; ModuleID = 'tree-complex.bc'
source_filename = "tree-complex.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }

!1334 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_LOOP_DYNAMIC_START", value: 695, isUnsigned: true)
!1335 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_LOOP_GUIDED_START", value: 696, isUnsigned: true)
!1336 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_LOOP_RUNTIME_START", value: 697, isUnsigned: true)
!1337 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_END", value: 698, isUnsigned: true)
!1338 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_END_NOWAIT", value: 699, isUnsigned: true)
!1339 = !DIEnumerator(name: "BUILT_IN_GOMP_ORDERED_START", value: 700, isUnsigned: true)
!1340 = !DIEnumerator(name: "BUILT_IN_GOMP_ORDERED_END", value: 701, isUnsigned: true)
!1341 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_START", value: 702, isUnsigned: true)
!1342 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_END", value: 703, isUnsigned: true)
!1343 = !DIEnumerator(name: "BUILT_IN_GOMP_TASK", value: 704, isUnsigned: true)
!1344 = !DIEnumerator(name: "BUILT_IN_GOMP_SECTIONS_START", value: 705, isUnsigned: true)
!1345 = !DIEnumerator(name: "BUILT_IN_GOMP_SECTIONS_NEXT", value: 706, isUnsigned: true)
!1346 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_SECTIONS_START", value: 707, isUnsigned: true)
!1347 = !DIEnumerator(name: "BUILT_IN_GOMP_SECTIONS_END", value: 708, isUnsigned: true)
!1348 = !DIEnumerator(name: "BUILT_IN_GOMP_SECTIONS_END_NOWAIT", value: 709, isUnsigned: true)
!1349 = !DIEnumerator(name: "BUILT_IN_GOMP_SINGLE_START", value: 710, isUnsigned: true)
!1350 = !DIEnumerator(name: "BUILT_IN_GOMP_SINGLE_COPY_START", value: 711, isUnsigned: true)
!1351 = !DIEnumerator(name: "BUILT_IN_GOMP_SINGLE_COPY_END", value: 712, isUnsigned: true)
!1352 = !DIEnumerator(name: "BUILT_IN_COMPLEX_MUL_MIN", value: 713, isUnsigned: true)
!1353 = !DIEnumerator(name: "BUILT_IN_COMPLEX_MUL_MAX", value: 716, isUnsigned: true)
!1354 = !DIEnumerator(name: "BUILT_IN_COMPLEX_DIV_MIN", value: 717, isUnsigned: true)
!1355 = !DIEnumerator(name: "BUILT_IN_COMPLEX_DIV_MAX", value: 720, isUnsigned: true)
!1356 = !DIEnumerator(name: "END_BUILTINS", value: 721, isUnsigned: true)
!1357 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_class", file: !1358, line: 36, baseType: !7, size: 32, elements: !1359)
!1358 = !DIFile(filename: "./machmode.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1359 = !{!1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378}
!1360 = !DIEnumerator(name: "MODE_RANDOM", value: 0, isUnsigned: true)
!1361 = !DIEnumerator(name: "MODE_CC", value: 1, isUnsigned: true)
!1362 = !DIEnumerator(name: "MODE_INT", value: 2, isUnsigned: true)
!1363 = !DIEnumerator(name: "MODE_PARTIAL_INT", value: 3, isUnsigned: true)
!1364 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!1365 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!1366 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!1367 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!1368 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!1369 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!1370 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!1371 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!1372 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!1373 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!1374 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!1375 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!1376 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!1377 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!1378 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!1379 = !{!1380, !1381, !1382, !1383, !1386, !1387, !1389, !366, !7, !1714, !2684, !1748, !1384, !625, !2686, !2699, !2704, !2709, !1357, !637, !1391, !2710, !1516}
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64)
!1381 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1382 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64)
!1385 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64)
!1388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1385)
!1389 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !1390, line: 56, baseType: !1391)
!1390 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64)
!1392 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !334, line: 3371, size: 1792, elements: !1393)
!1393 = !{!1394, !1427, !1433, !1446, !1465, !1476, !1481, !1490, !1496, !1509, !1521, !1559, !2017, !2045, !2062, !2063, !2068, !2077, !2083, !2088, !2092, !2096, !2335, !2382, !2388, !2394, !2401, !2414, !2428, !2445, !2457, !2479, !2494, !2666}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1392, file: !334, line: 3372, baseType: !1395, size: 64)
!1395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !334, line: 360, size: 64, elements: !1396)
!1396 = !{!1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1395, file: !334, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !1395, file: !334, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !1395, file: !334, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !1395, file: !334, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !1395, file: !334, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !1395, file: !334, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !1395, file: !334, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !1395, file: !334, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !1395, file: !334, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !1395, file: !334, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !1395, file: !334, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !1395, file: !334, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !1395, file: !334, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !1395, file: !334, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !1395, file: !334, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !1395, file: !334, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !1395, file: !334, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !1395, file: !334, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1395, file: !334, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1395, file: !334, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1395, file: !334, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1395, file: !334, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1395, file: !334, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1395, file: !334, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1395, file: !334, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1395, file: !334, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !1395, file: !334, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !1395, file: !334, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !1395, file: !334, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !1395, file: !334, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1392, file: !334, line: 3373, baseType: !1428, size: 192)
!1428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !334, line: 402, size: 192, elements: !1429)
!1429 = !{!1430, !1431, !1432}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1428, file: !334, line: 403, baseType: !1395, size: 64)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1428, file: !334, line: 404, baseType: !1389, size: 64, offset: 64)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1428, file: !334, line: 405, baseType: !1389, size: 64, offset: 128)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1392, file: !334, line: 3374, baseType: !1434, size: 320)
!1434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !334, line: 1384, size: 320, elements: !1435)
!1435 = !{!1436, !1437}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1434, file: !334, line: 1385, baseType: !1428, size: 192)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1434, file: !334, line: 1386, baseType: !1438, size: 128, offset: 192)
!1438 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1439, line: 58, baseType: !1440)
!1439 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1440 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1439, line: 54, size: 128, elements: !1441)
!1441 = !{!1442, !1444}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1440, file: !1439, line: 56, baseType: !1443, size: 64)
!1443 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1440, file: !1439, line: 57, baseType: !1445, size: 64, offset: 64)
!1445 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !1392, file: !334, line: 3375, baseType: !1447, size: 256)
!1447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !334, line: 1397, size: 256, elements: !1448)
!1448 = !{!1449, !1450}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1447, file: !334, line: 1398, baseType: !1428, size: 192)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1447, file: !334, line: 1399, baseType: !1451, size: 64, offset: 192)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64)
!1452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1453, line: 52, size: 256, elements: !1454)
!1453 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1454 = !{!1455, !1456, !1457, !1458, !1459, !1460, !1461}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1452, file: !1453, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1452, file: !1453, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1452, file: !1453, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1452, file: !1453, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1452, file: !1453, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1452, file: !1453, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1452, file: !1453, line: 62, baseType: !1462, size: 192, offset: 64)
!1462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1443, size: 192, elements: !1463)
!1463 = !{!1464}
!1464 = !DISubrange(count: 3)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !1392, file: !334, line: 3376, baseType: !1466, size: 256)
!1466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !334, line: 1408, size: 256, elements: !1467)
!1467 = !{!1468, !1469}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1466, file: !334, line: 1409, baseType: !1428, size: 192)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1466, file: !334, line: 1410, baseType: !1470, size: 64, offset: 192)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64)
!1471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1472, line: 27, size: 192, elements: !1473)
!1472 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1473 = !{!1474, !1475}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1471, file: !1472, line: 29, baseType: !1438, size: 128)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1471, file: !1472, line: 30, baseType: !189, size: 32, offset: 128)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1392, file: !334, line: 3377, baseType: !1477, size: 256)
!1477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !334, line: 1437, size: 256, elements: !1478)
!1478 = !{!1479, !1480}
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1477, file: !334, line: 1438, baseType: !1428, size: 192)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1477, file: !334, line: 1439, baseType: !1389, size: 64, offset: 192)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1392, file: !334, line: 3378, baseType: !1482, size: 256)
!1482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !334, line: 1418, size: 256, elements: !1483)
!1483 = !{!1484, !1485, !1486}
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1482, file: !334, line: 1419, baseType: !1428, size: 192)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1482, file: !334, line: 1420, baseType: !1382, size: 32, offset: 192)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1482, file: !334, line: 1421, baseType: !1487, size: 8, offset: 224)
!1487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1385, size: 8, elements: !1488)
!1488 = !{!1489}
!1489 = !DISubrange(count: 1)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !1392, file: !334, line: 3379, baseType: !1491, size: 320)
!1491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !334, line: 1428, size: 320, elements: !1492)
!1492 = !{!1493, !1494, !1495}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1491, file: !334, line: 1429, baseType: !1428, size: 192)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1491, file: !334, line: 1430, baseType: !1389, size: 64, offset: 192)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1491, file: !334, line: 1431, baseType: !1389, size: 64, offset: 256)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1392, file: !334, line: 3380, baseType: !1497, size: 320)
!1497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !334, line: 1460, size: 320, elements: !1498)
!1498 = !{!1499, !1500}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1497, file: !334, line: 1461, baseType: !1428, size: 192)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1497, file: !334, line: 1462, baseType: !1501, size: 128, offset: 192)
!1501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1502, line: 31, size: 128, elements: !1503)
!1502 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1503 = !{!1504, !1507, !1508}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1501, file: !1502, line: 32, baseType: !1505, size: 64)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64)
!1506 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1381)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1501, file: !1502, line: 33, baseType: !7, size: 32, offset: 64)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1501, file: !1502, line: 34, baseType: !7, size: 32, offset: 96)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !1392, file: !334, line: 3381, baseType: !1510, size: 384)
!1510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !334, line: 2507, size: 384, elements: !1511)
!1511 = !{!1512, !1513, !1518, !1519, !1520}
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1510, file: !334, line: 2508, baseType: !1428, size: 192)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1510, file: !334, line: 2509, baseType: !1514, size: 32, offset: 192)
!1514 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1515, line: 58, baseType: !1516)
!1515 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1516 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1517, line: 44, baseType: !7)
!1517 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1510, file: !334, line: 2510, baseType: !7, size: 32, offset: 224)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1510, file: !334, line: 2511, baseType: !1389, size: 64, offset: 256)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1510, file: !334, line: 2512, baseType: !1389, size: 64, offset: 320)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !1392, file: !334, line: 3382, baseType: !1522, size: 896)
!1522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !334, line: 2652, size: 896, elements: !1523)
!1523 = !{!1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556}
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1522, file: !334, line: 2653, baseType: !1510, size: 384)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1522, file: !334, line: 2654, baseType: !1389, size: 64, offset: 384)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1522, file: !334, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1522, file: !334, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1522, file: !334, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1522, file: !334, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1522, file: !334, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1522, file: !334, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1522, file: !334, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1522, file: !334, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1522, file: !334, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1522, file: !334, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1522, file: !334, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1522, file: !334, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1522, file: !334, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1522, file: !334, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1522, file: !334, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1522, file: !334, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1522, file: !334, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1522, file: !334, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1522, file: !334, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1522, file: !334, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1522, file: !334, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1522, file: !334, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1522, file: !334, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1522, file: !334, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1522, file: !334, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1522, file: !334, line: 2703, baseType: !7, size: 32, offset: 512)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1522, file: !334, line: 2705, baseType: !1389, size: 64, offset: 576)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1522, file: !334, line: 2706, baseType: !1389, size: 64, offset: 640)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1522, file: !334, line: 2707, baseType: !1389, size: 64, offset: 704)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1522, file: !334, line: 2708, baseType: !1389, size: 64, offset: 768)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1522, file: !334, line: 2711, baseType: !1557, size: 64, offset: 832)
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64)
!1558 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !334, line: 2711, flags: DIFlagFwdDecl)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !1392, file: !334, line: 3383, baseType: !1560, size: 960)
!1560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !334, line: 2756, size: 960, elements: !1561)
!1561 = !{!1562, !1563}
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1560, file: !334, line: 2757, baseType: !1522, size: 896)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1560, file: !334, line: 2758, baseType: !1564, size: 64, offset: 896)
!1564 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !1390, line: 50, baseType: !1565)
!1565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1566, size: 64)
!1566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !1567, line: 240, size: 384, elements: !1568)
!1567 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1568 = !{!1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579}
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1566, file: !1567, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1566, file: !1567, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !1566, file: !1567, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1566, file: !1567, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !1566, file: !1567, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !1566, file: !1567, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !1566, file: !1567, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1566, file: !1567, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !1566, file: !1567, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !1566, file: !1567, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1566, file: !1567, line: 321, baseType: !1580, size: 320, offset: 64)
!1580 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !1567, line: 315, size: 320, elements: !1581)
!1581 = !{!1582, !1984, !1986, !2015, !2016}
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1580, file: !1567, line: 316, baseType: !1583, size: 64)
!1583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1584, size: 64, elements: !1488)
!1584 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !1567, line: 183, baseType: !1585)
!1585 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !1567, line: 166, size: 64, elements: !1586)
!1586 = !{!1587, !1588, !1589, !1590, !1591, !1599, !1600, !1612, !1615, !1675, !1676, !1961, !1974, !1981}
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !1585, file: !1567, line: 168, baseType: !1382, size: 32)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !1585, file: !1567, line: 169, baseType: !7, size: 32)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !1585, file: !1567, line: 170, baseType: !1387, size: 64)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !1585, file: !1567, line: 171, baseType: !1564, size: 64)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !1585, file: !1567, line: 172, baseType: !1592, size: 64)
!1592 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !1390, line: 53, baseType: !1593)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64)
!1594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !1567, line: 359, size: 128, elements: !1595)
!1595 = !{!1596, !1597}
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !1594, file: !1567, line: 360, baseType: !1382, size: 32)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1594, file: !1567, line: 361, baseType: !1598, size: 64, offset: 64)
!1598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1564, size: 64, elements: !1488)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !1585, file: !1567, line: 173, baseType: !189, size: 32)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !1585, file: !1567, line: 174, baseType: !1601, size: 32)
!1601 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !1567, line: 133, baseType: !1602)
!1602 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1567, line: 115, size: 32, elements: !1603)
!1603 = !{!1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611}
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !1602, file: !1567, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !1602, file: !1567, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !1602, file: !1567, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !1602, file: !1567, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !1602, file: !1567, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !1602, file: !1567, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !1602, file: !1567, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1602, file: !1567, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !1585, file: !1567, line: 175, baseType: !1613, size: 64)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64)
!1614 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !1567, line: 175, flags: DIFlagFwdDecl)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !1585, file: !1567, line: 176, baseType: !1616, size: 64)
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64)
!1617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1618, line: 75, size: 256, elements: !1619)
!1618 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1619 = !{!1620, !1634, !1635, !1636}
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1617, file: !1618, line: 76, baseType: !1621, size: 64)
!1621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1622, size: 64)
!1622 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1618, line: 68, baseType: !1623)
!1623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1618, line: 63, size: 320, elements: !1624)
!1624 = !{!1625, !1627, !1628, !1629}
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1623, file: !1618, line: 64, baseType: !1626, size: 64)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1623, size: 64)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1623, file: !1618, line: 65, baseType: !1626, size: 64, offset: 64)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1623, file: !1618, line: 66, baseType: !7, size: 32, offset: 128)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1623, file: !1618, line: 67, baseType: !1630, size: 128, offset: 192)
!1630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1631, size: 128, elements: !1632)
!1631 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1618, line: 29, baseType: !1443)
!1632 = !{!1633}
!1633 = !DISubrange(count: 2)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1617, file: !1618, line: 77, baseType: !1621, size: 64, offset: 64)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1617, file: !1618, line: 78, baseType: !7, size: 32, offset: 128)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1617, file: !1618, line: 79, baseType: !1637, size: 64, offset: 192)
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64)
!1638 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1618, line: 49, baseType: !1639)
!1639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1618, line: 45, size: 832, elements: !1640)
!1640 = !{!1641, !1642, !1643}
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1639, file: !1618, line: 46, baseType: !1626, size: 64)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1639, file: !1618, line: 47, baseType: !1616, size: 64, offset: 64)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1639, file: !1618, line: 48, baseType: !1644, size: 704, offset: 128)
!1644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1645, line: 164, size: 704, elements: !1646)
!1645 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1646 = !{!1647, !1648, !1658, !1659, !1660, !1661, !1662, !1663, !1667, !1671, !1672, !1673, !1674}
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1644, file: !1645, line: 166, baseType: !1445, size: 64)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1644, file: !1645, line: 167, baseType: !1649, size: 64, offset: 64)
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1650, size: 64)
!1650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1645, line: 157, size: 192, elements: !1651)
!1651 = !{!1652, !1653, !1654}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1650, file: !1645, line: 159, baseType: !1384, size: 64)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1650, file: !1645, line: 160, baseType: !1649, size: 64, offset: 64)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1650, file: !1645, line: 161, baseType: !1655, size: 32, offset: 128)
!1655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1385, size: 32, elements: !1656)
!1656 = !{!1657}
!1657 = !DISubrange(count: 4)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1644, file: !1645, line: 168, baseType: !1384, size: 64, offset: 128)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1644, file: !1645, line: 169, baseType: !1384, size: 64, offset: 192)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1644, file: !1645, line: 170, baseType: !1384, size: 64, offset: 256)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1644, file: !1645, line: 171, baseType: !1445, size: 64, offset: 320)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1644, file: !1645, line: 172, baseType: !1382, size: 32, offset: 384)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1644, file: !1645, line: 176, baseType: !1664, size: 64, offset: 448)
!1664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1665, size: 64)
!1665 = !DISubroutineType(types: !1666)
!1666 = !{!1649, !1386, !1445}
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1644, file: !1645, line: 177, baseType: !1668, size: 64, offset: 512)
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64)
!1669 = !DISubroutineType(types: !1670)
!1670 = !{null, !1386, !1649}
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1644, file: !1645, line: 178, baseType: !1386, size: 64, offset: 576)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1644, file: !1645, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1644, file: !1645, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1644, file: !1645, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !1585, file: !1567, line: 177, baseType: !1389, size: 64)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !1585, file: !1567, line: 178, baseType: !1677, size: 64)
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1678, size: 64)
!1678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !318, line: 217, size: 832, elements: !1679)
!1679 = !{!1680, !1926, !1927, !1928, !1931, !1935, !1936, !1937, !1955, !1956, !1957, !1958, !1959, !1960}
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1678, file: !318, line: 219, baseType: !1681, size: 64)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64)
!1682 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !318, line: 151, baseType: !1683)
!1683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !318, line: 151, size: 128, elements: !1684)
!1684 = !{!1685}
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1683, file: !318, line: 151, baseType: !1686, size: 128)
!1686 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !318, line: 150, baseType: !1687)
!1687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !318, line: 150, size: 128, elements: !1688)
!1688 = !{!1689, !1690, !1691}
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1687, file: !318, line: 150, baseType: !7, size: 32)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1687, file: !318, line: 150, baseType: !7, size: 32, offset: 32)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1687, file: !318, line: 150, baseType: !1692, size: 64, offset: 64)
!1692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1693, size: 64, elements: !1488)
!1693 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !1390, line: 108, baseType: !1694)
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64)
!1695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !318, line: 122, size: 512, elements: !1696)
!1696 = !{!1697, !1698, !1699, !1918, !1919, !1920, !1921, !1922, !1923, !1924}
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1695, file: !318, line: 124, baseType: !1677, size: 64)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1695, file: !318, line: 125, baseType: !1677, size: 64, offset: 64)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1695, file: !318, line: 131, baseType: !1700, size: 64, offset: 128)
!1700 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !318, line: 128, size: 64, elements: !1701)
!1701 = !{!1702, !1917}
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1700, file: !318, line: 129, baseType: !1703, size: 64)
!1703 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !1390, line: 66, baseType: !1704)
!1704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1705, size: 64)
!1705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !561, line: 143, size: 192, elements: !1706)
!1706 = !{!1707, !1915, !1916}
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1705, file: !561, line: 145, baseType: !1708, size: 64)
!1708 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !1390, line: 69, baseType: !1709)
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64)
!1710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !561, line: 136, size: 192, elements: !1711)
!1711 = !{!1712, !1913, !1914}
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1710, file: !561, line: 137, baseType: !1713, size: 64)
!1713 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !1390, line: 58, baseType: !1714)
!1714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1715, size: 64)
!1715 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !561, line: 737, size: 768, elements: !1716)
!1716 = !{!1717, !1734, !1768, !1774, !1779, !1784, !1791, !1797, !1803, !1808, !1822, !1827, !1833, !1838, !1848, !1853, !1871, !1878, !1885, !1891, !1896, !1902, !1908}
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1715, file: !561, line: 738, baseType: !1718, size: 256)
!1718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !561, line: 271, size: 256, elements: !1719)
!1719 = !{!1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733}
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1718, file: !561, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1718, file: !561, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1718, file: !561, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1718, file: !561, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1718, file: !561, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1718, file: !561, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1718, file: !561, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1718, file: !561, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1718, file: !561, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1718, file: !561, line: 312, baseType: !7, size: 32, offset: 32)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1718, file: !561, line: 316, baseType: !1514, size: 32, offset: 64)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1718, file: !561, line: 319, baseType: !7, size: 32, offset: 96)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1718, file: !561, line: 323, baseType: !1677, size: 64, offset: 128)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1718, file: !561, line: 327, baseType: !1389, size: 64, offset: 192)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1715, file: !561, line: 739, baseType: !1735, size: 448)
!1735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !561, line: 350, size: 448, elements: !1736)
!1736 = !{!1737, !1766}
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1735, file: !561, line: 353, baseType: !1738, size: 384)
!1738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !561, line: 333, size: 384, elements: !1739)
!1739 = !{!1740, !1741, !1749}
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1738, file: !561, line: 336, baseType: !1718, size: 256)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1738, file: !561, line: 343, baseType: !1742, size: 64, offset: 256)
!1742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1743, size: 64)
!1743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1744, line: 37, size: 128, elements: !1745)
!1744 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1745 = !{!1746, !1747}
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1743, file: !1744, line: 39, baseType: !1742, size: 64)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1743, file: !1744, line: 40, baseType: !1748, size: 64, offset: 64)
!1748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1738, file: !561, line: 344, baseType: !1750, size: 64, offset: 320)
!1750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1751, size: 64)
!1751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1744, line: 45, size: 320, elements: !1752)
!1752 = !{!1753, !1754}
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1751, file: !1744, line: 47, baseType: !1750, size: 64)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1751, file: !1744, line: 48, baseType: !1755, size: 256, offset: 64)
!1755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !334, line: 1883, size: 256, elements: !1756)
!1756 = !{!1757, !1759, !1760, !1765}
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1755, file: !334, line: 1884, baseType: !1758, size: 64)
!1758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1755, size: 64)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1755, file: !334, line: 1885, baseType: !1758, size: 64, offset: 64)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1755, file: !334, line: 1891, baseType: !1761, size: 64, offset: 128)
!1761 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1755, file: !334, line: 1891, size: 64, elements: !1762)
!1762 = !{!1763, !1764}
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1761, file: !334, line: 1891, baseType: !1713, size: 64)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1761, file: !334, line: 1891, baseType: !1389, size: 64)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1755, file: !334, line: 1892, baseType: !1748, size: 64, offset: 192)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1735, file: !561, line: 359, baseType: !1767, size: 64, offset: 384)
!1767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1389, size: 64, elements: !1488)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1715, file: !561, line: 740, baseType: !1769, size: 512)
!1769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !561, line: 365, size: 512, elements: !1770)
!1770 = !{!1771, !1772, !1773}
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1769, file: !561, line: 368, baseType: !1738, size: 384)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1769, file: !561, line: 373, baseType: !1389, size: 64, offset: 384)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1769, file: !561, line: 374, baseType: !1389, size: 64, offset: 448)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1715, file: !561, line: 741, baseType: !1775, size: 576)
!1775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !561, line: 380, size: 576, elements: !1776)
!1776 = !{!1777, !1778}
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1775, file: !561, line: 383, baseType: !1769, size: 512)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1775, file: !561, line: 389, baseType: !1767, size: 64, offset: 512)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1715, file: !561, line: 742, baseType: !1780, size: 320)
!1780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !561, line: 395, size: 320, elements: !1781)
!1781 = !{!1782, !1783}
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1780, file: !561, line: 397, baseType: !1718, size: 256)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1780, file: !561, line: 400, baseType: !1703, size: 64, offset: 256)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1715, file: !561, line: 743, baseType: !1785, size: 448)
!1785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !561, line: 406, size: 448, elements: !1786)
!1786 = !{!1787, !1788, !1789, !1790}
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1785, file: !561, line: 408, baseType: !1718, size: 256)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1785, file: !561, line: 412, baseType: !1389, size: 64, offset: 256)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1785, file: !561, line: 420, baseType: !1389, size: 64, offset: 320)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1785, file: !561, line: 423, baseType: !1703, size: 64, offset: 384)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1715, file: !561, line: 744, baseType: !1792, size: 384)
!1792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !561, line: 429, size: 384, elements: !1793)
!1793 = !{!1794, !1795, !1796}
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1792, file: !561, line: 431, baseType: !1718, size: 256)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1792, file: !561, line: 434, baseType: !1389, size: 64, offset: 256)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1792, file: !561, line: 437, baseType: !1703, size: 64, offset: 320)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1715, file: !561, line: 745, baseType: !1798, size: 384)
!1798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !561, line: 443, size: 384, elements: !1799)
!1799 = !{!1800, !1801, !1802}
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1798, file: !561, line: 445, baseType: !1718, size: 256)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1798, file: !561, line: 449, baseType: !1389, size: 64, offset: 256)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1798, file: !561, line: 453, baseType: !1703, size: 64, offset: 320)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1715, file: !561, line: 746, baseType: !1804, size: 320)
!1804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !561, line: 459, size: 320, elements: !1805)
!1805 = !{!1806, !1807}
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1804, file: !561, line: 461, baseType: !1718, size: 256)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1804, file: !561, line: 464, baseType: !1389, size: 64, offset: 256)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1715, file: !561, line: 747, baseType: !1809, size: 768)
!1809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !561, line: 469, size: 768, elements: !1810)
!1810 = !{!1811, !1812, !1813, !1814, !1815}
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1809, file: !561, line: 471, baseType: !1718, size: 256)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1809, file: !561, line: 474, baseType: !7, size: 32, offset: 256)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1809, file: !561, line: 475, baseType: !7, size: 32, offset: 288)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1809, file: !561, line: 478, baseType: !1389, size: 64, offset: 320)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1809, file: !561, line: 481, baseType: !1816, size: 384, offset: 384)
!1816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1817, size: 384, elements: !1488)
!1817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !334, line: 1917, size: 384, elements: !1818)
!1818 = !{!1819, !1820, !1821}
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1817, file: !334, line: 1920, baseType: !1755, size: 256)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1817, file: !334, line: 1921, baseType: !1389, size: 64, offset: 256)
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1817, file: !334, line: 1922, baseType: !1514, size: 32, offset: 320)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1715, file: !561, line: 748, baseType: !1823, size: 320)
!1823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !561, line: 487, size: 320, elements: !1824)
!1824 = !{!1825, !1826}
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1823, file: !561, line: 490, baseType: !1718, size: 256)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1823, file: !561, line: 494, baseType: !1382, size: 32, offset: 256)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1715, file: !561, line: 749, baseType: !1828, size: 384)
!1828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !561, line: 500, size: 384, elements: !1829)
!1829 = !{!1830, !1831, !1832}
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1828, file: !561, line: 502, baseType: !1718, size: 256)
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1828, file: !561, line: 506, baseType: !1703, size: 64, offset: 256)
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1828, file: !561, line: 510, baseType: !1703, size: 64, offset: 320)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1715, file: !561, line: 750, baseType: !1834, size: 320)
!1834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !561, line: 529, size: 320, elements: !1835)
!1835 = !{!1836, !1837}
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1834, file: !561, line: 531, baseType: !1718, size: 256)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1834, file: !561, line: 540, baseType: !1703, size: 64, offset: 256)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1715, file: !561, line: 751, baseType: !1839, size: 704)
!1839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !561, line: 546, size: 704, elements: !1840)
!1840 = !{!1841, !1842, !1843, !1844, !1845, !1846, !1847}
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1839, file: !561, line: 549, baseType: !1769, size: 512)
!1842 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1839, file: !561, line: 553, baseType: !1387, size: 64, offset: 512)
!1843 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1839, file: !561, line: 557, baseType: !1381, size: 8, offset: 576)
!1844 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1839, file: !561, line: 558, baseType: !1381, size: 8, offset: 584)
!1845 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1839, file: !561, line: 559, baseType: !1381, size: 8, offset: 592)
!1846 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1839, file: !561, line: 560, baseType: !1381, size: 8, offset: 600)
!1847 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1839, file: !561, line: 566, baseType: !1767, size: 64, offset: 640)
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1715, file: !561, line: 752, baseType: !1849, size: 384)
!1849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !561, line: 571, size: 384, elements: !1850)
!1850 = !{!1851, !1852}
!1851 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1849, file: !561, line: 573, baseType: !1780, size: 320)
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1849, file: !561, line: 577, baseType: !1389, size: 64, offset: 320)
!1853 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1715, file: !561, line: 753, baseType: !1854, size: 576)
!1854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !561, line: 600, size: 576, elements: !1855)
!1855 = !{!1856, !1857, !1858, !1861, !1870}
!1856 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1854, file: !561, line: 602, baseType: !1780, size: 320)
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1854, file: !561, line: 605, baseType: !1389, size: 64, offset: 320)
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1854, file: !561, line: 609, baseType: !1859, size: 64, offset: 384)
!1859 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1860, line: 46, baseType: !1443)
!1860 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1861 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1854, file: !561, line: 612, baseType: !1862, size: 64, offset: 448)
!1862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1863, size: 64)
!1863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !561, line: 581, size: 320, elements: !1864)
!1864 = !{!1865, !1866, !1867, !1868, !1869}
!1865 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1863, file: !561, line: 583, baseType: !366, size: 32)
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1863, file: !561, line: 586, baseType: !1389, size: 64, offset: 64)
!1867 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1863, file: !561, line: 589, baseType: !1389, size: 64, offset: 128)
!1868 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1863, file: !561, line: 592, baseType: !1389, size: 64, offset: 192)
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1863, file: !561, line: 595, baseType: !1389, size: 64, offset: 256)
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1854, file: !561, line: 616, baseType: !1703, size: 64, offset: 512)
!1871 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1715, file: !561, line: 754, baseType: !1872, size: 512)
!1872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !561, line: 622, size: 512, elements: !1873)
!1873 = !{!1874, !1875, !1876, !1877}
!1874 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1872, file: !561, line: 624, baseType: !1780, size: 320)
!1875 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1872, file: !561, line: 628, baseType: !1389, size: 64, offset: 320)
!1876 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1872, file: !561, line: 632, baseType: !1389, size: 64, offset: 384)
!1877 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1872, file: !561, line: 636, baseType: !1389, size: 64, offset: 448)
!1878 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1715, file: !561, line: 755, baseType: !1879, size: 704)
!1879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !561, line: 642, size: 704, elements: !1880)
!1880 = !{!1881, !1882, !1883, !1884}
!1881 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1879, file: !561, line: 644, baseType: !1872, size: 512)
!1882 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1879, file: !561, line: 648, baseType: !1389, size: 64, offset: 512)
!1883 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1879, file: !561, line: 652, baseType: !1389, size: 64, offset: 576)
!1884 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1879, file: !561, line: 653, baseType: !1389, size: 64, offset: 640)
!1885 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1715, file: !561, line: 756, baseType: !1886, size: 448)
!1886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !561, line: 663, size: 448, elements: !1887)
!1887 = !{!1888, !1889, !1890}
!1888 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1886, file: !561, line: 665, baseType: !1780, size: 320)
!1889 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1886, file: !561, line: 668, baseType: !1389, size: 64, offset: 320)
!1890 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1886, file: !561, line: 673, baseType: !1389, size: 64, offset: 384)
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1715, file: !561, line: 757, baseType: !1892, size: 384)
!1892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !561, line: 694, size: 384, elements: !1893)
!1893 = !{!1894, !1895}
!1894 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1892, file: !561, line: 696, baseType: !1780, size: 320)
!1895 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1892, file: !561, line: 699, baseType: !1389, size: 64, offset: 320)
!1896 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1715, file: !561, line: 758, baseType: !1897, size: 384)
!1897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !561, line: 681, size: 384, elements: !1898)
!1898 = !{!1899, !1900, !1901}
!1899 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1897, file: !561, line: 683, baseType: !1718, size: 256)
!1900 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1897, file: !561, line: 686, baseType: !1389, size: 64, offset: 256)
!1901 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1897, file: !561, line: 689, baseType: !1389, size: 64, offset: 320)
!1902 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1715, file: !561, line: 759, baseType: !1903, size: 384)
!1903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !561, line: 707, size: 384, elements: !1904)
!1904 = !{!1905, !1906, !1907}
!1905 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1903, file: !561, line: 709, baseType: !1718, size: 256)
!1906 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1903, file: !561, line: 712, baseType: !1389, size: 64, offset: 256)
!1907 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1903, file: !561, line: 712, baseType: !1389, size: 64, offset: 320)
!1908 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1715, file: !561, line: 760, baseType: !1909, size: 320)
!1909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !561, line: 718, size: 320, elements: !1910)
!1910 = !{!1911, !1912}
!1911 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1909, file: !561, line: 720, baseType: !1718, size: 256)
!1912 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1909, file: !561, line: 723, baseType: !1389, size: 64, offset: 256)
!1913 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1710, file: !561, line: 138, baseType: !1709, size: 64, offset: 64)
!1914 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1710, file: !561, line: 139, baseType: !1709, size: 64, offset: 128)
!1915 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1705, file: !561, line: 146, baseType: !1708, size: 64, offset: 64)
!1916 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1705, file: !561, line: 152, baseType: !1703, size: 64, offset: 128)
!1917 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1700, file: !318, line: 130, baseType: !1564, size: 64)
!1918 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1695, file: !318, line: 134, baseType: !1386, size: 64, offset: 192)
!1919 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1695, file: !318, line: 137, baseType: !1389, size: 64, offset: 256)
!1920 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1695, file: !318, line: 138, baseType: !1514, size: 32, offset: 320)
!1921 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1695, file: !318, line: 142, baseType: !7, size: 32, offset: 352)
!1922 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1695, file: !318, line: 144, baseType: !1382, size: 32, offset: 384)
!1923 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1695, file: !318, line: 145, baseType: !1382, size: 32, offset: 416)
!1924 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1695, file: !318, line: 146, baseType: !1925, size: 64, offset: 448)
!1925 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !318, line: 119, baseType: !1445)
!1926 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1678, file: !318, line: 220, baseType: !1681, size: 64, offset: 64)
!1927 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1678, file: !318, line: 223, baseType: !1386, size: 64, offset: 128)
!1928 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1678, file: !318, line: 226, baseType: !1929, size: 64, offset: 192)
!1929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1930, size: 64)
!1930 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !318, line: 185, flags: DIFlagFwdDecl)
!1931 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1678, file: !318, line: 229, baseType: !1932, size: 128, offset: 256)
!1932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1933, size: 128, elements: !1632)
!1933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1934, size: 64)
!1934 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !318, line: 229, flags: DIFlagFwdDecl)
!1935 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1678, file: !318, line: 232, baseType: !1677, size: 64, offset: 384)
!1936 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1678, file: !318, line: 233, baseType: !1677, size: 64, offset: 448)
!1937 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1678, file: !318, line: 238, baseType: !1938, size: 64, offset: 512)
!1938 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !318, line: 235, size: 64, elements: !1939)
!1939 = !{!1940, !1946}
!1940 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1938, file: !318, line: 236, baseType: !1941, size: 64)
!1941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1942, size: 64)
!1942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !318, line: 273, size: 128, elements: !1943)
!1943 = !{!1944, !1945}
!1944 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1942, file: !318, line: 275, baseType: !1703, size: 64)
!1945 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1942, file: !318, line: 278, baseType: !1703, size: 64, offset: 64)
!1946 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1938, file: !318, line: 237, baseType: !1947, size: 64)
!1947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1948, size: 64)
!1948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !318, line: 259, size: 320, elements: !1949)
!1949 = !{!1950, !1951, !1952, !1953, !1954}
!1950 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1948, file: !318, line: 261, baseType: !1564, size: 64)
!1951 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1948, file: !318, line: 262, baseType: !1564, size: 64, offset: 64)
!1952 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1948, file: !318, line: 266, baseType: !1564, size: 64, offset: 128)
!1953 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1948, file: !318, line: 267, baseType: !1564, size: 64, offset: 192)
!1954 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1948, file: !318, line: 270, baseType: !1382, size: 32, offset: 256)
!1955 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1678, file: !318, line: 241, baseType: !1925, size: 64, offset: 576)
!1956 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1678, file: !318, line: 244, baseType: !1382, size: 32, offset: 640)
!1957 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1678, file: !318, line: 247, baseType: !1382, size: 32, offset: 672)
!1958 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1678, file: !318, line: 250, baseType: !1382, size: 32, offset: 704)
!1959 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1678, file: !318, line: 253, baseType: !1382, size: 32, offset: 736)
!1960 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1678, file: !318, line: 256, baseType: !1382, size: 32, offset: 768)
!1961 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !1585, file: !1567, line: 179, baseType: !1962, size: 64)
!1962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1963, size: 64)
!1963 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !1567, line: 150, baseType: !1964)
!1964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !1567, line: 142, size: 320, elements: !1965)
!1965 = !{!1966, !1967, !1968, !1969, !1972, !1973}
!1966 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1964, file: !1567, line: 144, baseType: !1389, size: 64)
!1967 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1964, file: !1567, line: 145, baseType: !1564, size: 64, offset: 64)
!1968 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1964, file: !1567, line: 146, baseType: !1564, size: 64, offset: 128)
!1969 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1964, file: !1567, line: 147, baseType: !1970, size: 32, offset: 192)
!1970 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1971, line: 31, baseType: !1382)
!1971 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1972 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1964, file: !1567, line: 148, baseType: !7, size: 32, offset: 224)
!1973 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1964, file: !1567, line: 149, baseType: !1381, size: 8, offset: 256)
!1974 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !1585, file: !1567, line: 180, baseType: !1975, size: 64)
!1975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1976, size: 64)
!1976 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !1567, line: 162, baseType: !1977)
!1977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !1567, line: 159, size: 128, elements: !1978)
!1978 = !{!1979, !1980}
!1979 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1977, file: !1567, line: 160, baseType: !1389, size: 64)
!1980 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1977, file: !1567, line: 161, baseType: !1445, size: 64, offset: 64)
!1981 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !1585, file: !1567, line: 181, baseType: !1982, size: 64)
!1982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1983, size: 64)
!1983 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !1567, line: 181, flags: DIFlagFwdDecl)
!1984 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !1580, file: !1567, line: 317, baseType: !1985, size: 64)
!1985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1445, size: 64, elements: !1488)
!1986 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !1580, file: !1567, line: 318, baseType: !1987, size: 320)
!1987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !1567, line: 188, size: 320, elements: !1988)
!1988 = !{!1989, !1991, !2014}
!1989 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1987, file: !1567, line: 190, baseType: !1990, size: 192)
!1990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1584, size: 192, elements: !1463)
!1991 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1987, file: !1567, line: 193, baseType: !1992, size: 64, offset: 192)
!1992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1993, size: 64)
!1993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !1567, line: 206, size: 320, elements: !1994)
!1994 = !{!1995, !1999, !2000, !2001, !2013}
!1995 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1993, file: !1567, line: 208, baseType: !1996, size: 64)
!1996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1997, size: 64)
!1997 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !1390, line: 62, baseType: !1998)
!1998 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1390, line: 61, flags: DIFlagFwdDecl)
!1999 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1993, file: !1567, line: 211, baseType: !7, size: 32, offset: 64)
!2000 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1993, file: !1567, line: 214, baseType: !1445, size: 64, offset: 128)
!2001 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1993, file: !1567, line: 224, baseType: !2002, size: 64, offset: 192)
!2002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2003, size: 64)
!2003 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !1567, line: 202, baseType: !2004)
!2004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !1567, line: 202, size: 128, elements: !2005)
!2005 = !{!2006}
!2006 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2004, file: !1567, line: 202, baseType: !2007, size: 128)
!2007 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !1567, line: 200, baseType: !2008)
!2008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !1567, line: 200, size: 128, elements: !2009)
!2009 = !{!2010, !2011, !2012}
!2010 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2008, file: !1567, line: 200, baseType: !7, size: 32)
!2011 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2008, file: !1567, line: 200, baseType: !7, size: 32, offset: 32)
!2012 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2008, file: !1567, line: 200, baseType: !1598, size: 64, offset: 64)
!2013 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1993, file: !1567, line: 234, baseType: !2002, size: 64, offset: 256)
!2014 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1987, file: !1567, line: 197, baseType: !1445, size: 64, offset: 256)
!2015 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !1580, file: !1567, line: 319, baseType: !1452, size: 256)
!2016 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !1580, file: !1567, line: 320, baseType: !1471, size: 192)
!2017 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !1392, file: !334, line: 3384, baseType: !2018, size: 1472)
!2018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !334, line: 3114, size: 1472, elements: !2019)
!2019 = !{!2020, !2041, !2042, !2043, !2044}
!2020 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2018, file: !334, line: 3115, baseType: !2021, size: 1216)
!2021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !334, line: 2984, size: 1216, elements: !2022)
!2022 = !{!2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040}
!2023 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2021, file: !334, line: 2985, baseType: !1560, size: 960)
!2024 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !2021, file: !334, line: 2986, baseType: !1389, size: 64, offset: 960)
!2025 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !2021, file: !334, line: 2987, baseType: !1389, size: 64, offset: 1024)
!2026 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !2021, file: !334, line: 2988, baseType: !1389, size: 64, offset: 1088)
!2027 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !2021, file: !334, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!2028 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !2021, file: !334, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!2029 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !2021, file: !334, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!2030 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !2021, file: !334, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!2031 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !2021, file: !334, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!2032 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !2021, file: !334, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!2033 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !2021, file: !334, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!2034 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !2021, file: !334, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!2035 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !2021, file: !334, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!2036 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !2021, file: !334, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!2037 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !2021, file: !334, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!2038 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !2021, file: !334, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!2039 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !2021, file: !334, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!2040 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !2021, file: !334, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!2041 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !2018, file: !334, line: 3117, baseType: !1389, size: 64, offset: 1216)
!2042 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !2018, file: !334, line: 3119, baseType: !1389, size: 64, offset: 1280)
!2043 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !2018, file: !334, line: 3121, baseType: !1389, size: 64, offset: 1344)
!2044 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !2018, file: !334, line: 3123, baseType: !1389, size: 64, offset: 1408)
!2045 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !1392, file: !334, line: 3385, baseType: !2046, size: 1088)
!2046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !334, line: 2874, size: 1088, elements: !2047)
!2047 = !{!2048, !2049, !2050}
!2048 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2046, file: !334, line: 2875, baseType: !1560, size: 960)
!2049 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !2046, file: !334, line: 2876, baseType: !1564, size: 64, offset: 960)
!2050 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2046, file: !334, line: 2877, baseType: !2051, size: 64, offset: 1024)
!2051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2052, size: 64)
!2052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !2053, line: 172, size: 128, elements: !2054)
!2053 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2054 = !{!2055, !2056, !2057, !2058, !2059, !2060, !2061}
!2055 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !2052, file: !2053, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!2056 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !2052, file: !2053, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!2057 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !2052, file: !2053, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!2058 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !2052, file: !2053, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!2059 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !2052, file: !2053, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!2060 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !2052, file: !2053, line: 195, baseType: !7, size: 32, offset: 32)
!2061 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !2052, file: !2053, line: 199, baseType: !1389, size: 64, offset: 64)
!2062 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !1392, file: !334, line: 3386, baseType: !2021, size: 1216)
!2063 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !1392, file: !334, line: 3387, baseType: !2064, size: 1280)
!2064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !334, line: 3093, size: 1280, elements: !2065)
!2065 = !{!2066, !2067}
!2066 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2064, file: !334, line: 3094, baseType: !2021, size: 1216)
!2067 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2064, file: !334, line: 3095, baseType: !2051, size: 64, offset: 1216)
!2068 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !1392, file: !334, line: 3388, baseType: !2069, size: 1216)
!2069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !334, line: 2824, size: 1216, elements: !2070)
!2070 = !{!2071, !2072, !2073, !2074, !2075, !2076}
!2071 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2069, file: !334, line: 2825, baseType: !1522, size: 896)
!2072 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2069, file: !334, line: 2827, baseType: !1389, size: 64, offset: 896)
!2073 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !2069, file: !334, line: 2828, baseType: !1389, size: 64, offset: 960)
!2074 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !2069, file: !334, line: 2829, baseType: !1389, size: 64, offset: 1024)
!2075 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !2069, file: !334, line: 2830, baseType: !1389, size: 64, offset: 1088)
!2076 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !2069, file: !334, line: 2831, baseType: !1389, size: 64, offset: 1152)
!2077 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !1392, file: !334, line: 3389, baseType: !2078, size: 1024)
!2078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !334, line: 2850, size: 1024, elements: !2079)
!2079 = !{!2080, !2081, !2082}
!2080 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2078, file: !334, line: 2851, baseType: !1560, size: 960)
!2081 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !2078, file: !334, line: 2852, baseType: !1382, size: 32, offset: 960)
!2082 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !2078, file: !334, line: 2853, baseType: !1382, size: 32, offset: 992)
!2083 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !1392, file: !334, line: 3390, baseType: !2084, size: 1024)
!2084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !334, line: 2857, size: 1024, elements: !2085)
!2085 = !{!2086, !2087}
!2086 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2084, file: !334, line: 2858, baseType: !1560, size: 960)
!2087 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2084, file: !334, line: 2859, baseType: !2051, size: 64, offset: 960)
!2088 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !1392, file: !334, line: 3391, baseType: !2089, size: 960)
!2089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !334, line: 2862, size: 960, elements: !2090)
!2090 = !{!2091}
!2091 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2089, file: !334, line: 2863, baseType: !1560, size: 960)
!2092 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !1392, file: !334, line: 3392, baseType: !2093, size: 1472)
!2093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !334, line: 3304, size: 1472, elements: !2094)
!2094 = !{!2095}
!2095 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2093, file: !334, line: 3305, baseType: !2018, size: 1472)
!2096 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !1392, file: !334, line: 3393, baseType: !2097, size: 1792)
!2097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !334, line: 3248, size: 1792, elements: !2098)
!2098 = !{!2099, !2100, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2334}
!2099 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2097, file: !334, line: 3249, baseType: !2018, size: 1472)
!2100 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !2097, file: !334, line: 3251, baseType: !2101, size: 64, offset: 1472)
!2101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2102, size: 64)
!2102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !2103, line: 463, size: 1152, elements: !2104)
!2103 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2104 = !{!2105, !2108, !2139, !2140, !2255, !2258, !2259, !2260, !2261, !2262, !2263, !2287, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2309, !2310, !2311, !2312, !2313}
!2105 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !2102, file: !2103, line: 464, baseType: !2106, size: 64)
!2106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2107, size: 64)
!2107 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !2103, line: 464, flags: DIFlagFwdDecl)
!2108 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !2102, file: !2103, line: 467, baseType: !2109, size: 64, offset: 64)
!2109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2110, size: 64)
!2110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !318, line: 374, size: 640, elements: !2111)
!2111 = !{!2112, !2114, !2115, !2128, !2129, !2130, !2131, !2132, !2133, !2135, !2137, !2138}
!2112 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !2110, file: !318, line: 377, baseType: !2113, size: 64)
!2113 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !1390, line: 111, baseType: !1677)
!2114 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !2110, file: !318, line: 378, baseType: !2113, size: 64, offset: 64)
!2115 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !2110, file: !318, line: 381, baseType: !2116, size: 64, offset: 128)
!2116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2117, size: 64)
!2117 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !318, line: 282, baseType: !2118)
!2118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !318, line: 282, size: 128, elements: !2119)
!2119 = !{!2120}
!2120 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2118, file: !318, line: 282, baseType: !2121, size: 128)
!2121 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !318, line: 281, baseType: !2122)
!2122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !318, line: 281, size: 128, elements: !2123)
!2123 = !{!2124, !2125, !2126}
!2124 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2122, file: !318, line: 281, baseType: !7, size: 32)
!2125 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2122, file: !318, line: 281, baseType: !7, size: 32, offset: 32)
!2126 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2122, file: !318, line: 281, baseType: !2127, size: 64, offset: 64)
!2127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2113, size: 64, elements: !1488)
!2128 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !2110, file: !318, line: 384, baseType: !1382, size: 32, offset: 192)
!2129 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !2110, file: !318, line: 387, baseType: !1382, size: 32, offset: 224)
!2130 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !2110, file: !318, line: 390, baseType: !1382, size: 32, offset: 256)
!2131 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !2110, file: !318, line: 394, baseType: !2116, size: 64, offset: 320)
!2132 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !2110, file: !318, line: 396, baseType: !317, size: 32, offset: 384)
!2133 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !2110, file: !318, line: 399, baseType: !2134, size: 64, offset: 416)
!2134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 64, elements: !1632)
!2135 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !2110, file: !318, line: 402, baseType: !2136, size: 64, offset: 480)
!2136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1632)
!2137 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !2110, file: !318, line: 406, baseType: !1382, size: 32, offset: 544)
!2138 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !2110, file: !318, line: 409, baseType: !1382, size: 32, offset: 576)
!2139 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !2102, file: !2103, line: 470, baseType: !1704, size: 64, offset: 128)
!2140 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !2102, file: !2103, line: 473, baseType: !2141, size: 64, offset: 192)
!2141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2142, size: 64)
!2142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !2053, line: 39, size: 1152, elements: !2143)
!2143 = !{!2144, !2194, !2207, !2219, !2220, !2232, !2233, !2237, !2238, !2239, !2240, !2241}
!2144 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !2142, file: !2053, line: 41, baseType: !2145, size: 64)
!2145 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !2146, line: 144, baseType: !2147)
!2146 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2148, size: 64)
!2148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !2146, line: 100, size: 896, elements: !2149)
!2149 = !{!2150, !2158, !2163, !2168, !2170, !2171, !2172, !2173, !2174, !2175, !2180, !2182, !2183, !2188, !2193}
!2150 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !2148, file: !2146, line: 102, baseType: !2151, size: 64)
!2151 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !2146, line: 52, baseType: !2152)
!2152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2153, size: 64)
