; ModuleID = 'tree-dfa.bc'
source_filename = "tree-dfa.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }

!571 = !DIEnumerator(name: "GIMPLE_COND", value: 1, isUnsigned: true)
!572 = !DIEnumerator(name: "GIMPLE_DEBUG", value: 2, isUnsigned: true)
!573 = !DIEnumerator(name: "GIMPLE_GOTO", value: 3, isUnsigned: true)
!574 = !DIEnumerator(name: "GIMPLE_LABEL", value: 4, isUnsigned: true)
!575 = !DIEnumerator(name: "GIMPLE_SWITCH", value: 5, isUnsigned: true)
!576 = !DIEnumerator(name: "GIMPLE_ASSIGN", value: 6, isUnsigned: true)
!577 = !DIEnumerator(name: "GIMPLE_ASM", value: 7, isUnsigned: true)
!578 = !DIEnumerator(name: "GIMPLE_CALL", value: 8, isUnsigned: true)
!579 = !DIEnumerator(name: "GIMPLE_RETURN", value: 9, isUnsigned: true)
!580 = !DIEnumerator(name: "GIMPLE_BIND", value: 10, isUnsigned: true)
!581 = !DIEnumerator(name: "GIMPLE_CATCH", value: 11, isUnsigned: true)
!582 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!583 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!584 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!585 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!586 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!587 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!588 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!589 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!590 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!591 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!592 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!593 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!594 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!595 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!596 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!597 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!598 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!599 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!600 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!601 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!602 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!603 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!604 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!605 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!606 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !568, line: 727, baseType: !7, size: 32, elements: !607)
!607 = !{!608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631}
!608 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!609 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!610 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!611 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!612 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!613 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!614 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!615 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!616 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!617 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!618 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!619 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!620 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!621 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!622 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!623 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!624 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!625 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!626 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!627 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!628 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!629 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!630 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!631 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!632 = !{!633, !634, !635, !636, !639, !640, !317, !642, !7, !653, !707, !1968, !709, !1011, !655, !1969, !1971, !978, !1972, !637, !1974}
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!635 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !638)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !644, line: 172, size: 128, elements: !645)
!644 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!645 = !{!646, !647, !648, !649, !650, !651, !652}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !643, file: !644, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !643, file: !644, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !643, file: !644, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !643, file: !644, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !643, file: !644, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !643, file: !644, line: 195, baseType: !7, size: 32, offset: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !643, file: !644, line: 199, baseType: !653, size: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !654, line: 56, baseType: !655)
!654 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !318, line: 3371, size: 1792, elements: !657)
!657 = !{!658, !691, !697, !710, !729, !740, !745, !754, !760, !773, !785, !823, !1314, !1342, !1348, !1349, !1354, !1363, !1369, !1374, !1378, !1382, !1619, !1666, !1672, !1678, !1685, !1698, !1712, !1729, !1741, !1763, !1778, !1950}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !656, file: !318, line: 3372, baseType: !659, size: 64)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !318, line: 360, size: 64, elements: !660)
!660 = !{!661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !659, file: !318, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !659, file: !318, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !659, file: !318, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !659, file: !318, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !659, file: !318, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !659, file: !318, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !659, file: !318, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !659, file: !318, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !659, file: !318, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !659, file: !318, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !659, file: !318, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !659, file: !318, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !659, file: !318, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !659, file: !318, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !659, file: !318, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !659, file: !318, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !659, file: !318, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !659, file: !318, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !659, file: !318, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !659, file: !318, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !659, file: !318, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !659, file: !318, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !659, file: !318, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !659, file: !318, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !659, file: !318, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !659, file: !318, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !659, file: !318, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !659, file: !318, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !659, file: !318, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !659, file: !318, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !656, file: !318, line: 3373, baseType: !692, size: 192)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !318, line: 402, size: 192, elements: !693)
!693 = !{!694, !695, !696}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !692, file: !318, line: 403, baseType: !659, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !692, file: !318, line: 404, baseType: !653, size: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !692, file: !318, line: 405, baseType: !653, size: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !656, file: !318, line: 3374, baseType: !698, size: 320)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !318, line: 1384, size: 320, elements: !699)
!699 = !{!700, !701}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !698, file: !318, line: 1385, baseType: !692, size: 192)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !698, file: !318, line: 1386, baseType: !702, size: 128, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !703, line: 58, baseType: !704)
!703 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !703, line: 54, size: 128, elements: !705)
!705 = !{!706, !708}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !704, file: !703, line: 56, baseType: !707, size: 64)
!707 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !704, file: !703, line: 57, baseType: !709, size: 64, offset: 64)
!709 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !656, file: !318, line: 3375, baseType: !711, size: 256)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !318, line: 1397, size: 256, elements: !712)
!712 = !{!713, !714}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !711, file: !318, line: 1398, baseType: !692, size: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !711, file: !318, line: 1399, baseType: !715, size: 64, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !717, line: 52, size: 256, elements: !718)
!717 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!718 = !{!719, !720, !721, !722, !723, !724, !725}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !716, file: !717, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !716, file: !717, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !716, file: !717, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !716, file: !717, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !716, file: !717, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !716, file: !717, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !716, file: !717, line: 62, baseType: !726, size: 192, offset: 64)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 192, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 3)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !656, file: !318, line: 3376, baseType: !730, size: 256)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !318, line: 1408, size: 256, elements: !731)
!731 = !{!732, !733}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !730, file: !318, line: 1409, baseType: !692, size: 192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !730, file: !318, line: 1410, baseType: !734, size: 64, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !736, line: 27, size: 192, elements: !737)
!736 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!737 = !{!738, !739}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !735, file: !736, line: 29, baseType: !702, size: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !735, file: !736, line: 30, baseType: !189, size: 32, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !656, file: !318, line: 3377, baseType: !741, size: 256)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !318, line: 1437, size: 256, elements: !742)
!742 = !{!743, !744}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !741, file: !318, line: 1438, baseType: !692, size: 192)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !741, file: !318, line: 1439, baseType: !653, size: 64, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !656, file: !318, line: 3378, baseType: !746, size: 256)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !318, line: 1418, size: 256, elements: !747)
!747 = !{!748, !749, !750}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !746, file: !318, line: 1419, baseType: !692, size: 192)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !746, file: !318, line: 1420, baseType: !635, size: 32, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !746, file: !318, line: 1421, baseType: !751, size: 8, offset: 224)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !638, size: 8, elements: !752)
!752 = !{!753}
!753 = !DISubrange(count: 1)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !656, file: !318, line: 3379, baseType: !755, size: 320)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !318, line: 1428, size: 320, elements: !756)
!756 = !{!757, !758, !759}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !755, file: !318, line: 1429, baseType: !692, size: 192)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !755, file: !318, line: 1430, baseType: !653, size: 64, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !755, file: !318, line: 1431, baseType: !653, size: 64, offset: 256)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !656, file: !318, line: 3380, baseType: !761, size: 320)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !318, line: 1460, size: 320, elements: !762)
!762 = !{!763, !764}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !761, file: !318, line: 1461, baseType: !692, size: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !761, file: !318, line: 1462, baseType: !765, size: 128, offset: 192)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !766, line: 31, size: 128, elements: !767)
!766 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!767 = !{!768, !771, !772}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !765, file: !766, line: 32, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !634)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !765, file: !766, line: 33, baseType: !7, size: 32, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !765, file: !766, line: 34, baseType: !7, size: 32, offset: 96)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !656, file: !318, line: 3381, baseType: !774, size: 384)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !318, line: 2507, size: 384, elements: !775)
!775 = !{!776, !777, !782, !783, !784}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !774, file: !318, line: 2508, baseType: !692, size: 192)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !774, file: !318, line: 2509, baseType: !778, size: 32, offset: 192)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !779, line: 58, baseType: !780)
!779 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !781, line: 44, baseType: !7)
!781 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!782 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !774, file: !318, line: 2510, baseType: !7, size: 32, offset: 224)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !774, file: !318, line: 2511, baseType: !653, size: 64, offset: 256)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !774, file: !318, line: 2512, baseType: !653, size: 64, offset: 320)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !656, file: !318, line: 3382, baseType: !786, size: 896)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !318, line: 2652, size: 896, elements: !787)
!787 = !{!788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !786, file: !318, line: 2653, baseType: !774, size: 384)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !786, file: !318, line: 2654, baseType: !653, size: 64, offset: 384)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !786, file: !318, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !786, file: !318, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !786, file: !318, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !786, file: !318, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !786, file: !318, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !786, file: !318, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !786, file: !318, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !786, file: !318, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !786, file: !318, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !786, file: !318, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !786, file: !318, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !786, file: !318, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !786, file: !318, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !786, file: !318, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !786, file: !318, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !786, file: !318, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !786, file: !318, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !786, file: !318, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !786, file: !318, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !786, file: !318, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !786, file: !318, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !786, file: !318, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !786, file: !318, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !786, file: !318, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !786, file: !318, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !786, file: !318, line: 2703, baseType: !7, size: 32, offset: 512)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !786, file: !318, line: 2705, baseType: !653, size: 64, offset: 576)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !786, file: !318, line: 2706, baseType: !653, size: 64, offset: 640)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !786, file: !318, line: 2707, baseType: !653, size: 64, offset: 704)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !786, file: !318, line: 2708, baseType: !653, size: 64, offset: 768)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !786, file: !318, line: 2711, baseType: !821, size: 64, offset: 832)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !318, line: 2711, flags: DIFlagFwdDecl)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !656, file: !318, line: 3383, baseType: !824, size: 960)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !318, line: 2756, size: 960, elements: !825)
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !824, file: !318, line: 2757, baseType: !786, size: 896)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !824, file: !318, line: 2758, baseType: !828, size: 64, offset: 896)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !654, line: 50, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !831, line: 240, size: 384, elements: !832)
!831 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!832 = !{!833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !830, file: !831, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !830, file: !831, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !830, file: !831, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !830, file: !831, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !830, file: !831, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !830, file: !831, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !830, file: !831, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !830, file: !831, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !830, file: !831, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !830, file: !831, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !830, file: !831, line: 321, baseType: !844, size: 320, offset: 64)
!844 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !831, line: 315, size: 320, elements: !845)
!845 = !{!846, !1247, !1249, !1312, !1313}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !844, file: !831, line: 316, baseType: !847, size: 64)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !848, size: 64, elements: !752)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !831, line: 183, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !831, line: 166, size: 64, elements: !850)
!850 = !{!851, !852, !853, !854, !855, !863, !864, !876, !879, !939, !940, !1224, !1237, !1244}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !849, file: !831, line: 168, baseType: !635, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !849, file: !831, line: 169, baseType: !7, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !849, file: !831, line: 170, baseType: !640, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !849, file: !831, line: 171, baseType: !828, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !849, file: !831, line: 172, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !654, line: 53, baseType: !857)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !831, line: 359, size: 128, elements: !859)
!859 = !{!860, !861}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !858, file: !831, line: 360, baseType: !635, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !858, file: !831, line: 361, baseType: !862, size: 64, offset: 64)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !828, size: 64, elements: !752)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !849, file: !831, line: 173, baseType: !189, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !849, file: !831, line: 174, baseType: !865, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !831, line: 133, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !831, line: 115, size: 32, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !866, file: !831, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !866, file: !831, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !866, file: !831, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !866, file: !831, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !866, file: !831, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !866, file: !831, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !866, file: !831, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !866, file: !831, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !849, file: !831, line: 175, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !831, line: 175, flags: DIFlagFwdDecl)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !849, file: !831, line: 176, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !882, line: 75, size: 256, elements: !883)
!882 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!883 = !{!884, !898, !899, !900}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !881, file: !882, line: 76, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !882, line: 68, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !882, line: 63, size: 320, elements: !888)
!888 = !{!889, !891, !892, !893}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !887, file: !882, line: 64, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !887, file: !882, line: 65, baseType: !890, size: 64, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !887, file: !882, line: 66, baseType: !7, size: 32, offset: 128)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !887, file: !882, line: 67, baseType: !894, size: 128, offset: 192)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !895, size: 128, elements: !896)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !882, line: 29, baseType: !707)
!896 = !{!897}
!897 = !DISubrange(count: 2)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !881, file: !882, line: 77, baseType: !885, size: 64, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !881, file: !882, line: 78, baseType: !7, size: 32, offset: 128)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !881, file: !882, line: 79, baseType: !901, size: 64, offset: 192)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !882, line: 49, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !882, line: 45, size: 832, elements: !904)
!904 = !{!905, !906, !907}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !903, file: !882, line: 46, baseType: !890, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !903, file: !882, line: 47, baseType: !880, size: 64, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !903, file: !882, line: 48, baseType: !908, size: 704, offset: 128)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !909, line: 164, size: 704, elements: !910)
!909 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!910 = !{!911, !912, !922, !923, !924, !925, !926, !927, !931, !935, !936, !937, !938}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !908, file: !909, line: 166, baseType: !709, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !908, file: !909, line: 167, baseType: !913, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !909, line: 157, size: 192, elements: !915)
!915 = !{!916, !917, !918}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !914, file: !909, line: 159, baseType: !637, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !914, file: !909, line: 160, baseType: !913, size: 64, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !914, file: !909, line: 161, baseType: !919, size: 32, offset: 128)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !638, size: 32, elements: !920)
!920 = !{!921}
!921 = !DISubrange(count: 4)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !908, file: !909, line: 168, baseType: !637, size: 64, offset: 128)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !908, file: !909, line: 169, baseType: !637, size: 64, offset: 192)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !908, file: !909, line: 170, baseType: !637, size: 64, offset: 256)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !908, file: !909, line: 171, baseType: !709, size: 64, offset: 320)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !908, file: !909, line: 172, baseType: !635, size: 32, offset: 384)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !908, file: !909, line: 176, baseType: !928, size: 64, offset: 448)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!913, !639, !709}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !908, file: !909, line: 177, baseType: !932, size: 64, offset: 512)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{null, !639, !913}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !908, file: !909, line: 178, baseType: !639, size: 64, offset: 576)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !908, file: !909, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !908, file: !909, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !908, file: !909, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !849, file: !831, line: 177, baseType: !653, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !849, file: !831, line: 178, baseType: !941, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !513, line: 217, size: 832, elements: !943)
!943 = !{!944, !1189, !1190, !1191, !1194, !1198, !1199, !1200, !1218, !1219, !1220, !1221, !1222, !1223}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !942, file: !513, line: 219, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !513, line: 151, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !513, line: 151, size: 128, elements: !948)
!948 = !{!949}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !947, file: !513, line: 151, baseType: !950, size: 128)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !513, line: 150, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !513, line: 150, size: 128, elements: !952)
!952 = !{!953, !954, !955}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !951, file: !513, line: 150, baseType: !7, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !951, file: !513, line: 150, baseType: !7, size: 32, offset: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !951, file: !513, line: 150, baseType: !956, size: 64, offset: 64)
!956 = !DICompositeType(tag: DW_TAG_array_type, baseType: !957, size: 64, elements: !752)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !654, line: 108, baseType: !958)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !513, line: 122, size: 512, elements: !960)
!960 = !{!961, !962, !963, !1181, !1182, !1183, !1184, !1185, !1186, !1187}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !959, file: !513, line: 124, baseType: !941, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !959, file: !513, line: 125, baseType: !941, size: 64, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !959, file: !513, line: 131, baseType: !964, size: 64, offset: 128)
!964 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !513, line: 128, size: 64, elements: !965)
!965 = !{!966, !1180}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !964, file: !513, line: 129, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !654, line: 66, baseType: !968)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !568, line: 143, size: 192, elements: !970)
!970 = !{!971, !1178, !1179}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !969, file: !568, line: 145, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !654, line: 69, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !568, line: 136, size: 192, elements: !975)
!975 = !{!976, !1176, !1177}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !974, file: !568, line: 137, baseType: !977, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !654, line: 58, baseType: !978)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !568, line: 737, size: 768, elements: !980)
!980 = !{!981, !998, !1031, !1037, !1042, !1047, !1054, !1060, !1066, !1071, !1085, !1090, !1096, !1101, !1111, !1116, !1134, !1141, !1148, !1154, !1159, !1165, !1171}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !979, file: !568, line: 738, baseType: !982, size: 256)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !568, line: 271, size: 256, elements: !983)
!983 = !{!984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !982, file: !568, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !982, file: !568, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !982, file: !568, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !982, file: !568, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !982, file: !568, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !982, file: !568, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !982, file: !568, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !982, file: !568, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !982, file: !568, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !982, file: !568, line: 312, baseType: !7, size: 32, offset: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !982, file: !568, line: 316, baseType: !778, size: 32, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !982, file: !568, line: 319, baseType: !7, size: 32, offset: 96)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !982, file: !568, line: 323, baseType: !941, size: 64, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !982, file: !568, line: 327, baseType: !653, size: 64, offset: 192)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !979, file: !568, line: 739, baseType: !999, size: 448)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !568, line: 350, size: 448, elements: !1000)
!1000 = !{!1001, !1029}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !999, file: !568, line: 353, baseType: !1002, size: 384)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !568, line: 333, size: 384, elements: !1003)
!1003 = !{!1004, !1005, !1012}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1002, file: !568, line: 336, baseType: !982, size: 256)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1002, file: !568, line: 343, baseType: !1006, size: 64, offset: 256)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !561, line: 37, size: 128, elements: !1008)
!1008 = !{!1009, !1010}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1007, file: !561, line: 39, baseType: !1006, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1007, file: !561, line: 40, baseType: !1011, size: 64, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1002, file: !568, line: 344, baseType: !1013, size: 64, offset: 320)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !561, line: 45, size: 320, elements: !1015)
!1015 = !{!1016, !1017}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1014, file: !561, line: 47, baseType: !1013, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1014, file: !561, line: 48, baseType: !1018, size: 256, offset: 64)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !318, line: 1883, size: 256, elements: !1019)
!1019 = !{!1020, !1022, !1023, !1028}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1018, file: !318, line: 1884, baseType: !1021, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1018, file: !318, line: 1885, baseType: !1021, size: 64, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1018, file: !318, line: 1891, baseType: !1024, size: 64, offset: 128)
!1024 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1018, file: !318, line: 1891, size: 64, elements: !1025)
!1025 = !{!1026, !1027}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1024, file: !318, line: 1891, baseType: !977, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1024, file: !318, line: 1891, baseType: !653, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1018, file: !318, line: 1892, baseType: !1011, size: 64, offset: 192)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !999, file: !568, line: 359, baseType: !1030, size: 64, offset: 384)
!1030 = !DICompositeType(tag: DW_TAG_array_type, baseType: !653, size: 64, elements: !752)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !979, file: !568, line: 740, baseType: !1032, size: 512)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !568, line: 365, size: 512, elements: !1033)
!1033 = !{!1034, !1035, !1036}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1032, file: !568, line: 368, baseType: !1002, size: 384)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1032, file: !568, line: 373, baseType: !653, size: 64, offset: 384)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1032, file: !568, line: 374, baseType: !653, size: 64, offset: 448)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !979, file: !568, line: 741, baseType: !1038, size: 576)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !568, line: 380, size: 576, elements: !1039)
!1039 = !{!1040, !1041}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1038, file: !568, line: 383, baseType: !1032, size: 512)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1038, file: !568, line: 389, baseType: !1030, size: 64, offset: 512)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !979, file: !568, line: 742, baseType: !1043, size: 320)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !568, line: 395, size: 320, elements: !1044)
!1044 = !{!1045, !1046}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1043, file: !568, line: 397, baseType: !982, size: 256)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1043, file: !568, line: 400, baseType: !967, size: 64, offset: 256)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !979, file: !568, line: 743, baseType: !1048, size: 448)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !568, line: 406, size: 448, elements: !1049)
!1049 = !{!1050, !1051, !1052, !1053}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1048, file: !568, line: 408, baseType: !982, size: 256)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1048, file: !568, line: 412, baseType: !653, size: 64, offset: 256)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1048, file: !568, line: 420, baseType: !653, size: 64, offset: 320)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1048, file: !568, line: 423, baseType: !967, size: 64, offset: 384)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !979, file: !568, line: 744, baseType: !1055, size: 384)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !568, line: 429, size: 384, elements: !1056)
!1056 = !{!1057, !1058, !1059}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1055, file: !568, line: 431, baseType: !982, size: 256)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1055, file: !568, line: 434, baseType: !653, size: 64, offset: 256)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1055, file: !568, line: 437, baseType: !967, size: 64, offset: 320)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !979, file: !568, line: 745, baseType: !1061, size: 384)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !568, line: 443, size: 384, elements: !1062)
!1062 = !{!1063, !1064, !1065}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1061, file: !568, line: 445, baseType: !982, size: 256)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1061, file: !568, line: 449, baseType: !653, size: 64, offset: 256)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1061, file: !568, line: 453, baseType: !967, size: 64, offset: 320)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !979, file: !568, line: 746, baseType: !1067, size: 320)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !568, line: 459, size: 320, elements: !1068)
!1068 = !{!1069, !1070}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1067, file: !568, line: 461, baseType: !982, size: 256)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1067, file: !568, line: 464, baseType: !653, size: 64, offset: 256)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !979, file: !568, line: 747, baseType: !1072, size: 768)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !568, line: 469, size: 768, elements: !1073)
!1073 = !{!1074, !1075, !1076, !1077, !1078}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1072, file: !568, line: 471, baseType: !982, size: 256)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1072, file: !568, line: 474, baseType: !7, size: 32, offset: 256)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1072, file: !568, line: 475, baseType: !7, size: 32, offset: 288)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1072, file: !568, line: 478, baseType: !653, size: 64, offset: 320)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1072, file: !568, line: 481, baseType: !1079, size: 384, offset: 384)
!1079 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1080, size: 384, elements: !752)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !318, line: 1917, size: 384, elements: !1081)
!1081 = !{!1082, !1083, !1084}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1080, file: !318, line: 1920, baseType: !1018, size: 256)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1080, file: !318, line: 1921, baseType: !653, size: 64, offset: 256)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1080, file: !318, line: 1922, baseType: !778, size: 32, offset: 320)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !979, file: !568, line: 748, baseType: !1086, size: 320)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !568, line: 487, size: 320, elements: !1087)
!1087 = !{!1088, !1089}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1086, file: !568, line: 490, baseType: !982, size: 256)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1086, file: !568, line: 494, baseType: !635, size: 32, offset: 256)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !979, file: !568, line: 749, baseType: !1091, size: 384)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !568, line: 500, size: 384, elements: !1092)
!1092 = !{!1093, !1094, !1095}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1091, file: !568, line: 502, baseType: !982, size: 256)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1091, file: !568, line: 506, baseType: !967, size: 64, offset: 256)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1091, file: !568, line: 510, baseType: !967, size: 64, offset: 320)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !979, file: !568, line: 750, baseType: !1097, size: 320)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !568, line: 529, size: 320, elements: !1098)
!1098 = !{!1099, !1100}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1097, file: !568, line: 531, baseType: !982, size: 256)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1097, file: !568, line: 540, baseType: !967, size: 64, offset: 256)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !979, file: !568, line: 751, baseType: !1102, size: 704)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !568, line: 546, size: 704, elements: !1103)
!1103 = !{!1104, !1105, !1106, !1107, !1108, !1109, !1110}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1102, file: !568, line: 549, baseType: !1032, size: 512)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1102, file: !568, line: 553, baseType: !640, size: 64, offset: 512)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1102, file: !568, line: 557, baseType: !634, size: 8, offset: 576)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1102, file: !568, line: 558, baseType: !634, size: 8, offset: 584)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1102, file: !568, line: 559, baseType: !634, size: 8, offset: 592)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1102, file: !568, line: 560, baseType: !634, size: 8, offset: 600)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1102, file: !568, line: 566, baseType: !1030, size: 64, offset: 640)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !979, file: !568, line: 752, baseType: !1112, size: 384)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !568, line: 571, size: 384, elements: !1113)
!1113 = !{!1114, !1115}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1112, file: !568, line: 573, baseType: !1043, size: 320)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1112, file: !568, line: 577, baseType: !653, size: 64, offset: 320)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !979, file: !568, line: 753, baseType: !1117, size: 576)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !568, line: 600, size: 576, elements: !1118)
!1118 = !{!1119, !1120, !1121, !1124, !1133}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1117, file: !568, line: 602, baseType: !1043, size: 320)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1117, file: !568, line: 605, baseType: !653, size: 64, offset: 320)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1117, file: !568, line: 609, baseType: !1122, size: 64, offset: 384)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1123, line: 46, baseType: !707)
!1123 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1117, file: !568, line: 612, baseType: !1125, size: 64, offset: 448)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !568, line: 581, size: 320, elements: !1127)
!1127 = !{!1128, !1129, !1130, !1131, !1132}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1126, file: !568, line: 583, baseType: !317, size: 32)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1126, file: !568, line: 586, baseType: !653, size: 64, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1126, file: !568, line: 589, baseType: !653, size: 64, offset: 128)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1126, file: !568, line: 592, baseType: !653, size: 64, offset: 192)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1126, file: !568, line: 595, baseType: !653, size: 64, offset: 256)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1117, file: !568, line: 616, baseType: !967, size: 64, offset: 512)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !979, file: !568, line: 754, baseType: !1135, size: 512)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !568, line: 622, size: 512, elements: !1136)
!1136 = !{!1137, !1138, !1139, !1140}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1135, file: !568, line: 624, baseType: !1043, size: 320)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1135, file: !568, line: 628, baseType: !653, size: 64, offset: 320)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1135, file: !568, line: 632, baseType: !653, size: 64, offset: 384)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1135, file: !568, line: 636, baseType: !653, size: 64, offset: 448)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !979, file: !568, line: 755, baseType: !1142, size: 704)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !568, line: 642, size: 704, elements: !1143)
!1143 = !{!1144, !1145, !1146, !1147}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1142, file: !568, line: 644, baseType: !1135, size: 512)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1142, file: !568, line: 648, baseType: !653, size: 64, offset: 512)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1142, file: !568, line: 652, baseType: !653, size: 64, offset: 576)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1142, file: !568, line: 653, baseType: !653, size: 64, offset: 640)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !979, file: !568, line: 756, baseType: !1149, size: 448)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !568, line: 663, size: 448, elements: !1150)
!1150 = !{!1151, !1152, !1153}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1149, file: !568, line: 665, baseType: !1043, size: 320)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1149, file: !568, line: 668, baseType: !653, size: 64, offset: 320)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1149, file: !568, line: 673, baseType: !653, size: 64, offset: 384)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !979, file: !568, line: 757, baseType: !1155, size: 384)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !568, line: 694, size: 384, elements: !1156)
!1156 = !{!1157, !1158}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1155, file: !568, line: 696, baseType: !1043, size: 320)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1155, file: !568, line: 699, baseType: !653, size: 64, offset: 320)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !979, file: !568, line: 758, baseType: !1160, size: 384)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !568, line: 681, size: 384, elements: !1161)
!1161 = !{!1162, !1163, !1164}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1160, file: !568, line: 683, baseType: !982, size: 256)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1160, file: !568, line: 686, baseType: !653, size: 64, offset: 256)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1160, file: !568, line: 689, baseType: !653, size: 64, offset: 320)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !979, file: !568, line: 759, baseType: !1166, size: 384)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !568, line: 707, size: 384, elements: !1167)
!1167 = !{!1168, !1169, !1170}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1166, file: !568, line: 709, baseType: !982, size: 256)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1166, file: !568, line: 712, baseType: !653, size: 64, offset: 256)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1166, file: !568, line: 712, baseType: !653, size: 64, offset: 320)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !979, file: !568, line: 760, baseType: !1172, size: 320)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !568, line: 718, size: 320, elements: !1173)
!1173 = !{!1174, !1175}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1172, file: !568, line: 720, baseType: !982, size: 256)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1172, file: !568, line: 723, baseType: !653, size: 64, offset: 256)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !974, file: !568, line: 138, baseType: !973, size: 64, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !974, file: !568, line: 139, baseType: !973, size: 64, offset: 128)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !969, file: !568, line: 146, baseType: !972, size: 64, offset: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !969, file: !568, line: 152, baseType: !967, size: 64, offset: 128)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !964, file: !513, line: 130, baseType: !828, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !959, file: !513, line: 134, baseType: !639, size: 64, offset: 192)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !959, file: !513, line: 137, baseType: !653, size: 64, offset: 256)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !959, file: !513, line: 138, baseType: !778, size: 32, offset: 320)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !959, file: !513, line: 142, baseType: !7, size: 32, offset: 352)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !959, file: !513, line: 144, baseType: !635, size: 32, offset: 384)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !959, file: !513, line: 145, baseType: !635, size: 32, offset: 416)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !959, file: !513, line: 146, baseType: !1188, size: 64, offset: 448)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !513, line: 119, baseType: !709)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !942, file: !513, line: 220, baseType: !945, size: 64, offset: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !942, file: !513, line: 223, baseType: !639, size: 64, offset: 128)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !942, file: !513, line: 226, baseType: !1192, size: 64, offset: 192)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !513, line: 185, flags: DIFlagFwdDecl)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !942, file: !513, line: 229, baseType: !1195, size: 128, offset: 256)
!1195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1196, size: 128, elements: !896)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !513, line: 229, flags: DIFlagFwdDecl)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !942, file: !513, line: 232, baseType: !941, size: 64, offset: 384)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !942, file: !513, line: 233, baseType: !941, size: 64, offset: 448)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !942, file: !513, line: 238, baseType: !1201, size: 64, offset: 512)
!1201 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !513, line: 235, size: 64, elements: !1202)
!1202 = !{!1203, !1209}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1201, file: !513, line: 236, baseType: !1204, size: 64)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !513, line: 273, size: 128, elements: !1206)
!1206 = !{!1207, !1208}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1205, file: !513, line: 275, baseType: !967, size: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1205, file: !513, line: 278, baseType: !967, size: 64, offset: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1201, file: !513, line: 237, baseType: !1210, size: 64)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !513, line: 259, size: 320, elements: !1212)
!1212 = !{!1213, !1214, !1215, !1216, !1217}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1211, file: !513, line: 261, baseType: !828, size: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1211, file: !513, line: 262, baseType: !828, size: 64, offset: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1211, file: !513, line: 266, baseType: !828, size: 64, offset: 128)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1211, file: !513, line: 267, baseType: !828, size: 64, offset: 192)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1211, file: !513, line: 270, baseType: !635, size: 32, offset: 256)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !942, file: !513, line: 241, baseType: !1188, size: 64, offset: 576)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !942, file: !513, line: 244, baseType: !635, size: 32, offset: 640)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !942, file: !513, line: 247, baseType: !635, size: 32, offset: 672)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !942, file: !513, line: 250, baseType: !635, size: 32, offset: 704)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !942, file: !513, line: 253, baseType: !635, size: 32, offset: 736)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !942, file: !513, line: 256, baseType: !635, size: 32, offset: 768)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !849, file: !831, line: 179, baseType: !1225, size: 64)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !831, line: 150, baseType: !1227)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !831, line: 142, size: 320, elements: !1228)
!1228 = !{!1229, !1230, !1231, !1232, !1235, !1236}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1227, file: !831, line: 144, baseType: !653, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1227, file: !831, line: 145, baseType: !828, size: 64, offset: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1227, file: !831, line: 146, baseType: !828, size: 64, offset: 128)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1227, file: !831, line: 147, baseType: !1233, size: 32, offset: 192)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1234, line: 31, baseType: !635)
!1234 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1227, file: !831, line: 148, baseType: !7, size: 32, offset: 224)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1227, file: !831, line: 149, baseType: !634, size: 8, offset: 256)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !849, file: !831, line: 180, baseType: !1238, size: 64)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !831, line: 162, baseType: !1240)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !831, line: 159, size: 128, elements: !1241)
!1241 = !{!1242, !1243}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1240, file: !831, line: 160, baseType: !653, size: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1240, file: !831, line: 161, baseType: !709, size: 64, offset: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !849, file: !831, line: 181, baseType: !1245, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !831, line: 181, flags: DIFlagFwdDecl)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !844, file: !831, line: 317, baseType: !1248, size: 64)
!1248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !709, size: 64, elements: !752)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !844, file: !831, line: 318, baseType: !1250, size: 320)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !831, line: 188, size: 320, elements: !1251)
!1251 = !{!1252, !1254, !1311}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1250, file: !831, line: 190, baseType: !1253, size: 192)
!1253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !848, size: 192, elements: !727)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1250, file: !831, line: 193, baseType: !1255, size: 64, offset: 192)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !831, line: 206, size: 320, elements: !1257)
!1257 = !{!1258, !1296, !1297, !1298, !1310}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1256, file: !831, line: 208, baseType: !1259, size: 64)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !654, line: 62, baseType: !1261)
!1261 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1262, line: 538, size: 256, elements: !1263)
!1262 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1263 = !{!1264, !1268, !1274, !1287}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1261, file: !1262, line: 539, baseType: !1265, size: 32)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1262, line: 482, size: 32, elements: !1266)
!1266 = !{!1267}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1265, file: !1262, line: 484, baseType: !7, size: 32)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1261, file: !1262, line: 540, baseType: !1269, size: 192)
!1269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1262, line: 488, size: 192, elements: !1270)
!1270 = !{!1271, !1272, !1273}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1269, file: !1262, line: 489, baseType: !1265, size: 32)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1269, file: !1262, line: 492, baseType: !640, size: 64, offset: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1269, file: !1262, line: 496, baseType: !653, size: 64, offset: 128)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1261, file: !1262, line: 541, baseType: !1275, size: 256)
!1275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1262, line: 504, size: 256, elements: !1276)
!1276 = !{!1277, !1278, !1285, !1286}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1275, file: !1262, line: 505, baseType: !1265, size: 32)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1275, file: !1262, line: 509, baseType: !1279, size: 64, offset: 64)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1262, line: 501, baseType: !1280)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{null, !1283}
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64)
!1284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1275, file: !1262, line: 510, baseType: !1283, size: 64, offset: 128)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1275, file: !1262, line: 513, baseType: !1259, size: 64, offset: 192)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1261, file: !1262, line: 542, baseType: !1288, size: 128)
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1262, line: 530, size: 128, elements: !1289)
!1289 = !{!1290, !1291}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1288, file: !1262, line: 531, baseType: !1265, size: 32)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1288, file: !1262, line: 534, baseType: !1292, size: 64, offset: 64)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1262, line: 525, baseType: !1293)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{!634, !653, !640, !707, !707}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1256, file: !831, line: 211, baseType: !7, size: 32, offset: 64)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1256, file: !831, line: 214, baseType: !709, size: 64, offset: 128)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1256, file: !831, line: 224, baseType: !1299, size: 64, offset: 192)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64)
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !831, line: 202, baseType: !1301)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !831, line: 202, size: 128, elements: !1302)
!1302 = !{!1303}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1301, file: !831, line: 202, baseType: !1304, size: 128)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !831, line: 200, baseType: !1305)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !831, line: 200, size: 128, elements: !1306)
!1306 = !{!1307, !1308, !1309}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1305, file: !831, line: 200, baseType: !7, size: 32)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1305, file: !831, line: 200, baseType: !7, size: 32, offset: 32)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1305, file: !831, line: 200, baseType: !862, size: 64, offset: 64)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1256, file: !831, line: 234, baseType: !1299, size: 64, offset: 256)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1250, file: !831, line: 197, baseType: !709, size: 64, offset: 256)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !844, file: !831, line: 319, baseType: !716, size: 256)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !844, file: !831, line: 320, baseType: !735, size: 192)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !656, file: !318, line: 3384, baseType: !1315, size: 1472)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !318, line: 3114, size: 1472, elements: !1316)
!1316 = !{!1317, !1338, !1339, !1340, !1341}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1315, file: !318, line: 3115, baseType: !1318, size: 1216)
!1318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !318, line: 2984, size: 1216, elements: !1319)
!1319 = !{!1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1318, file: !318, line: 2985, baseType: !824, size: 960)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1318, file: !318, line: 2986, baseType: !653, size: 64, offset: 960)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1318, file: !318, line: 2987, baseType: !653, size: 64, offset: 1024)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1318, file: !318, line: 2988, baseType: !653, size: 64, offset: 1088)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1318, file: !318, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1318, file: !318, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1318, file: !318, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1318, file: !318, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1318, file: !318, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1318, file: !318, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1318, file: !318, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1318, file: !318, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1318, file: !318, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1318, file: !318, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1318, file: !318, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1318, file: !318, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1318, file: !318, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1318, file: !318, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1315, file: !318, line: 3117, baseType: !653, size: 64, offset: 1216)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1315, file: !318, line: 3119, baseType: !653, size: 64, offset: 1280)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1315, file: !318, line: 3121, baseType: !653, size: 64, offset: 1344)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1315, file: !318, line: 3123, baseType: !653, size: 64, offset: 1408)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !656, file: !318, line: 3385, baseType: !1343, size: 1088)
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !318, line: 2874, size: 1088, elements: !1344)
!1344 = !{!1345, !1346, !1347}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1343, file: !318, line: 2875, baseType: !824, size: 960)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1343, file: !318, line: 2876, baseType: !828, size: 64, offset: 960)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1343, file: !318, line: 2877, baseType: !642, size: 64, offset: 1024)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !656, file: !318, line: 3386, baseType: !1318, size: 1216)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !656, file: !318, line: 3387, baseType: !1350, size: 1280)
!1350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !318, line: 3093, size: 1280, elements: !1351)
!1351 = !{!1352, !1353}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1350, file: !318, line: 3094, baseType: !1318, size: 1216)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1350, file: !318, line: 3095, baseType: !642, size: 64, offset: 1216)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !656, file: !318, line: 3388, baseType: !1355, size: 1216)
!1355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !318, line: 2824, size: 1216, elements: !1356)
!1356 = !{!1357, !1358, !1359, !1360, !1361, !1362}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1355, file: !318, line: 2825, baseType: !786, size: 896)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1355, file: !318, line: 2827, baseType: !653, size: 64, offset: 896)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1355, file: !318, line: 2828, baseType: !653, size: 64, offset: 960)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1355, file: !318, line: 2829, baseType: !653, size: 64, offset: 1024)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1355, file: !318, line: 2830, baseType: !653, size: 64, offset: 1088)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1355, file: !318, line: 2831, baseType: !653, size: 64, offset: 1152)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !656, file: !318, line: 3389, baseType: !1364, size: 1024)
!1364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !318, line: 2850, size: 1024, elements: !1365)
!1365 = !{!1366, !1367, !1368}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1364, file: !318, line: 2851, baseType: !824, size: 960)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1364, file: !318, line: 2852, baseType: !635, size: 32, offset: 960)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1364, file: !318, line: 2853, baseType: !635, size: 32, offset: 992)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !656, file: !318, line: 3390, baseType: !1370, size: 1024)
!1370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !318, line: 2857, size: 1024, elements: !1371)
!1371 = !{!1372, !1373}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1370, file: !318, line: 2858, baseType: !824, size: 960)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1370, file: !318, line: 2859, baseType: !642, size: 64, offset: 960)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !656, file: !318, line: 3391, baseType: !1375, size: 960)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !318, line: 2862, size: 960, elements: !1376)
!1376 = !{!1377}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1375, file: !318, line: 2863, baseType: !824, size: 960)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !656, file: !318, line: 3392, baseType: !1379, size: 1472)
!1379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !318, line: 3304, size: 1472, elements: !1380)
!1380 = !{!1381}
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1379, file: !318, line: 3305, baseType: !1315, size: 1472)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !656, file: !318, line: 3393, baseType: !1383, size: 1792)
!1383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !318, line: 3248, size: 1792, elements: !1384)
!1384 = !{!1385, !1386, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1383, file: !318, line: 3249, baseType: !1315, size: 1472)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1383, file: !318, line: 3251, baseType: !1387, size: 64, offset: 1472)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64)
!1388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1389, line: 463, size: 1152, elements: !1390)
!1389 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1390 = !{!1391, !1394, !1425, !1426, !1539, !1542, !1543, !1544, !1545, !1546, !1547, !1571, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1388, file: !1389, line: 464, baseType: !1392, size: 64)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64)
!1393 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1389, line: 464, flags: DIFlagFwdDecl)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1388, file: !1389, line: 467, baseType: !1395, size: 64, offset: 64)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64)
!1396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !513, line: 374, size: 640, elements: !1397)
!1397 = !{!1398, !1400, !1401, !1414, !1415, !1416, !1417, !1418, !1419, !1421, !1423, !1424}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1396, file: !513, line: 377, baseType: !1399, size: 64)
!1399 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !654, line: 111, baseType: !941)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1396, file: !513, line: 378, baseType: !1399, size: 64, offset: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1396, file: !513, line: 381, baseType: !1402, size: 64, offset: 128)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64)
!1403 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !513, line: 282, baseType: !1404)
!1404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !513, line: 282, size: 128, elements: !1405)
!1405 = !{!1406}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1404, file: !513, line: 282, baseType: !1407, size: 128)
!1407 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !513, line: 281, baseType: !1408)
!1408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !513, line: 281, size: 128, elements: !1409)
!1409 = !{!1410, !1411, !1412}
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1408, file: !513, line: 281, baseType: !7, size: 32)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1408, file: !513, line: 281, baseType: !7, size: 32, offset: 32)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1408, file: !513, line: 281, baseType: !1413, size: 64, offset: 64)
!1413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1399, size: 64, elements: !752)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1396, file: !513, line: 384, baseType: !635, size: 32, offset: 192)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1396, file: !513, line: 387, baseType: !635, size: 32, offset: 224)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1396, file: !513, line: 390, baseType: !635, size: 32, offset: 256)
