; ModuleID = 'tree-loop-linear.bc'
source_filename = "tree-loop-linear.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!342 = !DIEnumerator(name: "OMP_MASTER", value: 159, isUnsigned: true)
!343 = !DIEnumerator(name: "OMP_ORDERED", value: 160, isUnsigned: true)
!344 = !DIEnumerator(name: "OMP_CRITICAL", value: 161, isUnsigned: true)
!345 = !DIEnumerator(name: "OMP_ATOMIC", value: 162, isUnsigned: true)
!346 = !DIEnumerator(name: "OMP_CLAUSE", value: 163, isUnsigned: true)
!347 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!348 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!349 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!350 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!351 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!352 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!353 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!354 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!355 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!356 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!357 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!358 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!359 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!360 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!361 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!362 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!363 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!364 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!365 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!366 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!367 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!368 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!369 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!370 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!371 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!372 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!373 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!374 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!375 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lpt_dec", file: !376, line: 31, baseType: !5, size: 32, elements: !377)
!376 = !DIFile(filename: "./cfgloop.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!377 = !{!378, !379, !380, !381, !382, !383}
!378 = !DIEnumerator(name: "LPT_NONE", value: 0, isUnsigned: true)
!379 = !DIEnumerator(name: "LPT_PEEL_COMPLETELY", value: 1, isUnsigned: true)
!380 = !DIEnumerator(name: "LPT_PEEL_SIMPLE", value: 2, isUnsigned: true)
!381 = !DIEnumerator(name: "LPT_UNROLL_CONSTANT", value: 3, isUnsigned: true)
!382 = !DIEnumerator(name: "LPT_UNROLL_RUNTIME", value: 4, isUnsigned: true)
!383 = !DIEnumerator(name: "LPT_UNROLL_STUPID", value: 5, isUnsigned: true)
!384 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "loop_estimation", file: !376, line: 91, baseType: !5, size: 32, elements: !385)
!385 = !{!386, !387}
!386 = !DIEnumerator(name: "EST_NOT_COMPUTED", value: 0, isUnsigned: true)
!387 = !DIEnumerator(name: "EST_AVAILABLE", value: 1, isUnsigned: true)
!388 = !{!389, !390, !391, !392, !395, !396, !398, !402, !393, !405, !407, !1761, !1038, !1774, !5, !1779, !1846, !601, !181, !556, !1858, !1792, !420}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!391 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !394)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!395, !401}
!401 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DISubroutineType(types: !404)
!404 = !{null, !395}
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !406, line: 35, baseType: !401)
!406 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_heap", file: !409, line: 34, baseType: !410)
!409 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_heap", file: !409, line: 34, size: 128, elements: !411)
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !410, file: !409, line: 34, baseType: !413, size: 128)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !409, line: 33, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !409, line: 33, size: 128, elements: !415)
!415 = !{!416, !417, !418}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !414, file: !409, line: 33, baseType: !5, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !414, file: !409, line: 33, baseType: !5, size: 32, offset: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !414, file: !409, line: 33, baseType: !419, size: 64, offset: 64)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !420, size: 64, elements: !521)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !421, line: 58, baseType: !422)
!421 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !409, line: 737, size: 768, elements: !424)
!424 = !{!425, !1608, !1618, !1624, !1629, !1634, !1641, !1647, !1653, !1658, !1672, !1677, !1683, !1688, !1698, !1703, !1719, !1726, !1733, !1739, !1744, !1750, !1756}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !423, file: !409, line: 738, baseType: !426, size: 256)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !409, line: 271, size: 256, elements: !427)
!427 = !{!428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !443, !444, !1607}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !426, file: !409, line: 274, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !426, file: !409, line: 277, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !426, file: !409, line: 281, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !426, file: !409, line: 284, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !426, file: !409, line: 291, baseType: !5, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !426, file: !409, line: 295, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !426, file: !409, line: 298, baseType: !5, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !426, file: !409, line: 301, baseType: !5, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !426, file: !409, line: 307, baseType: !5, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !426, file: !409, line: 312, baseType: !5, size: 32, offset: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !426, file: !409, line: 316, baseType: !439, size: 32, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !440, line: 58, baseType: !441)
!440 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !442, line: 44, baseType: !5)
!442 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!443 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !426, file: !409, line: 319, baseType: !5, size: 32, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !426, file: !409, line: 323, baseType: !445, size: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !133, line: 217, size: 832, elements: !447)
!447 = !{!448, !1574, !1575, !1576, !1577, !1581, !1582, !1583, !1601, !1602, !1603, !1604, !1605, !1606}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !446, file: !133, line: 219, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !133, line: 151, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !133, line: 151, size: 128, elements: !452)
!452 = !{!453}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !451, file: !133, line: 151, baseType: !454, size: 128)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !133, line: 150, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !133, line: 150, size: 128, elements: !456)
!456 = !{!457, !458, !459}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !455, file: !133, line: 150, baseType: !5, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !455, file: !133, line: 150, baseType: !5, size: 32, offset: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !455, file: !133, line: 150, baseType: !460, size: 64, offset: 64)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, size: 64, elements: !521)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !421, line: 108, baseType: !462)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !133, line: 122, size: 512, elements: !464)
!464 = !{!465, !466, !467, !1566, !1567, !1568, !1569, !1570, !1571, !1572}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !463, file: !133, line: 124, baseType: !445, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !463, file: !133, line: 125, baseType: !445, size: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !463, file: !133, line: 131, baseType: !468, size: 64, offset: 128)
!468 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !133, line: 128, size: 64, elements: !469)
!469 = !{!470, !485}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !468, file: !133, line: 129, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !421, line: 66, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !409, line: 143, size: 192, elements: !474)
!474 = !{!475, !483, !484}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !473, file: !409, line: 145, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !421, line: 69, baseType: !477)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !409, line: 136, size: 192, elements: !479)
!479 = !{!480, !481, !482}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !478, file: !409, line: 137, baseType: !420, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !478, file: !409, line: 138, baseType: !477, size: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !478, file: !409, line: 139, baseType: !477, size: 64, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !473, file: !409, line: 146, baseType: !476, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !473, file: !409, line: 152, baseType: !471, size: 64, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !468, file: !133, line: 130, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !421, line: 50, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !489, line: 240, size: 384, elements: !490)
!489 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !488, file: !489, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !488, file: !489, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !488, file: !489, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !488, file: !489, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !488, file: !489, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !488, file: !489, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !488, file: !489, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !488, file: !489, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !488, file: !489, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !488, file: !489, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !488, file: !489, line: 321, baseType: !502, size: 320, offset: 64)
!502 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !489, line: 315, size: 320, elements: !503)
!503 = !{!504, !1533, !1535, !1564, !1565}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !502, file: !489, line: 316, baseType: !505, size: 64)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 64, elements: !521)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !489, line: 183, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !489, line: 166, size: 64, elements: !508)
!508 = !{!509, !510, !511, !512, !513, !523, !524, !536, !539, !600, !1511, !1512, !1523, !1530}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !507, file: !489, line: 168, baseType: !391, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !507, file: !489, line: 169, baseType: !5, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !507, file: !489, line: 170, baseType: !396, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !507, file: !489, line: 171, baseType: !486, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !507, file: !489, line: 172, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !421, line: 53, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !489, line: 359, size: 128, elements: !517)
!517 = !{!518, !519}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !516, file: !489, line: 360, baseType: !391, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !516, file: !489, line: 361, baseType: !520, size: 64, offset: 64)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 64, elements: !521)
!521 = !{!522}
!522 = !DISubrange(count: 1)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !507, file: !489, line: 173, baseType: !3, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !507, file: !489, line: 174, baseType: !525, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !489, line: 133, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !489, line: 115, size: 32, elements: !527)
!527 = !{!528, !529, !530, !531, !532, !533, !534, !535}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !526, file: !489, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !526, file: !489, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !526, file: !489, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !526, file: !489, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !526, file: !489, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !526, file: !489, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !526, file: !489, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !526, file: !489, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !507, file: !489, line: 175, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !489, line: 175, flags: DIFlagFwdDecl)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !507, file: !489, line: 176, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !542, line: 75, size: 256, elements: !543)
!542 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!543 = !{!544, !559, !560, !561}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !541, file: !542, line: 76, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !542, line: 68, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !542, line: 63, size: 320, elements: !548)
!548 = !{!549, !551, !552, !553}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !547, file: !542, line: 64, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !547, file: !542, line: 65, baseType: !550, size: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !547, file: !542, line: 66, baseType: !5, size: 32, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !547, file: !542, line: 67, baseType: !554, size: 128, offset: 192)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 128, elements: !557)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !542, line: 29, baseType: !556)
!556 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!557 = !{!558}
!558 = !DISubrange(count: 2)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !541, file: !542, line: 77, baseType: !545, size: 64, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !541, file: !542, line: 78, baseType: !5, size: 32, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !541, file: !542, line: 79, baseType: !562, size: 64, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !542, line: 49, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !542, line: 45, size: 832, elements: !565)
!565 = !{!566, !567, !568}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !564, file: !542, line: 46, baseType: !550, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !564, file: !542, line: 47, baseType: !540, size: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !564, file: !542, line: 48, baseType: !569, size: 704, offset: 128)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !570, line: 164, size: 704, elements: !571)
!570 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!571 = !{!572, !573, !583, !584, !585, !586, !587, !588, !592, !596, !597, !598, !599}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !569, file: !570, line: 166, baseType: !401, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !569, file: !570, line: 167, baseType: !574, size: 64, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !570, line: 157, size: 192, elements: !576)
!576 = !{!577, !578, !579}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !575, file: !570, line: 159, baseType: !393, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !575, file: !570, line: 160, baseType: !574, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !575, file: !570, line: 161, baseType: !580, size: 32, offset: 128)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 32, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 4)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !569, file: !570, line: 168, baseType: !393, size: 64, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !569, file: !570, line: 169, baseType: !393, size: 64, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !569, file: !570, line: 170, baseType: !393, size: 64, offset: 256)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !569, file: !570, line: 171, baseType: !401, size: 64, offset: 320)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !569, file: !570, line: 172, baseType: !391, size: 32, offset: 384)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !569, file: !570, line: 176, baseType: !589, size: 64, offset: 448)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!574, !395, !401}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !569, file: !570, line: 177, baseType: !593, size: 64, offset: 512)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{null, !395, !574}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !569, file: !570, line: 178, baseType: !395, size: 64, offset: 576)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !569, file: !570, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !569, file: !570, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !569, file: !570, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !507, file: !489, line: 177, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !421, line: 56, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !149, line: 3371, size: 1792, elements: !604)
!604 = !{!605, !638, !644, !655, !674, !685, !690, !697, !703, !716, !724, !762, !767, !795, !812, !813, !818, !827, !833, !838, !842, !846, !1160, !1209, !1215, !1221, !1228, !1241, !1255, !1272, !1284, !1306, !1321, !1493}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !603, file: !149, line: 3372, baseType: !606, size: 64)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !149, line: 360, size: 64, elements: !607)
!607 = !{!608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !606, file: !149, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !606, file: !149, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !606, file: !149, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !606, file: !149, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !606, file: !149, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !606, file: !149, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !606, file: !149, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !606, file: !149, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !606, file: !149, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !606, file: !149, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !606, file: !149, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !606, file: !149, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !606, file: !149, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !606, file: !149, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !606, file: !149, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !606, file: !149, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !606, file: !149, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !606, file: !149, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !606, file: !149, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !606, file: !149, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !606, file: !149, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !606, file: !149, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !606, file: !149, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !606, file: !149, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !606, file: !149, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !606, file: !149, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !606, file: !149, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !606, file: !149, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !606, file: !149, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !606, file: !149, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !603, file: !149, line: 3373, baseType: !639, size: 192)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !149, line: 402, size: 192, elements: !640)
!640 = !{!641, !642, !643}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !639, file: !149, line: 403, baseType: !606, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !639, file: !149, line: 404, baseType: !601, size: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !639, file: !149, line: 405, baseType: !601, size: 64, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !603, file: !149, line: 3374, baseType: !645, size: 320)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !149, line: 1384, size: 320, elements: !646)
!646 = !{!647, !648}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !645, file: !149, line: 1385, baseType: !639, size: 192)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !645, file: !149, line: 1386, baseType: !649, size: 128, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !650, line: 58, baseType: !651)
!650 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !650, line: 54, size: 128, elements: !652)
!652 = !{!653, !654}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !651, file: !650, line: 56, baseType: !556, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !651, file: !650, line: 57, baseType: !401, size: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !603, file: !149, line: 3375, baseType: !656, size: 256)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !149, line: 1397, size: 256, elements: !657)
!657 = !{!658, !659}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !656, file: !149, line: 1398, baseType: !639, size: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !656, file: !149, line: 1399, baseType: !660, size: 64, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !662, line: 52, size: 256, elements: !663)
!662 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!663 = !{!664, !665, !666, !667, !668, !669, !670}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !661, file: !662, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !661, file: !662, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !661, file: !662, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !661, file: !662, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !661, file: !662, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !661, file: !662, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !661, file: !662, line: 62, baseType: !671, size: 192, offset: 64)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 192, elements: !672)
!672 = !{!673}
!673 = !DISubrange(count: 3)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !603, file: !149, line: 3376, baseType: !675, size: 256)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !149, line: 1408, size: 256, elements: !676)
!676 = !{!677, !678}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !675, file: !149, line: 1409, baseType: !639, size: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !675, file: !149, line: 1410, baseType: !679, size: 64, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !681, line: 27, size: 192, elements: !682)
!681 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!682 = !{!683, !684}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !680, file: !681, line: 29, baseType: !649, size: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !680, file: !681, line: 30, baseType: !3, size: 32, offset: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !603, file: !149, line: 3377, baseType: !686, size: 256)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !149, line: 1437, size: 256, elements: !687)
!687 = !{!688, !689}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !686, file: !149, line: 1438, baseType: !639, size: 192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !686, file: !149, line: 1439, baseType: !601, size: 64, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !603, file: !149, line: 3378, baseType: !691, size: 256)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !149, line: 1418, size: 256, elements: !692)
!692 = !{!693, !694, !695}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !691, file: !149, line: 1419, baseType: !639, size: 192)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !691, file: !149, line: 1420, baseType: !391, size: 32, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !691, file: !149, line: 1421, baseType: !696, size: 8, offset: 224)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 8, elements: !521)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !603, file: !149, line: 3379, baseType: !698, size: 320)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !149, line: 1428, size: 320, elements: !699)
!699 = !{!700, !701, !702}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !698, file: !149, line: 1429, baseType: !639, size: 192)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !698, file: !149, line: 1430, baseType: !601, size: 64, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !698, file: !149, line: 1431, baseType: !601, size: 64, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !603, file: !149, line: 3380, baseType: !704, size: 320)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !149, line: 1460, size: 320, elements: !705)
!705 = !{!706, !707}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !704, file: !149, line: 1461, baseType: !639, size: 192)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !704, file: !149, line: 1462, baseType: !708, size: 128, offset: 192)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !709, line: 31, size: 128, elements: !710)
!709 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!710 = !{!711, !714, !715}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !708, file: !709, line: 32, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !390)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !708, file: !709, line: 33, baseType: !5, size: 32, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !708, file: !709, line: 34, baseType: !5, size: 32, offset: 96)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !603, file: !149, line: 3381, baseType: !717, size: 384)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !149, line: 2507, size: 384, elements: !718)
!718 = !{!719, !720, !721, !722, !723}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !717, file: !149, line: 2508, baseType: !639, size: 192)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !717, file: !149, line: 2509, baseType: !439, size: 32, offset: 192)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !717, file: !149, line: 2510, baseType: !5, size: 32, offset: 224)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !717, file: !149, line: 2511, baseType: !601, size: 64, offset: 256)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !717, file: !149, line: 2512, baseType: !601, size: 64, offset: 320)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !603, file: !149, line: 3382, baseType: !725, size: 896)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !149, line: 2652, size: 896, elements: !726)
!726 = !{!727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !725, file: !149, line: 2653, baseType: !717, size: 384)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !725, file: !149, line: 2654, baseType: !601, size: 64, offset: 384)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !725, file: !149, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !725, file: !149, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !725, file: !149, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !725, file: !149, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !725, file: !149, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !725, file: !149, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !725, file: !149, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !725, file: !149, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !725, file: !149, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !725, file: !149, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !725, file: !149, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !725, file: !149, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !725, file: !149, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !725, file: !149, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !725, file: !149, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !725, file: !149, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !725, file: !149, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !725, file: !149, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !725, file: !149, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !725, file: !149, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !725, file: !149, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !725, file: !149, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !725, file: !149, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !725, file: !149, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !725, file: !149, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !725, file: !149, line: 2703, baseType: !5, size: 32, offset: 512)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !725, file: !149, line: 2705, baseType: !601, size: 64, offset: 576)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !725, file: !149, line: 2706, baseType: !601, size: 64, offset: 640)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !725, file: !149, line: 2707, baseType: !601, size: 64, offset: 704)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !725, file: !149, line: 2708, baseType: !601, size: 64, offset: 768)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !725, file: !149, line: 2711, baseType: !760, size: 64, offset: 832)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !149, line: 2711, flags: DIFlagFwdDecl)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !603, file: !149, line: 3383, baseType: !763, size: 960)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !149, line: 2756, size: 960, elements: !764)
!764 = !{!765, !766}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !763, file: !149, line: 2757, baseType: !725, size: 896)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !763, file: !149, line: 2758, baseType: !486, size: 64, offset: 896)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !603, file: !149, line: 3384, baseType: !768, size: 1472)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !149, line: 3114, size: 1472, elements: !769)
!769 = !{!770, !791, !792, !793, !794}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !768, file: !149, line: 3115, baseType: !771, size: 1216)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !149, line: 2984, size: 1216, elements: !772)
!772 = !{!773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !771, file: !149, line: 2985, baseType: !763, size: 960)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !771, file: !149, line: 2986, baseType: !601, size: 64, offset: 960)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !771, file: !149, line: 2987, baseType: !601, size: 64, offset: 1024)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !771, file: !149, line: 2988, baseType: !601, size: 64, offset: 1088)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !771, file: !149, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !771, file: !149, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !771, file: !149, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !771, file: !149, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !771, file: !149, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !771, file: !149, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !771, file: !149, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !771, file: !149, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !771, file: !149, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !771, file: !149, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !771, file: !149, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !771, file: !149, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !771, file: !149, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !771, file: !149, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !768, file: !149, line: 3117, baseType: !601, size: 64, offset: 1216)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !768, file: !149, line: 3119, baseType: !601, size: 64, offset: 1280)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !768, file: !149, line: 3121, baseType: !601, size: 64, offset: 1344)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !768, file: !149, line: 3123, baseType: !601, size: 64, offset: 1408)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !603, file: !149, line: 3385, baseType: !796, size: 1088)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !149, line: 2874, size: 1088, elements: !797)
!797 = !{!798, !799, !800}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !796, file: !149, line: 2875, baseType: !763, size: 960)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !796, file: !149, line: 2876, baseType: !486, size: 64, offset: 960)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !796, file: !149, line: 2877, baseType: !801, size: 64, offset: 1024)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !803, line: 172, size: 128, elements: !804)
!803 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!804 = !{!805, !806, !807, !808, !809, !810, !811}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !802, file: !803, line: 174, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !802, file: !803, line: 178, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !802, file: !803, line: 183, baseType: !5, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !802, file: !803, line: 187, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !802, file: !803, line: 192, baseType: !5, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !802, file: !803, line: 195, baseType: !5, size: 32, offset: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !802, file: !803, line: 199, baseType: !601, size: 64, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !603, file: !149, line: 3386, baseType: !771, size: 1216)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !603, file: !149, line: 3387, baseType: !814, size: 1280)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !149, line: 3093, size: 1280, elements: !815)
!815 = !{!816, !817}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !814, file: !149, line: 3094, baseType: !771, size: 1216)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !814, file: !149, line: 3095, baseType: !801, size: 64, offset: 1216)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !603, file: !149, line: 3388, baseType: !819, size: 1216)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !149, line: 2824, size: 1216, elements: !820)
!820 = !{!821, !822, !823, !824, !825, !826}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !819, file: !149, line: 2825, baseType: !725, size: 896)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !819, file: !149, line: 2827, baseType: !601, size: 64, offset: 896)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !819, file: !149, line: 2828, baseType: !601, size: 64, offset: 960)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !819, file: !149, line: 2829, baseType: !601, size: 64, offset: 1024)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !819, file: !149, line: 2830, baseType: !601, size: 64, offset: 1088)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !819, file: !149, line: 2831, baseType: !601, size: 64, offset: 1152)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !603, file: !149, line: 3389, baseType: !828, size: 1024)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !149, line: 2850, size: 1024, elements: !829)
!829 = !{!830, !831, !832}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !828, file: !149, line: 2851, baseType: !763, size: 960)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !828, file: !149, line: 2852, baseType: !391, size: 32, offset: 960)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !828, file: !149, line: 2853, baseType: !391, size: 32, offset: 992)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !603, file: !149, line: 3390, baseType: !834, size: 1024)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !149, line: 2857, size: 1024, elements: !835)
!835 = !{!836, !837}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !834, file: !149, line: 2858, baseType: !763, size: 960)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !834, file: !149, line: 2859, baseType: !801, size: 64, offset: 960)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !603, file: !149, line: 3391, baseType: !839, size: 960)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !149, line: 2862, size: 960, elements: !840)
!840 = !{!841}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !839, file: !149, line: 2863, baseType: !763, size: 960)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !603, file: !149, line: 3392, baseType: !843, size: 1472)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !149, line: 3304, size: 1472, elements: !844)
!844 = !{!845}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !843, file: !149, line: 3305, baseType: !768, size: 1472)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !603, file: !149, line: 3393, baseType: !847, size: 1792)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !149, line: 3248, size: 1792, elements: !848)
!848 = !{!849, !850, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !847, file: !149, line: 3249, baseType: !768, size: 1472)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !847, file: !149, line: 3251, baseType: !851, size: 64, offset: 1472)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !853, line: 463, size: 1152, elements: !854)
!853 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!854 = !{!855, !858, !889, !890, !1020, !1083, !1084, !1085, !1086, !1087, !1088, !1112, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !852, file: !853, line: 464, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !853, line: 464, flags: DIFlagFwdDecl)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !852, file: !853, line: 467, baseType: !859, size: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !133, line: 374, size: 640, elements: !861)
!861 = !{!862, !864, !865, !878, !879, !880, !881, !882, !883, !885, !887, !888}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !860, file: !133, line: 377, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !421, line: 111, baseType: !445)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !860, file: !133, line: 378, baseType: !863, size: 64, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !860, file: !133, line: 381, baseType: !866, size: 64, offset: 128)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !133, line: 282, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !133, line: 282, size: 128, elements: !869)
!869 = !{!870}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !868, file: !133, line: 282, baseType: !871, size: 128)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !133, line: 281, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !133, line: 281, size: 128, elements: !873)
!873 = !{!874, !875, !876}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !872, file: !133, line: 281, baseType: !5, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !872, file: !133, line: 281, baseType: !5, size: 32, offset: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !872, file: !133, line: 281, baseType: !877, size: 64, offset: 64)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !863, size: 64, elements: !521)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !860, file: !133, line: 384, baseType: !391, size: 32, offset: 192)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !860, file: !133, line: 387, baseType: !391, size: 32, offset: 224)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !860, file: !133, line: 390, baseType: !391, size: 32, offset: 256)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !860, file: !133, line: 394, baseType: !866, size: 64, offset: 320)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !860, file: !133, line: 396, baseType: !132, size: 32, offset: 384)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !860, file: !133, line: 399, baseType: !884, size: 64, offset: 416)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 64, elements: !557)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !860, file: !133, line: 402, baseType: !886, size: 64, offset: 480)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !557)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !860, file: !133, line: 406, baseType: !391, size: 32, offset: 544)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !860, file: !133, line: 409, baseType: !391, size: 32, offset: 576)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !852, file: !853, line: 470, baseType: !472, size: 64, offset: 128)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !852, file: !853, line: 473, baseType: !891, size: 64, offset: 192)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !803, line: 39, size: 1152, elements: !893)
!893 = !{!894, !942, !948, !961, !962, !974, !975, !979, !980, !981, !982, !983}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !892, file: !803, line: 41, baseType: !895, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !896, line: 144, baseType: !897)
!896 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !896, line: 100, size: 896, elements: !899)
!899 = !{!900, !908, !913, !915, !917, !919, !920, !921, !922, !923, !928, !930, !931, !936, !941}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !898, file: !896, line: 102, baseType: !901, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !896, line: 52, baseType: !902)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{!905, !906}
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !896, line: 47, baseType: !5)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !898, file: !896, line: 105, baseType: !909, size: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !896, line: 59, baseType: !910)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!391, !906, !906}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !898, file: !896, line: 108, baseType: !914, size: 64, offset: 128)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !896, line: 63, baseType: !402)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !898, file: !896, line: 111, baseType: !916, size: 64, offset: 192)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !898, file: !896, line: 114, baseType: !918, size: 64, offset: 256)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !406, line: 46, baseType: !556)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !898, file: !896, line: 117, baseType: !918, size: 64, offset: 320)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !898, file: !896, line: 120, baseType: !918, size: 64, offset: 384)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !898, file: !896, line: 124, baseType: !5, size: 32, offset: 448)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !898, file: !896, line: 128, baseType: !5, size: 32, offset: 480)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !898, file: !896, line: 131, baseType: !924, size: 64, offset: 512)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !896, line: 75, baseType: !925)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DISubroutineType(types: !927)
!927 = !{!395, !918, !918}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !898, file: !896, line: 132, baseType: !929, size: 64, offset: 576)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !896, line: 78, baseType: !402)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !898, file: !896, line: 135, baseType: !395, size: 64, offset: 640)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !898, file: !896, line: 136, baseType: !932, size: 64, offset: 704)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !896, line: 82, baseType: !933)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{!395, !395, !918, !918}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !898, file: !896, line: 137, baseType: !937, size: 64, offset: 768)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !896, line: 83, baseType: !938)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{null, !395, !395}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !898, file: !896, line: 141, baseType: !5, size: 32, offset: 832)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !892, file: !803, line: 48, baseType: !943, size: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !409, line: 35, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !409, line: 35, size: 128, elements: !946)
!946 = !{!947}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !945, file: !409, line: 35, baseType: !413, size: 128)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !892, file: !803, line: 51, baseType: !949, size: 64, offset: 128)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !149, line: 183, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !149, line: 183, size: 128, elements: !952)
!952 = !{!953}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !951, file: !149, line: 183, baseType: !954, size: 128)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !149, line: 182, baseType: !955)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !149, line: 182, size: 128, elements: !956)
!956 = !{!957, !958, !959}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !955, file: !149, line: 182, baseType: !5, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !955, file: !149, line: 182, baseType: !5, size: 32, offset: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !955, file: !149, line: 182, baseType: !960, size: 64, offset: 64)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 64, elements: !521)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !892, file: !803, line: 54, baseType: !601, size: 64, offset: 192)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !892, file: !803, line: 57, baseType: !963, size: 128, offset: 256)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !964, line: 31, size: 128, elements: !965)
!964 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!965 = !{!966, !967, !968, !969, !970, !971, !972}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !963, file: !964, line: 35, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !963, file: !964, line: 39, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !963, file: !964, line: 42, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !963, file: !964, line: 46, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !963, file: !964, line: 50, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !963, file: !964, line: 53, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !963, file: !964, line: 56, baseType: !973, size: 64, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !421, line: 47, baseType: !540)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !892, file: !803, line: 60, baseType: !963, size: 128, offset: 384)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !892, file: !803, line: 64, baseType: !976, size: 64, offset: 512)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !978, line: 33, flags: DIFlagFwdDecl)
!978 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!979 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !892, file: !803, line: 67, baseType: !601, size: 64, offset: 576)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !892, file: !803, line: 73, baseType: !895, size: 64, offset: 640)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !892, file: !803, line: 77, baseType: !973, size: 64, offset: 704)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !892, file: !803, line: 80, baseType: !5, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !892, file: !803, line: 82, baseType: !984, size: 320, offset: 832)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !985, line: 62, size: 320, elements: !986)
!985 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!986 = !{!987, !993, !994, !995, !996, !1003}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !984, file: !985, line: 63, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !985, line: 56, size: 128, elements: !990)
!990 = !{!991, !992}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !989, file: !985, line: 57, baseType: !988, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !989, file: !985, line: 58, baseType: !696, size: 8, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !984, file: !985, line: 64, baseType: !5, size: 32, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !984, file: !985, line: 66, baseType: !5, size: 32, offset: 96)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !984, file: !985, line: 68, baseType: !390, size: 8, offset: 128)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !984, file: !985, line: 70, baseType: !997, size: 64, offset: 192)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !985, line: 37, size: 128, elements: !999)
!999 = !{!1000, !1001}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !998, file: !985, line: 39, baseType: !997, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !998, file: !985, line: 40, baseType: !1002, size: 64, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !984, file: !985, line: 71, baseType: !1004, size: 64, offset: 256)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !985, line: 45, size: 320, elements: !1006)
!1006 = !{!1007, !1008}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1005, file: !985, line: 47, baseType: !1004, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1005, file: !985, line: 48, baseType: !1009, size: 256, offset: 64)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !149, line: 1883, size: 256, elements: !1010)
!1010 = !{!1011, !1013, !1014, !1019}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1009, file: !149, line: 1884, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1009, file: !149, line: 1885, baseType: !1012, size: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1009, file: !149, line: 1891, baseType: !1015, size: 64, offset: 128)
!1015 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1009, file: !149, line: 1891, size: 64, elements: !1016)
!1016 = !{!1017, !1018}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1015, file: !149, line: 1891, baseType: !420, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1015, file: !149, line: 1891, baseType: !601, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1009, file: !149, line: 1892, baseType: !1002, size: 64, offset: 192)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !852, file: !853, line: 476, baseType: !1021, size: 64, offset: 256)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !376, line: 187, size: 256, elements: !1023)
!1023 = !{!1024, !1025, !1081, !1082}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1022, file: !376, line: 189, baseType: !391, size: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1022, file: !376, line: 192, baseType: !1026, size: 64, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !376, line: 87, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !376, line: 87, size: 128, elements: !1029)
!1029 = !{!1030}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1028, file: !376, line: 87, baseType: !1031, size: 128)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !376, line: 85, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !376, line: 85, size: 128, elements: !1033)
!1033 = !{!1034, !1035, !1036}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1032, file: !376, line: 85, baseType: !5, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1032, file: !376, line: 85, baseType: !5, size: 32, offset: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1032, file: !376, line: 85, baseType: !1037, size: 64, offset: 64)
!1037 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1038, size: 64, elements: !521)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !376, line: 84, baseType: !1039)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !376, line: 100, size: 1216, elements: !1041)
!1041 = !{!1042, !1043, !1044, !1045, !1046, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1071, !1079, !1080}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1040, file: !376, line: 102, baseType: !391, size: 32)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1040, file: !376, line: 105, baseType: !5, size: 32, offset: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1040, file: !376, line: 108, baseType: !445, size: 64, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1040, file: !376, line: 111, baseType: !445, size: 64, offset: 128)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1040, file: !376, line: 114, baseType: !1047, size: 64, offset: 192)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !376, line: 41, size: 64, elements: !1048)
!1048 = !{!1049, !1050}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1047, file: !376, line: 42, baseType: !375, size: 32)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1047, file: !376, line: 43, baseType: !5, size: 32, offset: 32)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1040, file: !376, line: 117, baseType: !5, size: 32, offset: 256)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1040, file: !376, line: 120, baseType: !5, size: 32, offset: 288)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1040, file: !376, line: 123, baseType: !1026, size: 64, offset: 320)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1040, file: !376, line: 126, baseType: !1039, size: 64, offset: 384)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1040, file: !376, line: 129, baseType: !1039, size: 64, offset: 448)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1040, file: !376, line: 132, baseType: !395, size: 64, offset: 512)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1040, file: !376, line: 139, baseType: !601, size: 64, offset: 576)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1040, file: !376, line: 143, baseType: !649, size: 128, offset: 640)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1040, file: !376, line: 146, baseType: !649, size: 128, offset: 768)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1040, file: !376, line: 148, baseType: !390, size: 8, offset: 896)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1040, file: !376, line: 149, baseType: !390, size: 8, offset: 904)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1040, file: !376, line: 153, baseType: !384, size: 32, offset: 928)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1040, file: !376, line: 156, baseType: !1064, size: 64, offset: 960)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !376, line: 48, size: 320, elements: !1066)
!1066 = !{!1067, !1068, !1069, !1070}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1065, file: !376, line: 50, baseType: !420, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1065, file: !376, line: 59, baseType: !649, size: 128, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1065, file: !376, line: 64, baseType: !390, size: 8, offset: 192)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1065, file: !376, line: 67, baseType: !1064, size: 64, offset: 256)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1040, file: !376, line: 159, baseType: !1072, size: 64, offset: 1024)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !376, line: 72, size: 256, elements: !1074)
!1074 = !{!1075, !1076, !1077, !1078}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1073, file: !376, line: 74, baseType: !462, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1073, file: !376, line: 77, baseType: !1072, size: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1073, file: !376, line: 78, baseType: !1072, size: 64, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1073, file: !376, line: 81, baseType: !1072, size: 64, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1040, file: !376, line: 162, baseType: !390, size: 8, offset: 1088)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1040, file: !376, line: 166, baseType: !601, size: 64, offset: 1152)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1022, file: !376, line: 197, baseType: !895, size: 64, offset: 128)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1022, file: !376, line: 200, baseType: !1039, size: 64, offset: 192)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !852, file: !853, line: 479, baseType: !895, size: 64, offset: 320)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !852, file: !853, line: 484, baseType: !601, size: 64, offset: 384)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !852, file: !853, line: 488, baseType: !601, size: 64, offset: 448)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !852, file: !853, line: 493, baseType: !601, size: 64, offset: 512)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !852, file: !853, line: 496, baseType: !601, size: 64, offset: 576)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !852, file: !853, line: 501, baseType: !1089, size: 64, offset: 640)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !144, line: 2355, size: 576, elements: !1091)
!1091 = !{!1092, !1095, !1096, !1097, !1098, !1100, !1101, !1106, !1107, !1108, !1109, !1110, !1111}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1090, file: !144, line: 2356, baseType: !1093, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !144, line: 2356, flags: DIFlagFwdDecl)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1090, file: !144, line: 2357, baseType: !396, size: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1090, file: !144, line: 2358, baseType: !391, size: 32, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1090, file: !144, line: 2359, baseType: !391, size: 32, offset: 160)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1090, file: !144, line: 2360, baseType: !1099, size: 128, offset: 192)
!1099 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 128, elements: !581)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1090, file: !144, line: 2364, baseType: !391, size: 32, offset: 320)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1090, file: !144, line: 2367, baseType: !1102, size: 128, offset: 384)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !144, line: 2349, size: 128, elements: !1103)
!1103 = !{!1104, !1105}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1102, file: !144, line: 2351, baseType: !486, size: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1102, file: !144, line: 2352, baseType: !401, size: 64, offset: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1090, file: !144, line: 2371, baseType: !143, size: 32, offset: 512)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1090, file: !144, line: 2374, baseType: !5, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1090, file: !144, line: 2377, baseType: !5, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1090, file: !144, line: 2381, baseType: !5, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1090, file: !144, line: 2392, baseType: !5, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1090, file: !144, line: 2396, baseType: !5, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !852, file: !853, line: 504, baseType: !1113, size: 64, offset: 704)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !853, line: 504, flags: DIFlagFwdDecl)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !852, file: !853, line: 507, baseType: !895, size: 64, offset: 768)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !852, file: !853, line: 510, baseType: !391, size: 32, offset: 832)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !852, file: !853, line: 513, baseType: !391, size: 32, offset: 864)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !852, file: !853, line: 516, baseType: !439, size: 32, offset: 896)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !852, file: !853, line: 519, baseType: !439, size: 32, offset: 928)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !852, file: !853, line: 522, baseType: !5, size: 32, offset: 960)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !852, file: !853, line: 523, baseType: !5, size: 32, offset: 992)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !852, file: !853, line: 528, baseType: !396, size: 64, offset: 1024)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !852, file: !853, line: 535, baseType: !5, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !852, file: !853, line: 539, baseType: !5, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !852, file: !853, line: 543, baseType: !5, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !852, file: !853, line: 546, baseType: !5, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !852, file: !853, line: 550, baseType: !5, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !852, file: !853, line: 554, baseType: !5, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !852, file: !853, line: 559, baseType: !5, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !852, file: !853, line: 562, baseType: !5, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !852, file: !853, line: 571, baseType: !5, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !852, file: !853, line: 573, baseType: !5, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !852, file: !853, line: 574, baseType: !5, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !852, file: !853, line: 581, baseType: !5, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !852, file: !853, line: 585, baseType: !5, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !852, file: !853, line: 588, baseType: !5, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !852, file: !853, line: 592, baseType: !5, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !852, file: !853, line: 598, baseType: !5, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !847, file: !149, line: 3254, baseType: !601, size: 64, offset: 1536)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !847, file: !149, line: 3257, baseType: !601, size: 64, offset: 1600)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !847, file: !149, line: 3258, baseType: !601, size: 64, offset: 1664)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !847, file: !149, line: 3264, baseType: !5, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !847, file: !149, line: 3265, baseType: !5, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !847, file: !149, line: 3267, baseType: !5, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !847, file: !149, line: 3268, baseType: !5, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !847, file: !149, line: 3269, baseType: !5, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !847, file: !149, line: 3271, baseType: !5, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !847, file: !149, line: 3272, baseType: !5, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !847, file: !149, line: 3273, baseType: !5, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !847, file: !149, line: 3274, baseType: !5, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !847, file: !149, line: 3275, baseType: !5, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !847, file: !149, line: 3276, baseType: !5, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !847, file: !149, line: 3277, baseType: !5, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !847, file: !149, line: 3279, baseType: !5, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !847, file: !149, line: 3280, baseType: !5, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !847, file: !149, line: 3281, baseType: !5, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !847, file: !149, line: 3282, baseType: !5, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !847, file: !149, line: 3283, baseType: !5, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
