; ModuleID = 'tree-scalar-evolution.bc'
source_filename = "tree-scalar-evolution.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }

!416 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!417 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!418 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!419 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!420 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!421 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!422 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!423 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!424 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!425 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!426 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!427 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!428 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!429 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !391, line: 80, baseType: !7, size: 32, elements: !430)
!430 = !{!431, !432, !433, !434}
!431 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!432 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!433 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!434 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!435 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !391, line: 727, baseType: !7, size: 32, elements: !436)
!436 = !{!437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460}
!437 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!438 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!439 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!440 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!441 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!442 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!443 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!444 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!445 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!446 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!447 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!448 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!449 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!450 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!451 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!452 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!453 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!454 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!455 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!456 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!457 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!458 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!459 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!460 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!461 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "t_bool", file: !3, line: 995, baseType: !7, size: 32, elements: !462)
!462 = !{!463, !464, !465}
!463 = !DIEnumerator(name: "t_false", value: 0, isUnsigned: true)
!464 = !DIEnumerator(name: "t_true", value: 1, isUnsigned: true)
!465 = !DIEnumerator(name: "t_dont_know", value: 2, isUnsigned: true)
!466 = !{!467, !468, !469, !470, !473, !474, !476, !134, !7, !1371, !1829, !1287, !946, !478, !1835, !603, !429, !801, !1837, !835, !471, !1839, !1841, !1850, !1043, !1863, !800}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!469 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !472)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !477, line: 56, baseType: !478)
!477 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !480)
!480 = !{!481, !514, !520, !533, !552, !563, !568, !577, !583, !596, !608, !646, !1157, !1185, !1202, !1203, !1208, !1217, !1223, !1228, !1232, !1236, !1480, !1527, !1533, !1539, !1546, !1559, !1573, !1590, !1602, !1624, !1639, !1811}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !479, file: !135, line: 3372, baseType: !482, size: 64)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !483)
!483 = !{!484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !482, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !482, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !482, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !482, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !482, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !482, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !482, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !482, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !482, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !482, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !482, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !482, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !482, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !482, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !482, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !482, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !482, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !482, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !482, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !482, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !482, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !482, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !482, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !482, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !482, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !482, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !482, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !482, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !482, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !482, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !479, file: !135, line: 3373, baseType: !515, size: 192)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !516)
!516 = !{!517, !518, !519}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !515, file: !135, line: 403, baseType: !482, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !515, file: !135, line: 404, baseType: !476, size: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !515, file: !135, line: 405, baseType: !476, size: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !479, file: !135, line: 3374, baseType: !521, size: 320)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !522)
!522 = !{!523, !524}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !521, file: !135, line: 1385, baseType: !515, size: 192)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !521, file: !135, line: 1386, baseType: !525, size: 128, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !526, line: 58, baseType: !527)
!526 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !526, line: 54, size: 128, elements: !528)
!528 = !{!529, !531}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !527, file: !526, line: 56, baseType: !530, size: 64)
!530 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !527, file: !526, line: 57, baseType: !532, size: 64, offset: 64)
!532 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !479, file: !135, line: 3375, baseType: !534, size: 256)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !535)
!535 = !{!536, !537}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !534, file: !135, line: 1398, baseType: !515, size: 192)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !534, file: !135, line: 1399, baseType: !538, size: 64, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !540, line: 52, size: 256, elements: !541)
!540 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!541 = !{!542, !543, !544, !545, !546, !547, !548}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !539, file: !540, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !539, file: !540, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !539, file: !540, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !539, file: !540, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !539, file: !540, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !539, file: !540, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !539, file: !540, line: 62, baseType: !549, size: 192, offset: 64)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !530, size: 192, elements: !550)
!550 = !{!551}
!551 = !DISubrange(count: 3)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !479, file: !135, line: 3376, baseType: !553, size: 256)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !554)
!554 = !{!555, !556}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !553, file: !135, line: 1409, baseType: !515, size: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !553, file: !135, line: 1410, baseType: !557, size: 64, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !559, line: 27, size: 192, elements: !560)
!559 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!560 = !{!561, !562}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !558, file: !559, line: 29, baseType: !525, size: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !558, file: !559, line: 30, baseType: !5, size: 32, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !479, file: !135, line: 3377, baseType: !564, size: 256)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !565)
!565 = !{!566, !567}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !564, file: !135, line: 1438, baseType: !515, size: 192)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !564, file: !135, line: 1439, baseType: !476, size: 64, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !479, file: !135, line: 3378, baseType: !569, size: 256)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !570)
!570 = !{!571, !572, !573}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !569, file: !135, line: 1419, baseType: !515, size: 192)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !569, file: !135, line: 1420, baseType: !469, size: 32, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !569, file: !135, line: 1421, baseType: !574, size: 8, offset: 224)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 8, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 1)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !479, file: !135, line: 3379, baseType: !578, size: 320)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !579)
!579 = !{!580, !581, !582}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !578, file: !135, line: 1429, baseType: !515, size: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !578, file: !135, line: 1430, baseType: !476, size: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !578, file: !135, line: 1431, baseType: !476, size: 64, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !479, file: !135, line: 3380, baseType: !584, size: 320)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !585)
!585 = !{!586, !587}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !584, file: !135, line: 1461, baseType: !515, size: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !584, file: !135, line: 1462, baseType: !588, size: 128, offset: 192)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !589, line: 31, size: 128, elements: !590)
!589 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!590 = !{!591, !594, !595}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !588, file: !589, line: 32, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !588, file: !589, line: 33, baseType: !7, size: 32, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !588, file: !589, line: 34, baseType: !7, size: 32, offset: 96)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !479, file: !135, line: 3381, baseType: !597, size: 384)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !598)
!598 = !{!599, !600, !605, !606, !607}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !597, file: !135, line: 2508, baseType: !515, size: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !597, file: !135, line: 2509, baseType: !601, size: 32, offset: 192)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !602, line: 58, baseType: !603)
!602 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !604, line: 44, baseType: !7)
!604 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!605 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !597, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !597, file: !135, line: 2511, baseType: !476, size: 64, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !597, file: !135, line: 2512, baseType: !476, size: 64, offset: 320)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !479, file: !135, line: 3382, baseType: !609, size: 896)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !610)
!610 = !{!611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !609, file: !135, line: 2653, baseType: !597, size: 384)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !609, file: !135, line: 2654, baseType: !476, size: 64, offset: 384)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !609, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !609, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !609, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !609, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !609, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !609, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !609, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !609, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !609, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !609, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !609, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !609, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !609, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !609, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !609, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !609, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !609, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !609, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !609, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !609, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !609, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !609, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !609, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !609, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !609, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !609, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !609, file: !135, line: 2705, baseType: !476, size: 64, offset: 576)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !609, file: !135, line: 2706, baseType: !476, size: 64, offset: 640)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !609, file: !135, line: 2707, baseType: !476, size: 64, offset: 704)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !609, file: !135, line: 2708, baseType: !476, size: 64, offset: 768)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !609, file: !135, line: 2711, baseType: !644, size: 64, offset: 832)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !479, file: !135, line: 3383, baseType: !647, size: 960)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !648)
!648 = !{!649, !650}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !647, file: !135, line: 2757, baseType: !609, size: 896)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !647, file: !135, line: 2758, baseType: !651, size: 64, offset: 896)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !477, line: 50, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !654, line: 240, size: 384, elements: !655)
!654 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!655 = !{!656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !653, file: !654, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !653, file: !654, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !653, file: !654, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !653, file: !654, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !653, file: !654, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !653, file: !654, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !653, file: !654, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !653, file: !654, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !653, file: !654, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !653, file: !654, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !653, file: !654, line: 321, baseType: !667, size: 320, offset: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !654, line: 315, size: 320, elements: !668)
!668 = !{!669, !1124, !1126, !1155, !1156}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !667, file: !654, line: 316, baseType: !670, size: 64)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !671, size: 64, elements: !575)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !654, line: 183, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !654, line: 166, size: 64, elements: !673)
!673 = !{!674, !675, !676, !677, !678, !686, !687, !699, !702, !762, !763, !1101, !1114, !1121}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !672, file: !654, line: 168, baseType: !469, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !672, file: !654, line: 169, baseType: !7, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !672, file: !654, line: 170, baseType: !474, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !672, file: !654, line: 171, baseType: !651, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !672, file: !654, line: 172, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !477, line: 53, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !654, line: 359, size: 128, elements: !682)
!682 = !{!683, !684}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !681, file: !654, line: 360, baseType: !469, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !681, file: !654, line: 361, baseType: !685, size: 64, offset: 64)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 64, elements: !575)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !672, file: !654, line: 173, baseType: !5, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !672, file: !654, line: 174, baseType: !688, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !654, line: 133, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !654, line: 115, size: 32, elements: !690)
!690 = !{!691, !692, !693, !694, !695, !696, !697, !698}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !689, file: !654, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !689, file: !654, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !689, file: !654, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !689, file: !654, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !689, file: !654, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !689, file: !654, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !689, file: !654, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !689, file: !654, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !672, file: !654, line: 175, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !654, line: 175, flags: DIFlagFwdDecl)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !672, file: !654, line: 176, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !705, line: 75, size: 256, elements: !706)
!705 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!706 = !{!707, !721, !722, !723}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !704, file: !705, line: 76, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !705, line: 68, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !705, line: 63, size: 320, elements: !711)
!711 = !{!712, !714, !715, !716}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !710, file: !705, line: 64, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !710, file: !705, line: 65, baseType: !713, size: 64, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !710, file: !705, line: 66, baseType: !7, size: 32, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !710, file: !705, line: 67, baseType: !717, size: 128, offset: 192)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !718, size: 128, elements: !719)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !705, line: 29, baseType: !530)
!719 = !{!720}
!720 = !DISubrange(count: 2)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !704, file: !705, line: 77, baseType: !708, size: 64, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !704, file: !705, line: 78, baseType: !7, size: 32, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !704, file: !705, line: 79, baseType: !724, size: 64, offset: 192)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !705, line: 49, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !705, line: 45, size: 832, elements: !727)
!727 = !{!728, !729, !730}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !726, file: !705, line: 46, baseType: !713, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !726, file: !705, line: 47, baseType: !703, size: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !726, file: !705, line: 48, baseType: !731, size: 704, offset: 128)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !732, line: 164, size: 704, elements: !733)
!732 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!733 = !{!734, !735, !745, !746, !747, !748, !749, !750, !754, !758, !759, !760, !761}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !731, file: !732, line: 166, baseType: !532, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !731, file: !732, line: 167, baseType: !736, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !732, line: 157, size: 192, elements: !738)
!738 = !{!739, !740, !741}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !737, file: !732, line: 159, baseType: !471, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !737, file: !732, line: 160, baseType: !736, size: 64, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !737, file: !732, line: 161, baseType: !742, size: 32, offset: 128)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 32, elements: !743)
!743 = !{!744}
!744 = !DISubrange(count: 4)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !731, file: !732, line: 168, baseType: !471, size: 64, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !731, file: !732, line: 169, baseType: !471, size: 64, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !731, file: !732, line: 170, baseType: !471, size: 64, offset: 256)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !731, file: !732, line: 171, baseType: !532, size: 64, offset: 320)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !731, file: !732, line: 172, baseType: !469, size: 32, offset: 384)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !731, file: !732, line: 176, baseType: !751, size: 64, offset: 448)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!736, !473, !532}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !731, file: !732, line: 177, baseType: !755, size: 64, offset: 512)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{null, !473, !736}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !731, file: !732, line: 178, baseType: !473, size: 64, offset: 576)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !731, file: !732, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !731, file: !732, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !731, file: !732, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !672, file: !654, line: 177, baseType: !476, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !672, file: !654, line: 178, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !343, line: 217, size: 832, elements: !766)
!766 = !{!767, !1013, !1014, !1015, !1071, !1075, !1076, !1077, !1095, !1096, !1097, !1098, !1099, !1100}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !765, file: !343, line: 219, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !343, line: 151, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !343, line: 151, size: 128, elements: !771)
!771 = !{!772}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !770, file: !343, line: 151, baseType: !773, size: 128)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !343, line: 150, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !343, line: 150, size: 128, elements: !775)
!775 = !{!776, !777, !778}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !774, file: !343, line: 150, baseType: !7, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !774, file: !343, line: 150, baseType: !7, size: 32, offset: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !774, file: !343, line: 150, baseType: !779, size: 64, offset: 64)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !780, size: 64, elements: !575)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !477, line: 108, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !343, line: 122, size: 512, elements: !783)
!783 = !{!784, !785, !786, !1005, !1006, !1007, !1008, !1009, !1010, !1011}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !782, file: !343, line: 124, baseType: !764, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !782, file: !343, line: 125, baseType: !764, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !782, file: !343, line: 131, baseType: !787, size: 64, offset: 128)
!787 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !343, line: 128, size: 64, elements: !788)
!788 = !{!789, !1004}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !787, file: !343, line: 129, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !477, line: 66, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !391, line: 143, size: 192, elements: !793)
!793 = !{!794, !1002, !1003}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !792, file: !391, line: 145, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !477, line: 69, baseType: !796)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !391, line: 136, size: 192, elements: !798)
!798 = !{!799, !1000, !1001}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !797, file: !391, line: 137, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !477, line: 58, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !391, line: 737, size: 768, elements: !803)
!803 = !{!804, !821, !855, !861, !866, !871, !878, !884, !890, !895, !909, !914, !920, !925, !935, !940, !958, !965, !972, !978, !983, !989, !995}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !802, file: !391, line: 738, baseType: !805, size: 256)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !391, line: 271, size: 256, elements: !806)
!806 = !{!807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !805, file: !391, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !805, file: !391, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !805, file: !391, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !805, file: !391, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !805, file: !391, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !805, file: !391, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !805, file: !391, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !805, file: !391, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !805, file: !391, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !805, file: !391, line: 312, baseType: !7, size: 32, offset: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !805, file: !391, line: 316, baseType: !601, size: 32, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !805, file: !391, line: 319, baseType: !7, size: 32, offset: 96)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !805, file: !391, line: 323, baseType: !764, size: 64, offset: 128)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !805, file: !391, line: 327, baseType: !476, size: 64, offset: 192)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !802, file: !391, line: 739, baseType: !822, size: 448)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !391, line: 350, size: 448, elements: !823)
!823 = !{!824, !853}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !822, file: !391, line: 353, baseType: !825, size: 384)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !391, line: 333, size: 384, elements: !826)
!826 = !{!827, !828, !836}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !825, file: !391, line: 336, baseType: !805, size: 256)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !825, file: !391, line: 343, baseType: !829, size: 64, offset: 256)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !831, line: 37, size: 128, elements: !832)
!831 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!832 = !{!833, !834}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !830, file: !831, line: 39, baseType: !829, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !830, file: !831, line: 40, baseType: !835, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !825, file: !391, line: 344, baseType: !837, size: 64, offset: 320)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !831, line: 45, size: 320, elements: !839)
!839 = !{!840, !841}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !838, file: !831, line: 47, baseType: !837, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !838, file: !831, line: 48, baseType: !842, size: 256, offset: 64)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !843)
!843 = !{!844, !846, !847, !852}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !842, file: !135, line: 1884, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !842, file: !135, line: 1885, baseType: !845, size: 64, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !842, file: !135, line: 1891, baseType: !848, size: 64, offset: 128)
!848 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !842, file: !135, line: 1891, size: 64, elements: !849)
!849 = !{!850, !851}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !848, file: !135, line: 1891, baseType: !800, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !848, file: !135, line: 1891, baseType: !476, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !842, file: !135, line: 1892, baseType: !835, size: 64, offset: 192)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !822, file: !391, line: 359, baseType: !854, size: 64, offset: 384)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 64, elements: !575)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !802, file: !391, line: 740, baseType: !856, size: 512)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !391, line: 365, size: 512, elements: !857)
!857 = !{!858, !859, !860}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !856, file: !391, line: 368, baseType: !825, size: 384)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !856, file: !391, line: 373, baseType: !476, size: 64, offset: 384)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !856, file: !391, line: 374, baseType: !476, size: 64, offset: 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !802, file: !391, line: 741, baseType: !862, size: 576)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !391, line: 380, size: 576, elements: !863)
!863 = !{!864, !865}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !862, file: !391, line: 383, baseType: !856, size: 512)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !862, file: !391, line: 389, baseType: !854, size: 64, offset: 512)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !802, file: !391, line: 742, baseType: !867, size: 320)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !391, line: 395, size: 320, elements: !868)
!868 = !{!869, !870}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !867, file: !391, line: 397, baseType: !805, size: 256)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !867, file: !391, line: 400, baseType: !790, size: 64, offset: 256)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !802, file: !391, line: 743, baseType: !872, size: 448)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !391, line: 406, size: 448, elements: !873)
!873 = !{!874, !875, !876, !877}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !872, file: !391, line: 408, baseType: !805, size: 256)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !872, file: !391, line: 412, baseType: !476, size: 64, offset: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !872, file: !391, line: 420, baseType: !476, size: 64, offset: 320)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !872, file: !391, line: 423, baseType: !790, size: 64, offset: 384)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !802, file: !391, line: 744, baseType: !879, size: 384)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !391, line: 429, size: 384, elements: !880)
!880 = !{!881, !882, !883}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !879, file: !391, line: 431, baseType: !805, size: 256)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !879, file: !391, line: 434, baseType: !476, size: 64, offset: 256)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !879, file: !391, line: 437, baseType: !790, size: 64, offset: 320)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !802, file: !391, line: 745, baseType: !885, size: 384)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !391, line: 443, size: 384, elements: !886)
!886 = !{!887, !888, !889}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !885, file: !391, line: 445, baseType: !805, size: 256)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !885, file: !391, line: 449, baseType: !476, size: 64, offset: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !885, file: !391, line: 453, baseType: !790, size: 64, offset: 320)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !802, file: !391, line: 746, baseType: !891, size: 320)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !391, line: 459, size: 320, elements: !892)
!892 = !{!893, !894}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !891, file: !391, line: 461, baseType: !805, size: 256)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !891, file: !391, line: 464, baseType: !476, size: 64, offset: 256)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !802, file: !391, line: 747, baseType: !896, size: 768)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !391, line: 469, size: 768, elements: !897)
!897 = !{!898, !899, !900, !901, !902}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !896, file: !391, line: 471, baseType: !805, size: 256)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !896, file: !391, line: 474, baseType: !7, size: 32, offset: 256)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !896, file: !391, line: 475, baseType: !7, size: 32, offset: 288)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !896, file: !391, line: 478, baseType: !476, size: 64, offset: 320)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !896, file: !391, line: 481, baseType: !903, size: 384, offset: 384)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !904, size: 384, elements: !575)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !905)
!905 = !{!906, !907, !908}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !904, file: !135, line: 1920, baseType: !842, size: 256)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !904, file: !135, line: 1921, baseType: !476, size: 64, offset: 256)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !904, file: !135, line: 1922, baseType: !601, size: 32, offset: 320)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !802, file: !391, line: 748, baseType: !910, size: 320)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !391, line: 487, size: 320, elements: !911)
!911 = !{!912, !913}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !910, file: !391, line: 490, baseType: !805, size: 256)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !910, file: !391, line: 494, baseType: !469, size: 32, offset: 256)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !802, file: !391, line: 749, baseType: !915, size: 384)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !391, line: 500, size: 384, elements: !916)
!916 = !{!917, !918, !919}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !915, file: !391, line: 502, baseType: !805, size: 256)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !915, file: !391, line: 506, baseType: !790, size: 64, offset: 256)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !915, file: !391, line: 510, baseType: !790, size: 64, offset: 320)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !802, file: !391, line: 750, baseType: !921, size: 320)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !391, line: 529, size: 320, elements: !922)
!922 = !{!923, !924}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !921, file: !391, line: 531, baseType: !805, size: 256)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !921, file: !391, line: 540, baseType: !790, size: 64, offset: 256)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !802, file: !391, line: 751, baseType: !926, size: 704)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !391, line: 546, size: 704, elements: !927)
!927 = !{!928, !929, !930, !931, !932, !933, !934}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !926, file: !391, line: 549, baseType: !856, size: 512)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !926, file: !391, line: 553, baseType: !474, size: 64, offset: 512)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !926, file: !391, line: 557, baseType: !468, size: 8, offset: 576)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !926, file: !391, line: 558, baseType: !468, size: 8, offset: 584)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !926, file: !391, line: 559, baseType: !468, size: 8, offset: 592)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !926, file: !391, line: 560, baseType: !468, size: 8, offset: 600)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !926, file: !391, line: 566, baseType: !854, size: 64, offset: 640)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !802, file: !391, line: 752, baseType: !936, size: 384)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !391, line: 571, size: 384, elements: !937)
!937 = !{!938, !939}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !936, file: !391, line: 573, baseType: !867, size: 320)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !936, file: !391, line: 577, baseType: !476, size: 64, offset: 320)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !802, file: !391, line: 753, baseType: !941, size: 576)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !391, line: 600, size: 576, elements: !942)
!942 = !{!943, !944, !945, !948, !957}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !941, file: !391, line: 602, baseType: !867, size: 320)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !941, file: !391, line: 605, baseType: !476, size: 64, offset: 320)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !941, file: !391, line: 609, baseType: !946, size: 64, offset: 384)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !947, line: 46, baseType: !530)
!947 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!948 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !941, file: !391, line: 612, baseType: !949, size: 64, offset: 448)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !391, line: 581, size: 320, elements: !951)
!951 = !{!952, !953, !954, !955, !956}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !950, file: !391, line: 583, baseType: !134, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !950, file: !391, line: 586, baseType: !476, size: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !950, file: !391, line: 589, baseType: !476, size: 64, offset: 128)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !950, file: !391, line: 592, baseType: !476, size: 64, offset: 192)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !950, file: !391, line: 595, baseType: !476, size: 64, offset: 256)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !941, file: !391, line: 616, baseType: !790, size: 64, offset: 512)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !802, file: !391, line: 754, baseType: !959, size: 512)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !391, line: 622, size: 512, elements: !960)
!960 = !{!961, !962, !963, !964}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !959, file: !391, line: 624, baseType: !867, size: 320)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !959, file: !391, line: 628, baseType: !476, size: 64, offset: 320)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !959, file: !391, line: 632, baseType: !476, size: 64, offset: 384)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !959, file: !391, line: 636, baseType: !476, size: 64, offset: 448)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !802, file: !391, line: 755, baseType: !966, size: 704)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !391, line: 642, size: 704, elements: !967)
!967 = !{!968, !969, !970, !971}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !966, file: !391, line: 644, baseType: !959, size: 512)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !966, file: !391, line: 648, baseType: !476, size: 64, offset: 512)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !966, file: !391, line: 652, baseType: !476, size: 64, offset: 576)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !966, file: !391, line: 653, baseType: !476, size: 64, offset: 640)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !802, file: !391, line: 756, baseType: !973, size: 448)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !391, line: 663, size: 448, elements: !974)
!974 = !{!975, !976, !977}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !973, file: !391, line: 665, baseType: !867, size: 320)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !973, file: !391, line: 668, baseType: !476, size: 64, offset: 320)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !973, file: !391, line: 673, baseType: !476, size: 64, offset: 384)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !802, file: !391, line: 757, baseType: !979, size: 384)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !391, line: 694, size: 384, elements: !980)
!980 = !{!981, !982}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !979, file: !391, line: 696, baseType: !867, size: 320)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !979, file: !391, line: 699, baseType: !476, size: 64, offset: 320)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !802, file: !391, line: 758, baseType: !984, size: 384)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !391, line: 681, size: 384, elements: !985)
!985 = !{!986, !987, !988}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !984, file: !391, line: 683, baseType: !805, size: 256)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !984, file: !391, line: 686, baseType: !476, size: 64, offset: 256)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !984, file: !391, line: 689, baseType: !476, size: 64, offset: 320)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !802, file: !391, line: 759, baseType: !990, size: 384)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !391, line: 707, size: 384, elements: !991)
!991 = !{!992, !993, !994}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !990, file: !391, line: 709, baseType: !805, size: 256)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !990, file: !391, line: 712, baseType: !476, size: 64, offset: 256)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !990, file: !391, line: 712, baseType: !476, size: 64, offset: 320)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !802, file: !391, line: 760, baseType: !996, size: 320)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !391, line: 718, size: 320, elements: !997)
!997 = !{!998, !999}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !996, file: !391, line: 720, baseType: !805, size: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !996, file: !391, line: 723, baseType: !476, size: 64, offset: 256)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !797, file: !391, line: 138, baseType: !796, size: 64, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !797, file: !391, line: 139, baseType: !796, size: 64, offset: 128)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !792, file: !391, line: 146, baseType: !795, size: 64, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !792, file: !391, line: 152, baseType: !790, size: 64, offset: 128)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !787, file: !343, line: 130, baseType: !651, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !782, file: !343, line: 134, baseType: !473, size: 64, offset: 192)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !782, file: !343, line: 137, baseType: !476, size: 64, offset: 256)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !782, file: !343, line: 138, baseType: !601, size: 32, offset: 320)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !782, file: !343, line: 142, baseType: !7, size: 32, offset: 352)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !782, file: !343, line: 144, baseType: !469, size: 32, offset: 384)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !782, file: !343, line: 145, baseType: !469, size: 32, offset: 416)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !782, file: !343, line: 146, baseType: !1012, size: 64, offset: 448)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !343, line: 119, baseType: !532)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !765, file: !343, line: 220, baseType: !768, size: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !765, file: !343, line: 223, baseType: !473, size: 64, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !765, file: !343, line: 226, baseType: !1016, size: 64, offset: 192)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 100, size: 1216, elements: !1018)
!1018 = !{!1019, !1020, !1021, !1022, !1023, !1028, !1029, !1030, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1061, !1069, !1070}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1017, file: !330, line: 102, baseType: !469, size: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1017, file: !330, line: 105, baseType: !7, size: 32, offset: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1017, file: !330, line: 108, baseType: !764, size: 64, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1017, file: !330, line: 111, baseType: !764, size: 64, offset: 128)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1017, file: !330, line: 114, baseType: !1024, size: 64, offset: 192)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !330, line: 41, size: 64, elements: !1025)
!1025 = !{!1026, !1027}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1024, file: !330, line: 42, baseType: !329, size: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1024, file: !330, line: 43, baseType: !7, size: 32, offset: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1017, file: !330, line: 117, baseType: !7, size: 32, offset: 256)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1017, file: !330, line: 120, baseType: !7, size: 32, offset: 288)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1017, file: !330, line: 123, baseType: !1031, size: 64, offset: 320)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !330, line: 87, baseType: !1033)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !330, line: 87, size: 128, elements: !1034)
!1034 = !{!1035}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1033, file: !330, line: 87, baseType: !1036, size: 128)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !330, line: 85, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !330, line: 85, size: 128, elements: !1038)
!1038 = !{!1039, !1040, !1041}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1037, file: !330, line: 85, baseType: !7, size: 32)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1037, file: !330, line: 85, baseType: !7, size: 32, offset: 32)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1037, file: !330, line: 85, baseType: !1042, size: 64, offset: 64)
!1042 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1043, size: 64, elements: !575)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !330, line: 84, baseType: !1016)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1017, file: !330, line: 126, baseType: !1016, size: 64, offset: 384)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1017, file: !330, line: 129, baseType: !1016, size: 64, offset: 448)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1017, file: !330, line: 132, baseType: !473, size: 64, offset: 512)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1017, file: !330, line: 139, baseType: !476, size: 64, offset: 576)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1017, file: !330, line: 143, baseType: !525, size: 128, offset: 640)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1017, file: !330, line: 146, baseType: !525, size: 128, offset: 768)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1017, file: !330, line: 148, baseType: !468, size: 8, offset: 896)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1017, file: !330, line: 149, baseType: !468, size: 8, offset: 904)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1017, file: !330, line: 153, baseType: !338, size: 32, offset: 928)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1017, file: !330, line: 156, baseType: !1054, size: 64, offset: 960)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !330, line: 48, size: 320, elements: !1056)
!1056 = !{!1057, !1058, !1059, !1060}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1055, file: !330, line: 50, baseType: !800, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1055, file: !330, line: 59, baseType: !525, size: 128, offset: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1055, file: !330, line: 64, baseType: !468, size: 8, offset: 192)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1055, file: !330, line: 67, baseType: !1054, size: 64, offset: 256)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1017, file: !330, line: 159, baseType: !1062, size: 64, offset: 1024)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !330, line: 72, size: 256, elements: !1064)
!1064 = !{!1065, !1066, !1067, !1068}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1063, file: !330, line: 74, baseType: !781, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1063, file: !330, line: 77, baseType: !1062, size: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1063, file: !330, line: 78, baseType: !1062, size: 64, offset: 128)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1063, file: !330, line: 81, baseType: !1062, size: 64, offset: 192)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1017, file: !330, line: 162, baseType: !468, size: 8, offset: 1088)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1017, file: !330, line: 166, baseType: !476, size: 64, offset: 1152)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !765, file: !343, line: 229, baseType: !1072, size: 128, offset: 256)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1073, size: 128, elements: !719)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !343, line: 229, flags: DIFlagFwdDecl)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !765, file: !343, line: 232, baseType: !764, size: 64, offset: 384)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !765, file: !343, line: 233, baseType: !764, size: 64, offset: 448)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !765, file: !343, line: 238, baseType: !1078, size: 64, offset: 512)
!1078 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !343, line: 235, size: 64, elements: !1079)
!1079 = !{!1080, !1086}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1078, file: !343, line: 236, baseType: !1081, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !343, line: 273, size: 128, elements: !1083)
!1083 = !{!1084, !1085}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1082, file: !343, line: 275, baseType: !790, size: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1082, file: !343, line: 278, baseType: !790, size: 64, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1078, file: !343, line: 237, baseType: !1087, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !343, line: 259, size: 320, elements: !1089)
!1089 = !{!1090, !1091, !1092, !1093, !1094}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1088, file: !343, line: 261, baseType: !651, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1088, file: !343, line: 262, baseType: !651, size: 64, offset: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1088, file: !343, line: 266, baseType: !651, size: 64, offset: 128)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1088, file: !343, line: 267, baseType: !651, size: 64, offset: 192)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1088, file: !343, line: 270, baseType: !469, size: 32, offset: 256)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !765, file: !343, line: 241, baseType: !1012, size: 64, offset: 576)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !765, file: !343, line: 244, baseType: !469, size: 32, offset: 640)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !765, file: !343, line: 247, baseType: !469, size: 32, offset: 672)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !765, file: !343, line: 250, baseType: !469, size: 32, offset: 704)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !765, file: !343, line: 253, baseType: !469, size: 32, offset: 736)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !765, file: !343, line: 256, baseType: !469, size: 32, offset: 768)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !672, file: !654, line: 179, baseType: !1102, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !654, line: 150, baseType: !1104)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !654, line: 142, size: 320, elements: !1105)
!1105 = !{!1106, !1107, !1108, !1109, !1112, !1113}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1104, file: !654, line: 144, baseType: !476, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1104, file: !654, line: 145, baseType: !651, size: 64, offset: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1104, file: !654, line: 146, baseType: !651, size: 64, offset: 128)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1104, file: !654, line: 147, baseType: !1110, size: 32, offset: 192)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1111, line: 31, baseType: !469)
!1111 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1104, file: !654, line: 148, baseType: !7, size: 32, offset: 224)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1104, file: !654, line: 149, baseType: !468, size: 8, offset: 256)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !672, file: !654, line: 180, baseType: !1115, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !654, line: 162, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !654, line: 159, size: 128, elements: !1118)
!1118 = !{!1119, !1120}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1117, file: !654, line: 160, baseType: !476, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1117, file: !654, line: 161, baseType: !532, size: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !672, file: !654, line: 181, baseType: !1122, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !654, line: 181, flags: DIFlagFwdDecl)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !667, file: !654, line: 317, baseType: !1125, size: 64)
!1125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !532, size: 64, elements: !575)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !667, file: !654, line: 318, baseType: !1127, size: 320)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !654, line: 188, size: 320, elements: !1128)
!1128 = !{!1129, !1131, !1154}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1127, file: !654, line: 190, baseType: !1130, size: 192)
!1130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !671, size: 192, elements: !550)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1127, file: !654, line: 193, baseType: !1132, size: 64, offset: 192)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !654, line: 206, size: 320, elements: !1134)
!1134 = !{!1135, !1139, !1140, !1141, !1153}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1133, file: !654, line: 208, baseType: !1136, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !477, line: 62, baseType: !1138)
!1138 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !477, line: 61, flags: DIFlagFwdDecl)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1133, file: !654, line: 211, baseType: !7, size: 32, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1133, file: !654, line: 214, baseType: !532, size: 64, offset: 128)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1133, file: !654, line: 224, baseType: !1142, size: 64, offset: 192)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !654, line: 202, baseType: !1144)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !654, line: 202, size: 128, elements: !1145)
!1145 = !{!1146}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1144, file: !654, line: 202, baseType: !1147, size: 128)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !654, line: 200, baseType: !1148)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !654, line: 200, size: 128, elements: !1149)
!1149 = !{!1150, !1151, !1152}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1148, file: !654, line: 200, baseType: !7, size: 32)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1148, file: !654, line: 200, baseType: !7, size: 32, offset: 32)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1148, file: !654, line: 200, baseType: !685, size: 64, offset: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1133, file: !654, line: 234, baseType: !1142, size: 64, offset: 256)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1127, file: !654, line: 197, baseType: !532, size: 64, offset: 256)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !667, file: !654, line: 319, baseType: !539, size: 256)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !667, file: !654, line: 320, baseType: !558, size: 192)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !479, file: !135, line: 3384, baseType: !1158, size: 1472)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1159)
!1159 = !{!1160, !1181, !1182, !1183, !1184}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1158, file: !135, line: 3115, baseType: !1161, size: 1216)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1162)
!1162 = !{!1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1161, file: !135, line: 2985, baseType: !647, size: 960)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1161, file: !135, line: 2986, baseType: !476, size: 64, offset: 960)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1161, file: !135, line: 2987, baseType: !476, size: 64, offset: 1024)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1161, file: !135, line: 2988, baseType: !476, size: 64, offset: 1088)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1161, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1161, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1161, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1161, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1161, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1161, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1161, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1161, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1161, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1161, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1161, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1161, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1161, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1161, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1158, file: !135, line: 3117, baseType: !476, size: 64, offset: 1216)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1158, file: !135, line: 3119, baseType: !476, size: 64, offset: 1280)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1158, file: !135, line: 3121, baseType: !476, size: 64, offset: 1344)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1158, file: !135, line: 3123, baseType: !476, size: 64, offset: 1408)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !479, file: !135, line: 3385, baseType: !1186, size: 1088)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1187)
!1187 = !{!1188, !1189, !1190}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1186, file: !135, line: 2875, baseType: !647, size: 960)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1186, file: !135, line: 2876, baseType: !651, size: 64, offset: 960)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1186, file: !135, line: 2877, baseType: !1191, size: 64, offset: 1024)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1193, line: 172, size: 128, elements: !1194)
!1193 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1194 = !{!1195, !1196, !1197, !1198, !1199, !1200, !1201}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1192, file: !1193, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1192, file: !1193, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1192, file: !1193, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1192, file: !1193, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1192, file: !1193, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1192, file: !1193, line: 195, baseType: !7, size: 32, offset: 32)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1192, file: !1193, line: 199, baseType: !476, size: 64, offset: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !479, file: !135, line: 3386, baseType: !1161, size: 1216)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !479, file: !135, line: 3387, baseType: !1204, size: 1280)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1205)
!1205 = !{!1206, !1207}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1204, file: !135, line: 3094, baseType: !1161, size: 1216)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1204, file: !135, line: 3095, baseType: !1191, size: 64, offset: 1216)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !479, file: !135, line: 3388, baseType: !1209, size: 1216)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1210)
!1210 = !{!1211, !1212, !1213, !1214, !1215, !1216}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1209, file: !135, line: 2825, baseType: !609, size: 896)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1209, file: !135, line: 2827, baseType: !476, size: 64, offset: 896)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1209, file: !135, line: 2828, baseType: !476, size: 64, offset: 960)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1209, file: !135, line: 2829, baseType: !476, size: 64, offset: 1024)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1209, file: !135, line: 2830, baseType: !476, size: 64, offset: 1088)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1209, file: !135, line: 2831, baseType: !476, size: 64, offset: 1152)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !479, file: !135, line: 3389, baseType: !1218, size: 1024)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1219)
!1219 = !{!1220, !1221, !1222}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1218, file: !135, line: 2851, baseType: !647, size: 960)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1218, file: !135, line: 2852, baseType: !469, size: 32, offset: 960)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1218, file: !135, line: 2853, baseType: !469, size: 32, offset: 992)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !479, file: !135, line: 3390, baseType: !1224, size: 1024)
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !1225)
!1225 = !{!1226, !1227}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1224, file: !135, line: 2858, baseType: !647, size: 960)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1224, file: !135, line: 2859, baseType: !1191, size: 64, offset: 960)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !479, file: !135, line: 3391, baseType: !1229, size: 960)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !1230)
!1230 = !{!1231}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1229, file: !135, line: 2863, baseType: !647, size: 960)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !479, file: !135, line: 3392, baseType: !1233, size: 1472)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !1234)
!1234 = !{!1235}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1233, file: !135, line: 3305, baseType: !1158, size: 1472)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !479, file: !135, line: 3393, baseType: !1237, size: 1792)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !1238)
!1238 = !{!1239, !1240, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1237, file: !135, line: 3249, baseType: !1158, size: 1472)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1237, file: !135, line: 3251, baseType: !1241, size: 64, offset: 1472)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1243, line: 463, size: 1152, elements: !1244)
!1243 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1244 = !{!1245, !1248, !1279, !1280, !1395, !1403, !1404, !1405, !1406, !1407, !1408, !1432, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1242, file: !1243, line: 464, baseType: !1246, size: 64)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1243, line: 464, flags: DIFlagFwdDecl)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1242, file: !1243, line: 467, baseType: !1249, size: 64, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !343, line: 374, size: 640, elements: !1251)
!1251 = !{!1252, !1254, !1255, !1268, !1269, !1270, !1271, !1272, !1273, !1275, !1277, !1278}
