; ModuleID = 'tree-vrp.bc'
source_filename = "tree-vrp.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }

!620 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!621 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!622 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!623 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!624 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!625 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!626 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !588, line: 727, baseType: !7, size: 32, elements: !627)
!627 = !{!628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651}
!628 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!629 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!630 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!631 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!632 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!633 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!634 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!635 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!636 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!637 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!638 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!639 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!640 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!641 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!642 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!643 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!644 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!645 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!646 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!647 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!648 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!649 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!650 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!651 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!652 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !588, line: 80, baseType: !7, size: 32, elements: !653)
!653 = !{!654, !655, !656, !657}
!654 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!655 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!656 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!657 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!658 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ssa_prop_result", file: !391, line: 44, baseType: !7, size: 32, elements: !659)
!659 = !{!660, !661, !662}
!660 = !DIEnumerator(name: "SSA_PROP_NOT_INTERESTING", value: 0, isUnsigned: true)
!661 = !DIEnumerator(name: "SSA_PROP_INTERESTING", value: 1, isUnsigned: true)
!662 = !DIEnumerator(name: "SSA_PROP_VARYING", value: 2, isUnsigned: true)
!663 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ev_direction", file: !664, line: 712, baseType: !7, size: 32, elements: !665)
!664 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!665 = !{!666, !667, !668}
!666 = !DIEnumerator(name: "EV_DIR_GROWS", value: 0, isUnsigned: true)
!667 = !DIEnumerator(name: "EV_DIR_DECREASES", value: 1, isUnsigned: true)
!668 = !DIEnumerator(name: "EV_DIR_UNKNOWN", value: 2, isUnsigned: true)
!669 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "warn_strict_overflow_code", file: !670, line: 367, baseType: !7, size: 32, elements: !671)
!670 = !DIFile(filename: "./flags.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!671 = !{!672, !673, !674, !675, !676}
!672 = !DIEnumerator(name: "WARN_STRICT_OVERFLOW_ALL", value: 1, isUnsigned: true)
!673 = !DIEnumerator(name: "WARN_STRICT_OVERFLOW_CONDITIONAL", value: 2, isUnsigned: true)
!674 = !DIEnumerator(name: "WARN_STRICT_OVERFLOW_COMPARISON", value: 3, isUnsigned: true)
!675 = !DIEnumerator(name: "WARN_STRICT_OVERFLOW_MISC", value: 4, isUnsigned: true)
!676 = !DIEnumerator(name: "WARN_STRICT_OVERFLOW_MAGNITUDE", value: 5, isUnsigned: true)
!677 = !{!678, !679, !680, !681, !684, !685, !134, !687, !693, !820, !747, !2046, !1586, !2064, !2065, !1018, !2076, !1051, !682, !7, !2078, !652, !2048, !2083, !2086, !2091, !2108, !749, !941, !2109, !1511, !2115, !2128, !2129, !997}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!680 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !683)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "value_range_t", file: !391, line: 107, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "value_range_d", file: !391, line: 83, size: 256, elements: !690)
!690 = !{!691, !692, !2044, !2045}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !689, file: !391, line: 86, baseType: !390, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !689, file: !391, line: 99, baseType: !693, size: 64, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !694, line: 56, baseType: !695)
!694 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !697)
!697 = !{!698, !731, !737, !750, !769, !780, !785, !794, !800, !813, !825, !863, !1373, !1401, !1417, !1418, !1423, !1432, !1438, !1443, !1447, !1451, !1695, !1742, !1748, !1754, !1761, !1774, !1788, !1805, !1817, !1839, !1854, !2026}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !696, file: !135, line: 3372, baseType: !699, size: 64)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !700)
!700 = !{!701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !699, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !699, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !699, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !699, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !699, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !699, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !699, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !699, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !699, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !699, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !699, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !699, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !699, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !699, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !699, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !699, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !699, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !699, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !699, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !699, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !699, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !699, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !699, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !699, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !699, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !699, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !699, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !699, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !699, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !699, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !696, file: !135, line: 3373, baseType: !732, size: 192)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !733)
!733 = !{!734, !735, !736}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !732, file: !135, line: 403, baseType: !699, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !732, file: !135, line: 404, baseType: !693, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !732, file: !135, line: 405, baseType: !693, size: 64, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !696, file: !135, line: 3374, baseType: !738, size: 320)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !739)
!739 = !{!740, !741}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !738, file: !135, line: 1385, baseType: !732, size: 192)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !738, file: !135, line: 1386, baseType: !742, size: 128, offset: 192)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !743, line: 58, baseType: !744)
!743 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !743, line: 54, size: 128, elements: !745)
!745 = !{!746, !748}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !744, file: !743, line: 56, baseType: !747, size: 64)
!747 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !744, file: !743, line: 57, baseType: !749, size: 64, offset: 64)
!749 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !696, file: !135, line: 3375, baseType: !751, size: 256)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !752)
!752 = !{!753, !754}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !751, file: !135, line: 1398, baseType: !732, size: 192)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !751, file: !135, line: 1399, baseType: !755, size: 64, offset: 192)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !757, line: 52, size: 256, elements: !758)
!757 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!758 = !{!759, !760, !761, !762, !763, !764, !765}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !756, file: !757, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !756, file: !757, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !756, file: !757, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !756, file: !757, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !756, file: !757, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !756, file: !757, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !756, file: !757, line: 62, baseType: !766, size: 192, offset: 64)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !747, size: 192, elements: !767)
!767 = !{!768}
!768 = !DISubrange(count: 3)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !696, file: !135, line: 3376, baseType: !770, size: 256)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !771)
!771 = !{!772, !773}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !770, file: !135, line: 1409, baseType: !732, size: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !770, file: !135, line: 1410, baseType: !774, size: 64, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !776, line: 27, size: 192, elements: !777)
!776 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!777 = !{!778, !779}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !775, file: !776, line: 29, baseType: !742, size: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !775, file: !776, line: 30, baseType: !5, size: 32, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !696, file: !135, line: 3377, baseType: !781, size: 256)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !782)
!782 = !{!783, !784}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !781, file: !135, line: 1438, baseType: !732, size: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !781, file: !135, line: 1439, baseType: !693, size: 64, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !696, file: !135, line: 3378, baseType: !786, size: 256)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !787)
!787 = !{!788, !789, !790}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !786, file: !135, line: 1419, baseType: !732, size: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !786, file: !135, line: 1420, baseType: !680, size: 32, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !786, file: !135, line: 1421, baseType: !791, size: 8, offset: 224)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !683, size: 8, elements: !792)
!792 = !{!793}
!793 = !DISubrange(count: 1)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !696, file: !135, line: 3379, baseType: !795, size: 320)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !796)
!796 = !{!797, !798, !799}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !795, file: !135, line: 1429, baseType: !732, size: 192)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !795, file: !135, line: 1430, baseType: !693, size: 64, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !795, file: !135, line: 1431, baseType: !693, size: 64, offset: 256)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !696, file: !135, line: 3380, baseType: !801, size: 320)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !802)
!802 = !{!803, !804}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !801, file: !135, line: 1461, baseType: !732, size: 192)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !801, file: !135, line: 1462, baseType: !805, size: 128, offset: 192)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !806, line: 31, size: 128, elements: !807)
!806 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!807 = !{!808, !811, !812}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !805, file: !806, line: 32, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !679)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !805, file: !806, line: 33, baseType: !7, size: 32, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !805, file: !806, line: 34, baseType: !7, size: 32, offset: 96)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !696, file: !135, line: 3381, baseType: !814, size: 384)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !815)
!815 = !{!816, !817, !822, !823, !824}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !814, file: !135, line: 2508, baseType: !732, size: 192)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !814, file: !135, line: 2509, baseType: !818, size: 32, offset: 192)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !819, line: 58, baseType: !820)
!819 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !821, line: 44, baseType: !7)
!821 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!822 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !814, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !814, file: !135, line: 2511, baseType: !693, size: 64, offset: 256)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !814, file: !135, line: 2512, baseType: !693, size: 64, offset: 320)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !696, file: !135, line: 3382, baseType: !826, size: 896)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !827)
!827 = !{!828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !826, file: !135, line: 2653, baseType: !814, size: 384)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !826, file: !135, line: 2654, baseType: !693, size: 64, offset: 384)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !826, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !826, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !826, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !826, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !826, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !826, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !826, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !826, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !826, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !826, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !826, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !826, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !826, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !826, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !826, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !826, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !826, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !826, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !826, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !826, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !826, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !826, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !826, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !826, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !826, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !826, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !826, file: !135, line: 2705, baseType: !693, size: 64, offset: 576)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !826, file: !135, line: 2706, baseType: !693, size: 64, offset: 640)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !826, file: !135, line: 2707, baseType: !693, size: 64, offset: 704)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !826, file: !135, line: 2708, baseType: !693, size: 64, offset: 768)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !826, file: !135, line: 2711, baseType: !861, size: 64, offset: 832)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !696, file: !135, line: 3383, baseType: !864, size: 960)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !865)
!865 = !{!866, !867}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !864, file: !135, line: 2757, baseType: !826, size: 896)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !864, file: !135, line: 2758, baseType: !868, size: 64, offset: 896)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !694, line: 50, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !871, line: 240, size: 384, elements: !872)
!871 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!872 = !{!873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !870, file: !871, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !870, file: !871, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !870, file: !871, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !870, file: !871, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !870, file: !871, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !870, file: !871, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !870, file: !871, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !870, file: !871, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !870, file: !871, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !870, file: !871, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !870, file: !871, line: 321, baseType: !884, size: 320, offset: 64)
!884 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !871, line: 315, size: 320, elements: !885)
!885 = !{!886, !1340, !1342, !1371, !1372}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !884, file: !871, line: 316, baseType: !887, size: 64)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 64, elements: !792)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !871, line: 183, baseType: !889)
!889 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !871, line: 166, size: 64, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !903, !904, !916, !919, !979, !980, !1317, !1330, !1337}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !889, file: !871, line: 168, baseType: !680, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !889, file: !871, line: 169, baseType: !7, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !889, file: !871, line: 170, baseType: !685, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !889, file: !871, line: 171, baseType: !868, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !889, file: !871, line: 172, baseType: !896, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !694, line: 53, baseType: !897)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !871, line: 359, size: 128, elements: !899)
!899 = !{!900, !901}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !898, file: !871, line: 360, baseType: !680, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !898, file: !871, line: 361, baseType: !902, size: 64, offset: 64)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !868, size: 64, elements: !792)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !889, file: !871, line: 173, baseType: !5, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !889, file: !871, line: 174, baseType: !905, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !871, line: 133, baseType: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !871, line: 115, size: 32, elements: !907)
!907 = !{!908, !909, !910, !911, !912, !913, !914, !915}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !906, file: !871, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !906, file: !871, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !906, file: !871, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !906, file: !871, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !906, file: !871, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !906, file: !871, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !906, file: !871, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !906, file: !871, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !889, file: !871, line: 175, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !871, line: 175, flags: DIFlagFwdDecl)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !889, file: !871, line: 176, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !922, line: 75, size: 256, elements: !923)
!922 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!923 = !{!924, !938, !939, !940}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !921, file: !922, line: 76, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !922, line: 68, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !922, line: 63, size: 320, elements: !928)
!928 = !{!929, !931, !932, !933}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !927, file: !922, line: 64, baseType: !930, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !927, file: !922, line: 65, baseType: !930, size: 64, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !927, file: !922, line: 66, baseType: !7, size: 32, offset: 128)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !927, file: !922, line: 67, baseType: !934, size: 128, offset: 192)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !935, size: 128, elements: !936)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !922, line: 29, baseType: !747)
!936 = !{!937}
!937 = !DISubrange(count: 2)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !921, file: !922, line: 77, baseType: !925, size: 64, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !921, file: !922, line: 78, baseType: !7, size: 32, offset: 128)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !921, file: !922, line: 79, baseType: !941, size: 64, offset: 192)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !922, line: 49, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !922, line: 45, size: 832, elements: !944)
!944 = !{!945, !946, !947}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !943, file: !922, line: 46, baseType: !930, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !943, file: !922, line: 47, baseType: !920, size: 64, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !943, file: !922, line: 48, baseType: !948, size: 704, offset: 128)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !949, line: 164, size: 704, elements: !950)
!949 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!950 = !{!951, !952, !962, !963, !964, !965, !966, !967, !971, !975, !976, !977, !978}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !948, file: !949, line: 166, baseType: !749, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !948, file: !949, line: 167, baseType: !953, size: 64, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !949, line: 157, size: 192, elements: !955)
!955 = !{!956, !957, !958}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !954, file: !949, line: 159, baseType: !682, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !954, file: !949, line: 160, baseType: !953, size: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !954, file: !949, line: 161, baseType: !959, size: 32, offset: 128)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !683, size: 32, elements: !960)
!960 = !{!961}
!961 = !DISubrange(count: 4)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !948, file: !949, line: 168, baseType: !682, size: 64, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !948, file: !949, line: 169, baseType: !682, size: 64, offset: 192)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !948, file: !949, line: 170, baseType: !682, size: 64, offset: 256)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !948, file: !949, line: 171, baseType: !749, size: 64, offset: 320)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !948, file: !949, line: 172, baseType: !680, size: 32, offset: 384)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !948, file: !949, line: 176, baseType: !968, size: 64, offset: 448)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!953, !684, !749}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !948, file: !949, line: 177, baseType: !972, size: 64, offset: 512)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{null, !684, !953}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !948, file: !949, line: 178, baseType: !684, size: 64, offset: 576)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !948, file: !949, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !948, file: !949, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !948, file: !949, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !889, file: !871, line: 177, baseType: !693, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !889, file: !871, line: 178, baseType: !981, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !343, line: 217, size: 832, elements: !983)
!983 = !{!984, !1229, !1230, !1231, !1287, !1291, !1292, !1293, !1311, !1312, !1313, !1314, !1315, !1316}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !982, file: !343, line: 219, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !343, line: 151, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !343, line: 151, size: 128, elements: !988)
!988 = !{!989}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !987, file: !343, line: 151, baseType: !990, size: 128)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !343, line: 150, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !343, line: 150, size: 128, elements: !992)
!992 = !{!993, !994, !995}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !991, file: !343, line: 150, baseType: !7, size: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !991, file: !343, line: 150, baseType: !7, size: 32, offset: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !991, file: !343, line: 150, baseType: !996, size: 64, offset: 64)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !997, size: 64, elements: !792)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !694, line: 108, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !343, line: 122, size: 512, elements: !1000)
!1000 = !{!1001, !1002, !1003, !1221, !1222, !1223, !1224, !1225, !1226, !1227}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !999, file: !343, line: 124, baseType: !981, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !999, file: !343, line: 125, baseType: !981, size: 64, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !999, file: !343, line: 131, baseType: !1004, size: 64, offset: 128)
!1004 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !343, line: 128, size: 64, elements: !1005)
!1005 = !{!1006, !1220}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1004, file: !343, line: 129, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !694, line: 66, baseType: !1008)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !588, line: 143, size: 192, elements: !1010)
!1010 = !{!1011, !1218, !1219}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1009, file: !588, line: 145, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !694, line: 69, baseType: !1013)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !588, line: 136, size: 192, elements: !1015)
!1015 = !{!1016, !1216, !1217}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1014, file: !588, line: 137, baseType: !1017, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !694, line: 58, baseType: !1018)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !588, line: 737, size: 768, elements: !1020)
!1020 = !{!1021, !1038, !1071, !1077, !1082, !1087, !1094, !1100, !1106, !1111, !1125, !1130, !1136, !1141, !1151, !1156, !1174, !1181, !1188, !1194, !1199, !1205, !1211}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1019, file: !588, line: 738, baseType: !1022, size: 256)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !588, line: 271, size: 256, elements: !1023)
!1023 = !{!1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1022, file: !588, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1022, file: !588, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1022, file: !588, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1022, file: !588, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1022, file: !588, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1022, file: !588, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1022, file: !588, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1022, file: !588, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1022, file: !588, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1022, file: !588, line: 312, baseType: !7, size: 32, offset: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1022, file: !588, line: 316, baseType: !818, size: 32, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1022, file: !588, line: 319, baseType: !7, size: 32, offset: 96)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1022, file: !588, line: 323, baseType: !981, size: 64, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1022, file: !588, line: 327, baseType: !693, size: 64, offset: 192)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1019, file: !588, line: 739, baseType: !1039, size: 448)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !588, line: 350, size: 448, elements: !1040)
!1040 = !{!1041, !1069}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1039, file: !588, line: 353, baseType: !1042, size: 384)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !588, line: 333, size: 384, elements: !1043)
!1043 = !{!1044, !1045, !1052}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1042, file: !588, line: 336, baseType: !1022, size: 256)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1042, file: !588, line: 343, baseType: !1046, size: 64, offset: 256)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !581, line: 37, size: 128, elements: !1048)
!1048 = !{!1049, !1050}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1047, file: !581, line: 39, baseType: !1046, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1047, file: !581, line: 40, baseType: !1051, size: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1042, file: !588, line: 344, baseType: !1053, size: 64, offset: 320)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !581, line: 45, size: 320, elements: !1055)
!1055 = !{!1056, !1057}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1054, file: !581, line: 47, baseType: !1053, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1054, file: !581, line: 48, baseType: !1058, size: 256, offset: 64)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !1059)
!1059 = !{!1060, !1062, !1063, !1068}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1058, file: !135, line: 1884, baseType: !1061, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1058, file: !135, line: 1885, baseType: !1061, size: 64, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1058, file: !135, line: 1891, baseType: !1064, size: 64, offset: 128)
!1064 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1058, file: !135, line: 1891, size: 64, elements: !1065)
!1065 = !{!1066, !1067}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1064, file: !135, line: 1891, baseType: !1017, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1064, file: !135, line: 1891, baseType: !693, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1058, file: !135, line: 1892, baseType: !1051, size: 64, offset: 192)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1039, file: !588, line: 359, baseType: !1070, size: 64, offset: 384)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !693, size: 64, elements: !792)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1019, file: !588, line: 740, baseType: !1072, size: 512)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !588, line: 365, size: 512, elements: !1073)
!1073 = !{!1074, !1075, !1076}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1072, file: !588, line: 368, baseType: !1042, size: 384)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1072, file: !588, line: 373, baseType: !693, size: 64, offset: 384)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1072, file: !588, line: 374, baseType: !693, size: 64, offset: 448)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1019, file: !588, line: 741, baseType: !1078, size: 576)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !588, line: 380, size: 576, elements: !1079)
!1079 = !{!1080, !1081}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1078, file: !588, line: 383, baseType: !1072, size: 512)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1078, file: !588, line: 389, baseType: !1070, size: 64, offset: 512)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1019, file: !588, line: 742, baseType: !1083, size: 320)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !588, line: 395, size: 320, elements: !1084)
!1084 = !{!1085, !1086}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1083, file: !588, line: 397, baseType: !1022, size: 256)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1083, file: !588, line: 400, baseType: !1007, size: 64, offset: 256)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1019, file: !588, line: 743, baseType: !1088, size: 448)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !588, line: 406, size: 448, elements: !1089)
!1089 = !{!1090, !1091, !1092, !1093}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1088, file: !588, line: 408, baseType: !1022, size: 256)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1088, file: !588, line: 412, baseType: !693, size: 64, offset: 256)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1088, file: !588, line: 420, baseType: !693, size: 64, offset: 320)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1088, file: !588, line: 423, baseType: !1007, size: 64, offset: 384)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1019, file: !588, line: 744, baseType: !1095, size: 384)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !588, line: 429, size: 384, elements: !1096)
!1096 = !{!1097, !1098, !1099}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1095, file: !588, line: 431, baseType: !1022, size: 256)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1095, file: !588, line: 434, baseType: !693, size: 64, offset: 256)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1095, file: !588, line: 437, baseType: !1007, size: 64, offset: 320)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1019, file: !588, line: 745, baseType: !1101, size: 384)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !588, line: 443, size: 384, elements: !1102)
!1102 = !{!1103, !1104, !1105}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1101, file: !588, line: 445, baseType: !1022, size: 256)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1101, file: !588, line: 449, baseType: !693, size: 64, offset: 256)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1101, file: !588, line: 453, baseType: !1007, size: 64, offset: 320)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1019, file: !588, line: 746, baseType: !1107, size: 320)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !588, line: 459, size: 320, elements: !1108)
!1108 = !{!1109, !1110}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1107, file: !588, line: 461, baseType: !1022, size: 256)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1107, file: !588, line: 464, baseType: !693, size: 64, offset: 256)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1019, file: !588, line: 747, baseType: !1112, size: 768)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !588, line: 469, size: 768, elements: !1113)
!1113 = !{!1114, !1115, !1116, !1117, !1118}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1112, file: !588, line: 471, baseType: !1022, size: 256)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1112, file: !588, line: 474, baseType: !7, size: 32, offset: 256)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1112, file: !588, line: 475, baseType: !7, size: 32, offset: 288)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1112, file: !588, line: 478, baseType: !693, size: 64, offset: 320)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1112, file: !588, line: 481, baseType: !1119, size: 384, offset: 384)
!1119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1120, size: 384, elements: !792)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !1121)
!1121 = !{!1122, !1123, !1124}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1120, file: !135, line: 1920, baseType: !1058, size: 256)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1120, file: !135, line: 1921, baseType: !693, size: 64, offset: 256)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1120, file: !135, line: 1922, baseType: !818, size: 32, offset: 320)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1019, file: !588, line: 748, baseType: !1126, size: 320)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !588, line: 487, size: 320, elements: !1127)
!1127 = !{!1128, !1129}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1126, file: !588, line: 490, baseType: !1022, size: 256)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1126, file: !588, line: 494, baseType: !680, size: 32, offset: 256)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1019, file: !588, line: 749, baseType: !1131, size: 384)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !588, line: 500, size: 384, elements: !1132)
!1132 = !{!1133, !1134, !1135}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1131, file: !588, line: 502, baseType: !1022, size: 256)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1131, file: !588, line: 506, baseType: !1007, size: 64, offset: 256)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1131, file: !588, line: 510, baseType: !1007, size: 64, offset: 320)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1019, file: !588, line: 750, baseType: !1137, size: 320)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !588, line: 529, size: 320, elements: !1138)
!1138 = !{!1139, !1140}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1137, file: !588, line: 531, baseType: !1022, size: 256)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1137, file: !588, line: 540, baseType: !1007, size: 64, offset: 256)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1019, file: !588, line: 751, baseType: !1142, size: 704)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !588, line: 546, size: 704, elements: !1143)
!1143 = !{!1144, !1145, !1146, !1147, !1148, !1149, !1150}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1142, file: !588, line: 549, baseType: !1072, size: 512)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1142, file: !588, line: 553, baseType: !685, size: 64, offset: 512)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1142, file: !588, line: 557, baseType: !679, size: 8, offset: 576)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1142, file: !588, line: 558, baseType: !679, size: 8, offset: 584)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1142, file: !588, line: 559, baseType: !679, size: 8, offset: 592)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1142, file: !588, line: 560, baseType: !679, size: 8, offset: 600)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1142, file: !588, line: 566, baseType: !1070, size: 64, offset: 640)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1019, file: !588, line: 752, baseType: !1152, size: 384)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !588, line: 571, size: 384, elements: !1153)
!1153 = !{!1154, !1155}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1152, file: !588, line: 573, baseType: !1083, size: 320)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1152, file: !588, line: 577, baseType: !693, size: 64, offset: 320)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1019, file: !588, line: 753, baseType: !1157, size: 576)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !588, line: 600, size: 576, elements: !1158)
!1158 = !{!1159, !1160, !1161, !1164, !1173}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1157, file: !588, line: 602, baseType: !1083, size: 320)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1157, file: !588, line: 605, baseType: !693, size: 64, offset: 320)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1157, file: !588, line: 609, baseType: !1162, size: 64, offset: 384)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1163, line: 46, baseType: !747)
!1163 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1157, file: !588, line: 612, baseType: !1165, size: 64, offset: 448)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !588, line: 581, size: 320, elements: !1167)
!1167 = !{!1168, !1169, !1170, !1171, !1172}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1166, file: !588, line: 583, baseType: !134, size: 32)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1166, file: !588, line: 586, baseType: !693, size: 64, offset: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1166, file: !588, line: 589, baseType: !693, size: 64, offset: 128)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1166, file: !588, line: 592, baseType: !693, size: 64, offset: 192)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1166, file: !588, line: 595, baseType: !693, size: 64, offset: 256)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1157, file: !588, line: 616, baseType: !1007, size: 64, offset: 512)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1019, file: !588, line: 754, baseType: !1175, size: 512)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !588, line: 622, size: 512, elements: !1176)
!1176 = !{!1177, !1178, !1179, !1180}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1175, file: !588, line: 624, baseType: !1083, size: 320)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1175, file: !588, line: 628, baseType: !693, size: 64, offset: 320)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1175, file: !588, line: 632, baseType: !693, size: 64, offset: 384)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1175, file: !588, line: 636, baseType: !693, size: 64, offset: 448)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1019, file: !588, line: 755, baseType: !1182, size: 704)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !588, line: 642, size: 704, elements: !1183)
!1183 = !{!1184, !1185, !1186, !1187}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1182, file: !588, line: 644, baseType: !1175, size: 512)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1182, file: !588, line: 648, baseType: !693, size: 64, offset: 512)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1182, file: !588, line: 652, baseType: !693, size: 64, offset: 576)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1182, file: !588, line: 653, baseType: !693, size: 64, offset: 640)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1019, file: !588, line: 756, baseType: !1189, size: 448)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !588, line: 663, size: 448, elements: !1190)
!1190 = !{!1191, !1192, !1193}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1189, file: !588, line: 665, baseType: !1083, size: 320)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1189, file: !588, line: 668, baseType: !693, size: 64, offset: 320)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1189, file: !588, line: 673, baseType: !693, size: 64, offset: 384)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1019, file: !588, line: 757, baseType: !1195, size: 384)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !588, line: 694, size: 384, elements: !1196)
!1196 = !{!1197, !1198}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1195, file: !588, line: 696, baseType: !1083, size: 320)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1195, file: !588, line: 699, baseType: !693, size: 64, offset: 320)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1019, file: !588, line: 758, baseType: !1200, size: 384)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !588, line: 681, size: 384, elements: !1201)
!1201 = !{!1202, !1203, !1204}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1200, file: !588, line: 683, baseType: !1022, size: 256)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1200, file: !588, line: 686, baseType: !693, size: 64, offset: 256)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1200, file: !588, line: 689, baseType: !693, size: 64, offset: 320)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1019, file: !588, line: 759, baseType: !1206, size: 384)
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !588, line: 707, size: 384, elements: !1207)
!1207 = !{!1208, !1209, !1210}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1206, file: !588, line: 709, baseType: !1022, size: 256)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1206, file: !588, line: 712, baseType: !693, size: 64, offset: 256)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1206, file: !588, line: 712, baseType: !693, size: 64, offset: 320)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1019, file: !588, line: 760, baseType: !1212, size: 320)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !588, line: 718, size: 320, elements: !1213)
!1213 = !{!1214, !1215}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1212, file: !588, line: 720, baseType: !1022, size: 256)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1212, file: !588, line: 723, baseType: !693, size: 64, offset: 256)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1014, file: !588, line: 138, baseType: !1013, size: 64, offset: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1014, file: !588, line: 139, baseType: !1013, size: 64, offset: 128)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1009, file: !588, line: 146, baseType: !1012, size: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1009, file: !588, line: 152, baseType: !1007, size: 64, offset: 128)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1004, file: !343, line: 130, baseType: !868, size: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !999, file: !343, line: 134, baseType: !684, size: 64, offset: 192)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !999, file: !343, line: 137, baseType: !693, size: 64, offset: 256)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !999, file: !343, line: 138, baseType: !818, size: 32, offset: 320)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !999, file: !343, line: 142, baseType: !7, size: 32, offset: 352)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !999, file: !343, line: 144, baseType: !680, size: 32, offset: 384)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !999, file: !343, line: 145, baseType: !680, size: 32, offset: 416)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !999, file: !343, line: 146, baseType: !1228, size: 64, offset: 448)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !343, line: 119, baseType: !749)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !982, file: !343, line: 220, baseType: !985, size: 64, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !982, file: !343, line: 223, baseType: !684, size: 64, offset: 128)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !982, file: !343, line: 226, baseType: !1232, size: 64, offset: 192)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 100, size: 1216, elements: !1234)
!1234 = !{!1235, !1236, !1237, !1238, !1239, !1244, !1245, !1246, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1277, !1285, !1286}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1233, file: !330, line: 102, baseType: !680, size: 32)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1233, file: !330, line: 105, baseType: !7, size: 32, offset: 32)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1233, file: !330, line: 108, baseType: !981, size: 64, offset: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1233, file: !330, line: 111, baseType: !981, size: 64, offset: 128)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1233, file: !330, line: 114, baseType: !1240, size: 64, offset: 192)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !330, line: 41, size: 64, elements: !1241)
!1241 = !{!1242, !1243}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1240, file: !330, line: 42, baseType: !329, size: 32)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1240, file: !330, line: 43, baseType: !7, size: 32, offset: 32)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1233, file: !330, line: 117, baseType: !7, size: 32, offset: 256)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1233, file: !330, line: 120, baseType: !7, size: 32, offset: 288)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1233, file: !330, line: 123, baseType: !1247, size: 64, offset: 320)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !330, line: 87, baseType: !1249)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !330, line: 87, size: 128, elements: !1250)
!1250 = !{!1251}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1249, file: !330, line: 87, baseType: !1252, size: 128)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !330, line: 85, baseType: !1253)
!1253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !330, line: 85, size: 128, elements: !1254)
!1254 = !{!1255, !1256, !1257}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1253, file: !330, line: 85, baseType: !7, size: 32)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1253, file: !330, line: 85, baseType: !7, size: 32, offset: 32)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1253, file: !330, line: 85, baseType: !1258, size: 64, offset: 64)
!1258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1259, size: 64, elements: !792)
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !330, line: 84, baseType: !1232)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1233, file: !330, line: 126, baseType: !1232, size: 64, offset: 384)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1233, file: !330, line: 129, baseType: !1232, size: 64, offset: 448)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1233, file: !330, line: 132, baseType: !684, size: 64, offset: 512)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1233, file: !330, line: 139, baseType: !693, size: 64, offset: 576)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1233, file: !330, line: 143, baseType: !742, size: 128, offset: 640)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1233, file: !330, line: 146, baseType: !742, size: 128, offset: 768)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1233, file: !330, line: 148, baseType: !679, size: 8, offset: 896)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1233, file: !330, line: 149, baseType: !679, size: 8, offset: 904)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1233, file: !330, line: 153, baseType: !338, size: 32, offset: 928)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1233, file: !330, line: 156, baseType: !1270, size: 64, offset: 960)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !330, line: 48, size: 320, elements: !1272)
!1272 = !{!1273, !1274, !1275, !1276}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1271, file: !330, line: 50, baseType: !1017, size: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1271, file: !330, line: 59, baseType: !742, size: 128, offset: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1271, file: !330, line: 64, baseType: !679, size: 8, offset: 192)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1271, file: !330, line: 67, baseType: !1270, size: 64, offset: 256)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1233, file: !330, line: 159, baseType: !1278, size: 64, offset: 1024)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !330, line: 72, size: 256, elements: !1280)
!1280 = !{!1281, !1282, !1283, !1284}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1279, file: !330, line: 74, baseType: !998, size: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1279, file: !330, line: 77, baseType: !1278, size: 64, offset: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1279, file: !330, line: 78, baseType: !1278, size: 64, offset: 128)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1279, file: !330, line: 81, baseType: !1278, size: 64, offset: 192)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1233, file: !330, line: 162, baseType: !679, size: 8, offset: 1088)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1233, file: !330, line: 166, baseType: !693, size: 64, offset: 1152)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !982, file: !343, line: 229, baseType: !1288, size: 128, offset: 256)
!1288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1289, size: 128, elements: !936)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1290 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !343, line: 229, flags: DIFlagFwdDecl)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !982, file: !343, line: 232, baseType: !981, size: 64, offset: 384)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !982, file: !343, line: 233, baseType: !981, size: 64, offset: 448)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !982, file: !343, line: 238, baseType: !1294, size: 64, offset: 512)
!1294 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !343, line: 235, size: 64, elements: !1295)
!1295 = !{!1296, !1302}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1294, file: !343, line: 236, baseType: !1297, size: 64)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64)
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !343, line: 273, size: 128, elements: !1299)
!1299 = !{!1300, !1301}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1298, file: !343, line: 275, baseType: !1007, size: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1298, file: !343, line: 278, baseType: !1007, size: 64, offset: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1294, file: !343, line: 237, baseType: !1303, size: 64)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !343, line: 259, size: 320, elements: !1305)
!1305 = !{!1306, !1307, !1308, !1309, !1310}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1304, file: !343, line: 261, baseType: !868, size: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1304, file: !343, line: 262, baseType: !868, size: 64, offset: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1304, file: !343, line: 266, baseType: !868, size: 64, offset: 128)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1304, file: !343, line: 267, baseType: !868, size: 64, offset: 192)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1304, file: !343, line: 270, baseType: !680, size: 32, offset: 256)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !982, file: !343, line: 241, baseType: !1228, size: 64, offset: 576)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !982, file: !343, line: 244, baseType: !680, size: 32, offset: 640)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !982, file: !343, line: 247, baseType: !680, size: 32, offset: 672)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !982, file: !343, line: 250, baseType: !680, size: 32, offset: 704)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !982, file: !343, line: 253, baseType: !680, size: 32, offset: 736)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !982, file: !343, line: 256, baseType: !680, size: 32, offset: 768)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !889, file: !871, line: 179, baseType: !1318, size: 64)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64)
!1319 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !871, line: 150, baseType: !1320)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !871, line: 142, size: 320, elements: !1321)
!1321 = !{!1322, !1323, !1324, !1325, !1328, !1329}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1320, file: !871, line: 144, baseType: !693, size: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1320, file: !871, line: 145, baseType: !868, size: 64, offset: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1320, file: !871, line: 146, baseType: !868, size: 64, offset: 128)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1320, file: !871, line: 147, baseType: !1326, size: 32, offset: 192)
!1326 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1327, line: 31, baseType: !680)
!1327 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1320, file: !871, line: 148, baseType: !7, size: 32, offset: 224)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1320, file: !871, line: 149, baseType: !679, size: 8, offset: 256)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !889, file: !871, line: 180, baseType: !1331, size: 64)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64)
!1332 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !871, line: 162, baseType: !1333)
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !871, line: 159, size: 128, elements: !1334)
!1334 = !{!1335, !1336}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1333, file: !871, line: 160, baseType: !693, size: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1333, file: !871, line: 161, baseType: !749, size: 64, offset: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !889, file: !871, line: 181, baseType: !1338, size: 64)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64)
!1339 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !871, line: 181, flags: DIFlagFwdDecl)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !884, file: !871, line: 317, baseType: !1341, size: 64)
!1341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !749, size: 64, elements: !792)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !884, file: !871, line: 318, baseType: !1343, size: 320)
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !871, line: 188, size: 320, elements: !1344)
!1344 = !{!1345, !1347, !1370}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1343, file: !871, line: 190, baseType: !1346, size: 192)
!1346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 192, elements: !767)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1343, file: !871, line: 193, baseType: !1348, size: 64, offset: 192)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64)
!1349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !871, line: 206, size: 320, elements: !1350)
!1350 = !{!1351, !1355, !1356, !1357, !1369}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1349, file: !871, line: 208, baseType: !1352, size: 64)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64)
!1353 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !694, line: 62, baseType: !1354)
!1354 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !694, line: 61, flags: DIFlagFwdDecl)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1349, file: !871, line: 211, baseType: !7, size: 32, offset: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1349, file: !871, line: 214, baseType: !749, size: 64, offset: 128)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1349, file: !871, line: 224, baseType: !1358, size: 64, offset: 192)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64)
!1359 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !871, line: 202, baseType: !1360)
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !871, line: 202, size: 128, elements: !1361)
!1361 = !{!1362}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1360, file: !871, line: 202, baseType: !1363, size: 128)
!1363 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !871, line: 200, baseType: !1364)
!1364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !871, line: 200, size: 128, elements: !1365)
!1365 = !{!1366, !1367, !1368}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1364, file: !871, line: 200, baseType: !7, size: 32)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1364, file: !871, line: 200, baseType: !7, size: 32, offset: 32)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1364, file: !871, line: 200, baseType: !902, size: 64, offset: 64)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1349, file: !871, line: 234, baseType: !1358, size: 64, offset: 256)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1343, file: !871, line: 197, baseType: !749, size: 64, offset: 256)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !884, file: !871, line: 319, baseType: !756, size: 256)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !884, file: !871, line: 320, baseType: !775, size: 192)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !696, file: !135, line: 3384, baseType: !1374, size: 1472)
!1374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1375)
!1375 = !{!1376, !1397, !1398, !1399, !1400}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1374, file: !135, line: 3115, baseType: !1377, size: 1216)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1378)
!1378 = !{!1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1377, file: !135, line: 2985, baseType: !864, size: 960)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1377, file: !135, line: 2986, baseType: !693, size: 64, offset: 960)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1377, file: !135, line: 2987, baseType: !693, size: 64, offset: 1024)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1377, file: !135, line: 2988, baseType: !693, size: 64, offset: 1088)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1377, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1377, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1377, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1377, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1377, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1377, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1377, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1377, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1377, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1377, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1377, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1377, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1377, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1377, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1374, file: !135, line: 3117, baseType: !693, size: 64, offset: 1216)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1374, file: !135, line: 3119, baseType: !693, size: 64, offset: 1280)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1374, file: !135, line: 3121, baseType: !693, size: 64, offset: 1344)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1374, file: !135, line: 3123, baseType: !693, size: 64, offset: 1408)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !696, file: !135, line: 3385, baseType: !1402, size: 1088)
!1402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1403)
!1403 = !{!1404, !1405, !1406}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1402, file: !135, line: 2875, baseType: !864, size: 960)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1402, file: !135, line: 2876, baseType: !868, size: 64, offset: 960)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1402, file: !135, line: 2877, baseType: !1407, size: 64, offset: 1024)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64)
!1408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !664, line: 172, size: 128, elements: !1409)
!1409 = !{!1410, !1411, !1412, !1413, !1414, !1415, !1416}
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1408, file: !664, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1408, file: !664, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1408, file: !664, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1408, file: !664, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1408, file: !664, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1408, file: !664, line: 195, baseType: !7, size: 32, offset: 32)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1408, file: !664, line: 199, baseType: !693, size: 64, offset: 64)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !696, file: !135, line: 3386, baseType: !1377, size: 1216)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !696, file: !135, line: 3387, baseType: !1419, size: 1280)
!1419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1420)
!1420 = !{!1421, !1422}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1419, file: !135, line: 3094, baseType: !1377, size: 1216)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1419, file: !135, line: 3095, baseType: !1407, size: 64, offset: 1216)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !696, file: !135, line: 3388, baseType: !1424, size: 1216)
!1424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1425)
!1425 = !{!1426, !1427, !1428, !1429, !1430, !1431}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1424, file: !135, line: 2825, baseType: !826, size: 896)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1424, file: !135, line: 2827, baseType: !693, size: 64, offset: 896)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1424, file: !135, line: 2828, baseType: !693, size: 64, offset: 960)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1424, file: !135, line: 2829, baseType: !693, size: 64, offset: 1024)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1424, file: !135, line: 2830, baseType: !693, size: 64, offset: 1088)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1424, file: !135, line: 2831, baseType: !693, size: 64, offset: 1152)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !696, file: !135, line: 3389, baseType: !1433, size: 1024)
!1433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1434)
!1434 = !{!1435, !1436, !1437}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1433, file: !135, line: 2851, baseType: !864, size: 960)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1433, file: !135, line: 2852, baseType: !680, size: 32, offset: 960)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1433, file: !135, line: 2853, baseType: !680, size: 32, offset: 992)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !696, file: !135, line: 3390, baseType: !1439, size: 1024)
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !1440)
!1440 = !{!1441, !1442}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1439, file: !135, line: 2858, baseType: !864, size: 960)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1439, file: !135, line: 2859, baseType: !1407, size: 64, offset: 960)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !696, file: !135, line: 3391, baseType: !1444, size: 960)
!1444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !1445)
!1445 = !{!1446}
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1444, file: !135, line: 2863, baseType: !864, size: 960)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !696, file: !135, line: 3392, baseType: !1448, size: 1472)
!1448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !1449)
!1449 = !{!1450}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1448, file: !135, line: 3305, baseType: !1374, size: 1472)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !696, file: !135, line: 3393, baseType: !1452, size: 1792)
!1452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !1453)
