; ModuleID = 'tree-ssa-loop-im.bc'
source_filename = "tree-ssa-loop-im.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!427 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!428 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!429 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!430 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!431 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!432 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!433 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!434 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!435 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !397, line: 727, baseType: !7, size: 32, elements: !436)
!436 = !{!437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460}
!437 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!438 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!439 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!440 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!441 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!442 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!443 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!444 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!445 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!446 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!447 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!448 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!449 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!450 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!451 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!452 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!453 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!454 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!455 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!456 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!457 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!458 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!459 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!460 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!461 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !397, line: 80, baseType: !7, size: 32, elements: !462)
!462 = !{!463, !464, !465, !466}
!463 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!464 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!465 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!466 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!467 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ssa_op_iter_type", file: !468, line: 119, baseType: !7, size: 32, elements: !469)
!468 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!469 = !{!470, !471, !472, !473}
!470 = !DIEnumerator(name: "ssa_op_iter_none", value: 0, isUnsigned: true)
!471 = !DIEnumerator(name: "ssa_op_iter_tree", value: 1, isUnsigned: true)
!472 = !DIEnumerator(name: "ssa_op_iter_use", value: 2, isUnsigned: true)
!473 = !DIEnumerator(name: "ssa_op_iter_def", value: 3, isUnsigned: true)
!474 = !{!475, !476, !477, !478, !481, !482, !134, !484, !809, !1867, !842, !479, !7, !538, !1869, !1918, !1921, !1409, !1890, !1907, !1922, !1934, !1946, !1953, !1955, !1956, !461, !1957, !1908, !1878, !1891, !1895, !1969, !1050, !1023, !1982, !611, !1995, !1990, !788, !1998, !1325}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!477 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !485, line: 56, baseType: !486)
!485 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !488)
!488 = !{!489, !522, !528, !541, !560, !571, !576, !585, !591, !604, !616, !654, !1198, !1226, !1242, !1243, !1248, !1257, !1263, !1268, !1272, !1276, !1518, !1565, !1571, !1577, !1584, !1597, !1611, !1628, !1640, !1662, !1677, !1849}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !487, file: !135, line: 3372, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !491)
!491 = !{!492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !490, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !490, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !490, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !490, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !490, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !490, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !490, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !490, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !490, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !490, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !490, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !490, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !490, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !490, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !490, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !490, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !490, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !490, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !490, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !490, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !490, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !490, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !490, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !490, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !490, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !490, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !490, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !490, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !490, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !490, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !487, file: !135, line: 3373, baseType: !523, size: 192)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !524)
!524 = !{!525, !526, !527}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !523, file: !135, line: 403, baseType: !490, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !523, file: !135, line: 404, baseType: !484, size: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !523, file: !135, line: 405, baseType: !484, size: 64, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !487, file: !135, line: 3374, baseType: !529, size: 320)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !530)
!530 = !{!531, !532}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !529, file: !135, line: 1385, baseType: !523, size: 192)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !529, file: !135, line: 1386, baseType: !533, size: 128, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !534, line: 58, baseType: !535)
!534 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !534, line: 54, size: 128, elements: !536)
!536 = !{!537, !539}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !535, file: !534, line: 56, baseType: !538, size: 64)
!538 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !535, file: !534, line: 57, baseType: !540, size: 64, offset: 64)
!540 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !487, file: !135, line: 3375, baseType: !542, size: 256)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !543)
!543 = !{!544, !545}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !542, file: !135, line: 1398, baseType: !523, size: 192)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !542, file: !135, line: 1399, baseType: !546, size: 64, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !548, line: 52, size: 256, elements: !549)
!548 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!549 = !{!550, !551, !552, !553, !554, !555, !556}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !547, file: !548, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !547, file: !548, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !547, file: !548, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !547, file: !548, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !547, file: !548, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !547, file: !548, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !547, file: !548, line: 62, baseType: !557, size: 192, offset: 64)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 192, elements: !558)
!558 = !{!559}
!559 = !DISubrange(count: 3)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !487, file: !135, line: 3376, baseType: !561, size: 256)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !562)
!562 = !{!563, !564}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !561, file: !135, line: 1409, baseType: !523, size: 192)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !561, file: !135, line: 1410, baseType: !565, size: 64, offset: 192)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !567, line: 27, size: 192, elements: !568)
!567 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!568 = !{!569, !570}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !566, file: !567, line: 29, baseType: !533, size: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !566, file: !567, line: 30, baseType: !5, size: 32, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !487, file: !135, line: 3377, baseType: !572, size: 256)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !573)
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !572, file: !135, line: 1438, baseType: !523, size: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !572, file: !135, line: 1439, baseType: !484, size: 64, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !487, file: !135, line: 3378, baseType: !577, size: 256)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !578)
!578 = !{!579, !580, !581}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !577, file: !135, line: 1419, baseType: !523, size: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !577, file: !135, line: 1420, baseType: !477, size: 32, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !577, file: !135, line: 1421, baseType: !582, size: 8, offset: 224)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 8, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 1)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !487, file: !135, line: 3379, baseType: !586, size: 320)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !587)
!587 = !{!588, !589, !590}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !586, file: !135, line: 1429, baseType: !523, size: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !586, file: !135, line: 1430, baseType: !484, size: 64, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !586, file: !135, line: 1431, baseType: !484, size: 64, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !487, file: !135, line: 3380, baseType: !592, size: 320)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !593)
!593 = !{!594, !595}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !592, file: !135, line: 1461, baseType: !523, size: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !592, file: !135, line: 1462, baseType: !596, size: 128, offset: 192)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !597, line: 31, size: 128, elements: !598)
!597 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!598 = !{!599, !602, !603}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !596, file: !597, line: 32, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !476)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !596, file: !597, line: 33, baseType: !7, size: 32, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !596, file: !597, line: 34, baseType: !7, size: 32, offset: 96)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !487, file: !135, line: 3381, baseType: !605, size: 384)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !606)
!606 = !{!607, !608, !613, !614, !615}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !605, file: !135, line: 2508, baseType: !523, size: 192)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !605, file: !135, line: 2509, baseType: !609, size: 32, offset: 192)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !610, line: 58, baseType: !611)
!610 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !612, line: 44, baseType: !7)
!612 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!613 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !605, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !605, file: !135, line: 2511, baseType: !484, size: 64, offset: 256)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !605, file: !135, line: 2512, baseType: !484, size: 64, offset: 320)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !487, file: !135, line: 3382, baseType: !617, size: 896)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !618)
!618 = !{!619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !617, file: !135, line: 2653, baseType: !605, size: 384)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !617, file: !135, line: 2654, baseType: !484, size: 64, offset: 384)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !617, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !617, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !617, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !617, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !617, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !617, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !617, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !617, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !617, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !617, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !617, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !617, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !617, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !617, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !617, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !617, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !617, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !617, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !617, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !617, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !617, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !617, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !617, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !617, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !617, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !617, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !617, file: !135, line: 2705, baseType: !484, size: 64, offset: 576)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !617, file: !135, line: 2706, baseType: !484, size: 64, offset: 640)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !617, file: !135, line: 2707, baseType: !484, size: 64, offset: 704)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !617, file: !135, line: 2708, baseType: !484, size: 64, offset: 768)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !617, file: !135, line: 2711, baseType: !652, size: 64, offset: 832)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !487, file: !135, line: 3383, baseType: !655, size: 960)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !656)
!656 = !{!657, !658}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !655, file: !135, line: 2757, baseType: !617, size: 896)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !655, file: !135, line: 2758, baseType: !659, size: 64, offset: 896)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !485, line: 50, baseType: !660)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !662, line: 240, size: 384, elements: !663)
!662 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!663 = !{!664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !661, file: !662, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !661, file: !662, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !661, file: !662, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !661, file: !662, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !661, file: !662, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !661, file: !662, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !661, file: !662, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !661, file: !662, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !661, file: !662, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !661, file: !662, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !661, file: !662, line: 321, baseType: !675, size: 320, offset: 64)
!675 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !662, line: 315, size: 320, elements: !676)
!676 = !{!677, !1131, !1133, !1196, !1197}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !675, file: !662, line: 316, baseType: !678, size: 64)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !679, size: 64, elements: !583)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !662, line: 183, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !662, line: 166, size: 64, elements: !681)
!681 = !{!682, !683, !684, !685, !686, !694, !695, !707, !710, !770, !771, !1108, !1121, !1128}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !680, file: !662, line: 168, baseType: !477, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !680, file: !662, line: 169, baseType: !7, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !680, file: !662, line: 170, baseType: !482, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !680, file: !662, line: 171, baseType: !659, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !680, file: !662, line: 172, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !485, line: 53, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !662, line: 359, size: 128, elements: !690)
!690 = !{!691, !692}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !689, file: !662, line: 360, baseType: !477, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !689, file: !662, line: 361, baseType: !693, size: 64, offset: 64)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !659, size: 64, elements: !583)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !680, file: !662, line: 173, baseType: !5, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !680, file: !662, line: 174, baseType: !696, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !662, line: 133, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !662, line: 115, size: 32, elements: !698)
!698 = !{!699, !700, !701, !702, !703, !704, !705, !706}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !697, file: !662, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !697, file: !662, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !697, file: !662, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !697, file: !662, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !697, file: !662, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !697, file: !662, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !697, file: !662, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !697, file: !662, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !680, file: !662, line: 175, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !662, line: 175, flags: DIFlagFwdDecl)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !680, file: !662, line: 176, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !713, line: 75, size: 256, elements: !714)
!713 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!714 = !{!715, !729, !730, !731}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !712, file: !713, line: 76, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !713, line: 68, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !713, line: 63, size: 320, elements: !719)
!719 = !{!720, !722, !723, !724}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !718, file: !713, line: 64, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !718, file: !713, line: 65, baseType: !721, size: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !718, file: !713, line: 66, baseType: !7, size: 32, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !718, file: !713, line: 67, baseType: !725, size: 128, offset: 192)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !726, size: 128, elements: !727)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !713, line: 29, baseType: !538)
!727 = !{!728}
!728 = !DISubrange(count: 2)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !712, file: !713, line: 77, baseType: !716, size: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !712, file: !713, line: 78, baseType: !7, size: 32, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !712, file: !713, line: 79, baseType: !732, size: 64, offset: 192)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !713, line: 49, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !713, line: 45, size: 832, elements: !735)
!735 = !{!736, !737, !738}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !734, file: !713, line: 46, baseType: !721, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !734, file: !713, line: 47, baseType: !711, size: 64, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !734, file: !713, line: 48, baseType: !739, size: 704, offset: 128)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !740, line: 164, size: 704, elements: !741)
!740 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!741 = !{!742, !743, !753, !754, !755, !756, !757, !758, !762, !766, !767, !768, !769}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !739, file: !740, line: 166, baseType: !540, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !739, file: !740, line: 167, baseType: !744, size: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !740, line: 157, size: 192, elements: !746)
!746 = !{!747, !748, !749}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !745, file: !740, line: 159, baseType: !479, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !745, file: !740, line: 160, baseType: !744, size: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !745, file: !740, line: 161, baseType: !750, size: 32, offset: 128)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 32, elements: !751)
!751 = !{!752}
!752 = !DISubrange(count: 4)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !739, file: !740, line: 168, baseType: !479, size: 64, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !739, file: !740, line: 169, baseType: !479, size: 64, offset: 192)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !739, file: !740, line: 170, baseType: !479, size: 64, offset: 256)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !739, file: !740, line: 171, baseType: !540, size: 64, offset: 320)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !739, file: !740, line: 172, baseType: !477, size: 32, offset: 384)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !739, file: !740, line: 176, baseType: !759, size: 64, offset: 448)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{!744, !481, !540}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !739, file: !740, line: 177, baseType: !763, size: 64, offset: 512)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{null, !481, !744}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !739, file: !740, line: 178, baseType: !481, size: 64, offset: 576)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !739, file: !740, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !739, file: !740, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !739, file: !740, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !680, file: !662, line: 177, baseType: !484, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !680, file: !662, line: 178, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !343, line: 217, size: 832, elements: !774)
!774 = !{!775, !1020, !1021, !1022, !1078, !1082, !1083, !1084, !1102, !1103, !1104, !1105, !1106, !1107}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !773, file: !343, line: 219, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !343, line: 151, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !343, line: 151, size: 128, elements: !779)
!779 = !{!780}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !778, file: !343, line: 151, baseType: !781, size: 128)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !343, line: 150, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !343, line: 150, size: 128, elements: !783)
!783 = !{!784, !785, !786}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !782, file: !343, line: 150, baseType: !7, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !782, file: !343, line: 150, baseType: !7, size: 32, offset: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !782, file: !343, line: 150, baseType: !787, size: 64, offset: 64)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !788, size: 64, elements: !583)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !485, line: 108, baseType: !789)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !343, line: 122, size: 512, elements: !791)
!791 = !{!792, !793, !794, !1012, !1013, !1014, !1015, !1016, !1017, !1018}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !790, file: !343, line: 124, baseType: !772, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !790, file: !343, line: 125, baseType: !772, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !790, file: !343, line: 131, baseType: !795, size: 64, offset: 128)
!795 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !343, line: 128, size: 64, elements: !796)
!796 = !{!797, !1011}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !795, file: !343, line: 129, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !485, line: 66, baseType: !799)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !397, line: 143, size: 192, elements: !801)
!801 = !{!802, !1009, !1010}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !800, file: !397, line: 145, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !485, line: 69, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !397, line: 136, size: 192, elements: !806)
!806 = !{!807, !1007, !1008}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !805, file: !397, line: 137, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !485, line: 58, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !397, line: 737, size: 768, elements: !811)
!811 = !{!812, !829, !862, !868, !873, !878, !885, !891, !897, !902, !916, !921, !927, !932, !942, !947, !965, !972, !979, !985, !990, !996, !1002}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !810, file: !397, line: 738, baseType: !813, size: 256)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !397, line: 271, size: 256, elements: !814)
!814 = !{!815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !813, file: !397, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !813, file: !397, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !813, file: !397, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !813, file: !397, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !813, file: !397, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !813, file: !397, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !813, file: !397, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !813, file: !397, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !813, file: !397, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !813, file: !397, line: 312, baseType: !7, size: 32, offset: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !813, file: !397, line: 316, baseType: !609, size: 32, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !813, file: !397, line: 319, baseType: !7, size: 32, offset: 96)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !813, file: !397, line: 323, baseType: !772, size: 64, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !813, file: !397, line: 327, baseType: !484, size: 64, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !810, file: !397, line: 739, baseType: !830, size: 448)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !397, line: 350, size: 448, elements: !831)
!831 = !{!832, !860}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !830, file: !397, line: 353, baseType: !833, size: 384)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !397, line: 333, size: 384, elements: !834)
!834 = !{!835, !836, !843}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !833, file: !397, line: 336, baseType: !813, size: 256)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !833, file: !397, line: 343, baseType: !837, size: 64, offset: 256)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !468, line: 37, size: 128, elements: !839)
!839 = !{!840, !841}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !838, file: !468, line: 39, baseType: !837, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !838, file: !468, line: 40, baseType: !842, size: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !833, file: !397, line: 344, baseType: !844, size: 64, offset: 320)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !468, line: 45, size: 320, elements: !846)
!846 = !{!847, !848}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !845, file: !468, line: 47, baseType: !844, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !845, file: !468, line: 48, baseType: !849, size: 256, offset: 64)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !850)
!850 = !{!851, !853, !854, !859}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !849, file: !135, line: 1884, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !849, file: !135, line: 1885, baseType: !852, size: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !849, file: !135, line: 1891, baseType: !855, size: 64, offset: 128)
!855 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !849, file: !135, line: 1891, size: 64, elements: !856)
!856 = !{!857, !858}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !855, file: !135, line: 1891, baseType: !808, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !855, file: !135, line: 1891, baseType: !484, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !849, file: !135, line: 1892, baseType: !842, size: 64, offset: 192)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !830, file: !397, line: 359, baseType: !861, size: 64, offset: 384)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 64, elements: !583)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !810, file: !397, line: 740, baseType: !863, size: 512)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !397, line: 365, size: 512, elements: !864)
!864 = !{!865, !866, !867}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !863, file: !397, line: 368, baseType: !833, size: 384)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !863, file: !397, line: 373, baseType: !484, size: 64, offset: 384)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !863, file: !397, line: 374, baseType: !484, size: 64, offset: 448)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !810, file: !397, line: 741, baseType: !869, size: 576)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !397, line: 380, size: 576, elements: !870)
!870 = !{!871, !872}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !869, file: !397, line: 383, baseType: !863, size: 512)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !869, file: !397, line: 389, baseType: !861, size: 64, offset: 512)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !810, file: !397, line: 742, baseType: !874, size: 320)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !397, line: 395, size: 320, elements: !875)
!875 = !{!876, !877}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !874, file: !397, line: 397, baseType: !813, size: 256)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !874, file: !397, line: 400, baseType: !798, size: 64, offset: 256)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !810, file: !397, line: 743, baseType: !879, size: 448)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !397, line: 406, size: 448, elements: !880)
!880 = !{!881, !882, !883, !884}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !879, file: !397, line: 408, baseType: !813, size: 256)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !879, file: !397, line: 412, baseType: !484, size: 64, offset: 256)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !879, file: !397, line: 420, baseType: !484, size: 64, offset: 320)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !879, file: !397, line: 423, baseType: !798, size: 64, offset: 384)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !810, file: !397, line: 744, baseType: !886, size: 384)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !397, line: 429, size: 384, elements: !887)
!887 = !{!888, !889, !890}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !886, file: !397, line: 431, baseType: !813, size: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !886, file: !397, line: 434, baseType: !484, size: 64, offset: 256)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !886, file: !397, line: 437, baseType: !798, size: 64, offset: 320)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !810, file: !397, line: 745, baseType: !892, size: 384)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !397, line: 443, size: 384, elements: !893)
!893 = !{!894, !895, !896}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !892, file: !397, line: 445, baseType: !813, size: 256)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !892, file: !397, line: 449, baseType: !484, size: 64, offset: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !892, file: !397, line: 453, baseType: !798, size: 64, offset: 320)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !810, file: !397, line: 746, baseType: !898, size: 320)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !397, line: 459, size: 320, elements: !899)
!899 = !{!900, !901}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !898, file: !397, line: 461, baseType: !813, size: 256)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !898, file: !397, line: 464, baseType: !484, size: 64, offset: 256)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !810, file: !397, line: 747, baseType: !903, size: 768)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !397, line: 469, size: 768, elements: !904)
!904 = !{!905, !906, !907, !908, !909}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !903, file: !397, line: 471, baseType: !813, size: 256)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !903, file: !397, line: 474, baseType: !7, size: 32, offset: 256)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !903, file: !397, line: 475, baseType: !7, size: 32, offset: 288)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !903, file: !397, line: 478, baseType: !484, size: 64, offset: 320)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !903, file: !397, line: 481, baseType: !910, size: 384, offset: 384)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !911, size: 384, elements: !583)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !911, file: !135, line: 1920, baseType: !849, size: 256)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !911, file: !135, line: 1921, baseType: !484, size: 64, offset: 256)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !911, file: !135, line: 1922, baseType: !609, size: 32, offset: 320)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !810, file: !397, line: 748, baseType: !917, size: 320)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !397, line: 487, size: 320, elements: !918)
!918 = !{!919, !920}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !917, file: !397, line: 490, baseType: !813, size: 256)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !917, file: !397, line: 494, baseType: !477, size: 32, offset: 256)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !810, file: !397, line: 749, baseType: !922, size: 384)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !397, line: 500, size: 384, elements: !923)
!923 = !{!924, !925, !926}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !922, file: !397, line: 502, baseType: !813, size: 256)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !922, file: !397, line: 506, baseType: !798, size: 64, offset: 256)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !922, file: !397, line: 510, baseType: !798, size: 64, offset: 320)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !810, file: !397, line: 750, baseType: !928, size: 320)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !397, line: 529, size: 320, elements: !929)
!929 = !{!930, !931}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !928, file: !397, line: 531, baseType: !813, size: 256)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !928, file: !397, line: 540, baseType: !798, size: 64, offset: 256)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !810, file: !397, line: 751, baseType: !933, size: 704)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !397, line: 546, size: 704, elements: !934)
!934 = !{!935, !936, !937, !938, !939, !940, !941}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !933, file: !397, line: 549, baseType: !863, size: 512)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !933, file: !397, line: 553, baseType: !482, size: 64, offset: 512)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !933, file: !397, line: 557, baseType: !476, size: 8, offset: 576)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !933, file: !397, line: 558, baseType: !476, size: 8, offset: 584)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !933, file: !397, line: 559, baseType: !476, size: 8, offset: 592)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !933, file: !397, line: 560, baseType: !476, size: 8, offset: 600)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !933, file: !397, line: 566, baseType: !861, size: 64, offset: 640)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !810, file: !397, line: 752, baseType: !943, size: 384)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !397, line: 571, size: 384, elements: !944)
!944 = !{!945, !946}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !943, file: !397, line: 573, baseType: !874, size: 320)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !943, file: !397, line: 577, baseType: !484, size: 64, offset: 320)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !810, file: !397, line: 753, baseType: !948, size: 576)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !397, line: 600, size: 576, elements: !949)
!949 = !{!950, !951, !952, !955, !964}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !948, file: !397, line: 602, baseType: !874, size: 320)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !948, file: !397, line: 605, baseType: !484, size: 64, offset: 320)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !948, file: !397, line: 609, baseType: !953, size: 64, offset: 384)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !954, line: 46, baseType: !538)
!954 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!955 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !948, file: !397, line: 612, baseType: !956, size: 64, offset: 448)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !397, line: 581, size: 320, elements: !958)
!958 = !{!959, !960, !961, !962, !963}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !957, file: !397, line: 583, baseType: !134, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !957, file: !397, line: 586, baseType: !484, size: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !957, file: !397, line: 589, baseType: !484, size: 64, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !957, file: !397, line: 592, baseType: !484, size: 64, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !957, file: !397, line: 595, baseType: !484, size: 64, offset: 256)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !948, file: !397, line: 616, baseType: !798, size: 64, offset: 512)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !810, file: !397, line: 754, baseType: !966, size: 512)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !397, line: 622, size: 512, elements: !967)
!967 = !{!968, !969, !970, !971}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !966, file: !397, line: 624, baseType: !874, size: 320)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !966, file: !397, line: 628, baseType: !484, size: 64, offset: 320)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !966, file: !397, line: 632, baseType: !484, size: 64, offset: 384)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !966, file: !397, line: 636, baseType: !484, size: 64, offset: 448)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !810, file: !397, line: 755, baseType: !973, size: 704)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !397, line: 642, size: 704, elements: !974)
!974 = !{!975, !976, !977, !978}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !973, file: !397, line: 644, baseType: !966, size: 512)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !973, file: !397, line: 648, baseType: !484, size: 64, offset: 512)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !973, file: !397, line: 652, baseType: !484, size: 64, offset: 576)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !973, file: !397, line: 653, baseType: !484, size: 64, offset: 640)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !810, file: !397, line: 756, baseType: !980, size: 448)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !397, line: 663, size: 448, elements: !981)
!981 = !{!982, !983, !984}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !980, file: !397, line: 665, baseType: !874, size: 320)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !980, file: !397, line: 668, baseType: !484, size: 64, offset: 320)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !980, file: !397, line: 673, baseType: !484, size: 64, offset: 384)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !810, file: !397, line: 757, baseType: !986, size: 384)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !397, line: 694, size: 384, elements: !987)
!987 = !{!988, !989}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !986, file: !397, line: 696, baseType: !874, size: 320)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !986, file: !397, line: 699, baseType: !484, size: 64, offset: 320)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !810, file: !397, line: 758, baseType: !991, size: 384)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !397, line: 681, size: 384, elements: !992)
!992 = !{!993, !994, !995}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !991, file: !397, line: 683, baseType: !813, size: 256)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !991, file: !397, line: 686, baseType: !484, size: 64, offset: 256)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !991, file: !397, line: 689, baseType: !484, size: 64, offset: 320)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !810, file: !397, line: 759, baseType: !997, size: 384)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !397, line: 707, size: 384, elements: !998)
!998 = !{!999, !1000, !1001}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !997, file: !397, line: 709, baseType: !813, size: 256)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !997, file: !397, line: 712, baseType: !484, size: 64, offset: 256)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !997, file: !397, line: 712, baseType: !484, size: 64, offset: 320)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !810, file: !397, line: 760, baseType: !1003, size: 320)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !397, line: 718, size: 320, elements: !1004)
!1004 = !{!1005, !1006}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1003, file: !397, line: 720, baseType: !813, size: 256)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1003, file: !397, line: 723, baseType: !484, size: 64, offset: 256)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !805, file: !397, line: 138, baseType: !804, size: 64, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !805, file: !397, line: 139, baseType: !804, size: 64, offset: 128)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !800, file: !397, line: 146, baseType: !803, size: 64, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !800, file: !397, line: 152, baseType: !798, size: 64, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !795, file: !343, line: 130, baseType: !659, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !790, file: !343, line: 134, baseType: !481, size: 64, offset: 192)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !790, file: !343, line: 137, baseType: !484, size: 64, offset: 256)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !790, file: !343, line: 138, baseType: !609, size: 32, offset: 320)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !790, file: !343, line: 142, baseType: !7, size: 32, offset: 352)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !790, file: !343, line: 144, baseType: !477, size: 32, offset: 384)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !790, file: !343, line: 145, baseType: !477, size: 32, offset: 416)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !790, file: !343, line: 146, baseType: !1019, size: 64, offset: 448)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !343, line: 119, baseType: !540)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !773, file: !343, line: 220, baseType: !776, size: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !773, file: !343, line: 223, baseType: !481, size: 64, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !773, file: !343, line: 226, baseType: !1023, size: 64, offset: 192)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 100, size: 1216, elements: !1025)
!1025 = !{!1026, !1027, !1028, !1029, !1030, !1035, !1036, !1037, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1068, !1076, !1077}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1024, file: !330, line: 102, baseType: !477, size: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1024, file: !330, line: 105, baseType: !7, size: 32, offset: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1024, file: !330, line: 108, baseType: !772, size: 64, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1024, file: !330, line: 111, baseType: !772, size: 64, offset: 128)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1024, file: !330, line: 114, baseType: !1031, size: 64, offset: 192)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !330, line: 41, size: 64, elements: !1032)
!1032 = !{!1033, !1034}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1031, file: !330, line: 42, baseType: !329, size: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1031, file: !330, line: 43, baseType: !7, size: 32, offset: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1024, file: !330, line: 117, baseType: !7, size: 32, offset: 256)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1024, file: !330, line: 120, baseType: !7, size: 32, offset: 288)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1024, file: !330, line: 123, baseType: !1038, size: 64, offset: 320)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !330, line: 87, baseType: !1040)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !330, line: 87, size: 128, elements: !1041)
!1041 = !{!1042}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1040, file: !330, line: 87, baseType: !1043, size: 128)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !330, line: 85, baseType: !1044)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !330, line: 85, size: 128, elements: !1045)
!1045 = !{!1046, !1047, !1048}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1044, file: !330, line: 85, baseType: !7, size: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1044, file: !330, line: 85, baseType: !7, size: 32, offset: 32)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1044, file: !330, line: 85, baseType: !1049, size: 64, offset: 64)
!1049 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1050, size: 64, elements: !583)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !330, line: 84, baseType: !1023)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1024, file: !330, line: 126, baseType: !1023, size: 64, offset: 384)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1024, file: !330, line: 129, baseType: !1023, size: 64, offset: 448)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1024, file: !330, line: 132, baseType: !481, size: 64, offset: 512)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1024, file: !330, line: 139, baseType: !484, size: 64, offset: 576)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1024, file: !330, line: 143, baseType: !533, size: 128, offset: 640)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1024, file: !330, line: 146, baseType: !533, size: 128, offset: 768)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1024, file: !330, line: 148, baseType: !476, size: 8, offset: 896)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1024, file: !330, line: 149, baseType: !476, size: 8, offset: 904)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1024, file: !330, line: 153, baseType: !338, size: 32, offset: 928)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1024, file: !330, line: 156, baseType: !1061, size: 64, offset: 960)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !330, line: 48, size: 320, elements: !1063)
!1063 = !{!1064, !1065, !1066, !1067}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1062, file: !330, line: 50, baseType: !808, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1062, file: !330, line: 59, baseType: !533, size: 128, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1062, file: !330, line: 64, baseType: !476, size: 8, offset: 192)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1062, file: !330, line: 67, baseType: !1061, size: 64, offset: 256)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1024, file: !330, line: 159, baseType: !1069, size: 64, offset: 1024)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !330, line: 72, size: 256, elements: !1071)
!1071 = !{!1072, !1073, !1074, !1075}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1070, file: !330, line: 74, baseType: !789, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1070, file: !330, line: 77, baseType: !1069, size: 64, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1070, file: !330, line: 78, baseType: !1069, size: 64, offset: 128)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1070, file: !330, line: 81, baseType: !1069, size: 64, offset: 192)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1024, file: !330, line: 162, baseType: !476, size: 8, offset: 1088)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1024, file: !330, line: 166, baseType: !484, size: 64, offset: 1152)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !773, file: !343, line: 229, baseType: !1079, size: 128, offset: 256)
!1079 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1080, size: 128, elements: !727)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !343, line: 229, flags: DIFlagFwdDecl)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !773, file: !343, line: 232, baseType: !772, size: 64, offset: 384)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !773, file: !343, line: 233, baseType: !772, size: 64, offset: 448)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !773, file: !343, line: 238, baseType: !1085, size: 64, offset: 512)
!1085 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !343, line: 235, size: 64, elements: !1086)
!1086 = !{!1087, !1093}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1085, file: !343, line: 236, baseType: !1088, size: 64)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !343, line: 273, size: 128, elements: !1090)
!1090 = !{!1091, !1092}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1089, file: !343, line: 275, baseType: !798, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1089, file: !343, line: 278, baseType: !798, size: 64, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1085, file: !343, line: 237, baseType: !1094, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !343, line: 259, size: 320, elements: !1096)
!1096 = !{!1097, !1098, !1099, !1100, !1101}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1095, file: !343, line: 261, baseType: !659, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1095, file: !343, line: 262, baseType: !659, size: 64, offset: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1095, file: !343, line: 266, baseType: !659, size: 64, offset: 128)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1095, file: !343, line: 267, baseType: !659, size: 64, offset: 192)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1095, file: !343, line: 270, baseType: !477, size: 32, offset: 256)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !773, file: !343, line: 241, baseType: !1019, size: 64, offset: 576)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !773, file: !343, line: 244, baseType: !477, size: 32, offset: 640)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !773, file: !343, line: 247, baseType: !477, size: 32, offset: 672)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !773, file: !343, line: 250, baseType: !477, size: 32, offset: 704)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !773, file: !343, line: 253, baseType: !477, size: 32, offset: 736)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !773, file: !343, line: 256, baseType: !477, size: 32, offset: 768)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !680, file: !662, line: 179, baseType: !1109, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !662, line: 150, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !662, line: 142, size: 320, elements: !1112)
!1112 = !{!1113, !1114, !1115, !1116, !1119, !1120}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1111, file: !662, line: 144, baseType: !484, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1111, file: !662, line: 145, baseType: !659, size: 64, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1111, file: !662, line: 146, baseType: !659, size: 64, offset: 128)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1111, file: !662, line: 147, baseType: !1117, size: 32, offset: 192)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1118, line: 31, baseType: !477)
!1118 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1111, file: !662, line: 148, baseType: !7, size: 32, offset: 224)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1111, file: !662, line: 149, baseType: !476, size: 8, offset: 256)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !680, file: !662, line: 180, baseType: !1122, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !662, line: 162, baseType: !1124)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !662, line: 159, size: 128, elements: !1125)
!1125 = !{!1126, !1127}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1124, file: !662, line: 160, baseType: !484, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1124, file: !662, line: 161, baseType: !540, size: 64, offset: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !680, file: !662, line: 181, baseType: !1129, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !662, line: 181, flags: DIFlagFwdDecl)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !675, file: !662, line: 317, baseType: !1132, size: 64)
!1132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 64, elements: !583)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !675, file: !662, line: 318, baseType: !1134, size: 320)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !662, line: 188, size: 320, elements: !1135)
!1135 = !{!1136, !1138, !1195}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1134, file: !662, line: 190, baseType: !1137, size: 192)
!1137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !679, size: 192, elements: !558)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1134, file: !662, line: 193, baseType: !1139, size: 64, offset: 192)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !662, line: 206, size: 320, elements: !1141)
!1141 = !{!1142, !1180, !1181, !1182, !1194}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1140, file: !662, line: 208, baseType: !1143, size: 64)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !485, line: 62, baseType: !1145)
!1145 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1146, line: 538, size: 256, elements: !1147)
!1146 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1147 = !{!1148, !1152, !1158, !1171}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1145, file: !1146, line: 539, baseType: !1149, size: 32)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1146, line: 482, size: 32, elements: !1150)
!1150 = !{!1151}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1149, file: !1146, line: 484, baseType: !7, size: 32)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1145, file: !1146, line: 540, baseType: !1153, size: 192)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1146, line: 488, size: 192, elements: !1154)
!1154 = !{!1155, !1156, !1157}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1153, file: !1146, line: 489, baseType: !1149, size: 32)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1153, file: !1146, line: 492, baseType: !482, size: 64, offset: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1153, file: !1146, line: 496, baseType: !484, size: 64, offset: 128)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1145, file: !1146, line: 541, baseType: !1159, size: 256)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1146, line: 504, size: 256, elements: !1160)
!1160 = !{!1161, !1162, !1169, !1170}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1159, file: !1146, line: 505, baseType: !1149, size: 32)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1159, file: !1146, line: 509, baseType: !1163, size: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1146, line: 501, baseType: !1164)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{null, !1167}
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1159, file: !1146, line: 510, baseType: !1167, size: 64, offset: 128)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1159, file: !1146, line: 513, baseType: !1143, size: 64, offset: 192)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1145, file: !1146, line: 542, baseType: !1172, size: 128)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1146, line: 530, size: 128, elements: !1173)
!1173 = !{!1174, !1175}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1172, file: !1146, line: 531, baseType: !1149, size: 32)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1172, file: !1146, line: 534, baseType: !1176, size: 64, offset: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1146, line: 525, baseType: !1177)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{!476, !484, !482, !538, !538}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1140, file: !662, line: 211, baseType: !7, size: 32, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1140, file: !662, line: 214, baseType: !540, size: 64, offset: 128)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1140, file: !662, line: 224, baseType: !1183, size: 64, offset: 192)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !662, line: 202, baseType: !1185)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !662, line: 202, size: 128, elements: !1186)
!1186 = !{!1187}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1185, file: !662, line: 202, baseType: !1188, size: 128)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !662, line: 200, baseType: !1189)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !662, line: 200, size: 128, elements: !1190)
!1190 = !{!1191, !1192, !1193}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1189, file: !662, line: 200, baseType: !7, size: 32)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1189, file: !662, line: 200, baseType: !7, size: 32, offset: 32)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1189, file: !662, line: 200, baseType: !693, size: 64, offset: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1140, file: !662, line: 234, baseType: !1183, size: 64, offset: 256)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1134, file: !662, line: 197, baseType: !540, size: 64, offset: 256)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !675, file: !662, line: 319, baseType: !547, size: 256)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !675, file: !662, line: 320, baseType: !566, size: 192)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !487, file: !135, line: 3384, baseType: !1199, size: 1472)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1200)
!1200 = !{!1201, !1222, !1223, !1224, !1225}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1199, file: !135, line: 3115, baseType: !1202, size: 1216)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1203)
!1203 = !{!1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1202, file: !135, line: 2985, baseType: !655, size: 960)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1202, file: !135, line: 2986, baseType: !484, size: 64, offset: 960)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1202, file: !135, line: 2987, baseType: !484, size: 64, offset: 1024)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1202, file: !135, line: 2988, baseType: !484, size: 64, offset: 1088)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1202, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1202, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1202, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1202, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1202, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1202, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1202, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1202, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1202, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1202, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1202, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1202, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1202, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1202, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1199, file: !135, line: 3117, baseType: !484, size: 64, offset: 1216)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1199, file: !135, line: 3119, baseType: !484, size: 64, offset: 1280)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1199, file: !135, line: 3121, baseType: !484, size: 64, offset: 1344)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1199, file: !135, line: 3123, baseType: !484, size: 64, offset: 1408)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !487, file: !135, line: 3385, baseType: !1227, size: 1088)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1228)
!1228 = !{!1229, !1230, !1231}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1227, file: !135, line: 2875, baseType: !655, size: 960)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1227, file: !135, line: 2876, baseType: !659, size: 64, offset: 960)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1227, file: !135, line: 2877, baseType: !1232, size: 64, offset: 1024)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !391, line: 172, size: 128, elements: !1234)
!1234 = !{!1235, !1236, !1237, !1238, !1239, !1240, !1241}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1233, file: !391, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1233, file: !391, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1233, file: !391, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1233, file: !391, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1233, file: !391, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1233, file: !391, line: 195, baseType: !7, size: 32, offset: 32)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1233, file: !391, line: 199, baseType: !484, size: 64, offset: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !487, file: !135, line: 3386, baseType: !1202, size: 1216)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !487, file: !135, line: 3387, baseType: !1244, size: 1280)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1245)
!1245 = !{!1246, !1247}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1244, file: !135, line: 3094, baseType: !1202, size: 1216)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1244, file: !135, line: 3095, baseType: !1232, size: 64, offset: 1216)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !487, file: !135, line: 3388, baseType: !1249, size: 1216)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1250)
!1250 = !{!1251, !1252, !1253, !1254, !1255, !1256}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1249, file: !135, line: 2825, baseType: !617, size: 896)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1249, file: !135, line: 2827, baseType: !484, size: 64, offset: 896)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1249, file: !135, line: 2828, baseType: !484, size: 64, offset: 960)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1249, file: !135, line: 2829, baseType: !484, size: 64, offset: 1024)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1249, file: !135, line: 2830, baseType: !484, size: 64, offset: 1088)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1249, file: !135, line: 2831, baseType: !484, size: 64, offset: 1152)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !487, file: !135, line: 3389, baseType: !1258, size: 1024)
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1259)
!1259 = !{!1260, !1261, !1262}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1258, file: !135, line: 2851, baseType: !655, size: 960)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1258, file: !135, line: 2852, baseType: !477, size: 32, offset: 960)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1258, file: !135, line: 2853, baseType: !477, size: 32, offset: 992)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !487, file: !135, line: 3390, baseType: !1264, size: 1024)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !1265)
!1265 = !{!1266, !1267}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1264, file: !135, line: 2858, baseType: !655, size: 960)
