; ModuleID = 'tree-stdarg.bc'
source_filename = "tree-stdarg.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }

!460 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!461 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!462 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!463 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!464 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!465 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!466 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!467 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!468 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!469 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!470 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!471 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!472 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!473 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!474 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!475 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!476 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!477 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!478 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !440, line: 727, baseType: !7, size: 32, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503}
!480 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!481 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!482 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!483 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!484 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!485 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!486 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!487 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!488 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!489 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!490 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!491 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!492 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!493 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!494 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!495 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!496 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!497 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!498 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!499 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!500 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!501 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!502 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!503 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!504 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !440, line: 80, baseType: !7, size: 32, elements: !505)
!505 = !{!506, !507, !508, !509}
!506 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!507 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!508 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!509 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!510 = !{!511, !512, !513, !514, !517, !518, !238, !520, !1181, !816, !1693, !849, !515, !1695, !574, !7, !1698, !1703, !504, !1704}
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!513 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !521, line: 56, baseType: !522)
!521 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !206, line: 3371, size: 1792, elements: !524)
!524 = !{!525, !558, !564, !577, !584, !591, !596, !605, !611, !624, !636, !674, !682, !710, !727, !728, !733, !742, !748, !753, !757, !761, !1342, !1391, !1397, !1403, !1410, !1423, !1437, !1454, !1466, !1488, !1503, !1675}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !523, file: !206, line: 3372, baseType: !526, size: 64)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !206, line: 360, size: 64, elements: !527)
!527 = !{!528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !526, file: !206, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !526, file: !206, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !526, file: !206, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !526, file: !206, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !526, file: !206, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !526, file: !206, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !526, file: !206, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !526, file: !206, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !526, file: !206, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !526, file: !206, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !526, file: !206, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !526, file: !206, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !526, file: !206, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !526, file: !206, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !526, file: !206, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !526, file: !206, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !526, file: !206, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !526, file: !206, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !526, file: !206, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !526, file: !206, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !526, file: !206, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !526, file: !206, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !526, file: !206, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !526, file: !206, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !526, file: !206, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !526, file: !206, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !526, file: !206, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !526, file: !206, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !526, file: !206, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !526, file: !206, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !523, file: !206, line: 3373, baseType: !559, size: 192)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !206, line: 402, size: 192, elements: !560)
!560 = !{!561, !562, !563}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !559, file: !206, line: 403, baseType: !526, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !559, file: !206, line: 404, baseType: !520, size: 64, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !559, file: !206, line: 405, baseType: !520, size: 64, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !523, file: !206, line: 3374, baseType: !565, size: 320)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !206, line: 1384, size: 320, elements: !566)
!566 = !{!567, !568}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !565, file: !206, line: 1385, baseType: !559, size: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !565, file: !206, line: 1386, baseType: !569, size: 128, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !570, line: 58, baseType: !571)
!570 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !570, line: 54, size: 128, elements: !572)
!572 = !{!573, !575}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !571, file: !570, line: 56, baseType: !574, size: 64)
!574 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !571, file: !570, line: 57, baseType: !576, size: 64, offset: 64)
!576 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !523, file: !206, line: 3375, baseType: !578, size: 256)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !206, line: 1397, size: 256, elements: !579)
!579 = !{!580, !581}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !578, file: !206, line: 1398, baseType: !559, size: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !578, file: !206, line: 1399, baseType: !582, size: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !206, line: 1392, flags: DIFlagFwdDecl)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !523, file: !206, line: 3376, baseType: !585, size: 256)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !206, line: 1408, size: 256, elements: !586)
!586 = !{!587, !588}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !585, file: !206, line: 1409, baseType: !559, size: 192)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !585, file: !206, line: 1410, baseType: !589, size: 64, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !206, line: 1403, flags: DIFlagFwdDecl)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !523, file: !206, line: 3377, baseType: !592, size: 256)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !206, line: 1437, size: 256, elements: !593)
!593 = !{!594, !595}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !592, file: !206, line: 1438, baseType: !559, size: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !592, file: !206, line: 1439, baseType: !520, size: 64, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !523, file: !206, line: 3378, baseType: !597, size: 256)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !206, line: 1418, size: 256, elements: !598)
!598 = !{!599, !600, !601}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !597, file: !206, line: 1419, baseType: !559, size: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !597, file: !206, line: 1420, baseType: !513, size: 32, offset: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !597, file: !206, line: 1421, baseType: !602, size: 8, offset: 224)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 8, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 1)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !523, file: !206, line: 3379, baseType: !606, size: 320)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !206, line: 1428, size: 320, elements: !607)
!607 = !{!608, !609, !610}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !606, file: !206, line: 1429, baseType: !559, size: 192)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !606, file: !206, line: 1430, baseType: !520, size: 64, offset: 192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !606, file: !206, line: 1431, baseType: !520, size: 64, offset: 256)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !523, file: !206, line: 3380, baseType: !612, size: 320)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !206, line: 1460, size: 320, elements: !613)
!613 = !{!614, !615}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !612, file: !206, line: 1461, baseType: !559, size: 192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !612, file: !206, line: 1462, baseType: !616, size: 128, offset: 192)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !617, line: 31, size: 128, elements: !618)
!617 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!618 = !{!619, !622, !623}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !616, file: !617, line: 32, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !512)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !616, file: !617, line: 33, baseType: !7, size: 32, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !616, file: !617, line: 34, baseType: !7, size: 32, offset: 96)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !523, file: !206, line: 3381, baseType: !625, size: 384)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !206, line: 2507, size: 384, elements: !626)
!626 = !{!627, !628, !633, !634, !635}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !625, file: !206, line: 2508, baseType: !559, size: 192)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !625, file: !206, line: 2509, baseType: !629, size: 32, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !630, line: 58, baseType: !631)
!630 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !632, line: 44, baseType: !7)
!632 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!633 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !625, file: !206, line: 2510, baseType: !7, size: 32, offset: 224)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !625, file: !206, line: 2511, baseType: !520, size: 64, offset: 256)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !625, file: !206, line: 2512, baseType: !520, size: 64, offset: 320)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !523, file: !206, line: 3382, baseType: !637, size: 896)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !206, line: 2652, size: 896, elements: !638)
!638 = !{!639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !637, file: !206, line: 2653, baseType: !625, size: 384)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !637, file: !206, line: 2654, baseType: !520, size: 64, offset: 384)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !637, file: !206, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !637, file: !206, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !637, file: !206, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !637, file: !206, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !637, file: !206, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !637, file: !206, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !637, file: !206, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !637, file: !206, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !637, file: !206, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !637, file: !206, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !637, file: !206, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !637, file: !206, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !637, file: !206, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !637, file: !206, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !637, file: !206, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !637, file: !206, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !637, file: !206, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !637, file: !206, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !637, file: !206, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !637, file: !206, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !637, file: !206, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !637, file: !206, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !637, file: !206, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !637, file: !206, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !637, file: !206, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !637, file: !206, line: 2703, baseType: !7, size: 32, offset: 512)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !637, file: !206, line: 2705, baseType: !520, size: 64, offset: 576)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !637, file: !206, line: 2706, baseType: !520, size: 64, offset: 640)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !637, file: !206, line: 2707, baseType: !520, size: 64, offset: 704)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !637, file: !206, line: 2708, baseType: !520, size: 64, offset: 768)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !637, file: !206, line: 2711, baseType: !672, size: 64, offset: 832)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !206, line: 2711, flags: DIFlagFwdDecl)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !523, file: !206, line: 3383, baseType: !675, size: 960)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !206, line: 2756, size: 960, elements: !676)
!676 = !{!677, !678}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !675, file: !206, line: 2757, baseType: !637, size: 896)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !675, file: !206, line: 2758, baseType: !679, size: 64, offset: 896)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !521, line: 50, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !521, line: 49, flags: DIFlagFwdDecl)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !523, file: !206, line: 3384, baseType: !683, size: 1472)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !206, line: 3114, size: 1472, elements: !684)
!684 = !{!685, !706, !707, !708, !709}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !683, file: !206, line: 3115, baseType: !686, size: 1216)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !206, line: 2984, size: 1216, elements: !687)
!687 = !{!688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !686, file: !206, line: 2985, baseType: !675, size: 960)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !686, file: !206, line: 2986, baseType: !520, size: 64, offset: 960)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !686, file: !206, line: 2987, baseType: !520, size: 64, offset: 1024)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !686, file: !206, line: 2988, baseType: !520, size: 64, offset: 1088)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !686, file: !206, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !686, file: !206, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !686, file: !206, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !686, file: !206, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !686, file: !206, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !686, file: !206, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !686, file: !206, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !686, file: !206, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !686, file: !206, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !686, file: !206, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !686, file: !206, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !686, file: !206, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !686, file: !206, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !686, file: !206, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !683, file: !206, line: 3117, baseType: !520, size: 64, offset: 1216)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !683, file: !206, line: 3119, baseType: !520, size: 64, offset: 1280)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !683, file: !206, line: 3121, baseType: !520, size: 64, offset: 1344)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !683, file: !206, line: 3123, baseType: !520, size: 64, offset: 1408)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !523, file: !206, line: 3385, baseType: !711, size: 1088)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !206, line: 2874, size: 1088, elements: !712)
!712 = !{!713, !714, !715}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !711, file: !206, line: 2875, baseType: !675, size: 960)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !711, file: !206, line: 2876, baseType: !679, size: 64, offset: 960)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !711, file: !206, line: 2877, baseType: !716, size: 64, offset: 1024)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !718, line: 172, size: 128, elements: !719)
!718 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!719 = !{!720, !721, !722, !723, !724, !725, !726}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !717, file: !718, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !717, file: !718, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !717, file: !718, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !717, file: !718, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !717, file: !718, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !717, file: !718, line: 195, baseType: !7, size: 32, offset: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !717, file: !718, line: 199, baseType: !520, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !523, file: !206, line: 3386, baseType: !686, size: 1216)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !523, file: !206, line: 3387, baseType: !729, size: 1280)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !206, line: 3093, size: 1280, elements: !730)
!730 = !{!731, !732}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !729, file: !206, line: 3094, baseType: !686, size: 1216)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !729, file: !206, line: 3095, baseType: !716, size: 64, offset: 1216)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !523, file: !206, line: 3388, baseType: !734, size: 1216)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !206, line: 2824, size: 1216, elements: !735)
!735 = !{!736, !737, !738, !739, !740, !741}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !734, file: !206, line: 2825, baseType: !637, size: 896)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !734, file: !206, line: 2827, baseType: !520, size: 64, offset: 896)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !734, file: !206, line: 2828, baseType: !520, size: 64, offset: 960)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !734, file: !206, line: 2829, baseType: !520, size: 64, offset: 1024)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !734, file: !206, line: 2830, baseType: !520, size: 64, offset: 1088)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !734, file: !206, line: 2831, baseType: !520, size: 64, offset: 1152)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !523, file: !206, line: 3389, baseType: !743, size: 1024)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !206, line: 2850, size: 1024, elements: !744)
!744 = !{!745, !746, !747}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !743, file: !206, line: 2851, baseType: !675, size: 960)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !743, file: !206, line: 2852, baseType: !513, size: 32, offset: 960)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !743, file: !206, line: 2853, baseType: !513, size: 32, offset: 992)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !523, file: !206, line: 3390, baseType: !749, size: 1024)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !206, line: 2857, size: 1024, elements: !750)
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !749, file: !206, line: 2858, baseType: !675, size: 960)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !749, file: !206, line: 2859, baseType: !716, size: 64, offset: 960)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !523, file: !206, line: 3391, baseType: !754, size: 960)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !206, line: 2862, size: 960, elements: !755)
!755 = !{!756}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !754, file: !206, line: 2863, baseType: !675, size: 960)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !523, file: !206, line: 3392, baseType: !758, size: 1472)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !206, line: 3304, size: 1472, elements: !759)
!759 = !{!760}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !758, file: !206, line: 3305, baseType: !683, size: 1472)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !523, file: !206, line: 3393, baseType: !762, size: 1792)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !206, line: 3248, size: 1792, elements: !763)
!763 = !{!764, !765, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !762, file: !206, line: 3249, baseType: !683, size: 1472)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !762, file: !206, line: 3251, baseType: !766, size: 64, offset: 1472)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !768, line: 463, size: 1152, elements: !769)
!768 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!769 = !{!770, !773, !1089, !1090, !1262, !1265, !1266, !1267, !1268, !1269, !1270, !1294, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !767, file: !768, line: 464, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !768, line: 464, flags: DIFlagFwdDecl)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !767, file: !768, line: 467, baseType: !774, size: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !190, line: 374, size: 640, elements: !776)
!776 = !{!777, !1064, !1065, !1078, !1079, !1080, !1081, !1082, !1083, !1085, !1087, !1088}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !775, file: !190, line: 377, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !521, line: 111, baseType: !779)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !190, line: 217, size: 832, elements: !781)
!781 = !{!782, !1027, !1028, !1029, !1032, !1038, !1039, !1040, !1058, !1059, !1060, !1061, !1062, !1063}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !780, file: !190, line: 219, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !190, line: 151, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !190, line: 151, size: 128, elements: !786)
!786 = !{!787}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !785, file: !190, line: 151, baseType: !788, size: 128)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !190, line: 150, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !190, line: 150, size: 128, elements: !790)
!790 = !{!791, !792, !793}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !789, file: !190, line: 150, baseType: !7, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !789, file: !190, line: 150, baseType: !7, size: 32, offset: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !789, file: !190, line: 150, baseType: !794, size: 64, offset: 64)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !795, size: 64, elements: !603)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !521, line: 108, baseType: !796)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !190, line: 122, size: 512, elements: !798)
!798 = !{!799, !800, !801, !1019, !1020, !1021, !1022, !1023, !1024, !1025}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !797, file: !190, line: 124, baseType: !779, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !797, file: !190, line: 125, baseType: !779, size: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !797, file: !190, line: 131, baseType: !802, size: 64, offset: 128)
!802 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !190, line: 128, size: 64, elements: !803)
!803 = !{!804, !1018}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !802, file: !190, line: 129, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !521, line: 66, baseType: !806)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !440, line: 143, size: 192, elements: !808)
!808 = !{!809, !1016, !1017}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !807, file: !440, line: 145, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !521, line: 69, baseType: !811)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !440, line: 136, size: 192, elements: !813)
!813 = !{!814, !1014, !1015}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !812, file: !440, line: 137, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !521, line: 58, baseType: !816)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !440, line: 737, size: 768, elements: !818)
!818 = !{!819, !836, !869, !875, !880, !885, !892, !898, !904, !909, !923, !928, !934, !939, !949, !954, !972, !979, !986, !992, !997, !1003, !1009}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !817, file: !440, line: 738, baseType: !820, size: 256)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !440, line: 271, size: 256, elements: !821)
!821 = !{!822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !820, file: !440, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !820, file: !440, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !820, file: !440, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !820, file: !440, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !820, file: !440, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !820, file: !440, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !820, file: !440, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !820, file: !440, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !820, file: !440, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !820, file: !440, line: 312, baseType: !7, size: 32, offset: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !820, file: !440, line: 316, baseType: !629, size: 32, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !820, file: !440, line: 319, baseType: !7, size: 32, offset: 96)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !820, file: !440, line: 323, baseType: !779, size: 64, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !820, file: !440, line: 327, baseType: !520, size: 64, offset: 192)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !817, file: !440, line: 739, baseType: !837, size: 448)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !440, line: 350, size: 448, elements: !838)
!838 = !{!839, !867}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !837, file: !440, line: 353, baseType: !840, size: 384)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !440, line: 333, size: 384, elements: !841)
!841 = !{!842, !843, !850}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !840, file: !440, line: 336, baseType: !820, size: 256)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !840, file: !440, line: 343, baseType: !844, size: 64, offset: 256)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !433, line: 37, size: 128, elements: !846)
!846 = !{!847, !848}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !845, file: !433, line: 39, baseType: !844, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !845, file: !433, line: 40, baseType: !849, size: 64, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !840, file: !440, line: 344, baseType: !851, size: 64, offset: 320)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !433, line: 45, size: 320, elements: !853)
!853 = !{!854, !855}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !852, file: !433, line: 47, baseType: !851, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !852, file: !433, line: 48, baseType: !856, size: 256, offset: 64)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !206, line: 1883, size: 256, elements: !857)
!857 = !{!858, !860, !861, !866}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !856, file: !206, line: 1884, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !856, file: !206, line: 1885, baseType: !859, size: 64, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !856, file: !206, line: 1891, baseType: !862, size: 64, offset: 128)
!862 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !856, file: !206, line: 1891, size: 64, elements: !863)
!863 = !{!864, !865}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !862, file: !206, line: 1891, baseType: !815, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !862, file: !206, line: 1891, baseType: !520, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !856, file: !206, line: 1892, baseType: !849, size: 64, offset: 192)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !837, file: !440, line: 359, baseType: !868, size: 64, offset: 384)
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, size: 64, elements: !603)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !817, file: !440, line: 740, baseType: !870, size: 512)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !440, line: 365, size: 512, elements: !871)
!871 = !{!872, !873, !874}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !870, file: !440, line: 368, baseType: !840, size: 384)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !870, file: !440, line: 373, baseType: !520, size: 64, offset: 384)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !870, file: !440, line: 374, baseType: !520, size: 64, offset: 448)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !817, file: !440, line: 741, baseType: !876, size: 576)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !440, line: 380, size: 576, elements: !877)
!877 = !{!878, !879}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !876, file: !440, line: 383, baseType: !870, size: 512)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !876, file: !440, line: 389, baseType: !868, size: 64, offset: 512)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !817, file: !440, line: 742, baseType: !881, size: 320)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !440, line: 395, size: 320, elements: !882)
!882 = !{!883, !884}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !881, file: !440, line: 397, baseType: !820, size: 256)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !881, file: !440, line: 400, baseType: !805, size: 64, offset: 256)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !817, file: !440, line: 743, baseType: !886, size: 448)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !440, line: 406, size: 448, elements: !887)
!887 = !{!888, !889, !890, !891}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !886, file: !440, line: 408, baseType: !820, size: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !886, file: !440, line: 412, baseType: !520, size: 64, offset: 256)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !886, file: !440, line: 420, baseType: !520, size: 64, offset: 320)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !886, file: !440, line: 423, baseType: !805, size: 64, offset: 384)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !817, file: !440, line: 744, baseType: !893, size: 384)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !440, line: 429, size: 384, elements: !894)
!894 = !{!895, !896, !897}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !893, file: !440, line: 431, baseType: !820, size: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !893, file: !440, line: 434, baseType: !520, size: 64, offset: 256)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !893, file: !440, line: 437, baseType: !805, size: 64, offset: 320)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !817, file: !440, line: 745, baseType: !899, size: 384)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !440, line: 443, size: 384, elements: !900)
!900 = !{!901, !902, !903}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !899, file: !440, line: 445, baseType: !820, size: 256)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !899, file: !440, line: 449, baseType: !520, size: 64, offset: 256)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !899, file: !440, line: 453, baseType: !805, size: 64, offset: 320)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !817, file: !440, line: 746, baseType: !905, size: 320)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !440, line: 459, size: 320, elements: !906)
!906 = !{!907, !908}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !905, file: !440, line: 461, baseType: !820, size: 256)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !905, file: !440, line: 464, baseType: !520, size: 64, offset: 256)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !817, file: !440, line: 747, baseType: !910, size: 768)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !440, line: 469, size: 768, elements: !911)
!911 = !{!912, !913, !914, !915, !916}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !910, file: !440, line: 471, baseType: !820, size: 256)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !910, file: !440, line: 474, baseType: !7, size: 32, offset: 256)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !910, file: !440, line: 475, baseType: !7, size: 32, offset: 288)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !910, file: !440, line: 478, baseType: !520, size: 64, offset: 320)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !910, file: !440, line: 481, baseType: !917, size: 384, offset: 384)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 384, elements: !603)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !206, line: 1917, size: 384, elements: !919)
!919 = !{!920, !921, !922}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !918, file: !206, line: 1920, baseType: !856, size: 256)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !918, file: !206, line: 1921, baseType: !520, size: 64, offset: 256)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !918, file: !206, line: 1922, baseType: !629, size: 32, offset: 320)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !817, file: !440, line: 748, baseType: !924, size: 320)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !440, line: 487, size: 320, elements: !925)
!925 = !{!926, !927}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !924, file: !440, line: 490, baseType: !820, size: 256)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !924, file: !440, line: 494, baseType: !513, size: 32, offset: 256)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !817, file: !440, line: 749, baseType: !929, size: 384)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !440, line: 500, size: 384, elements: !930)
!930 = !{!931, !932, !933}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !929, file: !440, line: 502, baseType: !820, size: 256)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !929, file: !440, line: 506, baseType: !805, size: 64, offset: 256)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !929, file: !440, line: 510, baseType: !805, size: 64, offset: 320)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !817, file: !440, line: 750, baseType: !935, size: 320)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !440, line: 529, size: 320, elements: !936)
!936 = !{!937, !938}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !935, file: !440, line: 531, baseType: !820, size: 256)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !935, file: !440, line: 540, baseType: !805, size: 64, offset: 256)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !817, file: !440, line: 751, baseType: !940, size: 704)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !440, line: 546, size: 704, elements: !941)
!941 = !{!942, !943, !944, !945, !946, !947, !948}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !940, file: !440, line: 549, baseType: !870, size: 512)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !940, file: !440, line: 553, baseType: !518, size: 64, offset: 512)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !940, file: !440, line: 557, baseType: !512, size: 8, offset: 576)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !940, file: !440, line: 558, baseType: !512, size: 8, offset: 584)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !940, file: !440, line: 559, baseType: !512, size: 8, offset: 592)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !940, file: !440, line: 560, baseType: !512, size: 8, offset: 600)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !940, file: !440, line: 566, baseType: !868, size: 64, offset: 640)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !817, file: !440, line: 752, baseType: !950, size: 384)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !440, line: 571, size: 384, elements: !951)
!951 = !{!952, !953}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !950, file: !440, line: 573, baseType: !881, size: 320)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !950, file: !440, line: 577, baseType: !520, size: 64, offset: 320)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !817, file: !440, line: 753, baseType: !955, size: 576)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !440, line: 600, size: 576, elements: !956)
!956 = !{!957, !958, !959, !962, !971}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !955, file: !440, line: 602, baseType: !881, size: 320)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !955, file: !440, line: 605, baseType: !520, size: 64, offset: 320)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !955, file: !440, line: 609, baseType: !960, size: 64, offset: 384)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !961, line: 46, baseType: !574)
!961 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!962 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !955, file: !440, line: 612, baseType: !963, size: 64, offset: 448)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !440, line: 581, size: 320, elements: !965)
!965 = !{!966, !967, !968, !969, !970}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !964, file: !440, line: 583, baseType: !238, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !964, file: !440, line: 586, baseType: !520, size: 64, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !964, file: !440, line: 589, baseType: !520, size: 64, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !964, file: !440, line: 592, baseType: !520, size: 64, offset: 192)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !964, file: !440, line: 595, baseType: !520, size: 64, offset: 256)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !955, file: !440, line: 616, baseType: !805, size: 64, offset: 512)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !817, file: !440, line: 754, baseType: !973, size: 512)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !440, line: 622, size: 512, elements: !974)
!974 = !{!975, !976, !977, !978}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !973, file: !440, line: 624, baseType: !881, size: 320)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !973, file: !440, line: 628, baseType: !520, size: 64, offset: 320)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !973, file: !440, line: 632, baseType: !520, size: 64, offset: 384)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !973, file: !440, line: 636, baseType: !520, size: 64, offset: 448)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !817, file: !440, line: 755, baseType: !980, size: 704)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !440, line: 642, size: 704, elements: !981)
!981 = !{!982, !983, !984, !985}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !980, file: !440, line: 644, baseType: !973, size: 512)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !980, file: !440, line: 648, baseType: !520, size: 64, offset: 512)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !980, file: !440, line: 652, baseType: !520, size: 64, offset: 576)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !980, file: !440, line: 653, baseType: !520, size: 64, offset: 640)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !817, file: !440, line: 756, baseType: !987, size: 448)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !440, line: 663, size: 448, elements: !988)
!988 = !{!989, !990, !991}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !987, file: !440, line: 665, baseType: !881, size: 320)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !987, file: !440, line: 668, baseType: !520, size: 64, offset: 320)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !987, file: !440, line: 673, baseType: !520, size: 64, offset: 384)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !817, file: !440, line: 757, baseType: !993, size: 384)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !440, line: 694, size: 384, elements: !994)
!994 = !{!995, !996}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !993, file: !440, line: 696, baseType: !881, size: 320)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !993, file: !440, line: 699, baseType: !520, size: 64, offset: 320)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !817, file: !440, line: 758, baseType: !998, size: 384)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !440, line: 681, size: 384, elements: !999)
!999 = !{!1000, !1001, !1002}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !998, file: !440, line: 683, baseType: !820, size: 256)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !998, file: !440, line: 686, baseType: !520, size: 64, offset: 256)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !998, file: !440, line: 689, baseType: !520, size: 64, offset: 320)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !817, file: !440, line: 759, baseType: !1004, size: 384)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !440, line: 707, size: 384, elements: !1005)
!1005 = !{!1006, !1007, !1008}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1004, file: !440, line: 709, baseType: !820, size: 256)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1004, file: !440, line: 712, baseType: !520, size: 64, offset: 256)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1004, file: !440, line: 712, baseType: !520, size: 64, offset: 320)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !817, file: !440, line: 760, baseType: !1010, size: 320)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !440, line: 718, size: 320, elements: !1011)
!1011 = !{!1012, !1013}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1010, file: !440, line: 720, baseType: !820, size: 256)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1010, file: !440, line: 723, baseType: !520, size: 64, offset: 256)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !812, file: !440, line: 138, baseType: !811, size: 64, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !812, file: !440, line: 139, baseType: !811, size: 64, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !807, file: !440, line: 146, baseType: !810, size: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !807, file: !440, line: 152, baseType: !805, size: 64, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !802, file: !190, line: 130, baseType: !679, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !797, file: !190, line: 134, baseType: !517, size: 64, offset: 192)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !797, file: !190, line: 137, baseType: !520, size: 64, offset: 256)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !797, file: !190, line: 138, baseType: !629, size: 32, offset: 320)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !797, file: !190, line: 142, baseType: !7, size: 32, offset: 352)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !797, file: !190, line: 144, baseType: !513, size: 32, offset: 384)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !797, file: !190, line: 145, baseType: !513, size: 32, offset: 416)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !797, file: !190, line: 146, baseType: !1026, size: 64, offset: 448)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !190, line: 119, baseType: !576)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !780, file: !190, line: 220, baseType: !783, size: 64, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !780, file: !190, line: 223, baseType: !517, size: 64, offset: 128)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !780, file: !190, line: 226, baseType: !1030, size: 64, offset: 192)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !190, line: 185, flags: DIFlagFwdDecl)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !780, file: !190, line: 229, baseType: !1033, size: 128, offset: 256)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1034, size: 128, elements: !1036)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !190, line: 229, flags: DIFlagFwdDecl)
!1036 = !{!1037}
!1037 = !DISubrange(count: 2)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !780, file: !190, line: 232, baseType: !779, size: 64, offset: 384)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !780, file: !190, line: 233, baseType: !779, size: 64, offset: 448)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !780, file: !190, line: 238, baseType: !1041, size: 64, offset: 512)
!1041 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !190, line: 235, size: 64, elements: !1042)
!1042 = !{!1043, !1049}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1041, file: !190, line: 236, baseType: !1044, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !190, line: 273, size: 128, elements: !1046)
!1046 = !{!1047, !1048}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1045, file: !190, line: 275, baseType: !805, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1045, file: !190, line: 278, baseType: !805, size: 64, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1041, file: !190, line: 237, baseType: !1050, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !190, line: 259, size: 320, elements: !1052)
!1052 = !{!1053, !1054, !1055, !1056, !1057}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1051, file: !190, line: 261, baseType: !679, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1051, file: !190, line: 262, baseType: !679, size: 64, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1051, file: !190, line: 266, baseType: !679, size: 64, offset: 128)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1051, file: !190, line: 267, baseType: !679, size: 64, offset: 192)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1051, file: !190, line: 270, baseType: !513, size: 32, offset: 256)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !780, file: !190, line: 241, baseType: !1026, size: 64, offset: 576)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !780, file: !190, line: 244, baseType: !513, size: 32, offset: 640)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !780, file: !190, line: 247, baseType: !513, size: 32, offset: 672)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !780, file: !190, line: 250, baseType: !513, size: 32, offset: 704)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !780, file: !190, line: 253, baseType: !513, size: 32, offset: 736)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !780, file: !190, line: 256, baseType: !513, size: 32, offset: 768)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !775, file: !190, line: 378, baseType: !778, size: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !775, file: !190, line: 381, baseType: !1066, size: 64, offset: 128)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !190, line: 282, baseType: !1068)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !190, line: 282, size: 128, elements: !1069)
!1069 = !{!1070}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1068, file: !190, line: 282, baseType: !1071, size: 128)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !190, line: 281, baseType: !1072)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !190, line: 281, size: 128, elements: !1073)
!1073 = !{!1074, !1075, !1076}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1072, file: !190, line: 281, baseType: !7, size: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1072, file: !190, line: 281, baseType: !7, size: 32, offset: 32)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1072, file: !190, line: 281, baseType: !1077, size: 64, offset: 64)
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !778, size: 64, elements: !603)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !775, file: !190, line: 384, baseType: !513, size: 32, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !775, file: !190, line: 387, baseType: !513, size: 32, offset: 224)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !775, file: !190, line: 390, baseType: !513, size: 32, offset: 256)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !775, file: !190, line: 394, baseType: !1066, size: 64, offset: 320)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !775, file: !190, line: 396, baseType: !189, size: 32, offset: 384)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !775, file: !190, line: 399, baseType: !1084, size: 64, offset: 416)
!1084 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 64, elements: !1036)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !775, file: !190, line: 402, baseType: !1086, size: 64, offset: 480)
!1086 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1036)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !775, file: !190, line: 406, baseType: !513, size: 32, offset: 544)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !775, file: !190, line: 409, baseType: !513, size: 32, offset: 576)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !767, file: !768, line: 470, baseType: !806, size: 64, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !767, file: !768, line: 473, baseType: !1091, size: 64, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !718, line: 39, size: 1152, elements: !1093)
!1093 = !{!1094, !1144, !1157, !1169, !1170, !1239, !1240, !1244, !1245, !1246, !1247, !1248}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1092, file: !718, line: 41, baseType: !1095, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1096, line: 144, baseType: !1097)
!1096 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1096, line: 100, size: 896, elements: !1099)
!1099 = !{!1100, !1108, !1113, !1118, !1120, !1121, !1122, !1123, !1124, !1125, !1130, !1132, !1133, !1138, !1143}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1098, file: !1096, line: 102, baseType: !1101, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1096, line: 52, baseType: !1102)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{!1105, !1106}
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1096, line: 47, baseType: !7)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1098, file: !1096, line: 105, baseType: !1109, size: 64, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1096, line: 59, baseType: !1110)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!513, !1106, !1106}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1098, file: !1096, line: 108, baseType: !1114, size: 64, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1096, line: 63, baseType: !1115)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{null, !517}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1098, file: !1096, line: 111, baseType: !1119, size: 64, offset: 192)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1098, file: !1096, line: 114, baseType: !960, size: 64, offset: 256)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1098, file: !1096, line: 117, baseType: !960, size: 64, offset: 320)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1098, file: !1096, line: 120, baseType: !960, size: 64, offset: 384)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1098, file: !1096, line: 124, baseType: !7, size: 32, offset: 448)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1098, file: !1096, line: 128, baseType: !7, size: 32, offset: 480)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1098, file: !1096, line: 131, baseType: !1126, size: 64, offset: 512)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1096, line: 75, baseType: !1127)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!517, !960, !960}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1098, file: !1096, line: 132, baseType: !1131, size: 64, offset: 576)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1096, line: 78, baseType: !1115)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1098, file: !1096, line: 135, baseType: !517, size: 64, offset: 640)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1098, file: !1096, line: 136, baseType: !1134, size: 64, offset: 704)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1096, line: 82, baseType: !1135)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{!517, !517, !960, !960}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1098, file: !1096, line: 137, baseType: !1139, size: 64, offset: 768)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1096, line: 83, baseType: !1140)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{null, !517, !517}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1098, file: !1096, line: 141, baseType: !7, size: 32, offset: 832)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1092, file: !718, line: 48, baseType: !1145, size: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !440, line: 35, baseType: !1147)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !440, line: 35, size: 128, elements: !1148)
!1148 = !{!1149}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1147, file: !440, line: 35, baseType: !1150, size: 128)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !440, line: 33, baseType: !1151)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !440, line: 33, size: 128, elements: !1152)
!1152 = !{!1153, !1154, !1155}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1151, file: !440, line: 33, baseType: !7, size: 32)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1151, file: !440, line: 33, baseType: !7, size: 32, offset: 32)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1151, file: !440, line: 33, baseType: !1156, size: 64, offset: 64)
!1156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !815, size: 64, elements: !603)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1092, file: !718, line: 51, baseType: !1158, size: 64, offset: 128)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !206, line: 183, baseType: !1160)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !206, line: 183, size: 128, elements: !1161)
!1161 = !{!1162}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1160, file: !206, line: 183, baseType: !1163, size: 128)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !206, line: 182, baseType: !1164)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !206, line: 182, size: 128, elements: !1165)
!1165 = !{!1166, !1167, !1168}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1164, file: !206, line: 182, baseType: !7, size: 32)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1164, file: !206, line: 182, baseType: !7, size: 32, offset: 32)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1164, file: !206, line: 182, baseType: !868, size: 64, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1092, file: !718, line: 54, baseType: !520, size: 64, offset: 192)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1092, file: !718, line: 57, baseType: !1171, size: 128, offset: 256)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1172, line: 31, size: 128, elements: !1173)
!1172 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1173 = !{!1174, !1175, !1176, !1177, !1178, !1179, !1180}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1171, file: !1172, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1171, file: !1172, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1171, file: !1172, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1171, file: !1172, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1171, file: !1172, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1171, file: !1172, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1171, file: !1172, line: 56, baseType: !1181, size: 64, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !521, line: 47, baseType: !1182)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1184, line: 75, size: 256, elements: !1185)
!1184 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1185 = !{!1186, !1198, !1199, !1200}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1183, file: !1184, line: 76, baseType: !1187, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1184, line: 68, baseType: !1189)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1184, line: 63, size: 320, elements: !1190)
!1190 = !{!1191, !1193, !1194, !1195}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1189, file: !1184, line: 64, baseType: !1192, size: 64)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1189, file: !1184, line: 65, baseType: !1192, size: 64, offset: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1189, file: !1184, line: 66, baseType: !7, size: 32, offset: 128)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1189, file: !1184, line: 67, baseType: !1196, size: 128, offset: 192)
!1196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1197, size: 128, elements: !1036)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1184, line: 29, baseType: !574)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1183, file: !1184, line: 77, baseType: !1187, size: 64, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1183, file: !1184, line: 78, baseType: !7, size: 32, offset: 128)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1183, file: !1184, line: 79, baseType: !1201, size: 64, offset: 192)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1184, line: 49, baseType: !1203)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1184, line: 45, size: 832, elements: !1204)
!1204 = !{!1205, !1206, !1207}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1203, file: !1184, line: 46, baseType: !1192, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1203, file: !1184, line: 47, baseType: !1182, size: 64, offset: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1203, file: !1184, line: 48, baseType: !1208, size: 704, offset: 128)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1209, line: 164, size: 704, elements: !1210)
!1209 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1210 = !{!1211, !1212, !1222, !1223, !1224, !1225, !1226, !1227, !1231, !1235, !1236, !1237, !1238}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1208, file: !1209, line: 166, baseType: !576, size: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1208, file: !1209, line: 167, baseType: !1213, size: 64, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1209, line: 157, size: 192, elements: !1215)
!1215 = !{!1216, !1217, !1218}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1214, file: !1209, line: 159, baseType: !515, size: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1214, file: !1209, line: 160, baseType: !1213, size: 64, offset: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1214, file: !1209, line: 161, baseType: !1219, size: 32, offset: 128)
!1219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 32, elements: !1220)
!1220 = !{!1221}
!1221 = !DISubrange(count: 4)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1208, file: !1209, line: 168, baseType: !515, size: 64, offset: 128)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1208, file: !1209, line: 169, baseType: !515, size: 64, offset: 192)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1208, file: !1209, line: 170, baseType: !515, size: 64, offset: 256)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1208, file: !1209, line: 171, baseType: !576, size: 64, offset: 320)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1208, file: !1209, line: 172, baseType: !513, size: 32, offset: 384)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1208, file: !1209, line: 176, baseType: !1228, size: 64, offset: 448)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{!1213, !517, !576}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1208, file: !1209, line: 177, baseType: !1232, size: 64, offset: 512)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{null, !517, !1213}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1208, file: !1209, line: 178, baseType: !517, size: 64, offset: 576)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1208, file: !1209, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1208, file: !1209, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1208, file: !1209, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1092, file: !718, line: 60, baseType: !1171, size: 128, offset: 384)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1092, file: !718, line: 64, baseType: !1241, size: 64, offset: 512)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1243, line: 33, flags: DIFlagFwdDecl)
!1243 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1092, file: !718, line: 67, baseType: !520, size: 64, offset: 576)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1092, file: !718, line: 73, baseType: !1095, size: 64, offset: 640)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1092, file: !718, line: 77, baseType: !1181, size: 64, offset: 704)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1092, file: !718, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1092, file: !718, line: 82, baseType: !1249, size: 320, offset: 832)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !433, line: 62, size: 320, elements: !1250)
!1250 = !{!1251, !1257, !1258, !1259, !1260, !1261}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1249, file: !433, line: 63, baseType: !1252, size: 64)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !433, line: 56, size: 128, elements: !1254)
!1254 = !{!1255, !1256}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1253, file: !433, line: 57, baseType: !1252, size: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1253, file: !433, line: 58, baseType: !602, size: 8, offset: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1249, file: !433, line: 64, baseType: !7, size: 32, offset: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1249, file: !433, line: 66, baseType: !7, size: 32, offset: 96)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1249, file: !433, line: 68, baseType: !512, size: 8, offset: 128)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1249, file: !433, line: 70, baseType: !844, size: 64, offset: 192)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1249, file: !433, line: 71, baseType: !851, size: 64, offset: 256)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !767, file: !768, line: 476, baseType: !1263, size: 64, offset: 256)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !768, line: 476, flags: DIFlagFwdDecl)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !767, file: !768, line: 479, baseType: !1095, size: 64, offset: 320)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !767, file: !768, line: 484, baseType: !520, size: 64, offset: 384)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !767, file: !768, line: 488, baseType: !520, size: 64, offset: 448)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !767, file: !768, line: 493, baseType: !520, size: 64, offset: 512)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !767, file: !768, line: 496, baseType: !520, size: 64, offset: 576)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !767, file: !768, line: 501, baseType: !1271, size: 64, offset: 640)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !201, line: 2355, size: 576, elements: !1273)
!1273 = !{!1274, !1277, !1278, !1279, !1280, !1282, !1283, !1288, !1289, !1290, !1291, !1292, !1293}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1272, file: !201, line: 2356, baseType: !1275, size: 64)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !201, line: 2356, flags: DIFlagFwdDecl)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1272, file: !201, line: 2357, baseType: !518, size: 64, offset: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1272, file: !201, line: 2358, baseType: !513, size: 32, offset: 128)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1272, file: !201, line: 2359, baseType: !513, size: 32, offset: 160)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1272, file: !201, line: 2360, baseType: !1281, size: 128, offset: 192)
!1281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 128, elements: !1220)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1272, file: !201, line: 2364, baseType: !513, size: 32, offset: 320)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1272, file: !201, line: 2367, baseType: !1284, size: 128, offset: 384)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !201, line: 2349, size: 128, elements: !1285)
!1285 = !{!1286, !1287}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1284, file: !201, line: 2351, baseType: !679, size: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1284, file: !201, line: 2352, baseType: !576, size: 64, offset: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1272, file: !201, line: 2371, baseType: !200, size: 32, offset: 512)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1272, file: !201, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1272, file: !201, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1272, file: !201, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1272, file: !201, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1272, file: !201, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !767, file: !768, line: 504, baseType: !1295, size: 64, offset: 704)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !768, line: 504, flags: DIFlagFwdDecl)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !767, file: !768, line: 507, baseType: !1095, size: 64, offset: 768)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !767, file: !768, line: 510, baseType: !513, size: 32, offset: 832)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !767, file: !768, line: 513, baseType: !513, size: 32, offset: 864)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !767, file: !768, line: 516, baseType: !629, size: 32, offset: 896)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !767, file: !768, line: 519, baseType: !629, size: 32, offset: 928)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !767, file: !768, line: 522, baseType: !7, size: 32, offset: 960)
