; ModuleID = 'tree-ssanames.bc'
source_filename = "tree-ssanames.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!428 = !DIEnumerator(name: "TV_REORDER_BLOCKS", value: 162, isUnsigned: true)
!429 = !DIEnumerator(name: "TV_SHORTEN_BRANCH", value: 163, isUnsigned: true)
!430 = !DIEnumerator(name: "TV_REG_STACK", value: 164, isUnsigned: true)
!431 = !DIEnumerator(name: "TV_FINAL", value: 165, isUnsigned: true)
!432 = !DIEnumerator(name: "TV_SYMOUT", value: 166, isUnsigned: true)
!433 = !DIEnumerator(name: "TV_VAR_TRACKING", value: 167, isUnsigned: true)
!434 = !DIEnumerator(name: "TV_TREE_IFCOMBINE", value: 168, isUnsigned: true)
!435 = !DIEnumerator(name: "TV_PLUGIN_INIT", value: 169, isUnsigned: true)
!436 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!437 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!438 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!439 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_code", file: !440, line: 51, baseType: !7, size: 32, elements: !441)
!440 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!441 = !{!442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477}
!442 = !DIEnumerator(name: "GIMPLE_ERROR_MARK", value: 0, isUnsigned: true)
!443 = !DIEnumerator(name: "GIMPLE_COND", value: 1, isUnsigned: true)
!444 = !DIEnumerator(name: "GIMPLE_DEBUG", value: 2, isUnsigned: true)
!445 = !DIEnumerator(name: "GIMPLE_GOTO", value: 3, isUnsigned: true)
!446 = !DIEnumerator(name: "GIMPLE_LABEL", value: 4, isUnsigned: true)
!447 = !DIEnumerator(name: "GIMPLE_SWITCH", value: 5, isUnsigned: true)
!448 = !DIEnumerator(name: "GIMPLE_ASSIGN", value: 6, isUnsigned: true)
!449 = !DIEnumerator(name: "GIMPLE_ASM", value: 7, isUnsigned: true)
!450 = !DIEnumerator(name: "GIMPLE_CALL", value: 8, isUnsigned: true)
!451 = !DIEnumerator(name: "GIMPLE_RETURN", value: 9, isUnsigned: true)
!452 = !DIEnumerator(name: "GIMPLE_BIND", value: 10, isUnsigned: true)
!453 = !DIEnumerator(name: "GIMPLE_CATCH", value: 11, isUnsigned: true)
!454 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!455 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!456 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!457 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!458 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!459 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!460 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!461 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!462 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!463 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!464 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!465 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!466 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!467 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!468 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!469 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!470 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!471 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!472 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!473 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!474 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!475 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!476 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!477 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!478 = !{!479, !480, !481, !482, !485, !486, !488, !39, !1386, !1126, !7}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!481 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !484)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !489, line: 56, baseType: !490)
!489 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !6, line: 3371, size: 1792, elements: !492)
!492 = !{!493, !526, !532, !545, !552, !559, !564, !573, !579, !592, !604, !642, !650, !678, !695, !696, !701, !710, !716, !721, !725, !729, !1310, !1359, !1365, !1371, !1378, !1391, !1405, !1422, !1434, !1456, !1471, !1643}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !491, file: !6, line: 3372, baseType: !494, size: 64)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !6, line: 360, size: 64, elements: !495)
!495 = !{!496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !494, file: !6, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !494, file: !6, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !494, file: !6, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !494, file: !6, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !494, file: !6, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !494, file: !6, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !494, file: !6, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !494, file: !6, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !494, file: !6, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !494, file: !6, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !494, file: !6, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !494, file: !6, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !494, file: !6, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !494, file: !6, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !494, file: !6, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !494, file: !6, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !494, file: !6, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !494, file: !6, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !494, file: !6, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !494, file: !6, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !494, file: !6, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !494, file: !6, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !494, file: !6, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !494, file: !6, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !494, file: !6, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !494, file: !6, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !494, file: !6, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !494, file: !6, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !494, file: !6, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !494, file: !6, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !491, file: !6, line: 3373, baseType: !527, size: 192)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !6, line: 402, size: 192, elements: !528)
!528 = !{!529, !530, !531}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !527, file: !6, line: 403, baseType: !494, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !527, file: !6, line: 404, baseType: !488, size: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !527, file: !6, line: 405, baseType: !488, size: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !491, file: !6, line: 3374, baseType: !533, size: 320)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !6, line: 1384, size: 320, elements: !534)
!534 = !{!535, !536}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !533, file: !6, line: 1385, baseType: !527, size: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !533, file: !6, line: 1386, baseType: !537, size: 128, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !538, line: 58, baseType: !539)
!538 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !538, line: 54, size: 128, elements: !540)
!540 = !{!541, !543}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !539, file: !538, line: 56, baseType: !542, size: 64)
!542 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !539, file: !538, line: 57, baseType: !544, size: 64, offset: 64)
!544 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !491, file: !6, line: 3375, baseType: !546, size: 256)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !6, line: 1397, size: 256, elements: !547)
!547 = !{!548, !549}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !546, file: !6, line: 1398, baseType: !527, size: 192)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !546, file: !6, line: 1399, baseType: !550, size: 64, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !6, line: 1392, flags: DIFlagFwdDecl)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !491, file: !6, line: 3376, baseType: !553, size: 256)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !6, line: 1408, size: 256, elements: !554)
!554 = !{!555, !556}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !553, file: !6, line: 1409, baseType: !527, size: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !553, file: !6, line: 1410, baseType: !557, size: 64, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !6, line: 1403, flags: DIFlagFwdDecl)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !491, file: !6, line: 3377, baseType: !560, size: 256)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !6, line: 1437, size: 256, elements: !561)
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !560, file: !6, line: 1438, baseType: !527, size: 192)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !560, file: !6, line: 1439, baseType: !488, size: 64, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !491, file: !6, line: 3378, baseType: !565, size: 256)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !6, line: 1418, size: 256, elements: !566)
!566 = !{!567, !568, !569}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !565, file: !6, line: 1419, baseType: !527, size: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !565, file: !6, line: 1420, baseType: !481, size: 32, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !565, file: !6, line: 1421, baseType: !570, size: 8, offset: 224)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 8, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 1)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !491, file: !6, line: 3379, baseType: !574, size: 320)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !6, line: 1428, size: 320, elements: !575)
!575 = !{!576, !577, !578}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !574, file: !6, line: 1429, baseType: !527, size: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !574, file: !6, line: 1430, baseType: !488, size: 64, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !574, file: !6, line: 1431, baseType: !488, size: 64, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !491, file: !6, line: 3380, baseType: !580, size: 320)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !6, line: 1460, size: 320, elements: !581)
!581 = !{!582, !583}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !580, file: !6, line: 1461, baseType: !527, size: 192)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !580, file: !6, line: 1462, baseType: !584, size: 128, offset: 192)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !585, line: 31, size: 128, elements: !586)
!585 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!586 = !{!587, !590, !591}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !584, file: !585, line: 32, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !584, file: !585, line: 33, baseType: !7, size: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !584, file: !585, line: 34, baseType: !7, size: 32, offset: 96)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !491, file: !6, line: 3381, baseType: !593, size: 384)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !6, line: 2507, size: 384, elements: !594)
!594 = !{!595, !596, !601, !602, !603}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !593, file: !6, line: 2508, baseType: !527, size: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !593, file: !6, line: 2509, baseType: !597, size: 32, offset: 192)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !598, line: 58, baseType: !599)
!598 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !600, line: 44, baseType: !7)
!600 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!601 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !593, file: !6, line: 2510, baseType: !7, size: 32, offset: 224)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !593, file: !6, line: 2511, baseType: !488, size: 64, offset: 256)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !593, file: !6, line: 2512, baseType: !488, size: 64, offset: 320)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !491, file: !6, line: 3382, baseType: !605, size: 896)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !6, line: 2652, size: 896, elements: !606)
!606 = !{!607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !605, file: !6, line: 2653, baseType: !593, size: 384)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !605, file: !6, line: 2654, baseType: !488, size: 64, offset: 384)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !605, file: !6, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !605, file: !6, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !605, file: !6, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !605, file: !6, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !605, file: !6, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !605, file: !6, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !605, file: !6, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !605, file: !6, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !605, file: !6, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !605, file: !6, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !605, file: !6, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !605, file: !6, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !605, file: !6, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !605, file: !6, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !605, file: !6, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !605, file: !6, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !605, file: !6, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !605, file: !6, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !605, file: !6, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !605, file: !6, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !605, file: !6, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !605, file: !6, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !605, file: !6, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !605, file: !6, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !605, file: !6, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !605, file: !6, line: 2703, baseType: !7, size: 32, offset: 512)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !605, file: !6, line: 2705, baseType: !488, size: 64, offset: 576)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !605, file: !6, line: 2706, baseType: !488, size: 64, offset: 640)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !605, file: !6, line: 2707, baseType: !488, size: 64, offset: 704)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !605, file: !6, line: 2708, baseType: !488, size: 64, offset: 768)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !605, file: !6, line: 2711, baseType: !640, size: 64, offset: 832)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !6, line: 2711, flags: DIFlagFwdDecl)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !491, file: !6, line: 3383, baseType: !643, size: 960)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !6, line: 2756, size: 960, elements: !644)
!644 = !{!645, !646}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !643, file: !6, line: 2757, baseType: !605, size: 896)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !643, file: !6, line: 2758, baseType: !647, size: 64, offset: 896)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !489, line: 50, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !489, line: 49, flags: DIFlagFwdDecl)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !491, file: !6, line: 3384, baseType: !651, size: 1472)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !6, line: 3114, size: 1472, elements: !652)
!652 = !{!653, !674, !675, !676, !677}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !651, file: !6, line: 3115, baseType: !654, size: 1216)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !6, line: 2984, size: 1216, elements: !655)
!655 = !{!656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !654, file: !6, line: 2985, baseType: !643, size: 960)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !654, file: !6, line: 2986, baseType: !488, size: 64, offset: 960)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !654, file: !6, line: 2987, baseType: !488, size: 64, offset: 1024)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !654, file: !6, line: 2988, baseType: !488, size: 64, offset: 1088)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !654, file: !6, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !654, file: !6, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !654, file: !6, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !654, file: !6, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !654, file: !6, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !654, file: !6, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !654, file: !6, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !654, file: !6, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !654, file: !6, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !654, file: !6, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !654, file: !6, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !654, file: !6, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !654, file: !6, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !654, file: !6, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !651, file: !6, line: 3117, baseType: !488, size: 64, offset: 1216)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !651, file: !6, line: 3119, baseType: !488, size: 64, offset: 1280)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !651, file: !6, line: 3121, baseType: !488, size: 64, offset: 1344)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !651, file: !6, line: 3123, baseType: !488, size: 64, offset: 1408)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !491, file: !6, line: 3385, baseType: !679, size: 1088)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !6, line: 2874, size: 1088, elements: !680)
!680 = !{!681, !682, !683}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !679, file: !6, line: 2875, baseType: !643, size: 960)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !679, file: !6, line: 2876, baseType: !647, size: 64, offset: 960)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !679, file: !6, line: 2877, baseType: !684, size: 64, offset: 1024)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !686, line: 172, size: 128, elements: !687)
!686 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!687 = !{!688, !689, !690, !691, !692, !693, !694}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !685, file: !686, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !685, file: !686, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !685, file: !686, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !685, file: !686, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !685, file: !686, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !685, file: !686, line: 195, baseType: !7, size: 32, offset: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !685, file: !686, line: 199, baseType: !488, size: 64, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !491, file: !6, line: 3386, baseType: !654, size: 1216)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !491, file: !6, line: 3387, baseType: !697, size: 1280)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !6, line: 3093, size: 1280, elements: !698)
!698 = !{!699, !700}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !697, file: !6, line: 3094, baseType: !654, size: 1216)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !697, file: !6, line: 3095, baseType: !684, size: 64, offset: 1216)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !491, file: !6, line: 3388, baseType: !702, size: 1216)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !6, line: 2824, size: 1216, elements: !703)
!703 = !{!704, !705, !706, !707, !708, !709}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !702, file: !6, line: 2825, baseType: !605, size: 896)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !702, file: !6, line: 2827, baseType: !488, size: 64, offset: 896)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !702, file: !6, line: 2828, baseType: !488, size: 64, offset: 960)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !702, file: !6, line: 2829, baseType: !488, size: 64, offset: 1024)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !702, file: !6, line: 2830, baseType: !488, size: 64, offset: 1088)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !702, file: !6, line: 2831, baseType: !488, size: 64, offset: 1152)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !491, file: !6, line: 3389, baseType: !711, size: 1024)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !6, line: 2850, size: 1024, elements: !712)
!712 = !{!713, !714, !715}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !711, file: !6, line: 2851, baseType: !643, size: 960)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !711, file: !6, line: 2852, baseType: !481, size: 32, offset: 960)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !711, file: !6, line: 2853, baseType: !481, size: 32, offset: 992)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !491, file: !6, line: 3390, baseType: !717, size: 1024)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !6, line: 2857, size: 1024, elements: !718)
!718 = !{!719, !720}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !717, file: !6, line: 2858, baseType: !643, size: 960)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !717, file: !6, line: 2859, baseType: !684, size: 64, offset: 960)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !491, file: !6, line: 3391, baseType: !722, size: 960)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !6, line: 2862, size: 960, elements: !723)
!723 = !{!724}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !722, file: !6, line: 2863, baseType: !643, size: 960)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !491, file: !6, line: 3392, baseType: !726, size: 1472)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !6, line: 3304, size: 1472, elements: !727)
!727 = !{!728}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !726, file: !6, line: 3305, baseType: !651, size: 1472)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !491, file: !6, line: 3393, baseType: !730, size: 1792)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !6, line: 3248, size: 1792, elements: !731)
!731 = !{!732, !733, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !730, file: !6, line: 3249, baseType: !651, size: 1472)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !730, file: !6, line: 3251, baseType: !734, size: 64, offset: 1472)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !736, line: 463, size: 1152, elements: !737)
!736 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!737 = !{!738, !741, !1057, !1058, !1230, !1233, !1234, !1235, !1236, !1237, !1238, !1262, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !735, file: !736, line: 464, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !736, line: 464, flags: DIFlagFwdDecl)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !735, file: !736, line: 467, baseType: !742, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !234, line: 374, size: 640, elements: !744)
!744 = !{!745, !1032, !1033, !1046, !1047, !1048, !1049, !1050, !1051, !1053, !1055, !1056}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !743, file: !234, line: 377, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !489, line: 111, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !234, line: 217, size: 832, elements: !749)
!749 = !{!750, !995, !996, !997, !1000, !1006, !1007, !1008, !1026, !1027, !1028, !1029, !1030, !1031}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !748, file: !234, line: 219, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !234, line: 151, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !234, line: 151, size: 128, elements: !754)
!754 = !{!755}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !753, file: !234, line: 151, baseType: !756, size: 128)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !234, line: 150, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !234, line: 150, size: 128, elements: !758)
!758 = !{!759, !760, !761}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !757, file: !234, line: 150, baseType: !7, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !757, file: !234, line: 150, baseType: !7, size: 32, offset: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !757, file: !234, line: 150, baseType: !762, size: 64, offset: 64)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !763, size: 64, elements: !571)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !489, line: 108, baseType: !764)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !234, line: 122, size: 512, elements: !766)
!766 = !{!767, !768, !769, !987, !988, !989, !990, !991, !992, !993}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !765, file: !234, line: 124, baseType: !747, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !765, file: !234, line: 125, baseType: !747, size: 64, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !765, file: !234, line: 131, baseType: !770, size: 64, offset: 128)
!770 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !234, line: 128, size: 64, elements: !771)
!771 = !{!772, !986}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !770, file: !234, line: 129, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !489, line: 66, baseType: !774)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !440, line: 143, size: 192, elements: !776)
!776 = !{!777, !984, !985}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !775, file: !440, line: 145, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !489, line: 69, baseType: !779)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !440, line: 136, size: 192, elements: !781)
!781 = !{!782, !982, !983}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !780, file: !440, line: 137, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !489, line: 58, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !440, line: 737, size: 768, elements: !786)
!786 = !{!787, !804, !837, !843, !848, !853, !860, !866, !872, !877, !891, !896, !902, !907, !917, !922, !940, !947, !954, !960, !965, !971, !977}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !785, file: !440, line: 738, baseType: !788, size: 256)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !440, line: 271, size: 256, elements: !789)
!789 = !{!790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !788, file: !440, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !788, file: !440, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !788, file: !440, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !788, file: !440, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !788, file: !440, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !788, file: !440, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !788, file: !440, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !788, file: !440, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !788, file: !440, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !788, file: !440, line: 312, baseType: !7, size: 32, offset: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !788, file: !440, line: 316, baseType: !597, size: 32, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !788, file: !440, line: 319, baseType: !7, size: 32, offset: 96)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !788, file: !440, line: 323, baseType: !747, size: 64, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !788, file: !440, line: 327, baseType: !488, size: 64, offset: 192)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !785, file: !440, line: 739, baseType: !805, size: 448)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !440, line: 350, size: 448, elements: !806)
!806 = !{!807, !835}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !805, file: !440, line: 353, baseType: !808, size: 384)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !440, line: 333, size: 384, elements: !809)
!809 = !{!810, !811, !818}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !808, file: !440, line: 336, baseType: !788, size: 256)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !808, file: !440, line: 343, baseType: !812, size: 64, offset: 256)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !250, line: 37, size: 128, elements: !814)
!814 = !{!815, !816}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !813, file: !250, line: 39, baseType: !812, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !813, file: !250, line: 40, baseType: !817, size: 64, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !808, file: !440, line: 344, baseType: !819, size: 64, offset: 320)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !250, line: 45, size: 320, elements: !821)
!821 = !{!822, !823}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !820, file: !250, line: 47, baseType: !819, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !820, file: !250, line: 48, baseType: !824, size: 256, offset: 64)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !6, line: 1883, size: 256, elements: !825)
!825 = !{!826, !828, !829, !834}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !824, file: !6, line: 1884, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !824, file: !6, line: 1885, baseType: !827, size: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !824, file: !6, line: 1891, baseType: !830, size: 64, offset: 128)
!830 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !824, file: !6, line: 1891, size: 64, elements: !831)
!831 = !{!832, !833}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !830, file: !6, line: 1891, baseType: !783, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !830, file: !6, line: 1891, baseType: !488, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !824, file: !6, line: 1892, baseType: !817, size: 64, offset: 192)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !805, file: !440, line: 359, baseType: !836, size: 64, offset: 384)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 64, elements: !571)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !785, file: !440, line: 740, baseType: !838, size: 512)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !440, line: 365, size: 512, elements: !839)
!839 = !{!840, !841, !842}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !838, file: !440, line: 368, baseType: !808, size: 384)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !838, file: !440, line: 373, baseType: !488, size: 64, offset: 384)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !838, file: !440, line: 374, baseType: !488, size: 64, offset: 448)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !785, file: !440, line: 741, baseType: !844, size: 576)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !440, line: 380, size: 576, elements: !845)
!845 = !{!846, !847}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !844, file: !440, line: 383, baseType: !838, size: 512)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !844, file: !440, line: 389, baseType: !836, size: 64, offset: 512)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !785, file: !440, line: 742, baseType: !849, size: 320)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !440, line: 395, size: 320, elements: !850)
!850 = !{!851, !852}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !849, file: !440, line: 397, baseType: !788, size: 256)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !849, file: !440, line: 400, baseType: !773, size: 64, offset: 256)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !785, file: !440, line: 743, baseType: !854, size: 448)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !440, line: 406, size: 448, elements: !855)
!855 = !{!856, !857, !858, !859}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !854, file: !440, line: 408, baseType: !788, size: 256)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !854, file: !440, line: 412, baseType: !488, size: 64, offset: 256)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !854, file: !440, line: 420, baseType: !488, size: 64, offset: 320)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !854, file: !440, line: 423, baseType: !773, size: 64, offset: 384)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !785, file: !440, line: 744, baseType: !861, size: 384)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !440, line: 429, size: 384, elements: !862)
!862 = !{!863, !864, !865}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !861, file: !440, line: 431, baseType: !788, size: 256)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !861, file: !440, line: 434, baseType: !488, size: 64, offset: 256)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !861, file: !440, line: 437, baseType: !773, size: 64, offset: 320)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !785, file: !440, line: 745, baseType: !867, size: 384)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !440, line: 443, size: 384, elements: !868)
!868 = !{!869, !870, !871}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !867, file: !440, line: 445, baseType: !788, size: 256)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !867, file: !440, line: 449, baseType: !488, size: 64, offset: 256)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !867, file: !440, line: 453, baseType: !773, size: 64, offset: 320)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !785, file: !440, line: 746, baseType: !873, size: 320)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !440, line: 459, size: 320, elements: !874)
!874 = !{!875, !876}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !873, file: !440, line: 461, baseType: !788, size: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !873, file: !440, line: 464, baseType: !488, size: 64, offset: 256)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !785, file: !440, line: 747, baseType: !878, size: 768)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !440, line: 469, size: 768, elements: !879)
!879 = !{!880, !881, !882, !883, !884}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !878, file: !440, line: 471, baseType: !788, size: 256)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !878, file: !440, line: 474, baseType: !7, size: 32, offset: 256)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !878, file: !440, line: 475, baseType: !7, size: 32, offset: 288)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !878, file: !440, line: 478, baseType: !488, size: 64, offset: 320)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !878, file: !440, line: 481, baseType: !885, size: 384, offset: 384)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !886, size: 384, elements: !571)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !6, line: 1917, size: 384, elements: !887)
!887 = !{!888, !889, !890}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !886, file: !6, line: 1920, baseType: !824, size: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !886, file: !6, line: 1921, baseType: !488, size: 64, offset: 256)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !886, file: !6, line: 1922, baseType: !597, size: 32, offset: 320)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !785, file: !440, line: 748, baseType: !892, size: 320)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !440, line: 487, size: 320, elements: !893)
!893 = !{!894, !895}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !892, file: !440, line: 490, baseType: !788, size: 256)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !892, file: !440, line: 494, baseType: !481, size: 32, offset: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !785, file: !440, line: 749, baseType: !897, size: 384)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !440, line: 500, size: 384, elements: !898)
!898 = !{!899, !900, !901}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !897, file: !440, line: 502, baseType: !788, size: 256)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !897, file: !440, line: 506, baseType: !773, size: 64, offset: 256)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !897, file: !440, line: 510, baseType: !773, size: 64, offset: 320)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !785, file: !440, line: 750, baseType: !903, size: 320)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !440, line: 529, size: 320, elements: !904)
!904 = !{!905, !906}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !903, file: !440, line: 531, baseType: !788, size: 256)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !903, file: !440, line: 540, baseType: !773, size: 64, offset: 256)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !785, file: !440, line: 751, baseType: !908, size: 704)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !440, line: 546, size: 704, elements: !909)
!909 = !{!910, !911, !912, !913, !914, !915, !916}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !908, file: !440, line: 549, baseType: !838, size: 512)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !908, file: !440, line: 553, baseType: !486, size: 64, offset: 512)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !908, file: !440, line: 557, baseType: !480, size: 8, offset: 576)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !908, file: !440, line: 558, baseType: !480, size: 8, offset: 584)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !908, file: !440, line: 559, baseType: !480, size: 8, offset: 592)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !908, file: !440, line: 560, baseType: !480, size: 8, offset: 600)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !908, file: !440, line: 566, baseType: !836, size: 64, offset: 640)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !785, file: !440, line: 752, baseType: !918, size: 384)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !440, line: 571, size: 384, elements: !919)
!919 = !{!920, !921}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !918, file: !440, line: 573, baseType: !849, size: 320)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !918, file: !440, line: 577, baseType: !488, size: 64, offset: 320)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !785, file: !440, line: 753, baseType: !923, size: 576)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !440, line: 600, size: 576, elements: !924)
!924 = !{!925, !926, !927, !930, !939}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !923, file: !440, line: 602, baseType: !849, size: 320)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !923, file: !440, line: 605, baseType: !488, size: 64, offset: 320)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !923, file: !440, line: 609, baseType: !928, size: 64, offset: 384)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !929, line: 46, baseType: !542)
!929 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!930 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !923, file: !440, line: 612, baseType: !931, size: 64, offset: 448)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !440, line: 581, size: 320, elements: !933)
!933 = !{!934, !935, !936, !937, !938}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !932, file: !440, line: 583, baseType: !39, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !932, file: !440, line: 586, baseType: !488, size: 64, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !932, file: !440, line: 589, baseType: !488, size: 64, offset: 128)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !932, file: !440, line: 592, baseType: !488, size: 64, offset: 192)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !932, file: !440, line: 595, baseType: !488, size: 64, offset: 256)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !923, file: !440, line: 616, baseType: !773, size: 64, offset: 512)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !785, file: !440, line: 754, baseType: !941, size: 512)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !440, line: 622, size: 512, elements: !942)
!942 = !{!943, !944, !945, !946}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !941, file: !440, line: 624, baseType: !849, size: 320)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !941, file: !440, line: 628, baseType: !488, size: 64, offset: 320)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !941, file: !440, line: 632, baseType: !488, size: 64, offset: 384)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !941, file: !440, line: 636, baseType: !488, size: 64, offset: 448)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !785, file: !440, line: 755, baseType: !948, size: 704)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !440, line: 642, size: 704, elements: !949)
!949 = !{!950, !951, !952, !953}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !948, file: !440, line: 644, baseType: !941, size: 512)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !948, file: !440, line: 648, baseType: !488, size: 64, offset: 512)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !948, file: !440, line: 652, baseType: !488, size: 64, offset: 576)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !948, file: !440, line: 653, baseType: !488, size: 64, offset: 640)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !785, file: !440, line: 756, baseType: !955, size: 448)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !440, line: 663, size: 448, elements: !956)
!956 = !{!957, !958, !959}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !955, file: !440, line: 665, baseType: !849, size: 320)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !955, file: !440, line: 668, baseType: !488, size: 64, offset: 320)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !955, file: !440, line: 673, baseType: !488, size: 64, offset: 384)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !785, file: !440, line: 757, baseType: !961, size: 384)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !440, line: 694, size: 384, elements: !962)
!962 = !{!963, !964}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !961, file: !440, line: 696, baseType: !849, size: 320)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !961, file: !440, line: 699, baseType: !488, size: 64, offset: 320)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !785, file: !440, line: 758, baseType: !966, size: 384)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !440, line: 681, size: 384, elements: !967)
!967 = !{!968, !969, !970}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !966, file: !440, line: 683, baseType: !788, size: 256)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !966, file: !440, line: 686, baseType: !488, size: 64, offset: 256)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !966, file: !440, line: 689, baseType: !488, size: 64, offset: 320)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !785, file: !440, line: 759, baseType: !972, size: 384)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !440, line: 707, size: 384, elements: !973)
!973 = !{!974, !975, !976}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !972, file: !440, line: 709, baseType: !788, size: 256)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !972, file: !440, line: 712, baseType: !488, size: 64, offset: 256)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !972, file: !440, line: 712, baseType: !488, size: 64, offset: 320)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !785, file: !440, line: 760, baseType: !978, size: 320)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !440, line: 718, size: 320, elements: !979)
!979 = !{!980, !981}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !978, file: !440, line: 720, baseType: !788, size: 256)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !978, file: !440, line: 723, baseType: !488, size: 64, offset: 256)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !780, file: !440, line: 138, baseType: !779, size: 64, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !780, file: !440, line: 139, baseType: !779, size: 64, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !775, file: !440, line: 146, baseType: !778, size: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !775, file: !440, line: 152, baseType: !773, size: 64, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !770, file: !234, line: 130, baseType: !647, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !765, file: !234, line: 134, baseType: !485, size: 64, offset: 192)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !765, file: !234, line: 137, baseType: !488, size: 64, offset: 256)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !765, file: !234, line: 138, baseType: !597, size: 32, offset: 320)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !765, file: !234, line: 142, baseType: !7, size: 32, offset: 352)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !765, file: !234, line: 144, baseType: !481, size: 32, offset: 384)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !765, file: !234, line: 145, baseType: !481, size: 32, offset: 416)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !765, file: !234, line: 146, baseType: !994, size: 64, offset: 448)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !234, line: 119, baseType: !544)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !748, file: !234, line: 220, baseType: !751, size: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !748, file: !234, line: 223, baseType: !485, size: 64, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !748, file: !234, line: 226, baseType: !998, size: 64, offset: 192)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !234, line: 185, flags: DIFlagFwdDecl)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !748, file: !234, line: 229, baseType: !1001, size: 128, offset: 256)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1002, size: 128, elements: !1004)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !234, line: 229, flags: DIFlagFwdDecl)
!1004 = !{!1005}
!1005 = !DISubrange(count: 2)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !748, file: !234, line: 232, baseType: !747, size: 64, offset: 384)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !748, file: !234, line: 233, baseType: !747, size: 64, offset: 448)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !748, file: !234, line: 238, baseType: !1009, size: 64, offset: 512)
!1009 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !234, line: 235, size: 64, elements: !1010)
!1010 = !{!1011, !1017}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1009, file: !234, line: 236, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !234, line: 273, size: 128, elements: !1014)
!1014 = !{!1015, !1016}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1013, file: !234, line: 275, baseType: !773, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1013, file: !234, line: 278, baseType: !773, size: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1009, file: !234, line: 237, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !234, line: 259, size: 320, elements: !1020)
!1020 = !{!1021, !1022, !1023, !1024, !1025}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1019, file: !234, line: 261, baseType: !647, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1019, file: !234, line: 262, baseType: !647, size: 64, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1019, file: !234, line: 266, baseType: !647, size: 64, offset: 128)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1019, file: !234, line: 267, baseType: !647, size: 64, offset: 192)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1019, file: !234, line: 270, baseType: !481, size: 32, offset: 256)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !748, file: !234, line: 241, baseType: !994, size: 64, offset: 576)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !748, file: !234, line: 244, baseType: !481, size: 32, offset: 640)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !748, file: !234, line: 247, baseType: !481, size: 32, offset: 672)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !748, file: !234, line: 250, baseType: !481, size: 32, offset: 704)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !748, file: !234, line: 253, baseType: !481, size: 32, offset: 736)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !748, file: !234, line: 256, baseType: !481, size: 32, offset: 768)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !743, file: !234, line: 378, baseType: !746, size: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !743, file: !234, line: 381, baseType: !1034, size: 64, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !234, line: 282, baseType: !1036)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !234, line: 282, size: 128, elements: !1037)
!1037 = !{!1038}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1036, file: !234, line: 282, baseType: !1039, size: 128)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !234, line: 281, baseType: !1040)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !234, line: 281, size: 128, elements: !1041)
!1041 = !{!1042, !1043, !1044}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1040, file: !234, line: 281, baseType: !7, size: 32)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1040, file: !234, line: 281, baseType: !7, size: 32, offset: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1040, file: !234, line: 281, baseType: !1045, size: 64, offset: 64)
!1045 = !DICompositeType(tag: DW_TAG_array_type, baseType: !746, size: 64, elements: !571)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !743, file: !234, line: 384, baseType: !481, size: 32, offset: 192)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !743, file: !234, line: 387, baseType: !481, size: 32, offset: 224)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !743, file: !234, line: 390, baseType: !481, size: 32, offset: 256)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !743, file: !234, line: 394, baseType: !1034, size: 64, offset: 320)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !743, file: !234, line: 396, baseType: !233, size: 32, offset: 384)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !743, file: !234, line: 399, baseType: !1052, size: 64, offset: 416)
!1052 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 64, elements: !1004)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !743, file: !234, line: 402, baseType: !1054, size: 64, offset: 480)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1004)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !743, file: !234, line: 406, baseType: !481, size: 32, offset: 544)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !743, file: !234, line: 409, baseType: !481, size: 32, offset: 576)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !735, file: !736, line: 470, baseType: !774, size: 64, offset: 128)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !735, file: !736, line: 473, baseType: !1059, size: 64, offset: 192)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !686, line: 39, size: 1152, elements: !1061)
!1061 = !{!1062, !1112, !1125, !1137, !1138, !1207, !1208, !1212, !1213, !1214, !1215, !1216}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1060, file: !686, line: 41, baseType: !1063, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1064, line: 144, baseType: !1065)
!1064 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1064, line: 100, size: 896, elements: !1067)
!1067 = !{!1068, !1076, !1081, !1086, !1088, !1089, !1090, !1091, !1092, !1093, !1098, !1100, !1101, !1106, !1111}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1066, file: !1064, line: 102, baseType: !1069, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1064, line: 52, baseType: !1070)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!1073, !1074}
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1064, line: 47, baseType: !7)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1066, file: !1064, line: 105, baseType: !1077, size: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1064, line: 59, baseType: !1078)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!481, !1074, !1074}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1066, file: !1064, line: 108, baseType: !1082, size: 64, offset: 128)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1064, line: 63, baseType: !1083)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{null, !485}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1066, file: !1064, line: 111, baseType: !1087, size: 64, offset: 192)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1066, file: !1064, line: 114, baseType: !928, size: 64, offset: 256)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1066, file: !1064, line: 117, baseType: !928, size: 64, offset: 320)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1066, file: !1064, line: 120, baseType: !928, size: 64, offset: 384)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1066, file: !1064, line: 124, baseType: !7, size: 32, offset: 448)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1066, file: !1064, line: 128, baseType: !7, size: 32, offset: 480)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1066, file: !1064, line: 131, baseType: !1094, size: 64, offset: 512)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1064, line: 75, baseType: !1095)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!485, !928, !928}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1066, file: !1064, line: 132, baseType: !1099, size: 64, offset: 576)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1064, line: 78, baseType: !1083)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1066, file: !1064, line: 135, baseType: !485, size: 64, offset: 640)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1066, file: !1064, line: 136, baseType: !1102, size: 64, offset: 704)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1064, line: 82, baseType: !1103)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!485, !485, !928, !928}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1066, file: !1064, line: 137, baseType: !1107, size: 64, offset: 768)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1064, line: 83, baseType: !1108)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{null, !485, !485}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1066, file: !1064, line: 141, baseType: !7, size: 32, offset: 832)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1060, file: !686, line: 48, baseType: !1113, size: 64, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !440, line: 35, baseType: !1115)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !440, line: 35, size: 128, elements: !1116)
!1116 = !{!1117}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1115, file: !440, line: 35, baseType: !1118, size: 128)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !440, line: 33, baseType: !1119)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !440, line: 33, size: 128, elements: !1120)
!1120 = !{!1121, !1122, !1123}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1119, file: !440, line: 33, baseType: !7, size: 32)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1119, file: !440, line: 33, baseType: !7, size: 32, offset: 32)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1119, file: !440, line: 33, baseType: !1124, size: 64, offset: 64)
!1124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !783, size: 64, elements: !571)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1060, file: !686, line: 51, baseType: !1126, size: 64, offset: 128)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !6, line: 183, baseType: !1128)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !6, line: 183, size: 128, elements: !1129)
!1129 = !{!1130}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1128, file: !6, line: 183, baseType: !1131, size: 128)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !6, line: 182, baseType: !1132)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !6, line: 182, size: 128, elements: !1133)
!1133 = !{!1134, !1135, !1136}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1132, file: !6, line: 182, baseType: !7, size: 32)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1132, file: !6, line: 182, baseType: !7, size: 32, offset: 32)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1132, file: !6, line: 182, baseType: !836, size: 64, offset: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1060, file: !686, line: 54, baseType: !488, size: 64, offset: 192)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1060, file: !686, line: 57, baseType: !1139, size: 128, offset: 256)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1140, line: 31, size: 128, elements: !1141)
!1140 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1141 = !{!1142, !1143, !1144, !1145, !1146, !1147, !1148}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1139, file: !1140, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1139, file: !1140, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1139, file: !1140, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1139, file: !1140, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1139, file: !1140, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1139, file: !1140, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1139, file: !1140, line: 56, baseType: !1149, size: 64, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !489, line: 47, baseType: !1150)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1152, line: 75, size: 256, elements: !1153)
!1152 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1153 = !{!1154, !1166, !1167, !1168}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1151, file: !1152, line: 76, baseType: !1155, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1152, line: 68, baseType: !1157)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1152, line: 63, size: 320, elements: !1158)
!1158 = !{!1159, !1161, !1162, !1163}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1157, file: !1152, line: 64, baseType: !1160, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1157, file: !1152, line: 65, baseType: !1160, size: 64, offset: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1157, file: !1152, line: 66, baseType: !7, size: 32, offset: 128)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1157, file: !1152, line: 67, baseType: !1164, size: 128, offset: 192)
!1164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1165, size: 128, elements: !1004)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1152, line: 29, baseType: !542)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1151, file: !1152, line: 77, baseType: !1155, size: 64, offset: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1151, file: !1152, line: 78, baseType: !7, size: 32, offset: 128)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1151, file: !1152, line: 79, baseType: !1169, size: 64, offset: 192)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1152, line: 49, baseType: !1171)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1152, line: 45, size: 832, elements: !1172)
!1172 = !{!1173, !1174, !1175}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1171, file: !1152, line: 46, baseType: !1160, size: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1171, file: !1152, line: 47, baseType: !1150, size: 64, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1171, file: !1152, line: 48, baseType: !1176, size: 704, offset: 128)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1177, line: 164, size: 704, elements: !1178)
!1177 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1178 = !{!1179, !1180, !1190, !1191, !1192, !1193, !1194, !1195, !1199, !1203, !1204, !1205, !1206}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1176, file: !1177, line: 166, baseType: !544, size: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1176, file: !1177, line: 167, baseType: !1181, size: 64, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1177, line: 157, size: 192, elements: !1183)
!1183 = !{!1184, !1185, !1186}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1182, file: !1177, line: 159, baseType: !483, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1182, file: !1177, line: 160, baseType: !1181, size: 64, offset: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1182, file: !1177, line: 161, baseType: !1187, size: 32, offset: 128)
!1187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 32, elements: !1188)
!1188 = !{!1189}
!1189 = !DISubrange(count: 4)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1176, file: !1177, line: 168, baseType: !483, size: 64, offset: 128)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1176, file: !1177, line: 169, baseType: !483, size: 64, offset: 192)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1176, file: !1177, line: 170, baseType: !483, size: 64, offset: 256)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1176, file: !1177, line: 171, baseType: !544, size: 64, offset: 320)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1176, file: !1177, line: 172, baseType: !481, size: 32, offset: 384)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1176, file: !1177, line: 176, baseType: !1196, size: 64, offset: 448)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!1181, !485, !544}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1176, file: !1177, line: 177, baseType: !1200, size: 64, offset: 512)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{null, !485, !1181}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1176, file: !1177, line: 178, baseType: !485, size: 64, offset: 576)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1176, file: !1177, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1176, file: !1177, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1176, file: !1177, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1060, file: !686, line: 60, baseType: !1139, size: 128, offset: 384)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1060, file: !686, line: 64, baseType: !1209, size: 64, offset: 512)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1211, line: 33, flags: DIFlagFwdDecl)
!1211 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1060, file: !686, line: 67, baseType: !488, size: 64, offset: 576)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1060, file: !686, line: 73, baseType: !1063, size: 64, offset: 640)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1060, file: !686, line: 77, baseType: !1149, size: 64, offset: 704)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1060, file: !686, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1060, file: !686, line: 82, baseType: !1217, size: 320, offset: 832)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !250, line: 62, size: 320, elements: !1218)
!1218 = !{!1219, !1225, !1226, !1227, !1228, !1229}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1217, file: !250, line: 63, baseType: !1220, size: 64)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !250, line: 56, size: 128, elements: !1222)
!1222 = !{!1223, !1224}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1221, file: !250, line: 57, baseType: !1220, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1221, file: !250, line: 58, baseType: !570, size: 8, offset: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1217, file: !250, line: 64, baseType: !7, size: 32, offset: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1217, file: !250, line: 66, baseType: !7, size: 32, offset: 96)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1217, file: !250, line: 68, baseType: !480, size: 8, offset: 128)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1217, file: !250, line: 70, baseType: !812, size: 64, offset: 192)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1217, file: !250, line: 71, baseType: !819, size: 64, offset: 256)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !735, file: !736, line: 476, baseType: !1231, size: 64, offset: 256)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1232 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !736, line: 476, flags: DIFlagFwdDecl)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !735, file: !736, line: 479, baseType: !1063, size: 64, offset: 320)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !735, file: !736, line: 484, baseType: !488, size: 64, offset: 384)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !735, file: !736, line: 488, baseType: !488, size: 64, offset: 448)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !735, file: !736, line: 493, baseType: !488, size: 64, offset: 512)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !735, file: !736, line: 496, baseType: !488, size: 64, offset: 576)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !735, file: !736, line: 501, baseType: !1239, size: 64, offset: 640)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !245, line: 2355, size: 576, elements: !1241)
!1241 = !{!1242, !1245, !1246, !1247, !1248, !1250, !1251, !1256, !1257, !1258, !1259, !1260, !1261}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1240, file: !245, line: 2356, baseType: !1243, size: 64)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !245, line: 2356, flags: DIFlagFwdDecl)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1240, file: !245, line: 2357, baseType: !486, size: 64, offset: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1240, file: !245, line: 2358, baseType: !481, size: 32, offset: 128)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1240, file: !245, line: 2359, baseType: !481, size: 32, offset: 160)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1240, file: !245, line: 2360, baseType: !1249, size: 128, offset: 192)
!1249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !481, size: 128, elements: !1188)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1240, file: !245, line: 2364, baseType: !481, size: 32, offset: 320)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1240, file: !245, line: 2367, baseType: !1252, size: 128, offset: 384)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !245, line: 2349, size: 128, elements: !1253)
!1253 = !{!1254, !1255}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1252, file: !245, line: 2351, baseType: !647, size: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1252, file: !245, line: 2352, baseType: !544, size: 64, offset: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1240, file: !245, line: 2371, baseType: !244, size: 32, offset: 512)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1240, file: !245, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1240, file: !245, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1240, file: !245, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1240, file: !245, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1240, file: !245, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !735, file: !736, line: 504, baseType: !1263, size: 64, offset: 704)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !736, line: 504, flags: DIFlagFwdDecl)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !735, file: !736, line: 507, baseType: !1063, size: 64, offset: 768)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !735, file: !736, line: 510, baseType: !481, size: 32, offset: 832)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !735, file: !736, line: 513, baseType: !481, size: 32, offset: 864)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !735, file: !736, line: 516, baseType: !597, size: 32, offset: 896)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !735, file: !736, line: 519, baseType: !597, size: 32, offset: 928)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !735, file: !736, line: 522, baseType: !7, size: 32, offset: 960)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !735, file: !736, line: 523, baseType: !7, size: 32, offset: 992)
