; ModuleID = 'tree-ssa-math-opts.bc'
source_filename = "tree-ssa-math-opts.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }

!1318 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!1319 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ssa_op_iter_type", file: !1320, line: 119, baseType: !7, size: 32, elements: !1321)
!1320 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1321 = !{!1322, !1323, !1324, !1325}
!1322 = !DIEnumerator(name: "ssa_op_iter_none", value: 0, isUnsigned: true)
!1323 = !DIEnumerator(name: "ssa_op_iter_tree", value: 1, isUnsigned: true)
!1324 = !DIEnumerator(name: "ssa_op_iter_use", value: 2, isUnsigned: true)
!1325 = !DIEnumerator(name: "ssa_op_iter_def", value: 3, isUnsigned: true)
!1326 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !1281, line: 80, baseType: !7, size: 32, elements: !1327)
!1327 = !{!1328, !1329, !1330, !1331}
!1328 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!1329 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!1330 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!1331 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!1332 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !1281, line: 727, baseType: !7, size: 32, elements: !1333)
!1333 = !{!1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357}
!1334 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!1335 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!1336 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!1337 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!1338 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!1339 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!1340 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!1341 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!1342 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!1343 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!1344 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!1345 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!1346 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!1347 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!1348 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!1349 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!1350 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!1351 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!1352 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!1353 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!1354 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!1355 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!1356 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!1357 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!1358 = !{!1359, !1360, !1361, !1362, !1365, !1366, !366, !1368, !2672, !1435, !1326, !1411, !2675, !2018, !1363, !1430, !2677, !7, !1410, !1488}
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64)
!1360 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1361 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64)
!1364 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64)
!1367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1364)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64)
!1369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "occurrence", file: !3, line: 109, size: 384, elements: !1370)
!1370 = !{!1371, !2666, !2667, !2668, !2669, !2670, !2671}
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1369, file: !3, line: 111, baseType: !1372, size: 64)
!1372 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !1373, line: 111, baseType: !1374)
!1373 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !318, line: 217, size: 832, elements: !1376)
!1376 = !{!1377, !2631, !2632, !2633, !2636, !2640, !2641, !2642, !2660, !2661, !2662, !2663, !2664, !2665}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1375, file: !318, line: 219, baseType: !1378, size: 64)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64)
!1379 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !318, line: 151, baseType: !1380)
!1380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !318, line: 151, size: 128, elements: !1381)
!1381 = !{!1382}
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1380, file: !318, line: 151, baseType: !1383, size: 128)
!1383 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !318, line: 150, baseType: !1384)
!1384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !318, line: 150, size: 128, elements: !1385)
!1385 = !{!1386, !1387, !1388}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1384, file: !318, line: 150, baseType: !7, size: 32)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1384, file: !318, line: 150, baseType: !7, size: 32, offset: 32)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1384, file: !318, line: 150, baseType: !1389, size: 64, offset: 64)
!1389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1390, size: 64, elements: !1533)
!1390 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !1373, line: 108, baseType: !1391)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64)
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !318, line: 122, size: 512, elements: !1393)
!1393 = !{!1394, !1395, !1396, !2623, !2624, !2625, !2626, !2627, !2628, !2629}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1392, file: !318, line: 124, baseType: !1374, size: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1392, file: !318, line: 125, baseType: !1374, size: 64, offset: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1392, file: !318, line: 131, baseType: !1397, size: 64, offset: 128)
!1397 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !318, line: 128, size: 64, elements: !1398)
!1398 = !{!1399, !2622}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1397, file: !318, line: 129, baseType: !1400, size: 64)
!1400 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !1373, line: 66, baseType: !1401)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64)
!1402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !1281, line: 143, size: 192, elements: !1403)
!1403 = !{!1404, !2620, !2621}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1402, file: !1281, line: 145, baseType: !1405, size: 64)
!1405 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !1373, line: 69, baseType: !1406)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64)
!1407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !1281, line: 136, size: 192, elements: !1408)
!1408 = !{!1409, !2618, !2619}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1407, file: !1281, line: 137, baseType: !1410, size: 64)
!1410 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !1373, line: 58, baseType: !1411)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64)
!1412 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !1281, line: 737, size: 768, elements: !1413)
!1413 = !{!1414, !2465, !2475, !2481, !2486, !2491, !2498, !2504, !2510, !2515, !2529, !2534, !2540, !2545, !2555, !2560, !2576, !2583, !2590, !2596, !2601, !2607, !2613}
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1412, file: !1281, line: 738, baseType: !1415, size: 256)
!1415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !1281, line: 271, size: 256, elements: !1416)
!1416 = !{!1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1432, !1433, !1434}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1415, file: !1281, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1415, file: !1281, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1415, file: !1281, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1415, file: !1281, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1415, file: !1281, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1415, file: !1281, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1415, file: !1281, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1415, file: !1281, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1415, file: !1281, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1415, file: !1281, line: 312, baseType: !7, size: 32, offset: 32)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1415, file: !1281, line: 316, baseType: !1428, size: 32, offset: 64)
!1428 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1429, line: 58, baseType: !1430)
!1429 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1430 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1431, line: 44, baseType: !7)
!1431 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1415, file: !1281, line: 319, baseType: !7, size: 32, offset: 96)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1415, file: !1281, line: 323, baseType: !1374, size: 64, offset: 128)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1415, file: !1281, line: 327, baseType: !1435, size: 64, offset: 192)
!1435 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !1373, line: 56, baseType: !1436)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64)
!1437 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !334, line: 3371, size: 1792, elements: !1438)
!1438 = !{!1439, !1472, !1478, !1491, !1510, !1521, !1526, !1535, !1541, !1554, !1562, !1600, !1774, !1802, !1819, !1820, !1825, !1834, !1840, !1845, !1849, !1853, !2116, !2163, !2169, !2175, !2182, !2195, !2209, !2226, !2238, !2260, !2275, !2447}
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1437, file: !334, line: 3372, baseType: !1440, size: 64)
!1440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !334, line: 360, size: 64, elements: !1441)
!1441 = !{!1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1440, file: !334, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !1440, file: !334, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !1440, file: !334, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !1440, file: !334, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !1440, file: !334, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !1440, file: !334, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !1440, file: !334, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !1440, file: !334, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !1440, file: !334, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !1440, file: !334, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !1440, file: !334, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !1440, file: !334, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !1440, file: !334, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !1440, file: !334, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !1440, file: !334, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !1440, file: !334, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !1440, file: !334, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !1440, file: !334, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1440, file: !334, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1440, file: !334, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1440, file: !334, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1440, file: !334, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1440, file: !334, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1440, file: !334, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1440, file: !334, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1440, file: !334, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !1440, file: !334, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !1440, file: !334, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !1440, file: !334, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !1440, file: !334, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1437, file: !334, line: 3373, baseType: !1473, size: 192)
!1473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !334, line: 402, size: 192, elements: !1474)
!1474 = !{!1475, !1476, !1477}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1473, file: !334, line: 403, baseType: !1440, size: 64)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1473, file: !334, line: 404, baseType: !1435, size: 64, offset: 64)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1473, file: !334, line: 405, baseType: !1435, size: 64, offset: 128)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1437, file: !334, line: 3374, baseType: !1479, size: 320)
!1479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !334, line: 1384, size: 320, elements: !1480)
!1480 = !{!1481, !1482}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1479, file: !334, line: 1385, baseType: !1473, size: 192)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1479, file: !334, line: 1386, baseType: !1483, size: 128, offset: 192)
!1483 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1484, line: 58, baseType: !1485)
!1484 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1485 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1484, line: 54, size: 128, elements: !1486)
!1486 = !{!1487, !1489}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1485, file: !1484, line: 56, baseType: !1488, size: 64)
!1488 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1485, file: !1484, line: 57, baseType: !1490, size: 64, offset: 64)
!1490 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !1437, file: !334, line: 3375, baseType: !1492, size: 256)
!1492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !334, line: 1397, size: 256, elements: !1493)
!1493 = !{!1494, !1495}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1492, file: !334, line: 1398, baseType: !1473, size: 192)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1492, file: !334, line: 1399, baseType: !1496, size: 64, offset: 192)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64)
!1497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1498, line: 52, size: 256, elements: !1499)
!1498 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1499 = !{!1500, !1501, !1502, !1503, !1504, !1505, !1506}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1497, file: !1498, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1497, file: !1498, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1497, file: !1498, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1497, file: !1498, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1497, file: !1498, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1497, file: !1498, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1497, file: !1498, line: 62, baseType: !1507, size: 192, offset: 64)
!1507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1488, size: 192, elements: !1508)
!1508 = !{!1509}
!1509 = !DISubrange(count: 3)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !1437, file: !334, line: 3376, baseType: !1511, size: 256)
!1511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !334, line: 1408, size: 256, elements: !1512)
!1512 = !{!1513, !1514}
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1511, file: !334, line: 1409, baseType: !1473, size: 192)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1511, file: !334, line: 1410, baseType: !1515, size: 64, offset: 192)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64)
!1516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1517, line: 27, size: 192, elements: !1518)
!1517 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1518 = !{!1519, !1520}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1516, file: !1517, line: 29, baseType: !1483, size: 128)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1516, file: !1517, line: 30, baseType: !189, size: 32, offset: 128)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1437, file: !334, line: 3377, baseType: !1522, size: 256)
!1522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !334, line: 1437, size: 256, elements: !1523)
!1523 = !{!1524, !1525}
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1522, file: !334, line: 1438, baseType: !1473, size: 192)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1522, file: !334, line: 1439, baseType: !1435, size: 64, offset: 192)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1437, file: !334, line: 3378, baseType: !1527, size: 256)
!1527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !334, line: 1418, size: 256, elements: !1528)
!1528 = !{!1529, !1530, !1531}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1527, file: !334, line: 1419, baseType: !1473, size: 192)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1527, file: !334, line: 1420, baseType: !1361, size: 32, offset: 192)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1527, file: !334, line: 1421, baseType: !1532, size: 8, offset: 224)
!1532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1364, size: 8, elements: !1533)
!1533 = !{!1534}
!1534 = !DISubrange(count: 1)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !1437, file: !334, line: 3379, baseType: !1536, size: 320)
!1536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !334, line: 1428, size: 320, elements: !1537)
!1537 = !{!1538, !1539, !1540}
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1536, file: !334, line: 1429, baseType: !1473, size: 192)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1536, file: !334, line: 1430, baseType: !1435, size: 64, offset: 192)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1536, file: !334, line: 1431, baseType: !1435, size: 64, offset: 256)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1437, file: !334, line: 3380, baseType: !1542, size: 320)
!1542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !334, line: 1460, size: 320, elements: !1543)
!1543 = !{!1544, !1545}
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1542, file: !334, line: 1461, baseType: !1473, size: 192)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1542, file: !334, line: 1462, baseType: !1546, size: 128, offset: 192)
!1546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1547, line: 31, size: 128, elements: !1548)
!1547 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1548 = !{!1549, !1552, !1553}
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1546, file: !1547, line: 32, baseType: !1550, size: 64)
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64)
!1551 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1360)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1546, file: !1547, line: 33, baseType: !7, size: 32, offset: 64)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1546, file: !1547, line: 34, baseType: !7, size: 32, offset: 96)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !1437, file: !334, line: 3381, baseType: !1555, size: 384)
!1555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !334, line: 2507, size: 384, elements: !1556)
!1556 = !{!1557, !1558, !1559, !1560, !1561}
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1555, file: !334, line: 2508, baseType: !1473, size: 192)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1555, file: !334, line: 2509, baseType: !1428, size: 32, offset: 192)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1555, file: !334, line: 2510, baseType: !7, size: 32, offset: 224)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1555, file: !334, line: 2511, baseType: !1435, size: 64, offset: 256)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1555, file: !334, line: 2512, baseType: !1435, size: 64, offset: 320)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !1437, file: !334, line: 3382, baseType: !1563, size: 896)
!1563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !334, line: 2652, size: 896, elements: !1564)
!1564 = !{!1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597}
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1563, file: !334, line: 2653, baseType: !1555, size: 384)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1563, file: !334, line: 2654, baseType: !1435, size: 64, offset: 384)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1563, file: !334, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1563, file: !334, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1563, file: !334, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1563, file: !334, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1563, file: !334, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1563, file: !334, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1563, file: !334, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1563, file: !334, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1563, file: !334, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1563, file: !334, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1563, file: !334, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1563, file: !334, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1563, file: !334, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1563, file: !334, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1563, file: !334, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1563, file: !334, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1563, file: !334, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1563, file: !334, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1563, file: !334, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1563, file: !334, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1563, file: !334, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1563, file: !334, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1563, file: !334, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1563, file: !334, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1563, file: !334, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1563, file: !334, line: 2703, baseType: !7, size: 32, offset: 512)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1563, file: !334, line: 2705, baseType: !1435, size: 64, offset: 576)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1563, file: !334, line: 2706, baseType: !1435, size: 64, offset: 640)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1563, file: !334, line: 2707, baseType: !1435, size: 64, offset: 704)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1563, file: !334, line: 2708, baseType: !1435, size: 64, offset: 768)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1563, file: !334, line: 2711, baseType: !1598, size: 64, offset: 832)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1599, size: 64)
!1599 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !334, line: 2711, flags: DIFlagFwdDecl)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !1437, file: !334, line: 3383, baseType: !1601, size: 960)
!1601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !334, line: 2756, size: 960, elements: !1602)
!1602 = !{!1603, !1604}
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1601, file: !334, line: 2757, baseType: !1563, size: 896)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1601, file: !334, line: 2758, baseType: !1605, size: 64, offset: 896)
!1605 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !1373, line: 50, baseType: !1606)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64)
!1607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !1608, line: 240, size: 384, elements: !1609)
!1608 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1609 = !{!1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1607, file: !1608, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1607, file: !1608, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !1607, file: !1608, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1607, file: !1608, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !1607, file: !1608, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !1607, file: !1608, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !1607, file: !1608, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1607, file: !1608, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !1607, file: !1608, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !1607, file: !1608, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1607, file: !1608, line: 321, baseType: !1621, size: 320, offset: 64)
!1621 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !1608, line: 315, size: 320, elements: !1622)
!1622 = !{!1623, !1741, !1743, !1772, !1773}
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1621, file: !1608, line: 316, baseType: !1624, size: 64)
!1624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1625, size: 64, elements: !1533)
!1625 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !1608, line: 183, baseType: !1626)
!1626 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !1608, line: 166, size: 64, elements: !1627)
!1627 = !{!1628, !1629, !1630, !1631, !1632, !1640, !1641, !1653, !1656, !1716, !1717, !1718, !1731, !1738}
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !1626, file: !1608, line: 168, baseType: !1361, size: 32)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !1626, file: !1608, line: 169, baseType: !7, size: 32)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !1626, file: !1608, line: 170, baseType: !1366, size: 64)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !1626, file: !1608, line: 171, baseType: !1605, size: 64)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !1626, file: !1608, line: 172, baseType: !1633, size: 64)
!1633 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !1373, line: 53, baseType: !1634)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64)
!1635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !1608, line: 359, size: 128, elements: !1636)
!1636 = !{!1637, !1638}
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !1635, file: !1608, line: 360, baseType: !1361, size: 32)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1635, file: !1608, line: 361, baseType: !1639, size: 64, offset: 64)
!1639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1605, size: 64, elements: !1533)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !1626, file: !1608, line: 173, baseType: !189, size: 32)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !1626, file: !1608, line: 174, baseType: !1642, size: 32)
!1642 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !1608, line: 133, baseType: !1643)
!1643 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1608, line: 115, size: 32, elements: !1644)
!1644 = !{!1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652}
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !1643, file: !1608, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !1643, file: !1608, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !1643, file: !1608, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !1643, file: !1608, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !1643, file: !1608, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !1643, file: !1608, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !1643, file: !1608, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1643, file: !1608, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !1626, file: !1608, line: 175, baseType: !1654, size: 64)
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64)
!1655 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !1608, line: 175, flags: DIFlagFwdDecl)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !1626, file: !1608, line: 176, baseType: !1657, size: 64)
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64)
!1658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1659, line: 75, size: 256, elements: !1660)
!1659 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1660 = !{!1661, !1675, !1676, !1677}
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1658, file: !1659, line: 76, baseType: !1662, size: 64)
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1663, size: 64)
!1663 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1659, line: 68, baseType: !1664)
!1664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1659, line: 63, size: 320, elements: !1665)
!1665 = !{!1666, !1668, !1669, !1670}
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1664, file: !1659, line: 64, baseType: !1667, size: 64)
!1667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1664, file: !1659, line: 65, baseType: !1667, size: 64, offset: 64)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1664, file: !1659, line: 66, baseType: !7, size: 32, offset: 128)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1664, file: !1659, line: 67, baseType: !1671, size: 128, offset: 192)
!1671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1672, size: 128, elements: !1673)
!1672 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1659, line: 29, baseType: !1488)
!1673 = !{!1674}
!1674 = !DISubrange(count: 2)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1658, file: !1659, line: 77, baseType: !1662, size: 64, offset: 64)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1658, file: !1659, line: 78, baseType: !7, size: 32, offset: 128)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1658, file: !1659, line: 79, baseType: !1678, size: 64, offset: 192)
!1678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1679, size: 64)
!1679 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1659, line: 49, baseType: !1680)
!1680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1659, line: 45, size: 832, elements: !1681)
!1681 = !{!1682, !1683, !1684}
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1680, file: !1659, line: 46, baseType: !1667, size: 64)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1680, file: !1659, line: 47, baseType: !1657, size: 64, offset: 64)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1680, file: !1659, line: 48, baseType: !1685, size: 704, offset: 128)
!1685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1686, line: 164, size: 704, elements: !1687)
!1686 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1687 = !{!1688, !1689, !1699, !1700, !1701, !1702, !1703, !1704, !1708, !1712, !1713, !1714, !1715}
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1685, file: !1686, line: 166, baseType: !1490, size: 64)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1685, file: !1686, line: 167, baseType: !1690, size: 64, offset: 64)
!1690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1691, size: 64)
!1691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1686, line: 157, size: 192, elements: !1692)
!1692 = !{!1693, !1694, !1695}
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1691, file: !1686, line: 159, baseType: !1363, size: 64)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1691, file: !1686, line: 160, baseType: !1690, size: 64, offset: 64)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1691, file: !1686, line: 161, baseType: !1696, size: 32, offset: 128)
!1696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1364, size: 32, elements: !1697)
!1697 = !{!1698}
!1698 = !DISubrange(count: 4)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1685, file: !1686, line: 168, baseType: !1363, size: 64, offset: 128)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1685, file: !1686, line: 169, baseType: !1363, size: 64, offset: 192)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1685, file: !1686, line: 170, baseType: !1363, size: 64, offset: 256)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1685, file: !1686, line: 171, baseType: !1490, size: 64, offset: 320)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1685, file: !1686, line: 172, baseType: !1361, size: 32, offset: 384)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1685, file: !1686, line: 176, baseType: !1705, size: 64, offset: 448)
!1705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1706, size: 64)
!1706 = !DISubroutineType(types: !1707)
!1707 = !{!1690, !1365, !1490}
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1685, file: !1686, line: 177, baseType: !1709, size: 64, offset: 512)
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64)
!1710 = !DISubroutineType(types: !1711)
!1711 = !{null, !1365, !1690}
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1685, file: !1686, line: 178, baseType: !1365, size: 64, offset: 576)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1685, file: !1686, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1685, file: !1686, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1685, file: !1686, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !1626, file: !1608, line: 177, baseType: !1435, size: 64)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !1626, file: !1608, line: 178, baseType: !1374, size: 64)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !1626, file: !1608, line: 179, baseType: !1719, size: 64)
!1719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1720, size: 64)
!1720 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !1608, line: 150, baseType: !1721)
!1721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !1608, line: 142, size: 320, elements: !1722)
!1722 = !{!1723, !1724, !1725, !1726, !1729, !1730}
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1721, file: !1608, line: 144, baseType: !1435, size: 64)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1721, file: !1608, line: 145, baseType: !1605, size: 64, offset: 64)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1721, file: !1608, line: 146, baseType: !1605, size: 64, offset: 128)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1721, file: !1608, line: 147, baseType: !1727, size: 32, offset: 192)
!1727 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1728, line: 31, baseType: !1361)
!1728 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1721, file: !1608, line: 148, baseType: !7, size: 32, offset: 224)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1721, file: !1608, line: 149, baseType: !1360, size: 8, offset: 256)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !1626, file: !1608, line: 180, baseType: !1732, size: 64)
!1732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1733, size: 64)
!1733 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !1608, line: 162, baseType: !1734)
!1734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !1608, line: 159, size: 128, elements: !1735)
!1735 = !{!1736, !1737}
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1734, file: !1608, line: 160, baseType: !1435, size: 64)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1734, file: !1608, line: 161, baseType: !1490, size: 64, offset: 64)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !1626, file: !1608, line: 181, baseType: !1739, size: 64)
!1739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1740, size: 64)
!1740 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !1608, line: 181, flags: DIFlagFwdDecl)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !1621, file: !1608, line: 317, baseType: !1742, size: 64)
!1742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1490, size: 64, elements: !1533)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !1621, file: !1608, line: 318, baseType: !1744, size: 320)
!1744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !1608, line: 188, size: 320, elements: !1745)
!1745 = !{!1746, !1748, !1771}
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1744, file: !1608, line: 190, baseType: !1747, size: 192)
!1747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1625, size: 192, elements: !1508)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1744, file: !1608, line: 193, baseType: !1749, size: 64, offset: 192)
!1749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1750, size: 64)
!1750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !1608, line: 206, size: 320, elements: !1751)
!1751 = !{!1752, !1756, !1757, !1758, !1770}
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1750, file: !1608, line: 208, baseType: !1753, size: 64)
!1753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1754, size: 64)
!1754 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !1373, line: 62, baseType: !1755)
!1755 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1373, line: 61, flags: DIFlagFwdDecl)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1750, file: !1608, line: 211, baseType: !7, size: 32, offset: 64)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1750, file: !1608, line: 214, baseType: !1490, size: 64, offset: 128)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1750, file: !1608, line: 224, baseType: !1759, size: 64, offset: 192)
!1759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1760, size: 64)
!1760 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !1608, line: 202, baseType: !1761)
!1761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !1608, line: 202, size: 128, elements: !1762)
!1762 = !{!1763}
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1761, file: !1608, line: 202, baseType: !1764, size: 128)
!1764 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !1608, line: 200, baseType: !1765)
!1765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !1608, line: 200, size: 128, elements: !1766)
!1766 = !{!1767, !1768, !1769}
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1765, file: !1608, line: 200, baseType: !7, size: 32)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1765, file: !1608, line: 200, baseType: !7, size: 32, offset: 32)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1765, file: !1608, line: 200, baseType: !1639, size: 64, offset: 64)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1750, file: !1608, line: 234, baseType: !1759, size: 64, offset: 256)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1744, file: !1608, line: 197, baseType: !1490, size: 64, offset: 256)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !1621, file: !1608, line: 319, baseType: !1497, size: 256)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !1621, file: !1608, line: 320, baseType: !1516, size: 192)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !1437, file: !334, line: 3384, baseType: !1775, size: 1472)
!1775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !334, line: 3114, size: 1472, elements: !1776)
!1776 = !{!1777, !1798, !1799, !1800, !1801}
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1775, file: !334, line: 3115, baseType: !1778, size: 1216)
!1778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !334, line: 2984, size: 1216, elements: !1779)
!1779 = !{!1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797}
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1778, file: !334, line: 2985, baseType: !1601, size: 960)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1778, file: !334, line: 2986, baseType: !1435, size: 64, offset: 960)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1778, file: !334, line: 2987, baseType: !1435, size: 64, offset: 1024)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1778, file: !334, line: 2988, baseType: !1435, size: 64, offset: 1088)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1778, file: !334, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1778, file: !334, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1778, file: !334, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1778, file: !334, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1778, file: !334, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1778, file: !334, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1778, file: !334, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1778, file: !334, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1778, file: !334, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1778, file: !334, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1778, file: !334, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1778, file: !334, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1778, file: !334, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1778, file: !334, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1775, file: !334, line: 3117, baseType: !1435, size: 64, offset: 1216)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1775, file: !334, line: 3119, baseType: !1435, size: 64, offset: 1280)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1775, file: !334, line: 3121, baseType: !1435, size: 64, offset: 1344)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1775, file: !334, line: 3123, baseType: !1435, size: 64, offset: 1408)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !1437, file: !334, line: 3385, baseType: !1803, size: 1088)
!1803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !334, line: 2874, size: 1088, elements: !1804)
!1804 = !{!1805, !1806, !1807}
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1803, file: !334, line: 2875, baseType: !1601, size: 960)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1803, file: !334, line: 2876, baseType: !1605, size: 64, offset: 960)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1803, file: !334, line: 2877, baseType: !1808, size: 64, offset: 1024)
!1808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1809, size: 64)
!1809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1810, line: 172, size: 128, elements: !1811)
!1810 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1811 = !{!1812, !1813, !1814, !1815, !1816, !1817, !1818}
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1809, file: !1810, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1809, file: !1810, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1809, file: !1810, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1809, file: !1810, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1809, file: !1810, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1809, file: !1810, line: 195, baseType: !7, size: 32, offset: 32)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1809, file: !1810, line: 199, baseType: !1435, size: 64, offset: 64)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !1437, file: !334, line: 3386, baseType: !1778, size: 1216)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !1437, file: !334, line: 3387, baseType: !1821, size: 1280)
!1821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !334, line: 3093, size: 1280, elements: !1822)
!1822 = !{!1823, !1824}
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1821, file: !334, line: 3094, baseType: !1778, size: 1216)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1821, file: !334, line: 3095, baseType: !1808, size: 64, offset: 1216)
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !1437, file: !334, line: 3388, baseType: !1826, size: 1216)
!1826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !334, line: 2824, size: 1216, elements: !1827)
!1827 = !{!1828, !1829, !1830, !1831, !1832, !1833}
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1826, file: !334, line: 2825, baseType: !1563, size: 896)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1826, file: !334, line: 2827, baseType: !1435, size: 64, offset: 896)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1826, file: !334, line: 2828, baseType: !1435, size: 64, offset: 960)
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1826, file: !334, line: 2829, baseType: !1435, size: 64, offset: 1024)
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1826, file: !334, line: 2830, baseType: !1435, size: 64, offset: 1088)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1826, file: !334, line: 2831, baseType: !1435, size: 64, offset: 1152)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !1437, file: !334, line: 3389, baseType: !1835, size: 1024)
!1835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !334, line: 2850, size: 1024, elements: !1836)
!1836 = !{!1837, !1838, !1839}
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1835, file: !334, line: 2851, baseType: !1601, size: 960)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1835, file: !334, line: 2852, baseType: !1361, size: 32, offset: 960)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1835, file: !334, line: 2853, baseType: !1361, size: 32, offset: 992)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !1437, file: !334, line: 3390, baseType: !1841, size: 1024)
!1841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !334, line: 2857, size: 1024, elements: !1842)
!1842 = !{!1843, !1844}
!1843 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1841, file: !334, line: 2858, baseType: !1601, size: 960)
!1844 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1841, file: !334, line: 2859, baseType: !1808, size: 64, offset: 960)
!1845 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !1437, file: !334, line: 3391, baseType: !1846, size: 960)
!1846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !334, line: 2862, size: 960, elements: !1847)
!1847 = !{!1848}
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1846, file: !334, line: 2863, baseType: !1601, size: 960)
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !1437, file: !334, line: 3392, baseType: !1850, size: 1472)
!1850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !334, line: 3304, size: 1472, elements: !1851)
!1851 = !{!1852}
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1850, file: !334, line: 3305, baseType: !1775, size: 1472)
!1853 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !1437, file: !334, line: 3393, baseType: !1854, size: 1792)
!1854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !334, line: 3248, size: 1792, elements: !1855)
!1855 = !{!1856, !1857, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115}
!1856 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1854, file: !334, line: 3249, baseType: !1775, size: 1472)
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1854, file: !334, line: 3251, baseType: !1858, size: 64, offset: 1472)
!1858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1859, size: 64)
!1859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1860, line: 463, size: 1152, elements: !1861)
!1860 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1861 = !{!1862, !1865, !1895, !1896, !2036, !2039, !2040, !2041, !2042, !2043, !2044, !2068, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094}
!1862 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1859, file: !1860, line: 464, baseType: !1863, size: 64)
!1863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1864, size: 64)
!1864 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1860, line: 464, flags: DIFlagFwdDecl)
!1865 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1859, file: !1860, line: 467, baseType: !1866, size: 64, offset: 64)
!1866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1867, size: 64)
!1867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !318, line: 374, size: 640, elements: !1868)
!1868 = !{!1869, !1870, !1871, !1884, !1885, !1886, !1887, !1888, !1889, !1891, !1893, !1894}
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1867, file: !318, line: 377, baseType: !1372, size: 64)
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1867, file: !318, line: 378, baseType: !1372, size: 64, offset: 64)
!1871 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1867, file: !318, line: 381, baseType: !1872, size: 64, offset: 128)
!1872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1873, size: 64)
!1873 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !318, line: 282, baseType: !1874)
!1874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !318, line: 282, size: 128, elements: !1875)
!1875 = !{!1876}
!1876 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1874, file: !318, line: 282, baseType: !1877, size: 128)
!1877 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !318, line: 281, baseType: !1878)
!1878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !318, line: 281, size: 128, elements: !1879)
!1879 = !{!1880, !1881, !1882}
!1880 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1878, file: !318, line: 281, baseType: !7, size: 32)
!1881 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1878, file: !318, line: 281, baseType: !7, size: 32, offset: 32)
!1882 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1878, file: !318, line: 281, baseType: !1883, size: 64, offset: 64)
!1883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1372, size: 64, elements: !1533)
!1884 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1867, file: !318, line: 384, baseType: !1361, size: 32, offset: 192)
!1885 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1867, file: !318, line: 387, baseType: !1361, size: 32, offset: 224)
!1886 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1867, file: !318, line: 390, baseType: !1361, size: 32, offset: 256)
!1887 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1867, file: !318, line: 394, baseType: !1872, size: 64, offset: 320)
!1888 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1867, file: !318, line: 396, baseType: !317, size: 32, offset: 384)
!1889 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1867, file: !318, line: 399, baseType: !1890, size: 64, offset: 416)
!1890 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 64, elements: !1673)
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1867, file: !318, line: 402, baseType: !1892, size: 64, offset: 480)
!1892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1673)
!1893 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1867, file: !318, line: 406, baseType: !1361, size: 32, offset: 544)
!1894 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1867, file: !318, line: 409, baseType: !1361, size: 32, offset: 576)
!1895 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1859, file: !1860, line: 470, baseType: !1401, size: 64, offset: 128)
!1896 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1859, file: !1860, line: 473, baseType: !1897, size: 64, offset: 192)
!1897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1898, size: 64)
!1898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1810, line: 39, size: 1152, elements: !1899)
!1899 = !{!1900, !1952, !1965, !1978, !1979, !1991, !1992, !1996, !1997, !1998, !1999, !2000}
!1900 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1898, file: !1810, line: 41, baseType: !1901, size: 64)
!1901 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1902, line: 144, baseType: !1903)
!1902 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1904, size: 64)
!1904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1902, line: 100, size: 896, elements: !1905)
!1905 = !{!1906, !1914, !1919, !1924, !1926, !1929, !1930, !1931, !1932, !1933, !1938, !1940, !1941, !1946, !1951}
!1906 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1904, file: !1902, line: 102, baseType: !1907, size: 64)
!1907 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1902, line: 52, baseType: !1908)
!1908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1909, size: 64)
!1909 = !DISubroutineType(types: !1910)
!1910 = !{!1911, !1912}
!1911 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1902, line: 47, baseType: !7)
!1912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1913, size: 64)
!1913 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1914 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1904, file: !1902, line: 105, baseType: !1915, size: 64, offset: 64)
!1915 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1902, line: 59, baseType: !1916)
!1916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1917, size: 64)
!1917 = !DISubroutineType(types: !1918)
!1918 = !{!1361, !1912, !1912}
!1919 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1904, file: !1902, line: 108, baseType: !1920, size: 64, offset: 128)
!1920 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1902, line: 63, baseType: !1921)
!1921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1922, size: 64)
!1922 = !DISubroutineType(types: !1923)
!1923 = !{null, !1365}
!1924 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1904, file: !1902, line: 111, baseType: !1925, size: 64, offset: 192)
!1925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64)
!1926 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1904, file: !1902, line: 114, baseType: !1927, size: 64, offset: 256)
!1927 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1928, line: 46, baseType: !1488)
!1928 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1929 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1904, file: !1902, line: 117, baseType: !1927, size: 64, offset: 320)
!1930 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1904, file: !1902, line: 120, baseType: !1927, size: 64, offset: 384)
!1931 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1904, file: !1902, line: 124, baseType: !7, size: 32, offset: 448)
!1932 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1904, file: !1902, line: 128, baseType: !7, size: 32, offset: 480)
!1933 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1904, file: !1902, line: 131, baseType: !1934, size: 64, offset: 512)
!1934 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1902, line: 75, baseType: !1935)
!1935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1936, size: 64)
!1936 = !DISubroutineType(types: !1937)
!1937 = !{!1365, !1927, !1927}
!1938 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1904, file: !1902, line: 132, baseType: !1939, size: 64, offset: 576)
!1939 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1902, line: 78, baseType: !1921)
!1940 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1904, file: !1902, line: 135, baseType: !1365, size: 64, offset: 640)
!1941 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1904, file: !1902, line: 136, baseType: !1942, size: 64, offset: 704)
!1942 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1902, line: 82, baseType: !1943)
!1943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1944, size: 64)
!1944 = !DISubroutineType(types: !1945)
!1945 = !{!1365, !1365, !1927, !1927}
!1946 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1904, file: !1902, line: 137, baseType: !1947, size: 64, offset: 768)
!1947 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1902, line: 83, baseType: !1948)
!1948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1949, size: 64)
!1949 = !DISubroutineType(types: !1950)
!1950 = !{null, !1365, !1365}
!1951 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1904, file: !1902, line: 141, baseType: !7, size: 32, offset: 832)
!1952 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1898, file: !1810, line: 48, baseType: !1953, size: 64, offset: 64)
!1953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1954, size: 64)
!1954 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !1281, line: 35, baseType: !1955)
!1955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !1281, line: 35, size: 128, elements: !1956)
!1956 = !{!1957}
!1957 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1955, file: !1281, line: 35, baseType: !1958, size: 128)
!1958 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !1281, line: 33, baseType: !1959)
!1959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !1281, line: 33, size: 128, elements: !1960)
!1960 = !{!1961, !1962, !1963}
!1961 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1959, file: !1281, line: 33, baseType: !7, size: 32)
!1962 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1959, file: !1281, line: 33, baseType: !7, size: 32, offset: 32)
!1963 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1959, file: !1281, line: 33, baseType: !1964, size: 64, offset: 64)
!1964 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1410, size: 64, elements: !1533)
!1965 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1898, file: !1810, line: 51, baseType: !1966, size: 64, offset: 128)
!1966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1967, size: 64)
!1967 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !334, line: 183, baseType: !1968)
!1968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !334, line: 183, size: 128, elements: !1969)
!1969 = !{!1970}
!1970 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1968, file: !334, line: 183, baseType: !1971, size: 128)
!1971 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !334, line: 182, baseType: !1972)
!1972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !334, line: 182, size: 128, elements: !1973)
!1973 = !{!1974, !1975, !1976}
!1974 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1972, file: !334, line: 182, baseType: !7, size: 32)
!1975 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1972, file: !334, line: 182, baseType: !7, size: 32, offset: 32)
!1976 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1972, file: !334, line: 182, baseType: !1977, size: 64, offset: 64)
!1977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1435, size: 64, elements: !1533)
!1978 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1898, file: !1810, line: 54, baseType: !1435, size: 64, offset: 192)
!1979 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1898, file: !1810, line: 57, baseType: !1980, size: 128, offset: 256)
!1980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1981, line: 31, size: 128, elements: !1982)
!1981 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1982 = !{!1983, !1984, !1985, !1986, !1987, !1988, !1989}
!1983 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1980, file: !1981, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1984 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1980, file: !1981, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1985 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1980, file: !1981, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1986 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1980, file: !1981, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1987 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1980, file: !1981, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1988 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1980, file: !1981, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1989 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1980, file: !1981, line: 56, baseType: !1990, size: 64, offset: 64)
!1990 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !1373, line: 47, baseType: !1657)
!1991 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1898, file: !1810, line: 60, baseType: !1980, size: 128, offset: 384)
!1992 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1898, file: !1810, line: 64, baseType: !1993, size: 64, offset: 512)
!1993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1994, size: 64)
!1994 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1995, line: 33, flags: DIFlagFwdDecl)
!1995 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1996 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1898, file: !1810, line: 67, baseType: !1435, size: 64, offset: 576)
!1997 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1898, file: !1810, line: 73, baseType: !1901, size: 64, offset: 640)
!1998 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1898, file: !1810, line: 77, baseType: !1990, size: 64, offset: 704)
!1999 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1898, file: !1810, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!2000 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1898, file: !1810, line: 82, baseType: !2001, size: 320, offset: 832)
!2001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !1320, line: 62, size: 320, elements: !2002)
!2002 = !{!2003, !2009, !2010, !2011, !2012, !2019}
!2003 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !2001, file: !1320, line: 63, baseType: !2004, size: 64)
!2004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2005, size: 64)
!2005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !1320, line: 56, size: 128, elements: !2006)
!2006 = !{!2007, !2008}
!2007 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2005, file: !1320, line: 57, baseType: !2004, size: 64)
!2008 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !2005, file: !1320, line: 58, baseType: !1532, size: 8, offset: 64)
!2009 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !2001, file: !1320, line: 64, baseType: !7, size: 32, offset: 64)
!2010 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !2001, file: !1320, line: 66, baseType: !7, size: 32, offset: 96)
!2011 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !2001, file: !1320, line: 68, baseType: !1360, size: 8, offset: 128)
!2012 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !2001, file: !1320, line: 70, baseType: !2013, size: 64, offset: 192)
!2013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2014, size: 64)
!2014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1320, line: 37, size: 128, elements: !2015)
!2015 = !{!2016, !2017}
!2016 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2014, file: !1320, line: 39, baseType: !2013, size: 64)
!2017 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !2014, file: !1320, line: 40, baseType: !2018, size: 64, offset: 64)
!2018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64)
!2019 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !2001, file: !1320, line: 71, baseType: !2020, size: 64, offset: 256)
!2020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2021, size: 64)
!2021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1320, line: 45, size: 320, elements: !2022)
!2022 = !{!2023, !2024}
!2023 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2021, file: !1320, line: 47, baseType: !2020, size: 64)
!2024 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !2021, file: !1320, line: 48, baseType: !2025, size: 256, offset: 64)
!2025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !334, line: 1883, size: 256, elements: !2026)
!2026 = !{!2027, !2029, !2030, !2035}
!2027 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2025, file: !334, line: 1884, baseType: !2028, size: 64)
!2028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2025, size: 64)
!2029 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2025, file: !334, line: 1885, baseType: !2028, size: 64, offset: 64)
!2030 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !2025, file: !334, line: 1891, baseType: !2031, size: 64, offset: 128)
!2031 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !2025, file: !334, line: 1891, size: 64, elements: !2032)
!2032 = !{!2033, !2034}
!2033 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !2031, file: !334, line: 1891, baseType: !1410, size: 64)
!2034 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !2031, file: !334, line: 1891, baseType: !1435, size: 64)
!2035 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !2025, file: !334, line: 1892, baseType: !2018, size: 64, offset: 192)
!2036 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1859, file: !1860, line: 476, baseType: !2037, size: 64, offset: 256)
!2037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2038, size: 64)
!2038 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1860, line: 476, flags: DIFlagFwdDecl)
!2039 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1859, file: !1860, line: 479, baseType: !1901, size: 64, offset: 320)
!2040 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1859, file: !1860, line: 484, baseType: !1435, size: 64, offset: 384)
!2041 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1859, file: !1860, line: 488, baseType: !1435, size: 64, offset: 448)
!2042 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1859, file: !1860, line: 493, baseType: !1435, size: 64, offset: 512)
!2043 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1859, file: !1860, line: 496, baseType: !1435, size: 64, offset: 576)
!2044 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1859, file: !1860, line: 501, baseType: !2045, size: 64, offset: 640)
!2045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2046, size: 64)
!2046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !329, line: 2355, size: 576, elements: !2047)
!2047 = !{!2048, !2051, !2052, !2053, !2054, !2056, !2057, !2062, !2063, !2064, !2065, !2066, !2067}
!2048 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !2046, file: !329, line: 2356, baseType: !2049, size: 64)
!2049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2050, size: 64)
!2050 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !329, line: 2356, flags: DIFlagFwdDecl)
!2051 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !2046, file: !329, line: 2357, baseType: !1366, size: 64, offset: 64)
!2052 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !2046, file: !329, line: 2358, baseType: !1361, size: 32, offset: 128)
!2053 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !2046, file: !329, line: 2359, baseType: !1361, size: 32, offset: 160)
!2054 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !2046, file: !329, line: 2360, baseType: !2055, size: 128, offset: 192)
!2055 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1361, size: 128, elements: !1697)
!2056 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !2046, file: !329, line: 2364, baseType: !1361, size: 32, offset: 320)
!2057 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !2046, file: !329, line: 2367, baseType: !2058, size: 128, offset: 384)
!2058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !329, line: 2349, size: 128, elements: !2059)
!2059 = !{!2060, !2061}
!2060 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !2058, file: !329, line: 2351, baseType: !1605, size: 64)
!2061 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2058, file: !329, line: 2352, baseType: !1490, size: 64, offset: 64)
!2062 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !2046, file: !329, line: 2371, baseType: !328, size: 32, offset: 512)
!2063 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !2046, file: !329, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!2064 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !2046, file: !329, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!2065 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !2046, file: !329, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!2066 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !2046, file: !329, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!2067 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !2046, file: !329, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!2068 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1859, file: !1860, line: 504, baseType: !2069, size: 64, offset: 704)
!2069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2070, size: 64)
!2070 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1860, line: 504, flags: DIFlagFwdDecl)
!2071 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1859, file: !1860, line: 507, baseType: !1901, size: 64, offset: 768)
!2072 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1859, file: !1860, line: 510, baseType: !1361, size: 32, offset: 832)
!2073 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1859, file: !1860, line: 513, baseType: !1361, size: 32, offset: 864)
!2074 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1859, file: !1860, line: 516, baseType: !1428, size: 32, offset: 896)
!2075 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1859, file: !1860, line: 519, baseType: !1428, size: 32, offset: 928)
!2076 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1859, file: !1860, line: 522, baseType: !7, size: 32, offset: 960)
!2077 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1859, file: !1860, line: 523, baseType: !7, size: 32, offset: 992)
!2078 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1859, file: !1860, line: 528, baseType: !1366, size: 64, offset: 1024)
!2079 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1859, file: !1860, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!2080 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1859, file: !1860, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!2081 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1859, file: !1860, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!2082 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1859, file: !1860, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!2083 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1859, file: !1860, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!2084 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1859, file: !1860, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!2085 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1859, file: !1860, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!2086 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1859, file: !1860, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!2087 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1859, file: !1860, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!2088 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1859, file: !1860, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!2089 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1859, file: !1860, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!2090 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1859, file: !1860, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!2091 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1859, file: !1860, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!2092 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1859, file: !1860, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!2093 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1859, file: !1860, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!2094 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1859, file: !1860, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!2095 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1854, file: !334, line: 3254, baseType: !1435, size: 64, offset: 1536)
!2096 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1854, file: !334, line: 3257, baseType: !1435, size: 64, offset: 1600)
!2097 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1854, file: !334, line: 3258, baseType: !1435, size: 64, offset: 1664)
!2098 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1854, file: !334, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!2099 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1854, file: !334, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!2100 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1854, file: !334, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!2101 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1854, file: !334, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!2102 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1854, file: !334, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!2103 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1854, file: !334, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!2104 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1854, file: !334, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!2105 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1854, file: !334, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!2106 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1854, file: !334, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!2107 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1854, file: !334, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!2108 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1854, file: !334, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!2109 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1854, file: !334, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!2110 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1854, file: !334, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!2111 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1854, file: !334, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!2112 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1854, file: !334, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!2113 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1854, file: !334, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!2114 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1854, file: !334, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!2115 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1854, file: !334, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!2116 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1437, file: !334, line: 3394, baseType: !2117, size: 1344)
!2117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !334, line: 2279, size: 1344, elements: !2118)
