; ModuleID = 'tree-pretty-print.bc'
source_filename = "tree-pretty-print.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.pretty_print_info = type { %struct.output_buffer*, i8*, i32, i32, i32, %struct.pp_wrapping_mode_t, i8 (%struct.pretty_print_info*, %struct.text_info*, i8*, i32, i8, i8, i8)*, i8, i8, i8 }
%struct.output_buffer = type { %struct.obstack, %struct.obstack, %struct.obstack*, %struct.chunk_info*, %struct._IO_FILE*, i32, [128 x i8] }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, i64, i32, %struct._obstack_chunk* (i8*, i64)*, void (i8*, %struct._obstack_chunk*)*, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [4 x i8] }
%struct.chunk_info = type { %struct.chunk_info*, [60 x i8*] }
%struct.pp_wrapping_mode_t = type { i32, i32 }
%struct.text_info = type { i8*, [1 x %struct.__va_list_tag]*, i32, i32*, %union.tree_node** }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%union.tree_node = type { %struct.tree_function_decl }

!387 = !DIEnumerator(name: "DIAGNOSTICS_SHOW_PREFIX_EVERY_LINE", value: 2, isUnsigned: true)
!388 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tree_code_class", file: !135, line: 58, baseType: !7, size: 32, elements: !389)
!389 = !{!390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400}
!390 = !DIEnumerator(name: "tcc_exceptional", value: 0, isUnsigned: true)
!391 = !DIEnumerator(name: "tcc_constant", value: 1, isUnsigned: true)
!392 = !DIEnumerator(name: "tcc_type", value: 2, isUnsigned: true)
!393 = !DIEnumerator(name: "tcc_declaration", value: 3, isUnsigned: true)
!394 = !DIEnumerator(name: "tcc_reference", value: 4, isUnsigned: true)
!395 = !DIEnumerator(name: "tcc_comparison", value: 5, isUnsigned: true)
!396 = !DIEnumerator(name: "tcc_unary", value: 6, isUnsigned: true)
!397 = !DIEnumerator(name: "tcc_binary", value: 7, isUnsigned: true)
!398 = !DIEnumerator(name: "tcc_statement", value: 8, isUnsigned: true)
!399 = !DIEnumerator(name: "tcc_vl_exp", value: 9, isUnsigned: true)
!400 = !DIEnumerator(name: "tcc_expression", value: 10, isUnsigned: true)
!401 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "prediction", file: !402, line: 32, baseType: !7, size: 32, elements: !403)
!402 = !DIFile(filename: "./predict.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!403 = !{!404, !405}
!404 = !DIEnumerator(name: "NOT_TAKEN", value: 0, isUnsigned: true)
!405 = !DIEnumerator(name: "TAKEN", value: 1, isUnsigned: true)
!406 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "br_predictor", file: !402, line: 24, baseType: !7, size: 32, elements: !407)
!407 = !{!408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436}
!408 = !DIEnumerator(name: "PRED_COMBINED", value: 0, isUnsigned: true)
!409 = !DIEnumerator(name: "PRED_DS_THEORY", value: 1, isUnsigned: true)
!410 = !DIEnumerator(name: "PRED_FIRST_MATCH", value: 2, isUnsigned: true)
!411 = !DIEnumerator(name: "PRED_NO_PREDICTION", value: 3, isUnsigned: true)
!412 = !DIEnumerator(name: "PRED_UNCONDITIONAL", value: 4, isUnsigned: true)
!413 = !DIEnumerator(name: "PRED_LOOP_ITERATIONS", value: 5, isUnsigned: true)
!414 = !DIEnumerator(name: "PRED_BUILTIN_EXPECT", value: 6, isUnsigned: true)
!415 = !DIEnumerator(name: "PRED_LOOP_ITERATIONS_GUESSED", value: 7, isUnsigned: true)
!416 = !DIEnumerator(name: "PRED_CONTINUE", value: 8, isUnsigned: true)
!417 = !DIEnumerator(name: "PRED_NORETURN", value: 9, isUnsigned: true)
!418 = !DIEnumerator(name: "PRED_COLD_FUNCTION", value: 10, isUnsigned: true)
!419 = !DIEnumerator(name: "PRED_LOOP_BRANCH", value: 11, isUnsigned: true)
!420 = !DIEnumerator(name: "PRED_LOOP_EXIT", value: 12, isUnsigned: true)
!421 = !DIEnumerator(name: "PRED_POINTER", value: 13, isUnsigned: true)
!422 = !DIEnumerator(name: "PRED_TREE_POINTER", value: 14, isUnsigned: true)
!423 = !DIEnumerator(name: "PRED_OPCODE_POSITIVE", value: 15, isUnsigned: true)
!424 = !DIEnumerator(name: "PRED_OPCODE_NONEQUAL", value: 16, isUnsigned: true)
!425 = !DIEnumerator(name: "PRED_FPOPCODE", value: 17, isUnsigned: true)
!426 = !DIEnumerator(name: "PRED_TREE_OPCODE_POSITIVE", value: 18, isUnsigned: true)
!427 = !DIEnumerator(name: "PRED_TREE_OPCODE_NONEQUAL", value: 19, isUnsigned: true)
!428 = !DIEnumerator(name: "PRED_TREE_FPOPCODE", value: 20, isUnsigned: true)
!429 = !DIEnumerator(name: "PRED_CALL", value: 21, isUnsigned: true)
!430 = !DIEnumerator(name: "PRED_TREE_EARLY_RETURN", value: 22, isUnsigned: true)
!431 = !DIEnumerator(name: "PRED_GOTO", value: 23, isUnsigned: true)
!432 = !DIEnumerator(name: "PRED_CONST_RETURN", value: 24, isUnsigned: true)
!433 = !DIEnumerator(name: "PRED_NEGATIVE_RETURN", value: 25, isUnsigned: true)
!434 = !DIEnumerator(name: "PRED_NULL_RETURN", value: 26, isUnsigned: true)
!435 = !DIEnumerator(name: "PRED_MUDFLAP", value: 27, isUnsigned: true)
!436 = !DIEnumerator(name: "END_PREDICTORS", value: 28, isUnsigned: true)
!437 = !{!438, !439, !440, !441, !444, !445, !447, !134, !574, !503, !501, !401, !406}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!440 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !443)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !448, line: 56, baseType: !449)
!448 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !451)
!451 = !{!452, !485, !491, !504, !523, !534, !539, !548, !554, !567, !579, !617, !625, !653, !670, !671, !676, !685, !691, !696, !700, !704, !1287, !1336, !1342, !1348, !1355, !1368, !1382, !1399, !1411, !1433, !1448, !1620}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !450, file: !135, line: 3372, baseType: !453, size: 64)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !454)
!454 = !{!455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !453, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !453, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !453, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !453, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !453, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !453, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !453, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !453, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !453, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !453, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !453, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !453, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !453, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !453, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !453, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !453, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !453, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !453, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !453, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !453, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !453, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !453, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !453, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !453, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !453, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !453, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !453, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !453, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !453, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !453, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !450, file: !135, line: 3373, baseType: !486, size: 192)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !487)
!487 = !{!488, !489, !490}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !486, file: !135, line: 403, baseType: !453, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !486, file: !135, line: 404, baseType: !447, size: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !486, file: !135, line: 405, baseType: !447, size: 64, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !450, file: !135, line: 3374, baseType: !492, size: 320)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !493)
!493 = !{!494, !495}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !492, file: !135, line: 1385, baseType: !486, size: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !492, file: !135, line: 1386, baseType: !496, size: 128, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !497, line: 58, baseType: !498)
!497 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !497, line: 54, size: 128, elements: !499)
!499 = !{!500, !502}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !498, file: !497, line: 56, baseType: !501, size: 64)
!501 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !498, file: !497, line: 57, baseType: !503, size: 64, offset: 64)
!503 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !450, file: !135, line: 3375, baseType: !505, size: 256)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !506)
!506 = !{!507, !508}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !505, file: !135, line: 1398, baseType: !486, size: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !505, file: !135, line: 1399, baseType: !509, size: 64, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !511, line: 52, size: 256, elements: !512)
!511 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!512 = !{!513, !514, !515, !516, !517, !518, !519}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !510, file: !511, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !510, file: !511, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !510, file: !511, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !510, file: !511, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !510, file: !511, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !510, file: !511, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !510, file: !511, line: 62, baseType: !520, size: 192, offset: 64)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 192, elements: !521)
!521 = !{!522}
!522 = !DISubrange(count: 3)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !450, file: !135, line: 3376, baseType: !524, size: 256)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !525)
!525 = !{!526, !527}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !524, file: !135, line: 1409, baseType: !486, size: 192)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !524, file: !135, line: 1410, baseType: !528, size: 64, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !530, line: 27, size: 192, elements: !531)
!530 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!531 = !{!532, !533}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !529, file: !530, line: 29, baseType: !496, size: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !529, file: !530, line: 30, baseType: !5, size: 32, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !450, file: !135, line: 3377, baseType: !535, size: 256)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !536)
!536 = !{!537, !538}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !535, file: !135, line: 1438, baseType: !486, size: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !535, file: !135, line: 1439, baseType: !447, size: 64, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !450, file: !135, line: 3378, baseType: !540, size: 256)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !541)
!541 = !{!542, !543, !544}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !540, file: !135, line: 1419, baseType: !486, size: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !540, file: !135, line: 1420, baseType: !440, size: 32, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !540, file: !135, line: 1421, baseType: !545, size: 8, offset: 224)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 8, elements: !546)
!546 = !{!547}
!547 = !DISubrange(count: 1)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !450, file: !135, line: 3379, baseType: !549, size: 320)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !550)
!550 = !{!551, !552, !553}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !549, file: !135, line: 1429, baseType: !486, size: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !549, file: !135, line: 1430, baseType: !447, size: 64, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !549, file: !135, line: 1431, baseType: !447, size: 64, offset: 256)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !450, file: !135, line: 3380, baseType: !555, size: 320)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !556)
!556 = !{!557, !558}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !555, file: !135, line: 1461, baseType: !486, size: 192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !555, file: !135, line: 1462, baseType: !559, size: 128, offset: 192)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !560, line: 31, size: 128, elements: !561)
!560 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!561 = !{!562, !565, !566}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !559, file: !560, line: 32, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !439)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !559, file: !560, line: 33, baseType: !7, size: 32, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !559, file: !560, line: 34, baseType: !7, size: 32, offset: 96)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !450, file: !135, line: 3381, baseType: !568, size: 384)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !569)
!569 = !{!570, !571, !576, !577, !578}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !568, file: !135, line: 2508, baseType: !486, size: 192)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !568, file: !135, line: 2509, baseType: !572, size: 32, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !573, line: 58, baseType: !574)
!573 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !575, line: 44, baseType: !7)
!575 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!576 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !568, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !568, file: !135, line: 2511, baseType: !447, size: 64, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !568, file: !135, line: 2512, baseType: !447, size: 64, offset: 320)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !450, file: !135, line: 3382, baseType: !580, size: 896)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !580, file: !135, line: 2653, baseType: !568, size: 384)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !580, file: !135, line: 2654, baseType: !447, size: 64, offset: 384)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !580, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !580, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !580, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !580, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !580, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !580, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !580, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !580, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !580, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !580, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !580, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !580, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !580, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !580, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !580, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !580, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !580, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !580, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !580, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !580, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !580, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !580, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !580, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !580, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !580, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !580, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !580, file: !135, line: 2705, baseType: !447, size: 64, offset: 576)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !580, file: !135, line: 2706, baseType: !447, size: 64, offset: 640)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !580, file: !135, line: 2707, baseType: !447, size: 64, offset: 704)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !580, file: !135, line: 2708, baseType: !447, size: 64, offset: 768)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !580, file: !135, line: 2711, baseType: !615, size: 64, offset: 832)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !450, file: !135, line: 3383, baseType: !618, size: 960)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !619)
!619 = !{!620, !621}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !618, file: !135, line: 2757, baseType: !580, size: 896)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !618, file: !135, line: 2758, baseType: !622, size: 64, offset: 896)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !448, line: 50, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !448, line: 49, flags: DIFlagFwdDecl)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !450, file: !135, line: 3384, baseType: !626, size: 1472)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !627)
!627 = !{!628, !649, !650, !651, !652}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !626, file: !135, line: 3115, baseType: !629, size: 1216)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !630)
!630 = !{!631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !629, file: !135, line: 2985, baseType: !618, size: 960)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !629, file: !135, line: 2986, baseType: !447, size: 64, offset: 960)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !629, file: !135, line: 2987, baseType: !447, size: 64, offset: 1024)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !629, file: !135, line: 2988, baseType: !447, size: 64, offset: 1088)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !629, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !629, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !629, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !629, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !629, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !629, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !629, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !629, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !629, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !629, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !629, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !629, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !629, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !629, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !626, file: !135, line: 3117, baseType: !447, size: 64, offset: 1216)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !626, file: !135, line: 3119, baseType: !447, size: 64, offset: 1280)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !626, file: !135, line: 3121, baseType: !447, size: 64, offset: 1344)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !626, file: !135, line: 3123, baseType: !447, size: 64, offset: 1408)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !450, file: !135, line: 3385, baseType: !654, size: 1088)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !655)
!655 = !{!656, !657, !658}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !654, file: !135, line: 2875, baseType: !618, size: 960)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !654, file: !135, line: 2876, baseType: !622, size: 64, offset: 960)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !654, file: !135, line: 2877, baseType: !659, size: 64, offset: 1024)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !661, line: 172, size: 128, elements: !662)
!661 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!662 = !{!663, !664, !665, !666, !667, !668, !669}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !660, file: !661, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !660, file: !661, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !660, file: !661, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !660, file: !661, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !660, file: !661, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !660, file: !661, line: 195, baseType: !7, size: 32, offset: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !660, file: !661, line: 199, baseType: !447, size: 64, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !450, file: !135, line: 3386, baseType: !629, size: 1216)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !450, file: !135, line: 3387, baseType: !672, size: 1280)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !673)
!673 = !{!674, !675}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !672, file: !135, line: 3094, baseType: !629, size: 1216)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !672, file: !135, line: 3095, baseType: !659, size: 64, offset: 1216)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !450, file: !135, line: 3388, baseType: !677, size: 1216)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !678)
!678 = !{!679, !680, !681, !682, !683, !684}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !677, file: !135, line: 2825, baseType: !580, size: 896)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !677, file: !135, line: 2827, baseType: !447, size: 64, offset: 896)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !677, file: !135, line: 2828, baseType: !447, size: 64, offset: 960)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !677, file: !135, line: 2829, baseType: !447, size: 64, offset: 1024)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !677, file: !135, line: 2830, baseType: !447, size: 64, offset: 1088)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !677, file: !135, line: 2831, baseType: !447, size: 64, offset: 1152)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !450, file: !135, line: 3389, baseType: !686, size: 1024)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !687)
!687 = !{!688, !689, !690}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !686, file: !135, line: 2851, baseType: !618, size: 960)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !686, file: !135, line: 2852, baseType: !440, size: 32, offset: 960)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !686, file: !135, line: 2853, baseType: !440, size: 32, offset: 992)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !450, file: !135, line: 3390, baseType: !692, size: 1024)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !693)
!693 = !{!694, !695}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !692, file: !135, line: 2858, baseType: !618, size: 960)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !692, file: !135, line: 2859, baseType: !659, size: 64, offset: 960)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !450, file: !135, line: 3391, baseType: !697, size: 960)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !698)
!698 = !{!699}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !697, file: !135, line: 2863, baseType: !618, size: 960)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !450, file: !135, line: 3392, baseType: !701, size: 1472)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !702)
!702 = !{!703}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !701, file: !135, line: 3305, baseType: !626, size: 1472)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !450, file: !135, line: 3393, baseType: !705, size: 1792)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !706)
!706 = !{!707, !708, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !705, file: !135, line: 3249, baseType: !626, size: 1472)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !705, file: !135, line: 3251, baseType: !709, size: 64, offset: 1472)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !711, line: 463, size: 1152, elements: !712)
!711 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!712 = !{!713, !716, !1034, !1035, !1207, !1210, !1211, !1212, !1213, !1214, !1215, !1239, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !710, file: !711, line: 464, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !711, line: 464, flags: DIFlagFwdDecl)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !710, file: !711, line: 467, baseType: !717, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !330, line: 374, size: 640, elements: !719)
!719 = !{!720, !1009, !1010, !1023, !1024, !1025, !1026, !1027, !1028, !1030, !1032, !1033}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !718, file: !330, line: 377, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !448, line: 111, baseType: !722)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !330, line: 217, size: 832, elements: !724)
!724 = !{!725, !972, !973, !974, !977, !983, !984, !985, !1003, !1004, !1005, !1006, !1007, !1008}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !723, file: !330, line: 219, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !330, line: 151, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !330, line: 151, size: 128, elements: !729)
!729 = !{!730}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !728, file: !330, line: 151, baseType: !731, size: 128)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !330, line: 150, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !330, line: 150, size: 128, elements: !733)
!733 = !{!734, !735, !736}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !732, file: !330, line: 150, baseType: !7, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !732, file: !330, line: 150, baseType: !7, size: 32, offset: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !732, file: !330, line: 150, baseType: !737, size: 64, offset: 64)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !738, size: 64, elements: !546)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !448, line: 108, baseType: !739)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !330, line: 122, size: 512, elements: !741)
!741 = !{!742, !743, !744, !964, !965, !966, !967, !968, !969, !970}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !740, file: !330, line: 124, baseType: !722, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !740, file: !330, line: 125, baseType: !722, size: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !740, file: !330, line: 131, baseType: !745, size: 64, offset: 128)
!745 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !330, line: 128, size: 64, elements: !746)
!746 = !{!747, !963}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !745, file: !330, line: 129, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !448, line: 66, baseType: !749)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !751, line: 143, size: 192, elements: !752)
!751 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!752 = !{!753, !961, !962}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !750, file: !751, line: 145, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !448, line: 69, baseType: !755)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !751, line: 136, size: 192, elements: !757)
!757 = !{!758, !959, !960}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !756, file: !751, line: 137, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !448, line: 58, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !751, line: 737, size: 768, elements: !762)
!762 = !{!763, !780, !814, !820, !825, !830, !837, !843, !849, !854, !868, !873, !879, !884, !894, !899, !917, !924, !931, !937, !942, !948, !954}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !761, file: !751, line: 738, baseType: !764, size: 256)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !751, line: 271, size: 256, elements: !765)
!765 = !{!766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !764, file: !751, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !764, file: !751, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !764, file: !751, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !764, file: !751, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !764, file: !751, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !764, file: !751, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !764, file: !751, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !764, file: !751, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !764, file: !751, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !764, file: !751, line: 312, baseType: !7, size: 32, offset: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !764, file: !751, line: 316, baseType: !572, size: 32, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !764, file: !751, line: 319, baseType: !7, size: 32, offset: 96)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !764, file: !751, line: 323, baseType: !722, size: 64, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !764, file: !751, line: 327, baseType: !447, size: 64, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !761, file: !751, line: 739, baseType: !781, size: 448)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !751, line: 350, size: 448, elements: !782)
!782 = !{!783, !812}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !781, file: !751, line: 353, baseType: !784, size: 384)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !751, line: 333, size: 384, elements: !785)
!785 = !{!786, !787, !795}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !784, file: !751, line: 336, baseType: !764, size: 256)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !784, file: !751, line: 343, baseType: !788, size: 64, offset: 256)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !790, line: 37, size: 128, elements: !791)
!790 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!791 = !{!792, !793}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !789, file: !790, line: 39, baseType: !788, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !789, file: !790, line: 40, baseType: !794, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !784, file: !751, line: 344, baseType: !796, size: 64, offset: 320)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !790, line: 45, size: 320, elements: !798)
!798 = !{!799, !800}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !797, file: !790, line: 47, baseType: !796, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !797, file: !790, line: 48, baseType: !801, size: 256, offset: 64)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !802)
!802 = !{!803, !805, !806, !811}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !801, file: !135, line: 1884, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !801, file: !135, line: 1885, baseType: !804, size: 64, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !801, file: !135, line: 1891, baseType: !807, size: 64, offset: 128)
!807 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !801, file: !135, line: 1891, size: 64, elements: !808)
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !807, file: !135, line: 1891, baseType: !759, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !807, file: !135, line: 1891, baseType: !447, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !801, file: !135, line: 1892, baseType: !794, size: 64, offset: 192)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !781, file: !751, line: 359, baseType: !813, size: 64, offset: 384)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !447, size: 64, elements: !546)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !761, file: !751, line: 740, baseType: !815, size: 512)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !751, line: 365, size: 512, elements: !816)
!816 = !{!817, !818, !819}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !815, file: !751, line: 368, baseType: !784, size: 384)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !815, file: !751, line: 373, baseType: !447, size: 64, offset: 384)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !815, file: !751, line: 374, baseType: !447, size: 64, offset: 448)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !761, file: !751, line: 741, baseType: !821, size: 576)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !751, line: 380, size: 576, elements: !822)
!822 = !{!823, !824}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !821, file: !751, line: 383, baseType: !815, size: 512)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !821, file: !751, line: 389, baseType: !813, size: 64, offset: 512)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !761, file: !751, line: 742, baseType: !826, size: 320)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !751, line: 395, size: 320, elements: !827)
!827 = !{!828, !829}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !826, file: !751, line: 397, baseType: !764, size: 256)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !826, file: !751, line: 400, baseType: !748, size: 64, offset: 256)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !761, file: !751, line: 743, baseType: !831, size: 448)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !751, line: 406, size: 448, elements: !832)
!832 = !{!833, !834, !835, !836}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !831, file: !751, line: 408, baseType: !764, size: 256)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !831, file: !751, line: 412, baseType: !447, size: 64, offset: 256)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !831, file: !751, line: 420, baseType: !447, size: 64, offset: 320)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !831, file: !751, line: 423, baseType: !748, size: 64, offset: 384)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !761, file: !751, line: 744, baseType: !838, size: 384)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !751, line: 429, size: 384, elements: !839)
!839 = !{!840, !841, !842}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !838, file: !751, line: 431, baseType: !764, size: 256)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !838, file: !751, line: 434, baseType: !447, size: 64, offset: 256)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !838, file: !751, line: 437, baseType: !748, size: 64, offset: 320)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !761, file: !751, line: 745, baseType: !844, size: 384)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !751, line: 443, size: 384, elements: !845)
!845 = !{!846, !847, !848}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !844, file: !751, line: 445, baseType: !764, size: 256)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !844, file: !751, line: 449, baseType: !447, size: 64, offset: 256)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !844, file: !751, line: 453, baseType: !748, size: 64, offset: 320)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !761, file: !751, line: 746, baseType: !850, size: 320)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !751, line: 459, size: 320, elements: !851)
!851 = !{!852, !853}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !850, file: !751, line: 461, baseType: !764, size: 256)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !850, file: !751, line: 464, baseType: !447, size: 64, offset: 256)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !761, file: !751, line: 747, baseType: !855, size: 768)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !751, line: 469, size: 768, elements: !856)
!856 = !{!857, !858, !859, !860, !861}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !855, file: !751, line: 471, baseType: !764, size: 256)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !855, file: !751, line: 474, baseType: !7, size: 32, offset: 256)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !855, file: !751, line: 475, baseType: !7, size: 32, offset: 288)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !855, file: !751, line: 478, baseType: !447, size: 64, offset: 320)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !855, file: !751, line: 481, baseType: !862, size: 384, offset: 384)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !863, size: 384, elements: !546)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !864)
!864 = !{!865, !866, !867}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !863, file: !135, line: 1920, baseType: !801, size: 256)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !863, file: !135, line: 1921, baseType: !447, size: 64, offset: 256)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !863, file: !135, line: 1922, baseType: !572, size: 32, offset: 320)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !761, file: !751, line: 748, baseType: !869, size: 320)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !751, line: 487, size: 320, elements: !870)
!870 = !{!871, !872}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !869, file: !751, line: 490, baseType: !764, size: 256)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !869, file: !751, line: 494, baseType: !440, size: 32, offset: 256)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !761, file: !751, line: 749, baseType: !874, size: 384)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !751, line: 500, size: 384, elements: !875)
!875 = !{!876, !877, !878}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !874, file: !751, line: 502, baseType: !764, size: 256)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !874, file: !751, line: 506, baseType: !748, size: 64, offset: 256)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !874, file: !751, line: 510, baseType: !748, size: 64, offset: 320)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !761, file: !751, line: 750, baseType: !880, size: 320)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !751, line: 529, size: 320, elements: !881)
!881 = !{!882, !883}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !880, file: !751, line: 531, baseType: !764, size: 256)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !880, file: !751, line: 540, baseType: !748, size: 64, offset: 256)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !761, file: !751, line: 751, baseType: !885, size: 704)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !751, line: 546, size: 704, elements: !886)
!886 = !{!887, !888, !889, !890, !891, !892, !893}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !885, file: !751, line: 549, baseType: !815, size: 512)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !885, file: !751, line: 553, baseType: !445, size: 64, offset: 512)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !885, file: !751, line: 557, baseType: !439, size: 8, offset: 576)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !885, file: !751, line: 558, baseType: !439, size: 8, offset: 584)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !885, file: !751, line: 559, baseType: !439, size: 8, offset: 592)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !885, file: !751, line: 560, baseType: !439, size: 8, offset: 600)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !885, file: !751, line: 566, baseType: !813, size: 64, offset: 640)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !761, file: !751, line: 752, baseType: !895, size: 384)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !751, line: 571, size: 384, elements: !896)
!896 = !{!897, !898}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !895, file: !751, line: 573, baseType: !826, size: 320)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !895, file: !751, line: 577, baseType: !447, size: 64, offset: 320)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !761, file: !751, line: 753, baseType: !900, size: 576)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !751, line: 600, size: 576, elements: !901)
!901 = !{!902, !903, !904, !907, !916}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !900, file: !751, line: 602, baseType: !826, size: 320)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !900, file: !751, line: 605, baseType: !447, size: 64, offset: 320)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !900, file: !751, line: 609, baseType: !905, size: 64, offset: 384)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !906, line: 46, baseType: !501)
!906 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!907 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !900, file: !751, line: 612, baseType: !908, size: 64, offset: 448)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !751, line: 581, size: 320, elements: !910)
!910 = !{!911, !912, !913, !914, !915}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !909, file: !751, line: 583, baseType: !134, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !909, file: !751, line: 586, baseType: !447, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !909, file: !751, line: 589, baseType: !447, size: 64, offset: 128)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !909, file: !751, line: 592, baseType: !447, size: 64, offset: 192)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !909, file: !751, line: 595, baseType: !447, size: 64, offset: 256)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !900, file: !751, line: 616, baseType: !748, size: 64, offset: 512)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !761, file: !751, line: 754, baseType: !918, size: 512)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !751, line: 622, size: 512, elements: !919)
!919 = !{!920, !921, !922, !923}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !918, file: !751, line: 624, baseType: !826, size: 320)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !918, file: !751, line: 628, baseType: !447, size: 64, offset: 320)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !918, file: !751, line: 632, baseType: !447, size: 64, offset: 384)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !918, file: !751, line: 636, baseType: !447, size: 64, offset: 448)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !761, file: !751, line: 755, baseType: !925, size: 704)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !751, line: 642, size: 704, elements: !926)
!926 = !{!927, !928, !929, !930}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !925, file: !751, line: 644, baseType: !918, size: 512)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !925, file: !751, line: 648, baseType: !447, size: 64, offset: 512)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !925, file: !751, line: 652, baseType: !447, size: 64, offset: 576)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !925, file: !751, line: 653, baseType: !447, size: 64, offset: 640)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !761, file: !751, line: 756, baseType: !932, size: 448)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !751, line: 663, size: 448, elements: !933)
!933 = !{!934, !935, !936}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !932, file: !751, line: 665, baseType: !826, size: 320)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !932, file: !751, line: 668, baseType: !447, size: 64, offset: 320)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !932, file: !751, line: 673, baseType: !447, size: 64, offset: 384)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !761, file: !751, line: 757, baseType: !938, size: 384)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !751, line: 694, size: 384, elements: !939)
!939 = !{!940, !941}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !938, file: !751, line: 696, baseType: !826, size: 320)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !938, file: !751, line: 699, baseType: !447, size: 64, offset: 320)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !761, file: !751, line: 758, baseType: !943, size: 384)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !751, line: 681, size: 384, elements: !944)
!944 = !{!945, !946, !947}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !943, file: !751, line: 683, baseType: !764, size: 256)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !943, file: !751, line: 686, baseType: !447, size: 64, offset: 256)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !943, file: !751, line: 689, baseType: !447, size: 64, offset: 320)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !761, file: !751, line: 759, baseType: !949, size: 384)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !751, line: 707, size: 384, elements: !950)
!950 = !{!951, !952, !953}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !949, file: !751, line: 709, baseType: !764, size: 256)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !949, file: !751, line: 712, baseType: !447, size: 64, offset: 256)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !949, file: !751, line: 712, baseType: !447, size: 64, offset: 320)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !761, file: !751, line: 760, baseType: !955, size: 320)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !751, line: 718, size: 320, elements: !956)
!956 = !{!957, !958}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !955, file: !751, line: 720, baseType: !764, size: 256)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !955, file: !751, line: 723, baseType: !447, size: 64, offset: 256)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !756, file: !751, line: 138, baseType: !755, size: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !756, file: !751, line: 139, baseType: !755, size: 64, offset: 128)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !750, file: !751, line: 146, baseType: !754, size: 64, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !750, file: !751, line: 152, baseType: !748, size: 64, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !745, file: !330, line: 130, baseType: !622, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !740, file: !330, line: 134, baseType: !444, size: 64, offset: 192)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !740, file: !330, line: 137, baseType: !447, size: 64, offset: 256)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !740, file: !330, line: 138, baseType: !572, size: 32, offset: 320)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !740, file: !330, line: 142, baseType: !7, size: 32, offset: 352)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !740, file: !330, line: 144, baseType: !440, size: 32, offset: 384)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !740, file: !330, line: 145, baseType: !440, size: 32, offset: 416)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !740, file: !330, line: 146, baseType: !971, size: 64, offset: 448)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !330, line: 119, baseType: !503)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !723, file: !330, line: 220, baseType: !726, size: 64, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !723, file: !330, line: 223, baseType: !444, size: 64, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !723, file: !330, line: 226, baseType: !975, size: 64, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 185, flags: DIFlagFwdDecl)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !723, file: !330, line: 229, baseType: !978, size: 128, offset: 256)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !979, size: 128, elements: !981)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !330, line: 229, flags: DIFlagFwdDecl)
!981 = !{!982}
!982 = !DISubrange(count: 2)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !723, file: !330, line: 232, baseType: !722, size: 64, offset: 384)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !723, file: !330, line: 233, baseType: !722, size: 64, offset: 448)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !723, file: !330, line: 238, baseType: !986, size: 64, offset: 512)
!986 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !330, line: 235, size: 64, elements: !987)
!987 = !{!988, !994}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !986, file: !330, line: 236, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !330, line: 273, size: 128, elements: !991)
!991 = !{!992, !993}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !990, file: !330, line: 275, baseType: !748, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !990, file: !330, line: 278, baseType: !748, size: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !986, file: !330, line: 237, baseType: !995, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !330, line: 259, size: 320, elements: !997)
!997 = !{!998, !999, !1000, !1001, !1002}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !996, file: !330, line: 261, baseType: !622, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !996, file: !330, line: 262, baseType: !622, size: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !996, file: !330, line: 266, baseType: !622, size: 64, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !996, file: !330, line: 267, baseType: !622, size: 64, offset: 192)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !996, file: !330, line: 270, baseType: !440, size: 32, offset: 256)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !723, file: !330, line: 241, baseType: !971, size: 64, offset: 576)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !723, file: !330, line: 244, baseType: !440, size: 32, offset: 640)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !723, file: !330, line: 247, baseType: !440, size: 32, offset: 672)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !723, file: !330, line: 250, baseType: !440, size: 32, offset: 704)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !723, file: !330, line: 253, baseType: !440, size: 32, offset: 736)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !723, file: !330, line: 256, baseType: !440, size: 32, offset: 768)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !718, file: !330, line: 378, baseType: !721, size: 64, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !718, file: !330, line: 381, baseType: !1011, size: 64, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !330, line: 282, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !330, line: 282, size: 128, elements: !1014)
!1014 = !{!1015}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1013, file: !330, line: 282, baseType: !1016, size: 128)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !330, line: 281, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !330, line: 281, size: 128, elements: !1018)
!1018 = !{!1019, !1020, !1021}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1017, file: !330, line: 281, baseType: !7, size: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1017, file: !330, line: 281, baseType: !7, size: 32, offset: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1017, file: !330, line: 281, baseType: !1022, size: 64, offset: 64)
!1022 = !DICompositeType(tag: DW_TAG_array_type, baseType: !721, size: 64, elements: !546)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !718, file: !330, line: 384, baseType: !440, size: 32, offset: 192)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !718, file: !330, line: 387, baseType: !440, size: 32, offset: 224)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !718, file: !330, line: 390, baseType: !440, size: 32, offset: 256)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !718, file: !330, line: 394, baseType: !1011, size: 64, offset: 320)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !718, file: !330, line: 396, baseType: !329, size: 32, offset: 384)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !718, file: !330, line: 399, baseType: !1029, size: 64, offset: 416)
!1029 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 64, elements: !981)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !718, file: !330, line: 402, baseType: !1031, size: 64, offset: 480)
!1031 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !981)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !718, file: !330, line: 406, baseType: !440, size: 32, offset: 544)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !718, file: !330, line: 409, baseType: !440, size: 32, offset: 576)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !710, file: !711, line: 470, baseType: !749, size: 64, offset: 128)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !710, file: !711, line: 473, baseType: !1036, size: 64, offset: 192)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !661, line: 39, size: 1152, elements: !1038)
!1038 = !{!1039, !1089, !1102, !1114, !1115, !1184, !1185, !1189, !1190, !1191, !1192, !1193}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1037, file: !661, line: 41, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1041, line: 144, baseType: !1042)
!1041 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1041, line: 100, size: 896, elements: !1044)
!1044 = !{!1045, !1053, !1058, !1063, !1065, !1066, !1067, !1068, !1069, !1070, !1075, !1077, !1078, !1083, !1088}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1043, file: !1041, line: 102, baseType: !1046, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1041, line: 52, baseType: !1047)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!1050, !1051}
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1041, line: 47, baseType: !7)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1043, file: !1041, line: 105, baseType: !1054, size: 64, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1041, line: 59, baseType: !1055)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!440, !1051, !1051}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1043, file: !1041, line: 108, baseType: !1059, size: 64, offset: 128)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1041, line: 63, baseType: !1060)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{null, !444}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1043, file: !1041, line: 111, baseType: !1064, size: 64, offset: 192)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1043, file: !1041, line: 114, baseType: !905, size: 64, offset: 256)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1043, file: !1041, line: 117, baseType: !905, size: 64, offset: 320)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1043, file: !1041, line: 120, baseType: !905, size: 64, offset: 384)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1043, file: !1041, line: 124, baseType: !7, size: 32, offset: 448)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1043, file: !1041, line: 128, baseType: !7, size: 32, offset: 480)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1043, file: !1041, line: 131, baseType: !1071, size: 64, offset: 512)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1041, line: 75, baseType: !1072)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!444, !905, !905}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1043, file: !1041, line: 132, baseType: !1076, size: 64, offset: 576)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1041, line: 78, baseType: !1060)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1043, file: !1041, line: 135, baseType: !444, size: 64, offset: 640)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1043, file: !1041, line: 136, baseType: !1079, size: 64, offset: 704)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1041, line: 82, baseType: !1080)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!444, !444, !905, !905}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1043, file: !1041, line: 137, baseType: !1084, size: 64, offset: 768)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1041, line: 83, baseType: !1085)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{null, !444, !444}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1043, file: !1041, line: 141, baseType: !7, size: 32, offset: 832)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1037, file: !661, line: 48, baseType: !1090, size: 64, offset: 64)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !751, line: 35, baseType: !1092)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !751, line: 35, size: 128, elements: !1093)
!1093 = !{!1094}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1092, file: !751, line: 35, baseType: !1095, size: 128)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !751, line: 33, baseType: !1096)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !751, line: 33, size: 128, elements: !1097)
!1097 = !{!1098, !1099, !1100}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1096, file: !751, line: 33, baseType: !7, size: 32)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1096, file: !751, line: 33, baseType: !7, size: 32, offset: 32)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1096, file: !751, line: 33, baseType: !1101, size: 64, offset: 64)
!1101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !759, size: 64, elements: !546)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1037, file: !661, line: 51, baseType: !1103, size: 64, offset: 128)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !135, line: 183, baseType: !1105)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !135, line: 183, size: 128, elements: !1106)
!1106 = !{!1107}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1105, file: !135, line: 183, baseType: !1108, size: 128)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !135, line: 182, baseType: !1109)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !135, line: 182, size: 128, elements: !1110)
!1110 = !{!1111, !1112, !1113}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1109, file: !135, line: 182, baseType: !7, size: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1109, file: !135, line: 182, baseType: !7, size: 32, offset: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1109, file: !135, line: 182, baseType: !813, size: 64, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1037, file: !661, line: 54, baseType: !447, size: 64, offset: 192)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1037, file: !661, line: 57, baseType: !1116, size: 128, offset: 256)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1117, line: 31, size: 128, elements: !1118)
!1117 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1118 = !{!1119, !1120, !1121, !1122, !1123, !1124, !1125}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1116, file: !1117, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1116, file: !1117, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1116, file: !1117, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1116, file: !1117, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1116, file: !1117, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1116, file: !1117, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1116, file: !1117, line: 56, baseType: !1126, size: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !448, line: 47, baseType: !1127)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1129, line: 75, size: 256, elements: !1130)
!1129 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1130 = !{!1131, !1143, !1144, !1145}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1128, file: !1129, line: 76, baseType: !1132, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1129, line: 68, baseType: !1134)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1129, line: 63, size: 320, elements: !1135)
!1135 = !{!1136, !1138, !1139, !1140}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1134, file: !1129, line: 64, baseType: !1137, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1134, file: !1129, line: 65, baseType: !1137, size: 64, offset: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1134, file: !1129, line: 66, baseType: !7, size: 32, offset: 128)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1134, file: !1129, line: 67, baseType: !1141, size: 128, offset: 192)
!1141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1142, size: 128, elements: !981)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1129, line: 29, baseType: !501)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1128, file: !1129, line: 77, baseType: !1132, size: 64, offset: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1128, file: !1129, line: 78, baseType: !7, size: 32, offset: 128)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1128, file: !1129, line: 79, baseType: !1146, size: 64, offset: 192)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1129, line: 49, baseType: !1148)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1129, line: 45, size: 832, elements: !1149)
!1149 = !{!1150, !1151, !1152}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1148, file: !1129, line: 46, baseType: !1137, size: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1148, file: !1129, line: 47, baseType: !1127, size: 64, offset: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1148, file: !1129, line: 48, baseType: !1153, size: 704, offset: 128)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1154, line: 164, size: 704, elements: !1155)
!1154 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1155 = !{!1156, !1157, !1167, !1168, !1169, !1170, !1171, !1172, !1176, !1180, !1181, !1182, !1183}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1153, file: !1154, line: 166, baseType: !503, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1153, file: !1154, line: 167, baseType: !1158, size: 64, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1154, line: 157, size: 192, elements: !1160)
!1160 = !{!1161, !1162, !1163}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1159, file: !1154, line: 159, baseType: !442, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1159, file: !1154, line: 160, baseType: !1158, size: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1159, file: !1154, line: 161, baseType: !1164, size: 32, offset: 128)
!1164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 32, elements: !1165)
!1165 = !{!1166}
!1166 = !DISubrange(count: 4)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1153, file: !1154, line: 168, baseType: !442, size: 64, offset: 128)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1153, file: !1154, line: 169, baseType: !442, size: 64, offset: 192)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1153, file: !1154, line: 170, baseType: !442, size: 64, offset: 256)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1153, file: !1154, line: 171, baseType: !503, size: 64, offset: 320)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1153, file: !1154, line: 172, baseType: !440, size: 32, offset: 384)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1153, file: !1154, line: 176, baseType: !1173, size: 64, offset: 448)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = !DISubroutineType(types: !1175)
!1175 = !{!1158, !444, !503}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1153, file: !1154, line: 177, baseType: !1177, size: 64, offset: 512)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{null, !444, !1158}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1153, file: !1154, line: 178, baseType: !444, size: 64, offset: 576)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1153, file: !1154, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1153, file: !1154, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1153, file: !1154, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1037, file: !661, line: 60, baseType: !1116, size: 128, offset: 384)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1037, file: !661, line: 64, baseType: !1186, size: 64, offset: 512)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1188, line: 33, flags: DIFlagFwdDecl)
!1188 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1037, file: !661, line: 67, baseType: !447, size: 64, offset: 576)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1037, file: !661, line: 73, baseType: !1040, size: 64, offset: 640)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1037, file: !661, line: 77, baseType: !1126, size: 64, offset: 704)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1037, file: !661, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1037, file: !661, line: 82, baseType: !1194, size: 320, offset: 832)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !790, line: 62, size: 320, elements: !1195)
!1195 = !{!1196, !1202, !1203, !1204, !1205, !1206}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1194, file: !790, line: 63, baseType: !1197, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !790, line: 56, size: 128, elements: !1199)
!1199 = !{!1200, !1201}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1198, file: !790, line: 57, baseType: !1197, size: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1198, file: !790, line: 58, baseType: !545, size: 8, offset: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1194, file: !790, line: 64, baseType: !7, size: 32, offset: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1194, file: !790, line: 66, baseType: !7, size: 32, offset: 96)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1194, file: !790, line: 68, baseType: !439, size: 8, offset: 128)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1194, file: !790, line: 70, baseType: !788, size: 64, offset: 192)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1194, file: !790, line: 71, baseType: !796, size: 64, offset: 256)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !710, file: !711, line: 476, baseType: !1208, size: 64, offset: 256)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !711, line: 476, flags: DIFlagFwdDecl)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !710, file: !711, line: 479, baseType: !1040, size: 64, offset: 320)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !710, file: !711, line: 484, baseType: !447, size: 64, offset: 384)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !710, file: !711, line: 488, baseType: !447, size: 64, offset: 448)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !710, file: !711, line: 493, baseType: !447, size: 64, offset: 512)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !710, file: !711, line: 496, baseType: !447, size: 64, offset: 576)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !710, file: !711, line: 501, baseType: !1216, size: 64, offset: 640)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !341, line: 2355, size: 576, elements: !1218)
!1218 = !{!1219, !1222, !1223, !1224, !1225, !1227, !1228, !1233, !1234, !1235, !1236, !1237, !1238}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1217, file: !341, line: 2356, baseType: !1220, size: 64)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !341, line: 2356, flags: DIFlagFwdDecl)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1217, file: !341, line: 2357, baseType: !445, size: 64, offset: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1217, file: !341, line: 2358, baseType: !440, size: 32, offset: 128)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1217, file: !341, line: 2359, baseType: !440, size: 32, offset: 160)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1217, file: !341, line: 2360, baseType: !1226, size: 128, offset: 192)
!1226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 128, elements: !1165)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1217, file: !341, line: 2364, baseType: !440, size: 32, offset: 320)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1217, file: !341, line: 2367, baseType: !1229, size: 128, offset: 384)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !341, line: 2349, size: 128, elements: !1230)
!1230 = !{!1231, !1232}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1229, file: !341, line: 2351, baseType: !622, size: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1229, file: !341, line: 2352, baseType: !503, size: 64, offset: 64)
