; ModuleID = 'tree-ssa-loop-prefetch.bc'
source_filename = "tree-ssa-loop-prefetch.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.param_info = type { i8*, i32, i8, i32, i32, i8* }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }

!1901 = !DIEnumerator(name: "CODE_FOR_vrotlv16qi3", value: 2907, isUnsigned: true)
!1902 = !DIEnumerator(name: "CODE_FOR_vrotlv8hi3", value: 2908, isUnsigned: true)
!1903 = !DIEnumerator(name: "CODE_FOR_vrotlv4si3", value: 2909, isUnsigned: true)
!1904 = !DIEnumerator(name: "CODE_FOR_vrotlv2di3", value: 2910, isUnsigned: true)
!1905 = !DIEnumerator(name: "CODE_FOR_vlshrv16qi3", value: 2911, isUnsigned: true)
!1906 = !DIEnumerator(name: "CODE_FOR_vlshrv8hi3", value: 2912, isUnsigned: true)
!1907 = !DIEnumerator(name: "CODE_FOR_vlshrv4si3", value: 2913, isUnsigned: true)
!1908 = !DIEnumerator(name: "CODE_FOR_vashrv16qi3", value: 2914, isUnsigned: true)
!1909 = !DIEnumerator(name: "CODE_FOR_vashrv8hi3", value: 2915, isUnsigned: true)
!1910 = !DIEnumerator(name: "CODE_FOR_vashrv4si3", value: 2916, isUnsigned: true)
!1911 = !DIEnumerator(name: "CODE_FOR_vashlv16qi3", value: 2917, isUnsigned: true)
!1912 = !DIEnumerator(name: "CODE_FOR_vashlv8hi3", value: 2918, isUnsigned: true)
!1913 = !DIEnumerator(name: "CODE_FOR_vashlv4si3", value: 2919, isUnsigned: true)
!1914 = !DIEnumerator(name: "CODE_FOR_ashlv16qi3", value: 2920, isUnsigned: true)
!1915 = !DIEnumerator(name: "CODE_FOR_lshlv16qi3", value: 2921, isUnsigned: true)
!1916 = !DIEnumerator(name: "CODE_FOR_ashrv16qi3", value: 2922, isUnsigned: true)
!1917 = !DIEnumerator(name: "CODE_FOR_ashrv2di3", value: 2923, isUnsigned: true)
!1918 = !DIEnumerator(name: "CODE_FOR_avx_vzeroall", value: 2924, isUnsigned: true)
!1919 = !DIEnumerator(name: "CODE_FOR_avx_vzeroupper", value: 2925, isUnsigned: true)
!1920 = !DIEnumerator(name: "CODE_FOR_avx_vpermilv2df", value: 2932, isUnsigned: true)
!1921 = !DIEnumerator(name: "CODE_FOR_avx_vpermilv4df", value: 2933, isUnsigned: true)
!1922 = !DIEnumerator(name: "CODE_FOR_avx_vpermilv4sf", value: 2934, isUnsigned: true)
!1923 = !DIEnumerator(name: "CODE_FOR_avx_vpermilv8sf", value: 2935, isUnsigned: true)
!1924 = !DIEnumerator(name: "CODE_FOR_avx_vperm2f128v8si3", value: 2936, isUnsigned: true)
!1925 = !DIEnumerator(name: "CODE_FOR_avx_vperm2f128v8sf3", value: 2937, isUnsigned: true)
!1926 = !DIEnumerator(name: "CODE_FOR_avx_vperm2f128v4df3", value: 2938, isUnsigned: true)
!1927 = !DIEnumerator(name: "CODE_FOR_avx_vinsertf128v32qi", value: 2939, isUnsigned: true)
!1928 = !DIEnumerator(name: "CODE_FOR_avx_vinsertf128v16hi", value: 2940, isUnsigned: true)
!1929 = !DIEnumerator(name: "CODE_FOR_avx_vinsertf128v8si", value: 2941, isUnsigned: true)
!1930 = !DIEnumerator(name: "CODE_FOR_avx_vinsertf128v4di", value: 2942, isUnsigned: true)
!1931 = !DIEnumerator(name: "CODE_FOR_avx_vinsertf128v8sf", value: 2943, isUnsigned: true)
!1932 = !DIEnumerator(name: "CODE_FOR_avx_vinsertf128v4df", value: 2944, isUnsigned: true)
!1933 = !DIEnumerator(name: "CODE_FOR_vec_initv32qi", value: 2945, isUnsigned: true)
!1934 = !DIEnumerator(name: "CODE_FOR_vec_initv16hi", value: 2946, isUnsigned: true)
!1935 = !DIEnumerator(name: "CODE_FOR_vec_initv8si", value: 2947, isUnsigned: true)
!1936 = !DIEnumerator(name: "CODE_FOR_vec_initv4di", value: 2948, isUnsigned: true)
!1937 = !DIEnumerator(name: "CODE_FOR_vec_initv8sf", value: 2949, isUnsigned: true)
!1938 = !DIEnumerator(name: "CODE_FOR_vec_initv4df", value: 2950, isUnsigned: true)
!1939 = !DIEnumerator(name: "CODE_FOR_memory_barrier", value: 2951, isUnsigned: true)
!1940 = !DIEnumerator(name: "CODE_FOR_sync_compare_and_swapqi", value: 2952, isUnsigned: true)
!1941 = !DIEnumerator(name: "CODE_FOR_sync_compare_and_swaphi", value: 2953, isUnsigned: true)
!1942 = !DIEnumerator(name: "CODE_FOR_sync_compare_and_swapsi", value: 2954, isUnsigned: true)
!1943 = !DIEnumerator(name: "CODE_FOR_sync_compare_and_swapdi", value: 2955, isUnsigned: true)
!1944 = !DIEnumerator(name: "CODE_FOR_nothing", value: 2956, isUnsigned: true)
!1945 = !{!1946, !1947, !1948, !1949, !1952, !1953, !5, !1955, !3340, !2522, !181, !2280, !3353, !2314, !1950, !3355, !3363, !3369, !2009, !3385, !3386, !3399, !3361, !3458, !2011, !2259, !2082}
!1946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1947, size: 64)
!1947 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1948 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1950, size: 64)
!1950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1951, size: 64)
!1951 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!1952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1954, size: 64)
!1954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1951)
!1955 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !1956, line: 56, baseType: !1957)
!1956 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1958, size: 64)
!1958 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !149, line: 3371, size: 1792, elements: !1959)
!1959 = !{!1960, !1993, !1999, !2012, !2031, !2042, !2047, !2056, !2062, !2075, !2087, !2125, !2670, !2698, !2715, !2716, !2721, !2730, !2736, !2741, !2745, !2749, !2991, !3038, !3044, !3050, !3057, !3070, !3084, !3101, !3113, !3135, !3150, !3322}
!1960 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1958, file: !149, line: 3372, baseType: !1961, size: 64)
!1961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !149, line: 360, size: 64, elements: !1962)
!1962 = !{!1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1990, !1991, !1992}
!1963 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1961, file: !149, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1964 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !1961, file: !149, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1965 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !1961, file: !149, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1966 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !1961, file: !149, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1967 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !1961, file: !149, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1968 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !1961, file: !149, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1969 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !1961, file: !149, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1970 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !1961, file: !149, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1971 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !1961, file: !149, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1972 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !1961, file: !149, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1973 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !1961, file: !149, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1974 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !1961, file: !149, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1975 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !1961, file: !149, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1976 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !1961, file: !149, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1977 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !1961, file: !149, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1978 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !1961, file: !149, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1979 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !1961, file: !149, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1980 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !1961, file: !149, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1981 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1961, file: !149, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1982 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1961, file: !149, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1983 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1961, file: !149, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1984 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1961, file: !149, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1985 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1961, file: !149, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1986 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1961, file: !149, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1987 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1961, file: !149, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1988 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1961, file: !149, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1989 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !1961, file: !149, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1990 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !1961, file: !149, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1991 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !1961, file: !149, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1992 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !1961, file: !149, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1993 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1958, file: !149, line: 3373, baseType: !1994, size: 192)
!1994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !149, line: 402, size: 192, elements: !1995)
!1995 = !{!1996, !1997, !1998}
!1996 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1994, file: !149, line: 403, baseType: !1961, size: 64)
!1997 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1994, file: !149, line: 404, baseType: !1955, size: 64, offset: 64)
!1998 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1994, file: !149, line: 405, baseType: !1955, size: 64, offset: 128)
!1999 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1958, file: !149, line: 3374, baseType: !2000, size: 320)
!2000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !149, line: 1384, size: 320, elements: !2001)
!2001 = !{!2002, !2003}
!2002 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2000, file: !149, line: 1385, baseType: !1994, size: 192)
!2003 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !2000, file: !149, line: 1386, baseType: !2004, size: 128, offset: 192)
!2004 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !2005, line: 58, baseType: !2006)
!2005 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2006 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2005, line: 54, size: 128, elements: !2007)
!2007 = !{!2008, !2010}
!2008 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !2006, file: !2005, line: 56, baseType: !2009, size: 64)
!2009 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!2010 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !2006, file: !2005, line: 57, baseType: !2011, size: 64, offset: 64)
!2011 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!2012 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !1958, file: !149, line: 3375, baseType: !2013, size: 256)
!2013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !149, line: 1397, size: 256, elements: !2014)
!2014 = !{!2015, !2016}
!2015 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2013, file: !149, line: 1398, baseType: !1994, size: 192)
!2016 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !2013, file: !149, line: 1399, baseType: !2017, size: 64, offset: 192)
!2017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2018, size: 64)
!2018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !2019, line: 52, size: 256, elements: !2020)
!2019 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2020 = !{!2021, !2022, !2023, !2024, !2025, !2026, !2027}
!2021 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !2018, file: !2019, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!2022 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !2018, file: !2019, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!2023 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !2018, file: !2019, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!2024 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !2018, file: !2019, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!2025 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !2018, file: !2019, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!2026 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !2018, file: !2019, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!2027 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !2018, file: !2019, line: 62, baseType: !2028, size: 192, offset: 64)
!2028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2009, size: 192, elements: !2029)
!2029 = !{!2030}
!2030 = !DISubrange(count: 3)
!2031 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !1958, file: !149, line: 3376, baseType: !2032, size: 256)
!2032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !149, line: 1408, size: 256, elements: !2033)
!2033 = !{!2034, !2035}
!2034 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2032, file: !149, line: 1409, baseType: !1994, size: 192)
!2035 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !2032, file: !149, line: 1410, baseType: !2036, size: 64, offset: 192)
!2036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2037, size: 64)
!2037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !2038, line: 27, size: 192, elements: !2039)
!2038 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2039 = !{!2040, !2041}
!2040 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !2037, file: !2038, line: 29, baseType: !2004, size: 128)
!2041 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2037, file: !2038, line: 30, baseType: !3, size: 32, offset: 128)
!2042 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1958, file: !149, line: 3377, baseType: !2043, size: 256)
!2043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !149, line: 1437, size: 256, elements: !2044)
!2044 = !{!2045, !2046}
!2045 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2043, file: !149, line: 1438, baseType: !1994, size: 192)
!2046 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !2043, file: !149, line: 1439, baseType: !1955, size: 64, offset: 192)
!2047 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1958, file: !149, line: 3378, baseType: !2048, size: 256)
!2048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !149, line: 1418, size: 256, elements: !2049)
!2049 = !{!2050, !2051, !2052}
!2050 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2048, file: !149, line: 1419, baseType: !1994, size: 192)
!2051 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !2048, file: !149, line: 1420, baseType: !1948, size: 32, offset: 192)
!2052 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !2048, file: !149, line: 1421, baseType: !2053, size: 8, offset: 224)
!2053 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1951, size: 8, elements: !2054)
!2054 = !{!2055}
!2055 = !DISubrange(count: 1)
!2056 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !1958, file: !149, line: 3379, baseType: !2057, size: 320)
!2057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !149, line: 1428, size: 320, elements: !2058)
!2058 = !{!2059, !2060, !2061}
!2059 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2057, file: !149, line: 1429, baseType: !1994, size: 192)
!2060 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !2057, file: !149, line: 1430, baseType: !1955, size: 64, offset: 192)
!2061 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !2057, file: !149, line: 1431, baseType: !1955, size: 64, offset: 256)
!2062 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1958, file: !149, line: 3380, baseType: !2063, size: 320)
!2063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !149, line: 1460, size: 320, elements: !2064)
!2064 = !{!2065, !2066}
!2065 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2063, file: !149, line: 1461, baseType: !1994, size: 192)
!2066 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !2063, file: !149, line: 1462, baseType: !2067, size: 128, offset: 192)
!2067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !2068, line: 31, size: 128, elements: !2069)
!2068 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2069 = !{!2070, !2073, !2074}
!2070 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !2067, file: !2068, line: 32, baseType: !2071, size: 64)
!2071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2072, size: 64)
!2072 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1947)
!2073 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !2067, file: !2068, line: 33, baseType: !5, size: 32, offset: 64)
!2074 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !2067, file: !2068, line: 34, baseType: !5, size: 32, offset: 96)
!2075 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !1958, file: !149, line: 3381, baseType: !2076, size: 384)
!2076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !149, line: 2507, size: 384, elements: !2077)
!2077 = !{!2078, !2079, !2084, !2085, !2086}
!2078 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2076, file: !149, line: 2508, baseType: !1994, size: 192)
!2079 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2076, file: !149, line: 2509, baseType: !2080, size: 32, offset: 192)
!2080 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !2081, line: 58, baseType: !2082)
!2081 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2082 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !2083, line: 44, baseType: !5)
!2083 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2084 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !2076, file: !149, line: 2510, baseType: !5, size: 32, offset: 224)
!2085 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2076, file: !149, line: 2511, baseType: !1955, size: 64, offset: 256)
!2086 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !2076, file: !149, line: 2512, baseType: !1955, size: 64, offset: 320)
!2087 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !1958, file: !149, line: 3382, baseType: !2088, size: 896)
!2088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !149, line: 2652, size: 896, elements: !2089)
!2089 = !{!2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122}
!2090 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2088, file: !149, line: 2653, baseType: !2076, size: 384)
!2091 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2088, file: !149, line: 2654, baseType: !1955, size: 64, offset: 384)
!2092 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2088, file: !149, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!2093 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !2088, file: !149, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!2094 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !2088, file: !149, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!2095 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !2088, file: !149, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!2096 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !2088, file: !149, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!2097 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !2088, file: !149, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!2098 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !2088, file: !149, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!2099 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !2088, file: !149, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!2100 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !2088, file: !149, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!2101 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !2088, file: !149, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!2102 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !2088, file: !149, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!2103 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !2088, file: !149, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!2104 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !2088, file: !149, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!2105 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !2088, file: !149, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!2106 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !2088, file: !149, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!2107 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !2088, file: !149, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!2108 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !2088, file: !149, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!2109 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !2088, file: !149, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!2110 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !2088, file: !149, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!2111 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !2088, file: !149, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!2112 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !2088, file: !149, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!2113 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !2088, file: !149, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!2114 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !2088, file: !149, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!2115 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !2088, file: !149, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!2116 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !2088, file: !149, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!2117 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !2088, file: !149, line: 2703, baseType: !5, size: 32, offset: 512)
!2118 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !2088, file: !149, line: 2705, baseType: !1955, size: 64, offset: 576)
!2119 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !2088, file: !149, line: 2706, baseType: !1955, size: 64, offset: 640)
!2120 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !2088, file: !149, line: 2707, baseType: !1955, size: 64, offset: 704)
!2121 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !2088, file: !149, line: 2708, baseType: !1955, size: 64, offset: 768)
!2122 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !2088, file: !149, line: 2711, baseType: !2123, size: 64, offset: 832)
!2123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2124, size: 64)
!2124 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !149, line: 2711, flags: DIFlagFwdDecl)
!2125 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !1958, file: !149, line: 3383, baseType: !2126, size: 960)
!2126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !149, line: 2756, size: 960, elements: !2127)
!2127 = !{!2128, !2129}
!2128 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2126, file: !149, line: 2757, baseType: !2088, size: 896)
!2129 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !2126, file: !149, line: 2758, baseType: !2130, size: 64, offset: 896)
!2130 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !1956, line: 50, baseType: !2131)
!2131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2132, size: 64)
!2132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !2133, line: 240, size: 384, elements: !2134)
!2133 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2134 = !{!2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145}
!2135 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2132, file: !2133, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!2136 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2132, file: !2133, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2137 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !2132, file: !2133, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!2138 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !2132, file: !2133, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!2139 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !2132, file: !2133, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!2140 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !2132, file: !2133, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!2141 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !2132, file: !2133, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!2142 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !2132, file: !2133, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!2143 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !2132, file: !2133, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!2144 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !2132, file: !2133, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!2145 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !2132, file: !2133, line: 321, baseType: !2146, size: 320, offset: 64)
!2146 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !2133, line: 315, size: 320, elements: !2147)
!2147 = !{!2148, !2603, !2605, !2668, !2669}
!2148 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !2146, file: !2133, line: 316, baseType: !2149, size: 64)
!2149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2150, size: 64, elements: !2054)
!2150 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !2133, line: 183, baseType: !2151)
!2151 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !2133, line: 166, size: 64, elements: !2152)
!2152 = !{!2153, !2154, !2155, !2156, !2157, !2165, !2166, !2178, !2181, !2241, !2242, !2580, !2593, !2600}
!2153 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !2151, file: !2133, line: 168, baseType: !1948, size: 32)
!2154 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !2151, file: !2133, line: 169, baseType: !5, size: 32)
!2155 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !2151, file: !2133, line: 170, baseType: !1953, size: 64)
!2156 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !2151, file: !2133, line: 171, baseType: !2130, size: 64)
!2157 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !2151, file: !2133, line: 172, baseType: !2158, size: 64)
!2158 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !1956, line: 53, baseType: !2159)
!2159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2160, size: 64)
!2160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !2133, line: 359, size: 128, elements: !2161)
!2161 = !{!2162, !2163}
!2162 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !2160, file: !2133, line: 360, baseType: !1948, size: 32)
!2163 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !2160, file: !2133, line: 361, baseType: !2164, size: 64, offset: 64)
!2164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2130, size: 64, elements: !2054)
!2165 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !2151, file: !2133, line: 173, baseType: !3, size: 32)
!2166 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !2151, file: !2133, line: 174, baseType: !2167, size: 32)
!2167 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !2133, line: 133, baseType: !2168)
!2168 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2133, line: 115, size: 32, elements: !2169)
!2169 = !{!2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177}
!2170 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !2168, file: !2133, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!2171 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !2168, file: !2133, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!2172 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !2168, file: !2133, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!2173 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !2168, file: !2133, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!2174 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !2168, file: !2133, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!2175 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !2168, file: !2133, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!2176 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !2168, file: !2133, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!2177 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !2168, file: !2133, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2178 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !2151, file: !2133, line: 175, baseType: !2179, size: 64)
!2179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2180, size: 64)
!2180 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !2133, line: 175, flags: DIFlagFwdDecl)
!2181 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !2151, file: !2133, line: 176, baseType: !2182, size: 64)
!2182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2183, size: 64)
!2183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !2184, line: 75, size: 256, elements: !2185)
!2184 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2185 = !{!2186, !2200, !2201, !2202}
!2186 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !2183, file: !2184, line: 76, baseType: !2187, size: 64)
!2187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2188, size: 64)
!2188 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !2184, line: 68, baseType: !2189)
!2189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !2184, line: 63, size: 320, elements: !2190)
!2190 = !{!2191, !2193, !2194, !2195}
!2191 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2189, file: !2184, line: 64, baseType: !2192, size: 64)
!2192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2189, size: 64)
!2193 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2189, file: !2184, line: 65, baseType: !2192, size: 64, offset: 64)
!2194 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !2189, file: !2184, line: 66, baseType: !5, size: 32, offset: 128)
!2195 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !2189, file: !2184, line: 67, baseType: !2196, size: 128, offset: 192)
!2196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2197, size: 128, elements: !2198)
!2197 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !2184, line: 29, baseType: !2009)
!2198 = !{!2199}
!2199 = !DISubrange(count: 2)
!2200 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !2183, file: !2184, line: 77, baseType: !2187, size: 64, offset: 64)
!2201 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !2183, file: !2184, line: 78, baseType: !5, size: 32, offset: 128)
!2202 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !2183, file: !2184, line: 79, baseType: !2203, size: 64, offset: 192)
!2203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2204, size: 64)
!2204 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !2184, line: 49, baseType: !2205)
!2205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !2184, line: 45, size: 832, elements: !2206)
!2206 = !{!2207, !2208, !2209}
!2207 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !2205, file: !2184, line: 46, baseType: !2192, size: 64)
!2208 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !2205, file: !2184, line: 47, baseType: !2182, size: 64, offset: 64)
!2209 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !2205, file: !2184, line: 48, baseType: !2210, size: 704, offset: 128)
!2210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !2211, line: 164, size: 704, elements: !2212)
!2211 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2212 = !{!2213, !2214, !2224, !2225, !2226, !2227, !2228, !2229, !2233, !2237, !2238, !2239, !2240}
!2213 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !2210, file: !2211, line: 166, baseType: !2011, size: 64)
!2214 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !2210, file: !2211, line: 167, baseType: !2215, size: 64, offset: 64)
!2215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2216, size: 64)
!2216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !2211, line: 157, size: 192, elements: !2217)
!2217 = !{!2218, !2219, !2220}
!2218 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !2216, file: !2211, line: 159, baseType: !1950, size: 64)
!2219 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2216, file: !2211, line: 160, baseType: !2215, size: 64, offset: 64)
!2220 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !2216, file: !2211, line: 161, baseType: !2221, size: 32, offset: 128)
!2221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1951, size: 32, elements: !2222)
!2222 = !{!2223}
!2223 = !DISubrange(count: 4)
!2224 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !2210, file: !2211, line: 168, baseType: !1950, size: 64, offset: 128)
!2225 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !2210, file: !2211, line: 169, baseType: !1950, size: 64, offset: 192)
!2226 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !2210, file: !2211, line: 170, baseType: !1950, size: 64, offset: 256)
!2227 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !2210, file: !2211, line: 171, baseType: !2011, size: 64, offset: 320)
!2228 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !2210, file: !2211, line: 172, baseType: !1948, size: 32, offset: 384)
!2229 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !2210, file: !2211, line: 176, baseType: !2230, size: 64, offset: 448)
!2230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2231, size: 64)
!2231 = !DISubroutineType(types: !2232)
!2232 = !{!2215, !1952, !2011}
!2233 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !2210, file: !2211, line: 177, baseType: !2234, size: 64, offset: 512)
!2234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2235, size: 64)
!2235 = !DISubroutineType(types: !2236)
!2236 = !{null, !1952, !2215}
!2237 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !2210, file: !2211, line: 178, baseType: !1952, size: 64, offset: 576)
!2238 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !2210, file: !2211, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!2239 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !2210, file: !2211, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!2240 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !2210, file: !2211, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!2241 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !2151, file: !2133, line: 177, baseType: !1955, size: 64)
!2242 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !2151, file: !2133, line: 178, baseType: !2243, size: 64)
!2243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2244, size: 64)
!2244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !133, line: 217, size: 832, elements: !2245)
!2245 = !{!2246, !2492, !2493, !2494, !2550, !2554, !2555, !2556, !2574, !2575, !2576, !2577, !2578, !2579}
!2246 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !2244, file: !133, line: 219, baseType: !2247, size: 64)
!2247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2248, size: 64)
!2248 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !133, line: 151, baseType: !2249)
!2249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !133, line: 151, size: 128, elements: !2250)
!2250 = !{!2251}
!2251 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2249, file: !133, line: 151, baseType: !2252, size: 128)
!2252 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !133, line: 150, baseType: !2253)
!2253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !133, line: 150, size: 128, elements: !2254)
!2254 = !{!2255, !2256, !2257}
!2255 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2253, file: !133, line: 150, baseType: !5, size: 32)
!2256 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2253, file: !133, line: 150, baseType: !5, size: 32, offset: 32)
!2257 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2253, file: !133, line: 150, baseType: !2258, size: 64, offset: 64)
!2258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2259, size: 64, elements: !2054)
!2259 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !1956, line: 108, baseType: !2260)
!2260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2261, size: 64)
!2261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !133, line: 122, size: 512, elements: !2262)
!2262 = !{!2263, !2264, !2265, !2484, !2485, !2486, !2487, !2488, !2489, !2490}
!2263 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !2261, file: !133, line: 124, baseType: !2243, size: 64)
!2264 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !2261, file: !133, line: 125, baseType: !2243, size: 64, offset: 64)
!2265 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !2261, file: !133, line: 131, baseType: !2266, size: 64, offset: 128)
!2266 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !133, line: 128, size: 64, elements: !2267)
!2267 = !{!2268, !2483}
!2268 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !2266, file: !133, line: 129, baseType: !2269, size: 64)
!2269 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !1956, line: 66, baseType: !2270)
!2270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2271, size: 64)
!2271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !389, line: 143, size: 192, elements: !2272)
!2272 = !{!2273, !2481, !2482}
!2273 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !2271, file: !389, line: 145, baseType: !2274, size: 64)
!2274 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !1956, line: 69, baseType: !2275)
!2275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2276, size: 64)
!2276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !389, line: 136, size: 192, elements: !2277)
!2277 = !{!2278, !2479, !2480}
!2278 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !2276, file: !389, line: 137, baseType: !2279, size: 64)
!2279 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !1956, line: 58, baseType: !2280)
!2280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2281, size: 64)
!2281 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !389, line: 737, size: 768, elements: !2282)
!2282 = !{!2283, !2300, !2334, !2340, !2345, !2350, !2357, !2363, !2369, !2374, !2388, !2393, !2399, !2404, !2414, !2419, !2437, !2444, !2451, !2457, !2462, !2468, !2474}
!2283 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2281, file: !389, line: 738, baseType: !2284, size: 256)
!2284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !389, line: 271, size: 256, elements: !2285)
!2285 = !{!2286, !2287, !2288, !2289, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299}
!2286 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2284, file: !389, line: 274, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!2287 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !2284, file: !389, line: 277, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!2288 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !2284, file: !389, line: 281, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!2289 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !2284, file: !389, line: 284, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!2290 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !2284, file: !389, line: 291, baseType: !5, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!2291 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !2284, file: !389, line: 295, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!2292 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !2284, file: !389, line: 298, baseType: !5, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!2293 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !2284, file: !389, line: 301, baseType: !5, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!2294 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !2284, file: !389, line: 307, baseType: !5, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2295 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !2284, file: !389, line: 312, baseType: !5, size: 32, offset: 32)
!2296 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !2284, file: !389, line: 316, baseType: !2080, size: 32, offset: 64)
!2297 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !2284, file: !389, line: 319, baseType: !5, size: 32, offset: 96)
!2298 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !2284, file: !389, line: 323, baseType: !2243, size: 64, offset: 128)
!2299 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !2284, file: !389, line: 327, baseType: !1955, size: 64, offset: 192)
!2300 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !2281, file: !389, line: 739, baseType: !2301, size: 448)
!2301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !389, line: 350, size: 448, elements: !2302)
!2302 = !{!2303, !2332}
!2303 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !2301, file: !389, line: 353, baseType: !2304, size: 384)
!2304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !389, line: 333, size: 384, elements: !2305)
!2305 = !{!2306, !2307, !2315}
!2306 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2304, file: !389, line: 336, baseType: !2284, size: 256)
!2307 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !2304, file: !389, line: 343, baseType: !2308, size: 64, offset: 256)
!2308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2309, size: 64)
!2309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !2310, line: 37, size: 128, elements: !2311)
!2310 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2311 = !{!2312, !2313}
!2312 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2309, file: !2310, line: 39, baseType: !2308, size: 64)
!2313 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !2309, file: !2310, line: 40, baseType: !2314, size: 64, offset: 64)
!2314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1955, size: 64)
!2315 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !2304, file: !389, line: 344, baseType: !2316, size: 64, offset: 320)
!2316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2317, size: 64)
!2317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !2310, line: 45, size: 320, elements: !2318)
!2318 = !{!2319, !2320}
!2319 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2317, file: !2310, line: 47, baseType: !2316, size: 64)
!2320 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !2317, file: !2310, line: 48, baseType: !2321, size: 256, offset: 64)
!2321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !149, line: 1883, size: 256, elements: !2322)
!2322 = !{!2323, !2325, !2326, !2331}
!2323 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2321, file: !149, line: 1884, baseType: !2324, size: 64)
!2324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2321, size: 64)
!2325 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2321, file: !149, line: 1885, baseType: !2324, size: 64, offset: 64)
!2326 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !2321, file: !149, line: 1891, baseType: !2327, size: 64, offset: 128)
!2327 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !2321, file: !149, line: 1891, size: 64, elements: !2328)
!2328 = !{!2329, !2330}
!2329 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !2327, file: !149, line: 1891, baseType: !2279, size: 64)
!2330 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !2327, file: !149, line: 1891, baseType: !1955, size: 64)
!2331 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !2321, file: !149, line: 1892, baseType: !2314, size: 64, offset: 192)
!2332 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !2301, file: !389, line: 359, baseType: !2333, size: 64, offset: 384)
!2333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1955, size: 64, elements: !2054)
!2334 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !2281, file: !389, line: 740, baseType: !2335, size: 512)
!2335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !389, line: 365, size: 512, elements: !2336)
!2336 = !{!2337, !2338, !2339}
!2337 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !2335, file: !389, line: 368, baseType: !2304, size: 384)
!2338 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !2335, file: !389, line: 373, baseType: !1955, size: 64, offset: 384)
!2339 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !2335, file: !389, line: 374, baseType: !1955, size: 64, offset: 448)
!2340 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !2281, file: !389, line: 741, baseType: !2341, size: 576)
!2341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !389, line: 380, size: 576, elements: !2342)
!2342 = !{!2343, !2344}
!2343 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !2341, file: !389, line: 383, baseType: !2335, size: 512)
!2344 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !2341, file: !389, line: 389, baseType: !2333, size: 64, offset: 512)
!2345 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2281, file: !389, line: 742, baseType: !2346, size: 320)
!2346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !389, line: 395, size: 320, elements: !2347)
!2347 = !{!2348, !2349}
!2348 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2346, file: !389, line: 397, baseType: !2284, size: 256)
!2349 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !2346, file: !389, line: 400, baseType: !2269, size: 64, offset: 256)
!2350 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !2281, file: !389, line: 743, baseType: !2351, size: 448)
!2351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !389, line: 406, size: 448, elements: !2352)
!2352 = !{!2353, !2354, !2355, !2356}
!2353 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2351, file: !389, line: 408, baseType: !2284, size: 256)
!2354 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !2351, file: !389, line: 412, baseType: !1955, size: 64, offset: 256)
!2355 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !2351, file: !389, line: 420, baseType: !1955, size: 64, offset: 320)
!2356 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !2351, file: !389, line: 423, baseType: !2269, size: 64, offset: 384)
!2357 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !2281, file: !389, line: 744, baseType: !2358, size: 384)
!2358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !389, line: 429, size: 384, elements: !2359)
!2359 = !{!2360, !2361, !2362}
!2360 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2358, file: !389, line: 431, baseType: !2284, size: 256)
!2361 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !2358, file: !389, line: 434, baseType: !1955, size: 64, offset: 256)
!2362 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !2358, file: !389, line: 437, baseType: !2269, size: 64, offset: 320)
!2363 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !2281, file: !389, line: 745, baseType: !2364, size: 384)
!2364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !389, line: 443, size: 384, elements: !2365)
!2365 = !{!2366, !2367, !2368}
!2366 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2364, file: !389, line: 445, baseType: !2284, size: 256)
!2367 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !2364, file: !389, line: 449, baseType: !1955, size: 64, offset: 256)
!2368 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !2364, file: !389, line: 453, baseType: !2269, size: 64, offset: 320)
!2369 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !2281, file: !389, line: 746, baseType: !2370, size: 320)
!2370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !389, line: 459, size: 320, elements: !2371)
!2371 = !{!2372, !2373}
!2372 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2370, file: !389, line: 461, baseType: !2284, size: 256)
!2373 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !2370, file: !389, line: 464, baseType: !1955, size: 64, offset: 256)
!2374 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !2281, file: !389, line: 747, baseType: !2375, size: 768)
!2375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !389, line: 469, size: 768, elements: !2376)
!2376 = !{!2377, !2378, !2379, !2380, !2381}
!2377 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2375, file: !389, line: 471, baseType: !2284, size: 256)
!2378 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !2375, file: !389, line: 474, baseType: !5, size: 32, offset: 256)
!2379 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !2375, file: !389, line: 475, baseType: !5, size: 32, offset: 288)
!2380 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !2375, file: !389, line: 478, baseType: !1955, size: 64, offset: 320)
!2381 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !2375, file: !389, line: 481, baseType: !2382, size: 384, offset: 384)
!2382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2383, size: 384, elements: !2054)
!2383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !149, line: 1917, size: 384, elements: !2384)
!2384 = !{!2385, !2386, !2387}
!2385 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !2383, file: !149, line: 1920, baseType: !2321, size: 256)
!2386 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !2383, file: !149, line: 1921, baseType: !1955, size: 64, offset: 256)
!2387 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2383, file: !149, line: 1922, baseType: !2080, size: 32, offset: 320)
!2388 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !2281, file: !389, line: 748, baseType: !2389, size: 320)
!2389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !389, line: 487, size: 320, elements: !2390)
!2390 = !{!2391, !2392}
!2391 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2389, file: !389, line: 490, baseType: !2284, size: 256)
!2392 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !2389, file: !389, line: 494, baseType: !1948, size: 32, offset: 256)
!2393 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !2281, file: !389, line: 749, baseType: !2394, size: 384)
!2394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !389, line: 500, size: 384, elements: !2395)
!2395 = !{!2396, !2397, !2398}
!2396 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2394, file: !389, line: 502, baseType: !2284, size: 256)
!2397 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !2394, file: !389, line: 506, baseType: !2269, size: 64, offset: 256)
!2398 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !2394, file: !389, line: 510, baseType: !2269, size: 64, offset: 320)
!2399 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !2281, file: !389, line: 750, baseType: !2400, size: 320)
!2400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !389, line: 529, size: 320, elements: !2401)
!2401 = !{!2402, !2403}
!2402 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2400, file: !389, line: 531, baseType: !2284, size: 256)
!2403 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !2400, file: !389, line: 540, baseType: !2269, size: 64, offset: 256)
!2404 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !2281, file: !389, line: 751, baseType: !2405, size: 704)
!2405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !389, line: 546, size: 704, elements: !2406)
!2406 = !{!2407, !2408, !2409, !2410, !2411, !2412, !2413}
!2407 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !2405, file: !389, line: 549, baseType: !2335, size: 512)
!2408 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !2405, file: !389, line: 553, baseType: !1953, size: 64, offset: 512)
!2409 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !2405, file: !389, line: 557, baseType: !1947, size: 8, offset: 576)
!2410 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !2405, file: !389, line: 558, baseType: !1947, size: 8, offset: 584)
!2411 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !2405, file: !389, line: 559, baseType: !1947, size: 8, offset: 592)
!2412 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !2405, file: !389, line: 560, baseType: !1947, size: 8, offset: 600)
!2413 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !2405, file: !389, line: 566, baseType: !2333, size: 64, offset: 640)
!2414 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !2281, file: !389, line: 752, baseType: !2415, size: 384)
!2415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !389, line: 571, size: 384, elements: !2416)
!2416 = !{!2417, !2418}
!2417 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2415, file: !389, line: 573, baseType: !2346, size: 320)
!2418 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2415, file: !389, line: 577, baseType: !1955, size: 64, offset: 320)
!2419 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !2281, file: !389, line: 753, baseType: !2420, size: 576)
!2420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !389, line: 600, size: 576, elements: !2421)
!2421 = !{!2422, !2423, !2424, !2427, !2436}
!2422 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2420, file: !389, line: 602, baseType: !2346, size: 320)
!2423 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2420, file: !389, line: 605, baseType: !1955, size: 64, offset: 320)
!2424 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !2420, file: !389, line: 609, baseType: !2425, size: 64, offset: 384)
!2425 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !2426, line: 46, baseType: !2009)
!2426 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!2427 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !2420, file: !389, line: 612, baseType: !2428, size: 64, offset: 448)
!2428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2429, size: 64)
!2429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !389, line: 581, size: 320, elements: !2430)
!2430 = !{!2431, !2432, !2433, !2434, !2435}
!2431 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !2429, file: !389, line: 583, baseType: !181, size: 32)
!2432 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !2429, file: !389, line: 586, baseType: !1955, size: 64, offset: 64)
!2433 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !2429, file: !389, line: 589, baseType: !1955, size: 64, offset: 128)
!2434 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !2429, file: !389, line: 592, baseType: !1955, size: 64, offset: 192)
!2435 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !2429, file: !389, line: 595, baseType: !1955, size: 64, offset: 256)
!2436 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !2420, file: !389, line: 616, baseType: !2269, size: 64, offset: 512)
!2437 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !2281, file: !389, line: 754, baseType: !2438, size: 512)
!2438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !389, line: 622, size: 512, elements: !2439)
!2439 = !{!2440, !2441, !2442, !2443}
!2440 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2438, file: !389, line: 624, baseType: !2346, size: 320)
!2441 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2438, file: !389, line: 628, baseType: !1955, size: 64, offset: 320)
!2442 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !2438, file: !389, line: 632, baseType: !1955, size: 64, offset: 384)
!2443 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !2438, file: !389, line: 636, baseType: !1955, size: 64, offset: 448)
!2444 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !2281, file: !389, line: 755, baseType: !2445, size: 704)
!2445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !389, line: 642, size: 704, elements: !2446)
!2446 = !{!2447, !2448, !2449, !2450}
!2447 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !2445, file: !389, line: 644, baseType: !2438, size: 512)
!2448 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !2445, file: !389, line: 648, baseType: !1955, size: 64, offset: 512)
!2449 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !2445, file: !389, line: 652, baseType: !1955, size: 64, offset: 576)
!2450 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !2445, file: !389, line: 653, baseType: !1955, size: 64, offset: 640)
!2451 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !2281, file: !389, line: 756, baseType: !2452, size: 448)
!2452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !389, line: 663, size: 448, elements: !2453)
!2453 = !{!2454, !2455, !2456}
!2454 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2452, file: !389, line: 665, baseType: !2346, size: 320)
!2455 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2452, file: !389, line: 668, baseType: !1955, size: 64, offset: 320)
!2456 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !2452, file: !389, line: 673, baseType: !1955, size: 64, offset: 384)
!2457 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !2281, file: !389, line: 757, baseType: !2458, size: 384)
!2458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !389, line: 694, size: 384, elements: !2459)
!2459 = !{!2460, !2461}
!2460 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2458, file: !389, line: 696, baseType: !2346, size: 320)
!2461 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2458, file: !389, line: 699, baseType: !1955, size: 64, offset: 320)
!2462 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !2281, file: !389, line: 758, baseType: !2463, size: 384)
!2463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !389, line: 681, size: 384, elements: !2464)
!2464 = !{!2465, !2466, !2467}
!2465 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2463, file: !389, line: 683, baseType: !2284, size: 256)
!2466 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !2463, file: !389, line: 686, baseType: !1955, size: 64, offset: 256)
!2467 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !2463, file: !389, line: 689, baseType: !1955, size: 64, offset: 320)
!2468 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !2281, file: !389, line: 759, baseType: !2469, size: 384)
!2469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !389, line: 707, size: 384, elements: !2470)
!2470 = !{!2471, !2472, !2473}
!2471 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2469, file: !389, line: 709, baseType: !2284, size: 256)
!2472 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !2469, file: !389, line: 712, baseType: !1955, size: 64, offset: 256)
!2473 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !2469, file: !389, line: 712, baseType: !1955, size: 64, offset: 320)
!2474 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !2281, file: !389, line: 760, baseType: !2475, size: 320)
!2475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !389, line: 718, size: 320, elements: !2476)
!2476 = !{!2477, !2478}
!2477 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2475, file: !389, line: 720, baseType: !2284, size: 256)
!2478 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !2475, file: !389, line: 723, baseType: !1955, size: 64, offset: 256)
!2479 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2276, file: !389, line: 138, baseType: !2275, size: 64, offset: 64)
!2480 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2276, file: !389, line: 139, baseType: !2275, size: 64, offset: 128)
!2481 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !2271, file: !389, line: 146, baseType: !2274, size: 64, offset: 64)
!2482 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !2271, file: !389, line: 152, baseType: !2269, size: 64, offset: 128)
!2483 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !2266, file: !133, line: 130, baseType: !2130, size: 64)
!2484 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !2261, file: !133, line: 134, baseType: !1952, size: 64, offset: 192)
!2485 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !2261, file: !133, line: 137, baseType: !1955, size: 64, offset: 256)
!2486 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !2261, file: !133, line: 138, baseType: !2080, size: 32, offset: 320)
!2487 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !2261, file: !133, line: 142, baseType: !5, size: 32, offset: 352)
!2488 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2261, file: !133, line: 144, baseType: !1948, size: 32, offset: 384)
!2489 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !2261, file: !133, line: 145, baseType: !1948, size: 32, offset: 416)
!2490 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !2261, file: !133, line: 146, baseType: !2491, size: 64, offset: 448)
!2491 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !133, line: 119, baseType: !2011)
!2492 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !2244, file: !133, line: 220, baseType: !2247, size: 64, offset: 64)
!2493 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !2244, file: !133, line: 223, baseType: !1952, size: 64, offset: 128)
!2494 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !2244, file: !133, line: 226, baseType: !2495, size: 64, offset: 192)
!2495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2496, size: 64)
!2496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !376, line: 100, size: 1216, elements: !2497)
!2497 = !{!2498, !2499, !2500, !2501, !2502, !2507, !2508, !2509, !2523, !2524, !2525, !2526, !2527, !2528, !2529, !2530, !2531, !2532, !2540, !2548, !2549}
!2498 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2496, file: !376, line: 102, baseType: !1948, size: 32)
!2499 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !2496, file: !376, line: 105, baseType: !5, size: 32, offset: 32)
!2500 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !2496, file: !376, line: 108, baseType: !2243, size: 64, offset: 64)
!2501 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !2496, file: !376, line: 111, baseType: !2243, size: 64, offset: 128)
!2502 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !2496, file: !376, line: 114, baseType: !2503, size: 64, offset: 192)
!2503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !376, line: 41, size: 64, elements: !2504)
!2504 = !{!2505, !2506}
!2505 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !2503, file: !376, line: 42, baseType: !375, size: 32)
!2506 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !2503, file: !376, line: 43, baseType: !5, size: 32, offset: 32)
!2507 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !2496, file: !376, line: 117, baseType: !5, size: 32, offset: 256)
!2508 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !2496, file: !376, line: 120, baseType: !5, size: 32, offset: 288)
!2509 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !2496, file: !376, line: 123, baseType: !2510, size: 64, offset: 320)
!2510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2511, size: 64)
!2511 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !376, line: 87, baseType: !2512)
!2512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !376, line: 87, size: 128, elements: !2513)
!2513 = !{!2514}
!2514 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2512, file: !376, line: 87, baseType: !2515, size: 128)
!2515 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !376, line: 85, baseType: !2516)
!2516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !376, line: 85, size: 128, elements: !2517)
!2517 = !{!2518, !2519, !2520}
!2518 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2516, file: !376, line: 85, baseType: !5, size: 32)
!2519 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2516, file: !376, line: 85, baseType: !5, size: 32, offset: 32)
!2520 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2516, file: !376, line: 85, baseType: !2521, size: 64, offset: 64)
!2521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2522, size: 64, elements: !2054)
!2522 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !376, line: 84, baseType: !2495)
!2523 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !2496, file: !376, line: 126, baseType: !2495, size: 64, offset: 384)
!2524 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2496, file: !376, line: 129, baseType: !2495, size: 64, offset: 448)
!2525 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !2496, file: !376, line: 132, baseType: !1952, size: 64, offset: 512)
!2526 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !2496, file: !376, line: 139, baseType: !1955, size: 64, offset: 576)
!2527 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !2496, file: !376, line: 143, baseType: !2004, size: 128, offset: 640)
!2528 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !2496, file: !376, line: 146, baseType: !2004, size: 128, offset: 768)
!2529 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !2496, file: !376, line: 148, baseType: !1947, size: 8, offset: 896)
!2530 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !2496, file: !376, line: 149, baseType: !1947, size: 8, offset: 904)
!2531 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !2496, file: !376, line: 153, baseType: !384, size: 32, offset: 928)
!2532 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !2496, file: !376, line: 156, baseType: !2533, size: 64, offset: 960)
!2533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2534, size: 64)
!2534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !376, line: 48, size: 320, elements: !2535)
!2535 = !{!2536, !2537, !2538, !2539}
!2536 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !2534, file: !376, line: 50, baseType: !2279, size: 64)
!2537 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !2534, file: !376, line: 59, baseType: !2004, size: 128, offset: 64)
!2538 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !2534, file: !376, line: 64, baseType: !1947, size: 8, offset: 192)
!2539 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2534, file: !376, line: 67, baseType: !2533, size: 64, offset: 256)
!2540 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !2496, file: !376, line: 159, baseType: !2541, size: 64, offset: 1024)
!2541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2542, size: 64)
!2542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !376, line: 72, size: 256, elements: !2543)
!2543 = !{!2544, !2545, !2546, !2547}
!2544 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !2542, file: !376, line: 74, baseType: !2260, size: 64)
!2545 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2542, file: !376, line: 77, baseType: !2541, size: 64, offset: 64)
!2546 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2542, file: !376, line: 78, baseType: !2541, size: 64, offset: 128)
!2547 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !2542, file: !376, line: 81, baseType: !2541, size: 64, offset: 192)
!2548 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !2496, file: !376, line: 162, baseType: !1947, size: 8, offset: 1088)
!2549 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !2496, file: !376, line: 166, baseType: !1955, size: 64, offset: 1152)
!2550 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !2244, file: !133, line: 229, baseType: !2551, size: 128, offset: 256)
!2551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2552, size: 128, elements: !2198)
!2552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2553, size: 64)
!2553 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !133, line: 229, flags: DIFlagFwdDecl)
!2554 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !2244, file: !133, line: 232, baseType: !2243, size: 64, offset: 384)
!2555 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !2244, file: !133, line: 233, baseType: !2243, size: 64, offset: 448)
!2556 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !2244, file: !133, line: 238, baseType: !2557, size: 64, offset: 512)
!2557 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !133, line: 235, size: 64, elements: !2558)
!2558 = !{!2559, !2565}
!2559 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !2557, file: !133, line: 236, baseType: !2560, size: 64)
!2560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2561, size: 64)
!2561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !133, line: 273, size: 128, elements: !2562)
!2562 = !{!2563, !2564}
!2563 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !2561, file: !133, line: 275, baseType: !2269, size: 64)
!2564 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !2561, file: !133, line: 278, baseType: !2269, size: 64, offset: 64)
!2565 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !2557, file: !133, line: 237, baseType: !2566, size: 64)
!2566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2567, size: 64)
!2567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !133, line: 259, size: 320, elements: !2568)
!2568 = !{!2569, !2570, !2571, !2572, !2573}
!2569 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !2567, file: !133, line: 261, baseType: !2130, size: 64)
!2570 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !2567, file: !133, line: 262, baseType: !2130, size: 64, offset: 64)
!2571 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !2567, file: !133, line: 266, baseType: !2130, size: 64, offset: 128)
!2572 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !2567, file: !133, line: 267, baseType: !2130, size: 64, offset: 192)
!2573 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !2567, file: !133, line: 270, baseType: !1948, size: 32, offset: 256)
!2574 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !2244, file: !133, line: 241, baseType: !2491, size: 64, offset: 576)
!2575 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !2244, file: !133, line: 244, baseType: !1948, size: 32, offset: 640)
!2576 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !2244, file: !133, line: 247, baseType: !1948, size: 32, offset: 672)
!2577 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !2244, file: !133, line: 250, baseType: !1948, size: 32, offset: 704)
!2578 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !2244, file: !133, line: 253, baseType: !1948, size: 32, offset: 736)
!2579 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2244, file: !133, line: 256, baseType: !1948, size: 32, offset: 768)
!2580 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !2151, file: !2133, line: 179, baseType: !2581, size: 64)
!2581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2582, size: 64)
!2582 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !2133, line: 150, baseType: !2583)
!2583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !2133, line: 142, size: 320, elements: !2584)
!2584 = !{!2585, !2586, !2587, !2588, !2591, !2592}
!2585 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !2583, file: !2133, line: 144, baseType: !1955, size: 64)
!2586 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2583, file: !2133, line: 145, baseType: !2130, size: 64, offset: 64)
!2587 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2583, file: !2133, line: 146, baseType: !2130, size: 64, offset: 128)
!2588 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !2583, file: !2133, line: 147, baseType: !2589, size: 32, offset: 192)
!2589 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !2590, line: 31, baseType: !1948)
!2590 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2591 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !2583, file: !2133, line: 148, baseType: !5, size: 32, offset: 224)
!2592 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !2583, file: !2133, line: 149, baseType: !1947, size: 8, offset: 256)
!2593 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !2151, file: !2133, line: 180, baseType: !2594, size: 64)
!2594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2595, size: 64)
!2595 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !2133, line: 162, baseType: !2596)
!2596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !2133, line: 159, size: 128, elements: !2597)
!2597 = !{!2598, !2599}
!2598 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !2596, file: !2133, line: 160, baseType: !1955, size: 64)
!2599 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2596, file: !2133, line: 161, baseType: !2011, size: 64, offset: 64)
!2600 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !2151, file: !2133, line: 181, baseType: !2601, size: 64)
!2601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2602, size: 64)
!2602 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !2133, line: 181, flags: DIFlagFwdDecl)
!2603 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !2146, file: !2133, line: 317, baseType: !2604, size: 64)
!2604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2011, size: 64, elements: !2054)
!2605 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !2146, file: !2133, line: 318, baseType: !2606, size: 320)
!2606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !2133, line: 188, size: 320, elements: !2607)
!2607 = !{!2608, !2610, !2667}
!2608 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !2606, file: !2133, line: 190, baseType: !2609, size: 192)
!2609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2150, size: 192, elements: !2029)
!2610 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !2606, file: !2133, line: 193, baseType: !2611, size: 64, offset: 192)
!2611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2612, size: 64)
!2612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !2133, line: 206, size: 320, elements: !2613)
!2613 = !{!2614, !2652, !2653, !2654, !2666}
!2614 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !2612, file: !2133, line: 208, baseType: !2615, size: 64)
!2615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2616, size: 64)
!2616 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !1956, line: 62, baseType: !2617)
!2617 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !2618, line: 538, size: 256, elements: !2619)
!2618 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2619 = !{!2620, !2624, !2630, !2643}
!2620 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2617, file: !2618, line: 539, baseType: !2621, size: 32)
!2621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !2618, line: 482, size: 32, elements: !2622)
!2622 = !{!2623}
!2623 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2621, file: !2618, line: 484, baseType: !5, size: 32)
!2624 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !2617, file: !2618, line: 540, baseType: !2625, size: 192)
!2625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !2618, line: 488, size: 192, elements: !2626)
!2626 = !{!2627, !2628, !2629}
!2627 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2625, file: !2618, line: 489, baseType: !2621, size: 32)
!2628 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2625, file: !2618, line: 492, baseType: !1953, size: 64, offset: 64)
!2629 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !2625, file: !2618, line: 496, baseType: !1955, size: 64, offset: 128)
!2630 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !2617, file: !2618, line: 541, baseType: !2631, size: 256)
!2631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !2618, line: 504, size: 256, elements: !2632)
!2632 = !{!2633, !2634, !2641, !2642}
!2633 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2631, file: !2618, line: 505, baseType: !2621, size: 32)
!2634 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !2631, file: !2618, line: 509, baseType: !2635, size: 64, offset: 64)
!2635 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !2618, line: 501, baseType: !2636)
!2636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2637, size: 64)
!2637 = !DISubroutineType(types: !2638)
!2638 = !{null, !2639}
!2639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2640, size: 64)
!2640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!2641 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !2631, file: !2618, line: 510, baseType: !2639, size: 64, offset: 128)
!2642 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2631, file: !2618, line: 513, baseType: !2615, size: 64, offset: 192)
!2643 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !2617, file: !2618, line: 542, baseType: !2644, size: 128)
!2644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !2618, line: 530, size: 128, elements: !2645)
!2645 = !{!2646, !2647}
!2646 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2644, file: !2618, line: 531, baseType: !2621, size: 32)
!2647 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !2644, file: !2618, line: 534, baseType: !2648, size: 64, offset: 64)
!2648 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !2618, line: 525, baseType: !2649)
!2649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2650, size: 64)
!2650 = !DISubroutineType(types: !2651)
!2651 = !{!1947, !1955, !1953, !2009, !2009}
!2652 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !2612, file: !2133, line: 211, baseType: !5, size: 32, offset: 64)
!2653 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2612, file: !2133, line: 214, baseType: !2011, size: 64, offset: 128)
!2654 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !2612, file: !2133, line: 224, baseType: !2655, size: 64, offset: 192)
!2655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2656, size: 64)
!2656 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !2133, line: 202, baseType: !2657)
!2657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !2133, line: 202, size: 128, elements: !2658)
!2658 = !{!2659}
!2659 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2657, file: !2133, line: 202, baseType: !2660, size: 128)
!2660 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !2133, line: 200, baseType: !2661)
!2661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !2133, line: 200, size: 128, elements: !2662)
!2662 = !{!2663, !2664, !2665}
!2663 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2661, file: !2133, line: 200, baseType: !5, size: 32)
!2664 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2661, file: !2133, line: 200, baseType: !5, size: 32, offset: 32)
!2665 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2661, file: !2133, line: 200, baseType: !2164, size: 64, offset: 64)
!2666 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !2612, file: !2133, line: 234, baseType: !2655, size: 64, offset: 256)
!2667 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2606, file: !2133, line: 197, baseType: !2011, size: 64, offset: 256)
!2668 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !2146, file: !2133, line: 319, baseType: !2018, size: 256)
!2669 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !2146, file: !2133, line: 320, baseType: !2037, size: 192)
!2670 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !1958, file: !149, line: 3384, baseType: !2671, size: 1472)
!2671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !149, line: 3114, size: 1472, elements: !2672)
!2672 = !{!2673, !2694, !2695, !2696, !2697}
!2673 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2671, file: !149, line: 3115, baseType: !2674, size: 1216)
!2674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !149, line: 2984, size: 1216, elements: !2675)
!2675 = !{!2676, !2677, !2678, !2679, !2680, !2681, !2682, !2683, !2684, !2685, !2686, !2687, !2688, !2689, !2690, !2691, !2692, !2693}
!2676 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2674, file: !149, line: 2985, baseType: !2126, size: 960)
!2677 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !2674, file: !149, line: 2986, baseType: !1955, size: 64, offset: 960)
!2678 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !2674, file: !149, line: 2987, baseType: !1955, size: 64, offset: 1024)
!2679 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !2674, file: !149, line: 2988, baseType: !1955, size: 64, offset: 1088)
!2680 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !2674, file: !149, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!2681 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !2674, file: !149, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!2682 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !2674, file: !149, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!2683 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !2674, file: !149, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!2684 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !2674, file: !149, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!2685 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !2674, file: !149, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!2686 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !2674, file: !149, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!2687 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !2674, file: !149, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!2688 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !2674, file: !149, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!2689 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !2674, file: !149, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!2690 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !2674, file: !149, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!2691 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !2674, file: !149, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!2692 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !2674, file: !149, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!2693 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !2674, file: !149, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!2694 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !2671, file: !149, line: 3117, baseType: !1955, size: 64, offset: 1216)
!2695 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !2671, file: !149, line: 3119, baseType: !1955, size: 64, offset: 1280)
!2696 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !2671, file: !149, line: 3121, baseType: !1955, size: 64, offset: 1344)
!2697 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !2671, file: !149, line: 3123, baseType: !1955, size: 64, offset: 1408)
!2698 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !1958, file: !149, line: 3385, baseType: !2699, size: 1088)
!2699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !149, line: 2874, size: 1088, elements: !2700)
!2700 = !{!2701, !2702, !2703}
!2701 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2699, file: !149, line: 2875, baseType: !2126, size: 960)
!2702 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !2699, file: !149, line: 2876, baseType: !2130, size: 64, offset: 960)
!2703 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2699, file: !149, line: 2877, baseType: !2704, size: 64, offset: 1024)
!2704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2705, size: 64)
!2705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !2706, line: 172, size: 128, elements: !2707)
!2706 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2707 = !{!2708, !2709, !2710, !2711, !2712, !2713, !2714}
!2708 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !2705, file: !2706, line: 174, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!2709 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !2705, file: !2706, line: 178, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!2710 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !2705, file: !2706, line: 183, baseType: !5, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!2711 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !2705, file: !2706, line: 187, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!2712 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !2705, file: !2706, line: 192, baseType: !5, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!2713 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !2705, file: !2706, line: 195, baseType: !5, size: 32, offset: 32)
!2714 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !2705, file: !2706, line: 199, baseType: !1955, size: 64, offset: 64)
!2715 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !1958, file: !149, line: 3386, baseType: !2674, size: 1216)
!2716 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !1958, file: !149, line: 3387, baseType: !2717, size: 1280)
!2717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !149, line: 3093, size: 1280, elements: !2718)
!2718 = !{!2719, !2720}
!2719 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2717, file: !149, line: 3094, baseType: !2674, size: 1216)
!2720 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2717, file: !149, line: 3095, baseType: !2704, size: 64, offset: 1216)
!2721 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !1958, file: !149, line: 3388, baseType: !2722, size: 1216)
!2722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !149, line: 2824, size: 1216, elements: !2723)
!2723 = !{!2724, !2725, !2726, !2727, !2728, !2729}
