; ModuleID = 'tree-predcom.bc'
source_filename = "tree-predcom.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!431 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!432 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!433 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!434 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!435 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!436 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!437 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!438 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!439 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!440 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !402, line: 727, baseType: !7, size: 32, elements: !441)
!441 = !{!442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465}
!442 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!443 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!444 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!445 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!446 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!447 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!448 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!449 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!450 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!451 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!452 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!453 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!454 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!455 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!456 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!457 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!458 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!459 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!460 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!461 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!462 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!463 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!464 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!465 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!466 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !402, line: 80, baseType: !7, size: 32, elements: !467)
!467 = !{!468, !469, !470, !471}
!468 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!469 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!470 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!471 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!472 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ssa_op_iter_type", file: !473, line: 119, baseType: !7, size: 32, elements: !474)
!473 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!474 = !{!475, !476, !477, !478}
!475 = !DIEnumerator(name: "ssa_op_iter_none", value: 0, isUnsigned: true)
!476 = !DIEnumerator(name: "ssa_op_iter_tree", value: 1, isUnsigned: true)
!477 = !DIEnumerator(name: "ssa_op_iter_use", value: 2, isUnsigned: true)
!478 = !DIEnumerator(name: "ssa_op_iter_def", value: 3, isUnsigned: true)
!479 = !{!480, !481, !482, !483, !486, !487, !196, !489, !1841, !1911, !1939, !1055, !1383, !1952, !1965, !2025, !958, !7, !2026, !2027, !1842, !793, !1964, !1977, !1921, !543, !1912, !2033, !2045, !814, !2047, !847, !484, !1867, !616, !2049, !466, !2052}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!482 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !485)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !490, line: 56, baseType: !491)
!490 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !164, line: 3371, size: 1792, elements: !493)
!493 = !{!494, !527, !533, !546, !565, !576, !581, !590, !596, !609, !621, !659, !1169, !1197, !1214, !1215, !1220, !1229, !1235, !1240, !1244, !1248, !1492, !1539, !1545, !1551, !1558, !1571, !1585, !1602, !1614, !1636, !1651, !1823}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !492, file: !164, line: 3372, baseType: !495, size: 64)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !164, line: 360, size: 64, elements: !496)
!496 = !{!497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !495, file: !164, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !495, file: !164, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !495, file: !164, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !495, file: !164, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !495, file: !164, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !495, file: !164, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !495, file: !164, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !495, file: !164, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !495, file: !164, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !495, file: !164, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !495, file: !164, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !495, file: !164, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !495, file: !164, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !495, file: !164, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !495, file: !164, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !495, file: !164, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !495, file: !164, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !495, file: !164, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !495, file: !164, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !495, file: !164, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !495, file: !164, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !495, file: !164, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !495, file: !164, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !495, file: !164, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !495, file: !164, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !495, file: !164, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !495, file: !164, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !495, file: !164, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !495, file: !164, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !495, file: !164, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !492, file: !164, line: 3373, baseType: !528, size: 192)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !164, line: 402, size: 192, elements: !529)
!529 = !{!530, !531, !532}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !528, file: !164, line: 403, baseType: !495, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !528, file: !164, line: 404, baseType: !489, size: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !528, file: !164, line: 405, baseType: !489, size: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !492, file: !164, line: 3374, baseType: !534, size: 320)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !164, line: 1384, size: 320, elements: !535)
!535 = !{!536, !537}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !534, file: !164, line: 1385, baseType: !528, size: 192)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !534, file: !164, line: 1386, baseType: !538, size: 128, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !539, line: 58, baseType: !540)
!539 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 54, size: 128, elements: !541)
!541 = !{!542, !544}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !540, file: !539, line: 56, baseType: !543, size: 64)
!543 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !540, file: !539, line: 57, baseType: !545, size: 64, offset: 64)
!545 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !492, file: !164, line: 3375, baseType: !547, size: 256)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !164, line: 1397, size: 256, elements: !548)
!548 = !{!549, !550}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !547, file: !164, line: 1398, baseType: !528, size: 192)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !547, file: !164, line: 1399, baseType: !551, size: 64, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !553, line: 52, size: 256, elements: !554)
!553 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!554 = !{!555, !556, !557, !558, !559, !560, !561}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !552, file: !553, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !552, file: !553, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !552, file: !553, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !552, file: !553, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !552, file: !553, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !552, file: !553, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !552, file: !553, line: 62, baseType: !562, size: 192, offset: 64)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 192, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 3)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !492, file: !164, line: 3376, baseType: !566, size: 256)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !164, line: 1408, size: 256, elements: !567)
!567 = !{!568, !569}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !566, file: !164, line: 1409, baseType: !528, size: 192)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !566, file: !164, line: 1410, baseType: !570, size: 64, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !572, line: 27, size: 192, elements: !573)
!572 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !571, file: !572, line: 29, baseType: !538, size: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !571, file: !572, line: 30, baseType: !5, size: 32, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !492, file: !164, line: 3377, baseType: !577, size: 256)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !164, line: 1437, size: 256, elements: !578)
!578 = !{!579, !580}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !577, file: !164, line: 1438, baseType: !528, size: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !577, file: !164, line: 1439, baseType: !489, size: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !492, file: !164, line: 3378, baseType: !582, size: 256)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !164, line: 1418, size: 256, elements: !583)
!583 = !{!584, !585, !586}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !582, file: !164, line: 1419, baseType: !528, size: 192)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !582, file: !164, line: 1420, baseType: !482, size: 32, offset: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !582, file: !164, line: 1421, baseType: !587, size: 8, offset: 224)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 8, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 1)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !492, file: !164, line: 3379, baseType: !591, size: 320)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !164, line: 1428, size: 320, elements: !592)
!592 = !{!593, !594, !595}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !591, file: !164, line: 1429, baseType: !528, size: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !591, file: !164, line: 1430, baseType: !489, size: 64, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !591, file: !164, line: 1431, baseType: !489, size: 64, offset: 256)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !492, file: !164, line: 3380, baseType: !597, size: 320)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !164, line: 1460, size: 320, elements: !598)
!598 = !{!599, !600}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !597, file: !164, line: 1461, baseType: !528, size: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !597, file: !164, line: 1462, baseType: !601, size: 128, offset: 192)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !602, line: 31, size: 128, elements: !603)
!602 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!603 = !{!604, !607, !608}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !601, file: !602, line: 32, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !481)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !601, file: !602, line: 33, baseType: !7, size: 32, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !601, file: !602, line: 34, baseType: !7, size: 32, offset: 96)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !492, file: !164, line: 3381, baseType: !610, size: 384)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !164, line: 2507, size: 384, elements: !611)
!611 = !{!612, !613, !618, !619, !620}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !610, file: !164, line: 2508, baseType: !528, size: 192)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !610, file: !164, line: 2509, baseType: !614, size: 32, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !615, line: 58, baseType: !616)
!615 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !617, line: 44, baseType: !7)
!617 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!618 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !610, file: !164, line: 2510, baseType: !7, size: 32, offset: 224)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !610, file: !164, line: 2511, baseType: !489, size: 64, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !610, file: !164, line: 2512, baseType: !489, size: 64, offset: 320)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !492, file: !164, line: 3382, baseType: !622, size: 896)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !164, line: 2652, size: 896, elements: !623)
!623 = !{!624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !622, file: !164, line: 2653, baseType: !610, size: 384)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !622, file: !164, line: 2654, baseType: !489, size: 64, offset: 384)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !622, file: !164, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !622, file: !164, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !622, file: !164, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !622, file: !164, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !622, file: !164, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !622, file: !164, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !622, file: !164, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !622, file: !164, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !622, file: !164, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !622, file: !164, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !622, file: !164, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !622, file: !164, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !622, file: !164, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !622, file: !164, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !622, file: !164, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !622, file: !164, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !622, file: !164, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !622, file: !164, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !622, file: !164, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !622, file: !164, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !622, file: !164, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !622, file: !164, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !622, file: !164, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !622, file: !164, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !622, file: !164, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !622, file: !164, line: 2703, baseType: !7, size: 32, offset: 512)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !622, file: !164, line: 2705, baseType: !489, size: 64, offset: 576)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !622, file: !164, line: 2706, baseType: !489, size: 64, offset: 640)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !622, file: !164, line: 2707, baseType: !489, size: 64, offset: 704)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !622, file: !164, line: 2708, baseType: !489, size: 64, offset: 768)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !622, file: !164, line: 2711, baseType: !657, size: 64, offset: 832)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !164, line: 2711, flags: DIFlagFwdDecl)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !492, file: !164, line: 3383, baseType: !660, size: 960)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !164, line: 2756, size: 960, elements: !661)
!661 = !{!662, !663}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !660, file: !164, line: 2757, baseType: !622, size: 896)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !660, file: !164, line: 2758, baseType: !664, size: 64, offset: 896)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !490, line: 50, baseType: !665)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !667, line: 240, size: 384, elements: !668)
!667 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!668 = !{!669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !666, file: !667, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !666, file: !667, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !666, file: !667, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !666, file: !667, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !666, file: !667, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !666, file: !667, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !666, file: !667, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !666, file: !667, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !666, file: !667, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !666, file: !667, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !666, file: !667, line: 321, baseType: !680, size: 320, offset: 64)
!680 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !667, line: 315, size: 320, elements: !681)
!681 = !{!682, !1136, !1138, !1167, !1168}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !680, file: !667, line: 316, baseType: !683, size: 64)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !684, size: 64, elements: !588)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !667, line: 183, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !667, line: 166, size: 64, elements: !686)
!686 = !{!687, !688, !689, !690, !691, !699, !700, !712, !715, !775, !776, !1113, !1126, !1133}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !685, file: !667, line: 168, baseType: !482, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !685, file: !667, line: 169, baseType: !7, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !685, file: !667, line: 170, baseType: !487, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !685, file: !667, line: 171, baseType: !664, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !685, file: !667, line: 172, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !490, line: 53, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !667, line: 359, size: 128, elements: !695)
!695 = !{!696, !697}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !694, file: !667, line: 360, baseType: !482, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !694, file: !667, line: 361, baseType: !698, size: 64, offset: 64)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !664, size: 64, elements: !588)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !685, file: !667, line: 173, baseType: !5, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !685, file: !667, line: 174, baseType: !701, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !667, line: 133, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !667, line: 115, size: 32, elements: !703)
!703 = !{!704, !705, !706, !707, !708, !709, !710, !711}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !702, file: !667, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !702, file: !667, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !702, file: !667, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !702, file: !667, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !702, file: !667, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !702, file: !667, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !702, file: !667, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !702, file: !667, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !685, file: !667, line: 175, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !667, line: 175, flags: DIFlagFwdDecl)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !685, file: !667, line: 176, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !718, line: 75, size: 256, elements: !719)
!718 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!719 = !{!720, !734, !735, !736}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !717, file: !718, line: 76, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !718, line: 68, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !718, line: 63, size: 320, elements: !724)
!724 = !{!725, !727, !728, !729}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !723, file: !718, line: 64, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !723, file: !718, line: 65, baseType: !726, size: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !723, file: !718, line: 66, baseType: !7, size: 32, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !723, file: !718, line: 67, baseType: !730, size: 128, offset: 192)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !731, size: 128, elements: !732)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !718, line: 29, baseType: !543)
!732 = !{!733}
!733 = !DISubrange(count: 2)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !717, file: !718, line: 77, baseType: !721, size: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !717, file: !718, line: 78, baseType: !7, size: 32, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !717, file: !718, line: 79, baseType: !737, size: 64, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !718, line: 49, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !718, line: 45, size: 832, elements: !740)
!740 = !{!741, !742, !743}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !739, file: !718, line: 46, baseType: !726, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !739, file: !718, line: 47, baseType: !716, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !739, file: !718, line: 48, baseType: !744, size: 704, offset: 128)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !745, line: 164, size: 704, elements: !746)
!745 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!746 = !{!747, !748, !758, !759, !760, !761, !762, !763, !767, !771, !772, !773, !774}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !744, file: !745, line: 166, baseType: !545, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !744, file: !745, line: 167, baseType: !749, size: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !745, line: 157, size: 192, elements: !751)
!751 = !{!752, !753, !754}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !750, file: !745, line: 159, baseType: !484, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !750, file: !745, line: 160, baseType: !749, size: 64, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !750, file: !745, line: 161, baseType: !755, size: 32, offset: 128)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 32, elements: !756)
!756 = !{!757}
!757 = !DISubrange(count: 4)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !744, file: !745, line: 168, baseType: !484, size: 64, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !744, file: !745, line: 169, baseType: !484, size: 64, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !744, file: !745, line: 170, baseType: !484, size: 64, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !744, file: !745, line: 171, baseType: !545, size: 64, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !744, file: !745, line: 172, baseType: !482, size: 32, offset: 384)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !744, file: !745, line: 176, baseType: !764, size: 64, offset: 448)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{!749, !486, !545}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !744, file: !745, line: 177, baseType: !768, size: 64, offset: 512)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DISubroutineType(types: !770)
!770 = !{null, !486, !749}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !744, file: !745, line: 178, baseType: !486, size: 64, offset: 576)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !744, file: !745, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !744, file: !745, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !744, file: !745, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !685, file: !667, line: 177, baseType: !489, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !685, file: !667, line: 178, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !779)
!779 = !{!780, !1025, !1026, !1027, !1083, !1087, !1088, !1089, !1107, !1108, !1109, !1110, !1111, !1112}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !778, file: !135, line: 219, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !784)
!784 = !{!785}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !783, file: !135, line: 151, baseType: !786, size: 128)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !788)
!788 = !{!789, !790, !791}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !787, file: !135, line: 150, baseType: !7, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !787, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !787, file: !135, line: 150, baseType: !792, size: 64, offset: 64)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !793, size: 64, elements: !588)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !490, line: 108, baseType: !794)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !796)
!796 = !{!797, !798, !799, !1017, !1018, !1019, !1020, !1021, !1022, !1023}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !795, file: !135, line: 124, baseType: !777, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !795, file: !135, line: 125, baseType: !777, size: 64, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !795, file: !135, line: 131, baseType: !800, size: 64, offset: 128)
!800 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !801)
!801 = !{!802, !1016}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !800, file: !135, line: 129, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !490, line: 66, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !402, line: 143, size: 192, elements: !806)
!806 = !{!807, !1014, !1015}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !805, file: !402, line: 145, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !490, line: 69, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !402, line: 136, size: 192, elements: !811)
!811 = !{!812, !1012, !1013}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !810, file: !402, line: 137, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !490, line: 58, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !402, line: 737, size: 768, elements: !816)
!816 = !{!817, !834, !867, !873, !878, !883, !890, !896, !902, !907, !921, !926, !932, !937, !947, !952, !970, !977, !984, !990, !995, !1001, !1007}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !815, file: !402, line: 738, baseType: !818, size: 256)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !402, line: 271, size: 256, elements: !819)
!819 = !{!820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !818, file: !402, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !818, file: !402, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !818, file: !402, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !818, file: !402, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !818, file: !402, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !818, file: !402, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !818, file: !402, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !818, file: !402, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !818, file: !402, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !818, file: !402, line: 312, baseType: !7, size: 32, offset: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !818, file: !402, line: 316, baseType: !614, size: 32, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !818, file: !402, line: 319, baseType: !7, size: 32, offset: 96)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !818, file: !402, line: 323, baseType: !777, size: 64, offset: 128)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !818, file: !402, line: 327, baseType: !489, size: 64, offset: 192)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !815, file: !402, line: 739, baseType: !835, size: 448)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !402, line: 350, size: 448, elements: !836)
!836 = !{!837, !865}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !835, file: !402, line: 353, baseType: !838, size: 384)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !402, line: 333, size: 384, elements: !839)
!839 = !{!840, !841, !848}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !838, file: !402, line: 336, baseType: !818, size: 256)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !838, file: !402, line: 343, baseType: !842, size: 64, offset: 256)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !473, line: 37, size: 128, elements: !844)
!844 = !{!845, !846}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !843, file: !473, line: 39, baseType: !842, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !843, file: !473, line: 40, baseType: !847, size: 64, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !838, file: !402, line: 344, baseType: !849, size: 64, offset: 320)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !473, line: 45, size: 320, elements: !851)
!851 = !{!852, !853}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !850, file: !473, line: 47, baseType: !849, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !850, file: !473, line: 48, baseType: !854, size: 256, offset: 64)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !164, line: 1883, size: 256, elements: !855)
!855 = !{!856, !858, !859, !864}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !854, file: !164, line: 1884, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !854, file: !164, line: 1885, baseType: !857, size: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !854, file: !164, line: 1891, baseType: !860, size: 64, offset: 128)
!860 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !854, file: !164, line: 1891, size: 64, elements: !861)
!861 = !{!862, !863}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !860, file: !164, line: 1891, baseType: !813, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !860, file: !164, line: 1891, baseType: !489, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !854, file: !164, line: 1892, baseType: !847, size: 64, offset: 192)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !835, file: !402, line: 359, baseType: !866, size: 64, offset: 384)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 64, elements: !588)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !815, file: !402, line: 740, baseType: !868, size: 512)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !402, line: 365, size: 512, elements: !869)
!869 = !{!870, !871, !872}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !868, file: !402, line: 368, baseType: !838, size: 384)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !868, file: !402, line: 373, baseType: !489, size: 64, offset: 384)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !868, file: !402, line: 374, baseType: !489, size: 64, offset: 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !815, file: !402, line: 741, baseType: !874, size: 576)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !402, line: 380, size: 576, elements: !875)
!875 = !{!876, !877}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !874, file: !402, line: 383, baseType: !868, size: 512)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !874, file: !402, line: 389, baseType: !866, size: 64, offset: 512)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !815, file: !402, line: 742, baseType: !879, size: 320)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !402, line: 395, size: 320, elements: !880)
!880 = !{!881, !882}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !879, file: !402, line: 397, baseType: !818, size: 256)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !879, file: !402, line: 400, baseType: !803, size: 64, offset: 256)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !815, file: !402, line: 743, baseType: !884, size: 448)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !402, line: 406, size: 448, elements: !885)
!885 = !{!886, !887, !888, !889}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !884, file: !402, line: 408, baseType: !818, size: 256)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !884, file: !402, line: 412, baseType: !489, size: 64, offset: 256)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !884, file: !402, line: 420, baseType: !489, size: 64, offset: 320)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !884, file: !402, line: 423, baseType: !803, size: 64, offset: 384)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !815, file: !402, line: 744, baseType: !891, size: 384)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !402, line: 429, size: 384, elements: !892)
!892 = !{!893, !894, !895}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !891, file: !402, line: 431, baseType: !818, size: 256)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !891, file: !402, line: 434, baseType: !489, size: 64, offset: 256)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !891, file: !402, line: 437, baseType: !803, size: 64, offset: 320)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !815, file: !402, line: 745, baseType: !897, size: 384)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !402, line: 443, size: 384, elements: !898)
!898 = !{!899, !900, !901}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !897, file: !402, line: 445, baseType: !818, size: 256)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !897, file: !402, line: 449, baseType: !489, size: 64, offset: 256)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !897, file: !402, line: 453, baseType: !803, size: 64, offset: 320)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !815, file: !402, line: 746, baseType: !903, size: 320)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !402, line: 459, size: 320, elements: !904)
!904 = !{!905, !906}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !903, file: !402, line: 461, baseType: !818, size: 256)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !903, file: !402, line: 464, baseType: !489, size: 64, offset: 256)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !815, file: !402, line: 747, baseType: !908, size: 768)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !402, line: 469, size: 768, elements: !909)
!909 = !{!910, !911, !912, !913, !914}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !908, file: !402, line: 471, baseType: !818, size: 256)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !908, file: !402, line: 474, baseType: !7, size: 32, offset: 256)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !908, file: !402, line: 475, baseType: !7, size: 32, offset: 288)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !908, file: !402, line: 478, baseType: !489, size: 64, offset: 320)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !908, file: !402, line: 481, baseType: !915, size: 384, offset: 384)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !916, size: 384, elements: !588)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !164, line: 1917, size: 384, elements: !917)
!917 = !{!918, !919, !920}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !916, file: !164, line: 1920, baseType: !854, size: 256)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !916, file: !164, line: 1921, baseType: !489, size: 64, offset: 256)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !916, file: !164, line: 1922, baseType: !614, size: 32, offset: 320)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !815, file: !402, line: 748, baseType: !922, size: 320)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !402, line: 487, size: 320, elements: !923)
!923 = !{!924, !925}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !922, file: !402, line: 490, baseType: !818, size: 256)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !922, file: !402, line: 494, baseType: !482, size: 32, offset: 256)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !815, file: !402, line: 749, baseType: !927, size: 384)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !402, line: 500, size: 384, elements: !928)
!928 = !{!929, !930, !931}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !927, file: !402, line: 502, baseType: !818, size: 256)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !927, file: !402, line: 506, baseType: !803, size: 64, offset: 256)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !927, file: !402, line: 510, baseType: !803, size: 64, offset: 320)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !815, file: !402, line: 750, baseType: !933, size: 320)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !402, line: 529, size: 320, elements: !934)
!934 = !{!935, !936}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !933, file: !402, line: 531, baseType: !818, size: 256)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !933, file: !402, line: 540, baseType: !803, size: 64, offset: 256)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !815, file: !402, line: 751, baseType: !938, size: 704)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !402, line: 546, size: 704, elements: !939)
!939 = !{!940, !941, !942, !943, !944, !945, !946}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !938, file: !402, line: 549, baseType: !868, size: 512)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !938, file: !402, line: 553, baseType: !487, size: 64, offset: 512)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !938, file: !402, line: 557, baseType: !481, size: 8, offset: 576)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !938, file: !402, line: 558, baseType: !481, size: 8, offset: 584)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !938, file: !402, line: 559, baseType: !481, size: 8, offset: 592)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !938, file: !402, line: 560, baseType: !481, size: 8, offset: 600)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !938, file: !402, line: 566, baseType: !866, size: 64, offset: 640)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !815, file: !402, line: 752, baseType: !948, size: 384)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !402, line: 571, size: 384, elements: !949)
!949 = !{!950, !951}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !948, file: !402, line: 573, baseType: !879, size: 320)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !948, file: !402, line: 577, baseType: !489, size: 64, offset: 320)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !815, file: !402, line: 753, baseType: !953, size: 576)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !402, line: 600, size: 576, elements: !954)
!954 = !{!955, !956, !957, !960, !969}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !953, file: !402, line: 602, baseType: !879, size: 320)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !953, file: !402, line: 605, baseType: !489, size: 64, offset: 320)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !953, file: !402, line: 609, baseType: !958, size: 64, offset: 384)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !959, line: 46, baseType: !543)
!959 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!960 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !953, file: !402, line: 612, baseType: !961, size: 64, offset: 448)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !402, line: 581, size: 320, elements: !963)
!963 = !{!964, !965, !966, !967, !968}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !962, file: !402, line: 583, baseType: !196, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !962, file: !402, line: 586, baseType: !489, size: 64, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !962, file: !402, line: 589, baseType: !489, size: 64, offset: 128)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !962, file: !402, line: 592, baseType: !489, size: 64, offset: 192)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !962, file: !402, line: 595, baseType: !489, size: 64, offset: 256)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !953, file: !402, line: 616, baseType: !803, size: 64, offset: 512)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !815, file: !402, line: 754, baseType: !971, size: 512)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !402, line: 622, size: 512, elements: !972)
!972 = !{!973, !974, !975, !976}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !971, file: !402, line: 624, baseType: !879, size: 320)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !971, file: !402, line: 628, baseType: !489, size: 64, offset: 320)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !971, file: !402, line: 632, baseType: !489, size: 64, offset: 384)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !971, file: !402, line: 636, baseType: !489, size: 64, offset: 448)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !815, file: !402, line: 755, baseType: !978, size: 704)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !402, line: 642, size: 704, elements: !979)
!979 = !{!980, !981, !982, !983}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !978, file: !402, line: 644, baseType: !971, size: 512)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !978, file: !402, line: 648, baseType: !489, size: 64, offset: 512)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !978, file: !402, line: 652, baseType: !489, size: 64, offset: 576)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !978, file: !402, line: 653, baseType: !489, size: 64, offset: 640)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !815, file: !402, line: 756, baseType: !985, size: 448)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !402, line: 663, size: 448, elements: !986)
!986 = !{!987, !988, !989}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !985, file: !402, line: 665, baseType: !879, size: 320)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !985, file: !402, line: 668, baseType: !489, size: 64, offset: 320)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !985, file: !402, line: 673, baseType: !489, size: 64, offset: 384)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !815, file: !402, line: 757, baseType: !991, size: 384)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !402, line: 694, size: 384, elements: !992)
!992 = !{!993, !994}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !991, file: !402, line: 696, baseType: !879, size: 320)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !991, file: !402, line: 699, baseType: !489, size: 64, offset: 320)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !815, file: !402, line: 758, baseType: !996, size: 384)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !402, line: 681, size: 384, elements: !997)
!997 = !{!998, !999, !1000}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !996, file: !402, line: 683, baseType: !818, size: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !996, file: !402, line: 686, baseType: !489, size: 64, offset: 256)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !996, file: !402, line: 689, baseType: !489, size: 64, offset: 320)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !815, file: !402, line: 759, baseType: !1002, size: 384)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !402, line: 707, size: 384, elements: !1003)
!1003 = !{!1004, !1005, !1006}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1002, file: !402, line: 709, baseType: !818, size: 256)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1002, file: !402, line: 712, baseType: !489, size: 64, offset: 256)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1002, file: !402, line: 712, baseType: !489, size: 64, offset: 320)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !815, file: !402, line: 760, baseType: !1008, size: 320)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !402, line: 718, size: 320, elements: !1009)
!1009 = !{!1010, !1011}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1008, file: !402, line: 720, baseType: !818, size: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1008, file: !402, line: 723, baseType: !489, size: 64, offset: 256)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !810, file: !402, line: 138, baseType: !809, size: 64, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !810, file: !402, line: 139, baseType: !809, size: 64, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !805, file: !402, line: 146, baseType: !808, size: 64, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !805, file: !402, line: 152, baseType: !803, size: 64, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !800, file: !135, line: 130, baseType: !664, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !795, file: !135, line: 134, baseType: !486, size: 64, offset: 192)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !795, file: !135, line: 137, baseType: !489, size: 64, offset: 256)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !795, file: !135, line: 138, baseType: !614, size: 32, offset: 320)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !795, file: !135, line: 142, baseType: !7, size: 32, offset: 352)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !795, file: !135, line: 144, baseType: !482, size: 32, offset: 384)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !795, file: !135, line: 145, baseType: !482, size: 32, offset: 416)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !795, file: !135, line: 146, baseType: !1024, size: 64, offset: 448)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !135, line: 119, baseType: !545)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !778, file: !135, line: 220, baseType: !781, size: 64, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !778, file: !135, line: 223, baseType: !486, size: 64, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !778, file: !135, line: 226, baseType: !1028, size: 64, offset: 192)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !146, line: 100, size: 1216, elements: !1030)
!1030 = !{!1031, !1032, !1033, !1034, !1035, !1040, !1041, !1042, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1073, !1081, !1082}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1029, file: !146, line: 102, baseType: !482, size: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1029, file: !146, line: 105, baseType: !7, size: 32, offset: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1029, file: !146, line: 108, baseType: !777, size: 64, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1029, file: !146, line: 111, baseType: !777, size: 64, offset: 128)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1029, file: !146, line: 114, baseType: !1036, size: 64, offset: 192)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !146, line: 41, size: 64, elements: !1037)
!1037 = !{!1038, !1039}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1036, file: !146, line: 42, baseType: !145, size: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1036, file: !146, line: 43, baseType: !7, size: 32, offset: 32)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1029, file: !146, line: 117, baseType: !7, size: 32, offset: 256)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1029, file: !146, line: 120, baseType: !7, size: 32, offset: 288)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1029, file: !146, line: 123, baseType: !1043, size: 64, offset: 320)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !146, line: 87, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !146, line: 87, size: 128, elements: !1046)
!1046 = !{!1047}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1045, file: !146, line: 87, baseType: !1048, size: 128)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !146, line: 85, baseType: !1049)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !146, line: 85, size: 128, elements: !1050)
!1050 = !{!1051, !1052, !1053}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1049, file: !146, line: 85, baseType: !7, size: 32)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1049, file: !146, line: 85, baseType: !7, size: 32, offset: 32)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1049, file: !146, line: 85, baseType: !1054, size: 64, offset: 64)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1055, size: 64, elements: !588)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !146, line: 84, baseType: !1028)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1029, file: !146, line: 126, baseType: !1028, size: 64, offset: 384)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1029, file: !146, line: 129, baseType: !1028, size: 64, offset: 448)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1029, file: !146, line: 132, baseType: !486, size: 64, offset: 512)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1029, file: !146, line: 139, baseType: !489, size: 64, offset: 576)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1029, file: !146, line: 143, baseType: !538, size: 128, offset: 640)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1029, file: !146, line: 146, baseType: !538, size: 128, offset: 768)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1029, file: !146, line: 148, baseType: !481, size: 8, offset: 896)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1029, file: !146, line: 149, baseType: !481, size: 8, offset: 904)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1029, file: !146, line: 153, baseType: !154, size: 32, offset: 928)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1029, file: !146, line: 156, baseType: !1066, size: 64, offset: 960)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !146, line: 48, size: 320, elements: !1068)
!1068 = !{!1069, !1070, !1071, !1072}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1067, file: !146, line: 50, baseType: !813, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1067, file: !146, line: 59, baseType: !538, size: 128, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1067, file: !146, line: 64, baseType: !481, size: 8, offset: 192)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1067, file: !146, line: 67, baseType: !1066, size: 64, offset: 256)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1029, file: !146, line: 159, baseType: !1074, size: 64, offset: 1024)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !146, line: 72, size: 256, elements: !1076)
!1076 = !{!1077, !1078, !1079, !1080}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1075, file: !146, line: 74, baseType: !794, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1075, file: !146, line: 77, baseType: !1074, size: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1075, file: !146, line: 78, baseType: !1074, size: 64, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1075, file: !146, line: 81, baseType: !1074, size: 64, offset: 192)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1029, file: !146, line: 162, baseType: !481, size: 8, offset: 1088)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1029, file: !146, line: 166, baseType: !489, size: 64, offset: 1152)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !778, file: !135, line: 229, baseType: !1084, size: 128, offset: 256)
!1084 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1085, size: 128, elements: !732)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !135, line: 229, flags: DIFlagFwdDecl)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !778, file: !135, line: 232, baseType: !777, size: 64, offset: 384)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !778, file: !135, line: 233, baseType: !777, size: 64, offset: 448)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !778, file: !135, line: 238, baseType: !1090, size: 64, offset: 512)
!1090 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !135, line: 235, size: 64, elements: !1091)
!1091 = !{!1092, !1098}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1090, file: !135, line: 236, baseType: !1093, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !135, line: 273, size: 128, elements: !1095)
!1095 = !{!1096, !1097}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1094, file: !135, line: 275, baseType: !803, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1094, file: !135, line: 278, baseType: !803, size: 64, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1090, file: !135, line: 237, baseType: !1099, size: 64)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !135, line: 259, size: 320, elements: !1101)
!1101 = !{!1102, !1103, !1104, !1105, !1106}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1100, file: !135, line: 261, baseType: !664, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1100, file: !135, line: 262, baseType: !664, size: 64, offset: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1100, file: !135, line: 266, baseType: !664, size: 64, offset: 128)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1100, file: !135, line: 267, baseType: !664, size: 64, offset: 192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1100, file: !135, line: 270, baseType: !482, size: 32, offset: 256)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !778, file: !135, line: 241, baseType: !1024, size: 64, offset: 576)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !778, file: !135, line: 244, baseType: !482, size: 32, offset: 640)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !778, file: !135, line: 247, baseType: !482, size: 32, offset: 672)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !778, file: !135, line: 250, baseType: !482, size: 32, offset: 704)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !778, file: !135, line: 253, baseType: !482, size: 32, offset: 736)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !778, file: !135, line: 256, baseType: !482, size: 32, offset: 768)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !685, file: !667, line: 179, baseType: !1114, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !667, line: 150, baseType: !1116)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !667, line: 142, size: 320, elements: !1117)
!1117 = !{!1118, !1119, !1120, !1121, !1124, !1125}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1116, file: !667, line: 144, baseType: !489, size: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1116, file: !667, line: 145, baseType: !664, size: 64, offset: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1116, file: !667, line: 146, baseType: !664, size: 64, offset: 128)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1116, file: !667, line: 147, baseType: !1122, size: 32, offset: 192)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1123, line: 31, baseType: !482)
!1123 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1116, file: !667, line: 148, baseType: !7, size: 32, offset: 224)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1116, file: !667, line: 149, baseType: !481, size: 8, offset: 256)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !685, file: !667, line: 180, baseType: !1127, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !667, line: 162, baseType: !1129)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !667, line: 159, size: 128, elements: !1130)
!1130 = !{!1131, !1132}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1129, file: !667, line: 160, baseType: !489, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1129, file: !667, line: 161, baseType: !545, size: 64, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !685, file: !667, line: 181, baseType: !1134, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !667, line: 181, flags: DIFlagFwdDecl)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !680, file: !667, line: 317, baseType: !1137, size: 64)
!1137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 64, elements: !588)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !680, file: !667, line: 318, baseType: !1139, size: 320)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !667, line: 188, size: 320, elements: !1140)
!1140 = !{!1141, !1143, !1166}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1139, file: !667, line: 190, baseType: !1142, size: 192)
!1142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !684, size: 192, elements: !563)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1139, file: !667, line: 193, baseType: !1144, size: 64, offset: 192)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !667, line: 206, size: 320, elements: !1146)
!1146 = !{!1147, !1151, !1152, !1153, !1165}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1145, file: !667, line: 208, baseType: !1148, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !490, line: 62, baseType: !1150)
!1150 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !490, line: 61, flags: DIFlagFwdDecl)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1145, file: !667, line: 211, baseType: !7, size: 32, offset: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1145, file: !667, line: 214, baseType: !545, size: 64, offset: 128)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1145, file: !667, line: 224, baseType: !1154, size: 64, offset: 192)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !667, line: 202, baseType: !1156)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !667, line: 202, size: 128, elements: !1157)
!1157 = !{!1158}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1156, file: !667, line: 202, baseType: !1159, size: 128)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !667, line: 200, baseType: !1160)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !667, line: 200, size: 128, elements: !1161)
!1161 = !{!1162, !1163, !1164}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1160, file: !667, line: 200, baseType: !7, size: 32)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1160, file: !667, line: 200, baseType: !7, size: 32, offset: 32)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1160, file: !667, line: 200, baseType: !698, size: 64, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1145, file: !667, line: 234, baseType: !1154, size: 64, offset: 256)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1139, file: !667, line: 197, baseType: !545, size: 64, offset: 256)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !680, file: !667, line: 319, baseType: !552, size: 256)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !680, file: !667, line: 320, baseType: !571, size: 192)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !492, file: !164, line: 3384, baseType: !1170, size: 1472)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !164, line: 3114, size: 1472, elements: !1171)
!1171 = !{!1172, !1193, !1194, !1195, !1196}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1170, file: !164, line: 3115, baseType: !1173, size: 1216)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !164, line: 2984, size: 1216, elements: !1174)
!1174 = !{!1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1173, file: !164, line: 2985, baseType: !660, size: 960)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1173, file: !164, line: 2986, baseType: !489, size: 64, offset: 960)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1173, file: !164, line: 2987, baseType: !489, size: 64, offset: 1024)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1173, file: !164, line: 2988, baseType: !489, size: 64, offset: 1088)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1173, file: !164, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1173, file: !164, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1173, file: !164, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1173, file: !164, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1173, file: !164, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1173, file: !164, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1173, file: !164, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1173, file: !164, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1173, file: !164, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1173, file: !164, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1173, file: !164, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1173, file: !164, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1173, file: !164, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1173, file: !164, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1170, file: !164, line: 3117, baseType: !489, size: 64, offset: 1216)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1170, file: !164, line: 3119, baseType: !489, size: 64, offset: 1280)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1170, file: !164, line: 3121, baseType: !489, size: 64, offset: 1344)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1170, file: !164, line: 3123, baseType: !489, size: 64, offset: 1408)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !492, file: !164, line: 3385, baseType: !1198, size: 1088)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !164, line: 2874, size: 1088, elements: !1199)
!1199 = !{!1200, !1201, !1202}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1198, file: !164, line: 2875, baseType: !660, size: 960)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1198, file: !164, line: 2876, baseType: !664, size: 64, offset: 960)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1198, file: !164, line: 2877, baseType: !1203, size: 64, offset: 1024)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1205, line: 172, size: 128, elements: !1206)
!1205 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1206 = !{!1207, !1208, !1209, !1210, !1211, !1212, !1213}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1204, file: !1205, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1204, file: !1205, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1204, file: !1205, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1204, file: !1205, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1204, file: !1205, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1204, file: !1205, line: 195, baseType: !7, size: 32, offset: 32)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1204, file: !1205, line: 199, baseType: !489, size: 64, offset: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !492, file: !164, line: 3386, baseType: !1173, size: 1216)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !492, file: !164, line: 3387, baseType: !1216, size: 1280)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !164, line: 3093, size: 1280, elements: !1217)
!1217 = !{!1218, !1219}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1216, file: !164, line: 3094, baseType: !1173, size: 1216)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1216, file: !164, line: 3095, baseType: !1203, size: 64, offset: 1216)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !492, file: !164, line: 3388, baseType: !1221, size: 1216)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !164, line: 2824, size: 1216, elements: !1222)
!1222 = !{!1223, !1224, !1225, !1226, !1227, !1228}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1221, file: !164, line: 2825, baseType: !622, size: 896)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1221, file: !164, line: 2827, baseType: !489, size: 64, offset: 896)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1221, file: !164, line: 2828, baseType: !489, size: 64, offset: 960)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1221, file: !164, line: 2829, baseType: !489, size: 64, offset: 1024)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1221, file: !164, line: 2830, baseType: !489, size: 64, offset: 1088)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1221, file: !164, line: 2831, baseType: !489, size: 64, offset: 1152)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !492, file: !164, line: 3389, baseType: !1230, size: 1024)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !164, line: 2850, size: 1024, elements: !1231)
!1231 = !{!1232, !1233, !1234}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1230, file: !164, line: 2851, baseType: !660, size: 960)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1230, file: !164, line: 2852, baseType: !482, size: 32, offset: 960)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1230, file: !164, line: 2853, baseType: !482, size: 32, offset: 992)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !492, file: !164, line: 3390, baseType: !1236, size: 1024)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !164, line: 2857, size: 1024, elements: !1237)
!1237 = !{!1238, !1239}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1236, file: !164, line: 2858, baseType: !660, size: 960)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1236, file: !164, line: 2859, baseType: !1203, size: 64, offset: 960)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !492, file: !164, line: 3391, baseType: !1241, size: 960)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !164, line: 2862, size: 960, elements: !1242)
!1242 = !{!1243}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1241, file: !164, line: 2863, baseType: !660, size: 960)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !492, file: !164, line: 3392, baseType: !1245, size: 1472)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !164, line: 3304, size: 1472, elements: !1246)
!1246 = !{!1247}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1245, file: !164, line: 3305, baseType: !1170, size: 1472)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !492, file: !164, line: 3393, baseType: !1249, size: 1792)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !164, line: 3248, size: 1792, elements: !1250)
!1250 = !{!1251, !1252, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1249, file: !164, line: 3249, baseType: !1170, size: 1472)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1249, file: !164, line: 3251, baseType: !1253, size: 64, offset: 1472)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1255, line: 463, size: 1152, elements: !1256)
!1255 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1256 = !{!1257, !1260, !1291, !1292, !1407, !1415, !1416, !1417, !1418, !1419, !1420, !1444, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1254, file: !1255, line: 464, baseType: !1258, size: 64)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64)
!1259 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1255, line: 464, flags: DIFlagFwdDecl)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1254, file: !1255, line: 467, baseType: !1261, size: 64, offset: 64)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64)
!1262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !1263)
!1263 = !{!1264, !1266, !1267, !1280, !1281, !1282, !1283, !1284, !1285, !1287, !1289, !1290}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1262, file: !135, line: 377, baseType: !1265, size: 64)
