; ModuleID = 'tree-ssa-live.bc'
source_filename = "tree-ssa-live.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }

!281 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!282 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!283 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!284 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!285 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!286 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!287 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!288 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!289 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!290 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!291 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!292 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!293 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tree_code_class", file: !4, line: 58, baseType: !5, size: 32, elements: !294)
!294 = !{!295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305}
!295 = !DIEnumerator(name: "tcc_exceptional", value: 0, isUnsigned: true)
!296 = !DIEnumerator(name: "tcc_constant", value: 1, isUnsigned: true)
!297 = !DIEnumerator(name: "tcc_type", value: 2, isUnsigned: true)
!298 = !DIEnumerator(name: "tcc_declaration", value: 3, isUnsigned: true)
!299 = !DIEnumerator(name: "tcc_reference", value: 4, isUnsigned: true)
!300 = !DIEnumerator(name: "tcc_comparison", value: 5, isUnsigned: true)
!301 = !DIEnumerator(name: "tcc_unary", value: 6, isUnsigned: true)
!302 = !DIEnumerator(name: "tcc_binary", value: 7, isUnsigned: true)
!303 = !DIEnumerator(name: "tcc_statement", value: 8, isUnsigned: true)
!304 = !DIEnumerator(name: "tcc_vl_exp", value: 9, isUnsigned: true)
!305 = !DIEnumerator(name: "tcc_expression", value: 10, isUnsigned: true)
!306 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !255, line: 727, baseType: !5, size: 32, elements: !307)
!307 = !{!308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331}
!308 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!309 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!310 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!311 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!312 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!313 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!314 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!315 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!316 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!317 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!318 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!319 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!320 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!321 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!322 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!323 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!324 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!325 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!326 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!327 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!328 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!329 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!330 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!331 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!332 = !{!333, !334, !335, !336, !339, !340, !342, !3, !1036, !384, !365, !372, !5, !493, !678, !1548, !711, !337, !1550, !1553, !1560, !1565, !438}
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!335 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !338)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "var_map", file: !343, line: 77, baseType: !344)
!343 = !DIFile(filename: "./tree-ssa-live.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_var_map", file: !343, line: 54, size: 448, elements: !346)
!346 = !{!347, !364, !366, !367, !368, !369, !370, !371}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "var_partition", scope: !345, file: !343, line: 57, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "partition", file: !349, line: 65, baseType: !350)
!349 = !DIFile(filename: "./include/partition.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "partition_def", file: !349, line: 59, size: 256, elements: !352)
!352 = !{!353, !354}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "num_elements", scope: !351, file: !349, line: 62, baseType: !335, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !351, file: !349, line: 64, baseType: !355, size: 192, offset: 64)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 192, elements: !362)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "partition_elem", file: !349, line: 46, size: 192, elements: !357)
!357 = !{!358, !359, !361}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "class_element", scope: !356, file: !349, line: 50, baseType: !335, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !356, file: !349, line: 53, baseType: !360, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "class_count", scope: !356, file: !349, line: 56, baseType: !5, size: 32, offset: 128)
!362 = !{!363}
!363 = !DISubrange(count: 1)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "partition_to_view", scope: !345, file: !343, line: 60, baseType: !365, size: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "view_to_partition", scope: !345, file: !343, line: 61, baseType: !365, size: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "num_partitions", scope: !345, file: !343, line: 64, baseType: !5, size: 32, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "partition_size", scope: !345, file: !343, line: 67, baseType: !5, size: 32, offset: 224)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "num_basevars", scope: !345, file: !343, line: 70, baseType: !335, size: 32, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "partition_to_base_index", scope: !345, file: !343, line: 73, baseType: !365, size: 64, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "basevars", scope: !345, file: !343, line: 76, baseType: !372, size: 64, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_heap", file: !4, line: 184, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_heap", file: !4, line: 184, size: 128, elements: !375)
!375 = !{!376}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !374, file: !4, line: 184, baseType: !377, size: 128)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !4, line: 182, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !4, line: 182, size: 128, elements: !379)
!379 = !{!380, !381, !382}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !378, file: !4, line: 182, baseType: !5, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !378, file: !4, line: 182, baseType: !5, size: 32, offset: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !378, file: !4, line: 182, baseType: !383, size: 64, offset: 64)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 64, elements: !362)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !385, line: 56, baseType: !386)
!385 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !4, line: 3371, size: 1792, elements: !388)
!388 = !{!389, !422, !428, !441, !448, !455, !460, !467, !473, !486, !498, !536, !544, !572, !589, !590, !595, !604, !610, !615, !619, !623, !1197, !1246, !1252, !1258, !1265, !1278, !1292, !1309, !1321, !1343, !1358, !1530}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !387, file: !4, line: 3372, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !4, line: 360, size: 64, elements: !391)
!391 = !{!392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !390, file: !4, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !390, file: !4, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !390, file: !4, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !390, file: !4, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !390, file: !4, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !390, file: !4, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !390, file: !4, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !390, file: !4, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !390, file: !4, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !390, file: !4, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !390, file: !4, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !390, file: !4, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !390, file: !4, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !390, file: !4, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !390, file: !4, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !390, file: !4, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !390, file: !4, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !390, file: !4, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !390, file: !4, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !390, file: !4, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !390, file: !4, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !390, file: !4, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !390, file: !4, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !390, file: !4, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !390, file: !4, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !390, file: !4, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !390, file: !4, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !390, file: !4, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !390, file: !4, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !390, file: !4, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !387, file: !4, line: 3373, baseType: !423, size: 192)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !4, line: 402, size: 192, elements: !424)
!424 = !{!425, !426, !427}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !423, file: !4, line: 403, baseType: !390, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !423, file: !4, line: 404, baseType: !384, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !423, file: !4, line: 405, baseType: !384, size: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !387, file: !4, line: 3374, baseType: !429, size: 320)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !4, line: 1384, size: 320, elements: !430)
!430 = !{!431, !432}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !429, file: !4, line: 1385, baseType: !423, size: 192)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !429, file: !4, line: 1386, baseType: !433, size: 128, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !434, line: 58, baseType: !435)
!434 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !434, line: 54, size: 128, elements: !436)
!436 = !{!437, !439}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !435, file: !434, line: 56, baseType: !438, size: 64)
!438 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !435, file: !434, line: 57, baseType: !440, size: 64, offset: 64)
!440 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !387, file: !4, line: 3375, baseType: !442, size: 256)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !4, line: 1397, size: 256, elements: !443)
!443 = !{!444, !445}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !442, file: !4, line: 1398, baseType: !423, size: 192)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !442, file: !4, line: 1399, baseType: !446, size: 64, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !4, line: 1392, flags: DIFlagFwdDecl)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !387, file: !4, line: 3376, baseType: !449, size: 256)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !4, line: 1408, size: 256, elements: !450)
!450 = !{!451, !452}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !449, file: !4, line: 1409, baseType: !423, size: 192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !449, file: !4, line: 1410, baseType: !453, size: 64, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !4, line: 1403, flags: DIFlagFwdDecl)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !387, file: !4, line: 3377, baseType: !456, size: 256)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !4, line: 1437, size: 256, elements: !457)
!457 = !{!458, !459}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !456, file: !4, line: 1438, baseType: !423, size: 192)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !456, file: !4, line: 1439, baseType: !384, size: 64, offset: 192)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !387, file: !4, line: 3378, baseType: !461, size: 256)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !4, line: 1418, size: 256, elements: !462)
!462 = !{!463, !464, !465}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !461, file: !4, line: 1419, baseType: !423, size: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !461, file: !4, line: 1420, baseType: !335, size: 32, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !461, file: !4, line: 1421, baseType: !466, size: 8, offset: 224)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 8, elements: !362)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !387, file: !4, line: 3379, baseType: !468, size: 320)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !4, line: 1428, size: 320, elements: !469)
!469 = !{!470, !471, !472}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !468, file: !4, line: 1429, baseType: !423, size: 192)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !468, file: !4, line: 1430, baseType: !384, size: 64, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !468, file: !4, line: 1431, baseType: !384, size: 64, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !387, file: !4, line: 3380, baseType: !474, size: 320)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !4, line: 1460, size: 320, elements: !475)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !474, file: !4, line: 1461, baseType: !423, size: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !474, file: !4, line: 1462, baseType: !478, size: 128, offset: 192)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !479, line: 31, size: 128, elements: !480)
!479 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!480 = !{!481, !484, !485}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !478, file: !479, line: 32, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !478, file: !479, line: 33, baseType: !5, size: 32, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !478, file: !479, line: 34, baseType: !5, size: 32, offset: 96)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !387, file: !4, line: 3381, baseType: !487, size: 384)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !4, line: 2507, size: 384, elements: !488)
!488 = !{!489, !490, !495, !496, !497}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !487, file: !4, line: 2508, baseType: !423, size: 192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !487, file: !4, line: 2509, baseType: !491, size: 32, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !492, line: 58, baseType: !493)
!492 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !494, line: 44, baseType: !5)
!494 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!495 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !487, file: !4, line: 2510, baseType: !5, size: 32, offset: 224)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !487, file: !4, line: 2511, baseType: !384, size: 64, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !487, file: !4, line: 2512, baseType: !384, size: 64, offset: 320)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !387, file: !4, line: 3382, baseType: !499, size: 896)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !4, line: 2652, size: 896, elements: !500)
!500 = !{!501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !499, file: !4, line: 2653, baseType: !487, size: 384)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !499, file: !4, line: 2654, baseType: !384, size: 64, offset: 384)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !499, file: !4, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !499, file: !4, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !499, file: !4, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !499, file: !4, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !499, file: !4, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !499, file: !4, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !499, file: !4, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !499, file: !4, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !499, file: !4, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !499, file: !4, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !499, file: !4, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !499, file: !4, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !499, file: !4, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !499, file: !4, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !499, file: !4, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !499, file: !4, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !499, file: !4, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !499, file: !4, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !499, file: !4, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !499, file: !4, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !499, file: !4, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !499, file: !4, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !499, file: !4, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !499, file: !4, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !499, file: !4, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !499, file: !4, line: 2703, baseType: !5, size: 32, offset: 512)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !499, file: !4, line: 2705, baseType: !384, size: 64, offset: 576)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !499, file: !4, line: 2706, baseType: !384, size: 64, offset: 640)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !499, file: !4, line: 2707, baseType: !384, size: 64, offset: 704)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !499, file: !4, line: 2708, baseType: !384, size: 64, offset: 768)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !499, file: !4, line: 2711, baseType: !534, size: 64, offset: 832)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !4, line: 2711, flags: DIFlagFwdDecl)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !387, file: !4, line: 3383, baseType: !537, size: 960)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !4, line: 2756, size: 960, elements: !538)
!538 = !{!539, !540}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !537, file: !4, line: 2757, baseType: !499, size: 896)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !537, file: !4, line: 2758, baseType: !541, size: 64, offset: 896)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !385, line: 50, baseType: !542)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !385, line: 49, flags: DIFlagFwdDecl)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !387, file: !4, line: 3384, baseType: !545, size: 1472)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !4, line: 3114, size: 1472, elements: !546)
!546 = !{!547, !568, !569, !570, !571}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !545, file: !4, line: 3115, baseType: !548, size: 1216)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !4, line: 2984, size: 1216, elements: !549)
!549 = !{!550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !548, file: !4, line: 2985, baseType: !537, size: 960)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !548, file: !4, line: 2986, baseType: !384, size: 64, offset: 960)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !548, file: !4, line: 2987, baseType: !384, size: 64, offset: 1024)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !548, file: !4, line: 2988, baseType: !384, size: 64, offset: 1088)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !548, file: !4, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !548, file: !4, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !548, file: !4, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !548, file: !4, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !548, file: !4, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !548, file: !4, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !548, file: !4, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !548, file: !4, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !548, file: !4, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !548, file: !4, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !548, file: !4, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !548, file: !4, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !548, file: !4, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !548, file: !4, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !545, file: !4, line: 3117, baseType: !384, size: 64, offset: 1216)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !545, file: !4, line: 3119, baseType: !384, size: 64, offset: 1280)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !545, file: !4, line: 3121, baseType: !384, size: 64, offset: 1344)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !545, file: !4, line: 3123, baseType: !384, size: 64, offset: 1408)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !387, file: !4, line: 3385, baseType: !573, size: 1088)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !4, line: 2874, size: 1088, elements: !574)
!574 = !{!575, !576, !577}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !573, file: !4, line: 2875, baseType: !537, size: 960)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !573, file: !4, line: 2876, baseType: !541, size: 64, offset: 960)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !573, file: !4, line: 2877, baseType: !578, size: 64, offset: 1024)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !580, line: 172, size: 128, elements: !581)
!580 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!581 = !{!582, !583, !584, !585, !586, !587, !588}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !579, file: !580, line: 174, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !579, file: !580, line: 178, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !579, file: !580, line: 183, baseType: !5, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !579, file: !580, line: 187, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !579, file: !580, line: 192, baseType: !5, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !579, file: !580, line: 195, baseType: !5, size: 32, offset: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !579, file: !580, line: 199, baseType: !384, size: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !387, file: !4, line: 3386, baseType: !548, size: 1216)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !387, file: !4, line: 3387, baseType: !591, size: 1280)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !4, line: 3093, size: 1280, elements: !592)
!592 = !{!593, !594}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !591, file: !4, line: 3094, baseType: !548, size: 1216)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !591, file: !4, line: 3095, baseType: !578, size: 64, offset: 1216)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !387, file: !4, line: 3388, baseType: !596, size: 1216)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !4, line: 2824, size: 1216, elements: !597)
!597 = !{!598, !599, !600, !601, !602, !603}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !596, file: !4, line: 2825, baseType: !499, size: 896)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !596, file: !4, line: 2827, baseType: !384, size: 64, offset: 896)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !596, file: !4, line: 2828, baseType: !384, size: 64, offset: 960)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !596, file: !4, line: 2829, baseType: !384, size: 64, offset: 1024)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !596, file: !4, line: 2830, baseType: !384, size: 64, offset: 1088)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !596, file: !4, line: 2831, baseType: !384, size: 64, offset: 1152)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !387, file: !4, line: 3389, baseType: !605, size: 1024)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !4, line: 2850, size: 1024, elements: !606)
!606 = !{!607, !608, !609}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !605, file: !4, line: 2851, baseType: !537, size: 960)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !605, file: !4, line: 2852, baseType: !335, size: 32, offset: 960)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !605, file: !4, line: 2853, baseType: !335, size: 32, offset: 992)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !387, file: !4, line: 3390, baseType: !611, size: 1024)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !4, line: 2857, size: 1024, elements: !612)
!612 = !{!613, !614}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !611, file: !4, line: 2858, baseType: !537, size: 960)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !611, file: !4, line: 2859, baseType: !578, size: 64, offset: 960)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !387, file: !4, line: 3391, baseType: !616, size: 960)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !4, line: 2862, size: 960, elements: !617)
!617 = !{!618}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !616, file: !4, line: 2863, baseType: !537, size: 960)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !387, file: !4, line: 3392, baseType: !620, size: 1472)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !4, line: 3304, size: 1472, elements: !621)
!621 = !{!622}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !620, file: !4, line: 3305, baseType: !545, size: 1472)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !387, file: !4, line: 3393, baseType: !624, size: 1792)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !4, line: 3248, size: 1792, elements: !625)
!625 = !{!626, !627, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !624, file: !4, line: 3249, baseType: !545, size: 1472)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !624, file: !4, line: 3251, baseType: !628, size: 64, offset: 1472)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !630, line: 463, size: 1152, elements: !631)
!630 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!631 = !{!632, !635, !950, !951, !1117, !1120, !1121, !1122, !1123, !1124, !1125, !1149, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !629, file: !630, line: 464, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !630, line: 464, flags: DIFlagFwdDecl)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !629, file: !630, line: 467, baseType: !636, size: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !200, line: 374, size: 640, elements: !638)
!638 = !{!639, !925, !926, !939, !940, !941, !942, !943, !944, !946, !948, !949}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !637, file: !200, line: 377, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !385, line: 111, baseType: !641)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !200, line: 217, size: 832, elements: !643)
!643 = !{!644, !888, !889, !890, !893, !899, !900, !901, !919, !920, !921, !922, !923, !924}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !642, file: !200, line: 219, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !200, line: 151, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !200, line: 151, size: 128, elements: !648)
!648 = !{!649}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !647, file: !200, line: 151, baseType: !650, size: 128)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !200, line: 150, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !200, line: 150, size: 128, elements: !652)
!652 = !{!653, !654, !655}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !651, file: !200, line: 150, baseType: !5, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !651, file: !200, line: 150, baseType: !5, size: 32, offset: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !651, file: !200, line: 150, baseType: !656, size: 64, offset: 64)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !657, size: 64, elements: !362)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !385, line: 108, baseType: !658)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !200, line: 122, size: 512, elements: !660)
!660 = !{!661, !662, !663, !880, !881, !882, !883, !884, !885, !886}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !659, file: !200, line: 124, baseType: !641, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !659, file: !200, line: 125, baseType: !641, size: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !659, file: !200, line: 131, baseType: !664, size: 64, offset: 128)
!664 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !200, line: 128, size: 64, elements: !665)
!665 = !{!666, !879}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !664, file: !200, line: 129, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !385, line: 66, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !255, line: 143, size: 192, elements: !670)
!670 = !{!671, !877, !878}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !669, file: !255, line: 145, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !385, line: 69, baseType: !673)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !255, line: 136, size: 192, elements: !675)
!675 = !{!676, !875, !876}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !674, file: !255, line: 137, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !385, line: 58, baseType: !678)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !255, line: 737, size: 768, elements: !680)
!680 = !{!681, !698, !730, !736, !741, !746, !753, !759, !765, !770, !784, !789, !795, !800, !810, !815, !833, !840, !847, !853, !858, !864, !870}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !679, file: !255, line: 738, baseType: !682, size: 256)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !255, line: 271, size: 256, elements: !683)
!683 = !{!684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !682, file: !255, line: 274, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !682, file: !255, line: 277, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !682, file: !255, line: 281, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !682, file: !255, line: 284, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !682, file: !255, line: 291, baseType: !5, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !682, file: !255, line: 295, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !682, file: !255, line: 298, baseType: !5, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !682, file: !255, line: 301, baseType: !5, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !682, file: !255, line: 307, baseType: !5, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !682, file: !255, line: 312, baseType: !5, size: 32, offset: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !682, file: !255, line: 316, baseType: !491, size: 32, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !682, file: !255, line: 319, baseType: !5, size: 32, offset: 96)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !682, file: !255, line: 323, baseType: !641, size: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !682, file: !255, line: 327, baseType: !384, size: 64, offset: 192)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !679, file: !255, line: 739, baseType: !699, size: 448)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !255, line: 350, size: 448, elements: !700)
!700 = !{!701, !729}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !699, file: !255, line: 353, baseType: !702, size: 384)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !255, line: 333, size: 384, elements: !703)
!703 = !{!704, !705, !712}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !702, file: !255, line: 336, baseType: !682, size: 256)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !702, file: !255, line: 343, baseType: !706, size: 64, offset: 256)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !248, line: 37, size: 128, elements: !708)
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !707, file: !248, line: 39, baseType: !706, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !707, file: !248, line: 40, baseType: !711, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !702, file: !255, line: 344, baseType: !713, size: 64, offset: 320)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !248, line: 45, size: 320, elements: !715)
!715 = !{!716, !717}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !714, file: !248, line: 47, baseType: !713, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !714, file: !248, line: 48, baseType: !718, size: 256, offset: 64)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !4, line: 1883, size: 256, elements: !719)
!719 = !{!720, !722, !723, !728}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !718, file: !4, line: 1884, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !718, file: !4, line: 1885, baseType: !721, size: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !718, file: !4, line: 1891, baseType: !724, size: 64, offset: 128)
!724 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !718, file: !4, line: 1891, size: 64, elements: !725)
!725 = !{!726, !727}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !724, file: !4, line: 1891, baseType: !677, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !724, file: !4, line: 1891, baseType: !384, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !718, file: !4, line: 1892, baseType: !711, size: 64, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !699, file: !255, line: 359, baseType: !383, size: 64, offset: 384)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !679, file: !255, line: 740, baseType: !731, size: 512)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !255, line: 365, size: 512, elements: !732)
!732 = !{!733, !734, !735}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !731, file: !255, line: 368, baseType: !702, size: 384)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !731, file: !255, line: 373, baseType: !384, size: 64, offset: 384)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !731, file: !255, line: 374, baseType: !384, size: 64, offset: 448)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !679, file: !255, line: 741, baseType: !737, size: 576)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !255, line: 380, size: 576, elements: !738)
!738 = !{!739, !740}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !737, file: !255, line: 383, baseType: !731, size: 512)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !737, file: !255, line: 389, baseType: !383, size: 64, offset: 512)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !679, file: !255, line: 742, baseType: !742, size: 320)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !255, line: 395, size: 320, elements: !743)
!743 = !{!744, !745}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !742, file: !255, line: 397, baseType: !682, size: 256)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !742, file: !255, line: 400, baseType: !667, size: 64, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !679, file: !255, line: 743, baseType: !747, size: 448)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !255, line: 406, size: 448, elements: !748)
!748 = !{!749, !750, !751, !752}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !747, file: !255, line: 408, baseType: !682, size: 256)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !747, file: !255, line: 412, baseType: !384, size: 64, offset: 256)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !747, file: !255, line: 420, baseType: !384, size: 64, offset: 320)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !747, file: !255, line: 423, baseType: !667, size: 64, offset: 384)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !679, file: !255, line: 744, baseType: !754, size: 384)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !255, line: 429, size: 384, elements: !755)
!755 = !{!756, !757, !758}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !754, file: !255, line: 431, baseType: !682, size: 256)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !754, file: !255, line: 434, baseType: !384, size: 64, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !754, file: !255, line: 437, baseType: !667, size: 64, offset: 320)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !679, file: !255, line: 745, baseType: !760, size: 384)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !255, line: 443, size: 384, elements: !761)
!761 = !{!762, !763, !764}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !760, file: !255, line: 445, baseType: !682, size: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !760, file: !255, line: 449, baseType: !384, size: 64, offset: 256)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !760, file: !255, line: 453, baseType: !667, size: 64, offset: 320)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !679, file: !255, line: 746, baseType: !766, size: 320)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !255, line: 459, size: 320, elements: !767)
!767 = !{!768, !769}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !766, file: !255, line: 461, baseType: !682, size: 256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !766, file: !255, line: 464, baseType: !384, size: 64, offset: 256)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !679, file: !255, line: 747, baseType: !771, size: 768)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !255, line: 469, size: 768, elements: !772)
!772 = !{!773, !774, !775, !776, !777}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !771, file: !255, line: 471, baseType: !682, size: 256)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !771, file: !255, line: 474, baseType: !5, size: 32, offset: 256)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !771, file: !255, line: 475, baseType: !5, size: 32, offset: 288)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !771, file: !255, line: 478, baseType: !384, size: 64, offset: 320)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !771, file: !255, line: 481, baseType: !778, size: 384, offset: 384)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !779, size: 384, elements: !362)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !4, line: 1917, size: 384, elements: !780)
!780 = !{!781, !782, !783}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !779, file: !4, line: 1920, baseType: !718, size: 256)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !779, file: !4, line: 1921, baseType: !384, size: 64, offset: 256)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !779, file: !4, line: 1922, baseType: !491, size: 32, offset: 320)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !679, file: !255, line: 748, baseType: !785, size: 320)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !255, line: 487, size: 320, elements: !786)
!786 = !{!787, !788}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !785, file: !255, line: 490, baseType: !682, size: 256)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !785, file: !255, line: 494, baseType: !335, size: 32, offset: 256)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !679, file: !255, line: 749, baseType: !790, size: 384)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !255, line: 500, size: 384, elements: !791)
!791 = !{!792, !793, !794}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !790, file: !255, line: 502, baseType: !682, size: 256)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !790, file: !255, line: 506, baseType: !667, size: 64, offset: 256)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !790, file: !255, line: 510, baseType: !667, size: 64, offset: 320)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !679, file: !255, line: 750, baseType: !796, size: 320)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !255, line: 529, size: 320, elements: !797)
!797 = !{!798, !799}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !796, file: !255, line: 531, baseType: !682, size: 256)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !796, file: !255, line: 540, baseType: !667, size: 64, offset: 256)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !679, file: !255, line: 751, baseType: !801, size: 704)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !255, line: 546, size: 704, elements: !802)
!802 = !{!803, !804, !805, !806, !807, !808, !809}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !801, file: !255, line: 549, baseType: !731, size: 512)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !801, file: !255, line: 553, baseType: !340, size: 64, offset: 512)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !801, file: !255, line: 557, baseType: !334, size: 8, offset: 576)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !801, file: !255, line: 558, baseType: !334, size: 8, offset: 584)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !801, file: !255, line: 559, baseType: !334, size: 8, offset: 592)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !801, file: !255, line: 560, baseType: !334, size: 8, offset: 600)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !801, file: !255, line: 566, baseType: !383, size: 64, offset: 640)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !679, file: !255, line: 752, baseType: !811, size: 384)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !255, line: 571, size: 384, elements: !812)
!812 = !{!813, !814}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !811, file: !255, line: 573, baseType: !742, size: 320)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !811, file: !255, line: 577, baseType: !384, size: 64, offset: 320)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !679, file: !255, line: 753, baseType: !816, size: 576)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !255, line: 600, size: 576, elements: !817)
!817 = !{!818, !819, !820, !823, !832}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !816, file: !255, line: 602, baseType: !742, size: 320)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !816, file: !255, line: 605, baseType: !384, size: 64, offset: 320)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !816, file: !255, line: 609, baseType: !821, size: 64, offset: 384)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !822, line: 46, baseType: !438)
!822 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!823 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !816, file: !255, line: 612, baseType: !824, size: 64, offset: 448)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !255, line: 581, size: 320, elements: !826)
!826 = !{!827, !828, !829, !830, !831}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !825, file: !255, line: 583, baseType: !3, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !825, file: !255, line: 586, baseType: !384, size: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !825, file: !255, line: 589, baseType: !384, size: 64, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !825, file: !255, line: 592, baseType: !384, size: 64, offset: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !825, file: !255, line: 595, baseType: !384, size: 64, offset: 256)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !816, file: !255, line: 616, baseType: !667, size: 64, offset: 512)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !679, file: !255, line: 754, baseType: !834, size: 512)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !255, line: 622, size: 512, elements: !835)
!835 = !{!836, !837, !838, !839}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !834, file: !255, line: 624, baseType: !742, size: 320)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !834, file: !255, line: 628, baseType: !384, size: 64, offset: 320)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !834, file: !255, line: 632, baseType: !384, size: 64, offset: 384)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !834, file: !255, line: 636, baseType: !384, size: 64, offset: 448)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !679, file: !255, line: 755, baseType: !841, size: 704)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !255, line: 642, size: 704, elements: !842)
!842 = !{!843, !844, !845, !846}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !841, file: !255, line: 644, baseType: !834, size: 512)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !841, file: !255, line: 648, baseType: !384, size: 64, offset: 512)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !841, file: !255, line: 652, baseType: !384, size: 64, offset: 576)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !841, file: !255, line: 653, baseType: !384, size: 64, offset: 640)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !679, file: !255, line: 756, baseType: !848, size: 448)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !255, line: 663, size: 448, elements: !849)
!849 = !{!850, !851, !852}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !848, file: !255, line: 665, baseType: !742, size: 320)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !848, file: !255, line: 668, baseType: !384, size: 64, offset: 320)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !848, file: !255, line: 673, baseType: !384, size: 64, offset: 384)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !679, file: !255, line: 757, baseType: !854, size: 384)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !255, line: 694, size: 384, elements: !855)
!855 = !{!856, !857}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !854, file: !255, line: 696, baseType: !742, size: 320)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !854, file: !255, line: 699, baseType: !384, size: 64, offset: 320)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !679, file: !255, line: 758, baseType: !859, size: 384)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !255, line: 681, size: 384, elements: !860)
!860 = !{!861, !862, !863}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !859, file: !255, line: 683, baseType: !682, size: 256)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !859, file: !255, line: 686, baseType: !384, size: 64, offset: 256)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !859, file: !255, line: 689, baseType: !384, size: 64, offset: 320)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !679, file: !255, line: 759, baseType: !865, size: 384)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !255, line: 707, size: 384, elements: !866)
!866 = !{!867, !868, !869}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !865, file: !255, line: 709, baseType: !682, size: 256)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !865, file: !255, line: 712, baseType: !384, size: 64, offset: 256)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !865, file: !255, line: 712, baseType: !384, size: 64, offset: 320)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !679, file: !255, line: 760, baseType: !871, size: 320)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !255, line: 718, size: 320, elements: !872)
!872 = !{!873, !874}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !871, file: !255, line: 720, baseType: !682, size: 256)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !871, file: !255, line: 723, baseType: !384, size: 64, offset: 256)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !674, file: !255, line: 138, baseType: !673, size: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !674, file: !255, line: 139, baseType: !673, size: 64, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !669, file: !255, line: 146, baseType: !672, size: 64, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !669, file: !255, line: 152, baseType: !667, size: 64, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !664, file: !200, line: 130, baseType: !541, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !659, file: !200, line: 134, baseType: !339, size: 64, offset: 192)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !659, file: !200, line: 137, baseType: !384, size: 64, offset: 256)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !659, file: !200, line: 138, baseType: !491, size: 32, offset: 320)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !659, file: !200, line: 142, baseType: !5, size: 32, offset: 352)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !659, file: !200, line: 144, baseType: !335, size: 32, offset: 384)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !659, file: !200, line: 145, baseType: !335, size: 32, offset: 416)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !659, file: !200, line: 146, baseType: !887, size: 64, offset: 448)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !200, line: 119, baseType: !440)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !642, file: !200, line: 220, baseType: !645, size: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !642, file: !200, line: 223, baseType: !339, size: 64, offset: 128)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !642, file: !200, line: 226, baseType: !891, size: 64, offset: 192)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !200, line: 185, flags: DIFlagFwdDecl)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !642, file: !200, line: 229, baseType: !894, size: 128, offset: 256)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !895, size: 128, elements: !897)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !200, line: 229, flags: DIFlagFwdDecl)
!897 = !{!898}
!898 = !DISubrange(count: 2)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !642, file: !200, line: 232, baseType: !641, size: 64, offset: 384)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !642, file: !200, line: 233, baseType: !641, size: 64, offset: 448)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !642, file: !200, line: 238, baseType: !902, size: 64, offset: 512)
!902 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !200, line: 235, size: 64, elements: !903)
!903 = !{!904, !910}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !902, file: !200, line: 236, baseType: !905, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !200, line: 273, size: 128, elements: !907)
!907 = !{!908, !909}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !906, file: !200, line: 275, baseType: !667, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !906, file: !200, line: 278, baseType: !667, size: 64, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !902, file: !200, line: 237, baseType: !911, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !200, line: 259, size: 320, elements: !913)
!913 = !{!914, !915, !916, !917, !918}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !912, file: !200, line: 261, baseType: !541, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !912, file: !200, line: 262, baseType: !541, size: 64, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !912, file: !200, line: 266, baseType: !541, size: 64, offset: 128)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !912, file: !200, line: 267, baseType: !541, size: 64, offset: 192)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !912, file: !200, line: 270, baseType: !335, size: 32, offset: 256)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !642, file: !200, line: 241, baseType: !887, size: 64, offset: 576)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !642, file: !200, line: 244, baseType: !335, size: 32, offset: 640)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !642, file: !200, line: 247, baseType: !335, size: 32, offset: 672)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !642, file: !200, line: 250, baseType: !335, size: 32, offset: 704)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !642, file: !200, line: 253, baseType: !335, size: 32, offset: 736)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !642, file: !200, line: 256, baseType: !335, size: 32, offset: 768)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !637, file: !200, line: 378, baseType: !640, size: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !637, file: !200, line: 381, baseType: !927, size: 64, offset: 128)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !200, line: 282, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !200, line: 282, size: 128, elements: !930)
!930 = !{!931}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !929, file: !200, line: 282, baseType: !932, size: 128)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !200, line: 281, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !200, line: 281, size: 128, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !933, file: !200, line: 281, baseType: !5, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !933, file: !200, line: 281, baseType: !5, size: 32, offset: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !933, file: !200, line: 281, baseType: !938, size: 64, offset: 64)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !640, size: 64, elements: !362)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !637, file: !200, line: 384, baseType: !335, size: 32, offset: 192)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !637, file: !200, line: 387, baseType: !335, size: 32, offset: 224)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !637, file: !200, line: 390, baseType: !335, size: 32, offset: 256)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !637, file: !200, line: 394, baseType: !927, size: 64, offset: 320)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !637, file: !200, line: 396, baseType: !199, size: 32, offset: 384)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !637, file: !200, line: 399, baseType: !945, size: 64, offset: 416)
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 64, elements: !897)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !637, file: !200, line: 402, baseType: !947, size: 64, offset: 480)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !897)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !637, file: !200, line: 406, baseType: !335, size: 32, offset: 544)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !637, file: !200, line: 409, baseType: !335, size: 32, offset: 576)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !629, file: !630, line: 470, baseType: !668, size: 64, offset: 128)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !629, file: !630, line: 473, baseType: !952, size: 64, offset: 192)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !580, line: 39, size: 1152, elements: !954)
!954 = !{!955, !1005, !1018, !1024, !1025, !1094, !1095, !1099, !1100, !1101, !1102, !1103}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !953, file: !580, line: 41, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !957, line: 144, baseType: !958)
!957 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !957, line: 100, size: 896, elements: !960)
!960 = !{!961, !969, !974, !979, !981, !982, !983, !984, !985, !986, !991, !993, !994, !999, !1004}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !959, file: !957, line: 102, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !957, line: 52, baseType: !963)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!966, !967}
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !957, line: 47, baseType: !5)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !959, file: !957, line: 105, baseType: !970, size: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !957, line: 59, baseType: !971)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!335, !967, !967}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !959, file: !957, line: 108, baseType: !975, size: 64, offset: 128)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !957, line: 63, baseType: !976)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{null, !339}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !959, file: !957, line: 111, baseType: !980, size: 64, offset: 192)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !959, file: !957, line: 114, baseType: !821, size: 64, offset: 256)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !959, file: !957, line: 117, baseType: !821, size: 64, offset: 320)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !959, file: !957, line: 120, baseType: !821, size: 64, offset: 384)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !959, file: !957, line: 124, baseType: !5, size: 32, offset: 448)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !959, file: !957, line: 128, baseType: !5, size: 32, offset: 480)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !959, file: !957, line: 131, baseType: !987, size: 64, offset: 512)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !957, line: 75, baseType: !988)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!339, !821, !821}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !959, file: !957, line: 132, baseType: !992, size: 64, offset: 576)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !957, line: 78, baseType: !976)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !959, file: !957, line: 135, baseType: !339, size: 64, offset: 640)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !959, file: !957, line: 136, baseType: !995, size: 64, offset: 704)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !957, line: 82, baseType: !996)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!339, !339, !821, !821}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !959, file: !957, line: 137, baseType: !1000, size: 64, offset: 768)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !957, line: 83, baseType: !1001)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{null, !339, !339}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !959, file: !957, line: 141, baseType: !5, size: 32, offset: 832)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !953, file: !580, line: 48, baseType: !1006, size: 64, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !255, line: 35, baseType: !1008)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !255, line: 35, size: 128, elements: !1009)
!1009 = !{!1010}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1008, file: !255, line: 35, baseType: !1011, size: 128)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !255, line: 33, baseType: !1012)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !255, line: 33, size: 128, elements: !1013)
!1013 = !{!1014, !1015, !1016}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1012, file: !255, line: 33, baseType: !5, size: 32)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1012, file: !255, line: 33, baseType: !5, size: 32, offset: 32)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1012, file: !255, line: 33, baseType: !1017, size: 64, offset: 64)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !677, size: 64, elements: !362)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !953, file: !580, line: 51, baseType: !1019, size: 64, offset: 128)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !4, line: 183, baseType: !1021)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !4, line: 183, size: 128, elements: !1022)
!1022 = !{!1023}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1021, file: !4, line: 183, baseType: !377, size: 128)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !953, file: !580, line: 54, baseType: !384, size: 64, offset: 192)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !953, file: !580, line: 57, baseType: !1026, size: 128, offset: 256)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1027, line: 31, size: 128, elements: !1028)
!1027 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1028 = !{!1029, !1030, !1031, !1032, !1033, !1034, !1035}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1026, file: !1027, line: 35, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1026, file: !1027, line: 39, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1026, file: !1027, line: 42, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1026, file: !1027, line: 46, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1026, file: !1027, line: 50, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1026, file: !1027, line: 53, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1026, file: !1027, line: 56, baseType: !1036, size: 64, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !385, line: 47, baseType: !1037)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1039, line: 75, size: 256, elements: !1040)
!1039 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1040 = !{!1041, !1053, !1054, !1055}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1038, file: !1039, line: 76, baseType: !1042, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1039, line: 68, baseType: !1044)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1039, line: 63, size: 320, elements: !1045)
!1045 = !{!1046, !1048, !1049, !1050}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1044, file: !1039, line: 64, baseType: !1047, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1044, file: !1039, line: 65, baseType: !1047, size: 64, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1044, file: !1039, line: 66, baseType: !5, size: 32, offset: 128)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1044, file: !1039, line: 67, baseType: !1051, size: 128, offset: 192)
!1051 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1052, size: 128, elements: !897)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1039, line: 29, baseType: !438)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1038, file: !1039, line: 77, baseType: !1042, size: 64, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1038, file: !1039, line: 78, baseType: !5, size: 32, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1038, file: !1039, line: 79, baseType: !1056, size: 64, offset: 192)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1039, line: 49, baseType: !1058)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1039, line: 45, size: 832, elements: !1059)
!1059 = !{!1060, !1061, !1062}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1058, file: !1039, line: 46, baseType: !1047, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1058, file: !1039, line: 47, baseType: !1037, size: 64, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1058, file: !1039, line: 48, baseType: !1063, size: 704, offset: 128)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1064, line: 164, size: 704, elements: !1065)
!1064 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1065 = !{!1066, !1067, !1077, !1078, !1079, !1080, !1081, !1082, !1086, !1090, !1091, !1092, !1093}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1063, file: !1064, line: 166, baseType: !440, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1063, file: !1064, line: 167, baseType: !1068, size: 64, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1064, line: 157, size: 192, elements: !1070)
!1070 = !{!1071, !1072, !1073}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1069, file: !1064, line: 159, baseType: !337, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1069, file: !1064, line: 160, baseType: !1068, size: 64, offset: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1069, file: !1064, line: 161, baseType: !1074, size: 32, offset: 128)
!1074 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 32, elements: !1075)
!1075 = !{!1076}
!1076 = !DISubrange(count: 4)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1063, file: !1064, line: 168, baseType: !337, size: 64, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1063, file: !1064, line: 169, baseType: !337, size: 64, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1063, file: !1064, line: 170, baseType: !337, size: 64, offset: 256)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1063, file: !1064, line: 171, baseType: !440, size: 64, offset: 320)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1063, file: !1064, line: 172, baseType: !335, size: 32, offset: 384)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1063, file: !1064, line: 176, baseType: !1083, size: 64, offset: 448)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!1068, !339, !440}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1063, file: !1064, line: 177, baseType: !1087, size: 64, offset: 512)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{null, !339, !1068}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1063, file: !1064, line: 178, baseType: !339, size: 64, offset: 576)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1063, file: !1064, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1063, file: !1064, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1063, file: !1064, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !953, file: !580, line: 60, baseType: !1026, size: 128, offset: 384)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !953, file: !580, line: 64, baseType: !1096, size: 64, offset: 512)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1098, line: 33, flags: DIFlagFwdDecl)
!1098 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !953, file: !580, line: 67, baseType: !384, size: 64, offset: 576)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !953, file: !580, line: 73, baseType: !956, size: 64, offset: 640)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !953, file: !580, line: 77, baseType: !1036, size: 64, offset: 704)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !953, file: !580, line: 80, baseType: !5, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !953, file: !580, line: 82, baseType: !1104, size: 320, offset: 832)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !248, line: 62, size: 320, elements: !1105)
!1105 = !{!1106, !1112, !1113, !1114, !1115, !1116}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1104, file: !248, line: 63, baseType: !1107, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !248, line: 56, size: 128, elements: !1109)
!1109 = !{!1110, !1111}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1108, file: !248, line: 57, baseType: !1107, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1108, file: !248, line: 58, baseType: !466, size: 8, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1104, file: !248, line: 64, baseType: !5, size: 32, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1104, file: !248, line: 66, baseType: !5, size: 32, offset: 96)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1104, file: !248, line: 68, baseType: !334, size: 8, offset: 128)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1104, file: !248, line: 70, baseType: !706, size: 64, offset: 192)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1104, file: !248, line: 71, baseType: !713, size: 64, offset: 256)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !629, file: !630, line: 476, baseType: !1118, size: 64, offset: 256)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !630, line: 476, flags: DIFlagFwdDecl)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !629, file: !630, line: 479, baseType: !956, size: 64, offset: 320)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !629, file: !630, line: 484, baseType: !384, size: 64, offset: 384)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !629, file: !630, line: 488, baseType: !384, size: 64, offset: 448)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !629, file: !630, line: 493, baseType: !384, size: 64, offset: 512)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !629, file: !630, line: 496, baseType: !384, size: 64, offset: 576)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !629, file: !630, line: 501, baseType: !1126, size: 64, offset: 640)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !211, line: 2355, size: 576, elements: !1128)
!1128 = !{!1129, !1132, !1133, !1134, !1135, !1137, !1138, !1143, !1144, !1145, !1146, !1147, !1148}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1127, file: !211, line: 2356, baseType: !1130, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !211, line: 2356, flags: DIFlagFwdDecl)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1127, file: !211, line: 2357, baseType: !340, size: 64, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1127, file: !211, line: 2358, baseType: !335, size: 32, offset: 128)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1127, file: !211, line: 2359, baseType: !335, size: 32, offset: 160)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1127, file: !211, line: 2360, baseType: !1136, size: 128, offset: 192)
