; ModuleID = 'tree-ssa-ifcombine.bc'
source_filename = "tree-ssa-ifcombine.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }

!452 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!453 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!454 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!455 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!456 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!457 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!458 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!459 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!460 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!461 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!462 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!463 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!464 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!465 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!466 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!467 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!468 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!469 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!470 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!471 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !433, line: 80, baseType: !7, size: 32, elements: !472)
!472 = !{!473, !474, !475, !476}
!473 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!474 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!475 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!476 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!477 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !433, line: 727, baseType: !7, size: 32, elements: !478)
!478 = !{!479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502}
!479 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!480 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!481 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!482 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!483 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!484 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!485 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!486 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!487 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!488 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!489 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!490 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!491 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!492 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!493 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!494 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!495 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!496 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!497 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!498 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!499 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!500 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!501 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!502 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!503 = !{!504, !505, !506, !507, !510, !511, !513, !624, !238, !471, !809, !1687, !843, !508}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!506 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !509)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !514, line: 56, baseType: !515)
!514 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !206, line: 3371, size: 1792, elements: !517)
!517 = !{!518, !551, !557, !570, !577, !584, !589, !598, !604, !617, !629, !667, !675, !703, !720, !721, !726, !735, !741, !746, !750, !754, !1336, !1385, !1391, !1397, !1404, !1417, !1431, !1448, !1460, !1482, !1497, !1669}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !516, file: !206, line: 3372, baseType: !519, size: 64)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !206, line: 360, size: 64, elements: !520)
!520 = !{!521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !519, file: !206, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !519, file: !206, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !519, file: !206, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !519, file: !206, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !519, file: !206, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !519, file: !206, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !519, file: !206, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !519, file: !206, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !519, file: !206, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !519, file: !206, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !519, file: !206, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !519, file: !206, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !519, file: !206, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !519, file: !206, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !519, file: !206, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !519, file: !206, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !519, file: !206, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !519, file: !206, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !519, file: !206, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !519, file: !206, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !519, file: !206, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !519, file: !206, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !519, file: !206, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !519, file: !206, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !519, file: !206, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !519, file: !206, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !519, file: !206, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !519, file: !206, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !519, file: !206, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !519, file: !206, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !516, file: !206, line: 3373, baseType: !552, size: 192)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !206, line: 402, size: 192, elements: !553)
!553 = !{!554, !555, !556}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !552, file: !206, line: 403, baseType: !519, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !552, file: !206, line: 404, baseType: !513, size: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !552, file: !206, line: 405, baseType: !513, size: 64, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !516, file: !206, line: 3374, baseType: !558, size: 320)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !206, line: 1384, size: 320, elements: !559)
!559 = !{!560, !561}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !558, file: !206, line: 1385, baseType: !552, size: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !558, file: !206, line: 1386, baseType: !562, size: 128, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !563, line: 58, baseType: !564)
!563 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !563, line: 54, size: 128, elements: !565)
!565 = !{!566, !568}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !564, file: !563, line: 56, baseType: !567, size: 64)
!567 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !564, file: !563, line: 57, baseType: !569, size: 64, offset: 64)
!569 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !516, file: !206, line: 3375, baseType: !571, size: 256)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !206, line: 1397, size: 256, elements: !572)
!572 = !{!573, !574}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !571, file: !206, line: 1398, baseType: !552, size: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !571, file: !206, line: 1399, baseType: !575, size: 64, offset: 192)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !206, line: 1392, flags: DIFlagFwdDecl)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !516, file: !206, line: 3376, baseType: !578, size: 256)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !206, line: 1408, size: 256, elements: !579)
!579 = !{!580, !581}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !578, file: !206, line: 1409, baseType: !552, size: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !578, file: !206, line: 1410, baseType: !582, size: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !206, line: 1403, flags: DIFlagFwdDecl)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !516, file: !206, line: 3377, baseType: !585, size: 256)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !206, line: 1437, size: 256, elements: !586)
!586 = !{!587, !588}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !585, file: !206, line: 1438, baseType: !552, size: 192)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !585, file: !206, line: 1439, baseType: !513, size: 64, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !516, file: !206, line: 3378, baseType: !590, size: 256)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !206, line: 1418, size: 256, elements: !591)
!591 = !{!592, !593, !594}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !590, file: !206, line: 1419, baseType: !552, size: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !590, file: !206, line: 1420, baseType: !506, size: 32, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !590, file: !206, line: 1421, baseType: !595, size: 8, offset: 224)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 8, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 1)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !516, file: !206, line: 3379, baseType: !599, size: 320)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !206, line: 1428, size: 320, elements: !600)
!600 = !{!601, !602, !603}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !599, file: !206, line: 1429, baseType: !552, size: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !599, file: !206, line: 1430, baseType: !513, size: 64, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !599, file: !206, line: 1431, baseType: !513, size: 64, offset: 256)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !516, file: !206, line: 3380, baseType: !605, size: 320)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !206, line: 1460, size: 320, elements: !606)
!606 = !{!607, !608}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !605, file: !206, line: 1461, baseType: !552, size: 192)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !605, file: !206, line: 1462, baseType: !609, size: 128, offset: 192)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !610, line: 31, size: 128, elements: !611)
!610 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!611 = !{!612, !615, !616}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !609, file: !610, line: 32, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !505)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !609, file: !610, line: 33, baseType: !7, size: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !609, file: !610, line: 34, baseType: !7, size: 32, offset: 96)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !516, file: !206, line: 3381, baseType: !618, size: 384)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !206, line: 2507, size: 384, elements: !619)
!619 = !{!620, !621, !626, !627, !628}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !618, file: !206, line: 2508, baseType: !552, size: 192)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !618, file: !206, line: 2509, baseType: !622, size: 32, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !623, line: 58, baseType: !624)
!623 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !625, line: 44, baseType: !7)
!625 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!626 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !618, file: !206, line: 2510, baseType: !7, size: 32, offset: 224)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !618, file: !206, line: 2511, baseType: !513, size: 64, offset: 256)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !618, file: !206, line: 2512, baseType: !513, size: 64, offset: 320)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !516, file: !206, line: 3382, baseType: !630, size: 896)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !206, line: 2652, size: 896, elements: !631)
!631 = !{!632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !630, file: !206, line: 2653, baseType: !618, size: 384)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !630, file: !206, line: 2654, baseType: !513, size: 64, offset: 384)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !630, file: !206, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !630, file: !206, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !630, file: !206, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !630, file: !206, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !630, file: !206, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !630, file: !206, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !630, file: !206, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !630, file: !206, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !630, file: !206, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !630, file: !206, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !630, file: !206, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !630, file: !206, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !630, file: !206, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !630, file: !206, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !630, file: !206, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !630, file: !206, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !630, file: !206, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !630, file: !206, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !630, file: !206, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !630, file: !206, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !630, file: !206, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !630, file: !206, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !630, file: !206, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !630, file: !206, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !630, file: !206, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !630, file: !206, line: 2703, baseType: !7, size: 32, offset: 512)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !630, file: !206, line: 2705, baseType: !513, size: 64, offset: 576)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !630, file: !206, line: 2706, baseType: !513, size: 64, offset: 640)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !630, file: !206, line: 2707, baseType: !513, size: 64, offset: 704)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !630, file: !206, line: 2708, baseType: !513, size: 64, offset: 768)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !630, file: !206, line: 2711, baseType: !665, size: 64, offset: 832)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !206, line: 2711, flags: DIFlagFwdDecl)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !516, file: !206, line: 3383, baseType: !668, size: 960)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !206, line: 2756, size: 960, elements: !669)
!669 = !{!670, !671}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !668, file: !206, line: 2757, baseType: !630, size: 896)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !668, file: !206, line: 2758, baseType: !672, size: 64, offset: 896)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !514, line: 50, baseType: !673)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !514, line: 49, flags: DIFlagFwdDecl)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !516, file: !206, line: 3384, baseType: !676, size: 1472)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !206, line: 3114, size: 1472, elements: !677)
!677 = !{!678, !699, !700, !701, !702}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !676, file: !206, line: 3115, baseType: !679, size: 1216)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !206, line: 2984, size: 1216, elements: !680)
!680 = !{!681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !679, file: !206, line: 2985, baseType: !668, size: 960)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !679, file: !206, line: 2986, baseType: !513, size: 64, offset: 960)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !679, file: !206, line: 2987, baseType: !513, size: 64, offset: 1024)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !679, file: !206, line: 2988, baseType: !513, size: 64, offset: 1088)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !679, file: !206, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !679, file: !206, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !679, file: !206, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !679, file: !206, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !679, file: !206, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !679, file: !206, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !679, file: !206, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !679, file: !206, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !679, file: !206, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !679, file: !206, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !679, file: !206, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !679, file: !206, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !679, file: !206, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !679, file: !206, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !676, file: !206, line: 3117, baseType: !513, size: 64, offset: 1216)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !676, file: !206, line: 3119, baseType: !513, size: 64, offset: 1280)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !676, file: !206, line: 3121, baseType: !513, size: 64, offset: 1344)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !676, file: !206, line: 3123, baseType: !513, size: 64, offset: 1408)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !516, file: !206, line: 3385, baseType: !704, size: 1088)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !206, line: 2874, size: 1088, elements: !705)
!705 = !{!706, !707, !708}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !704, file: !206, line: 2875, baseType: !668, size: 960)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !704, file: !206, line: 2876, baseType: !672, size: 64, offset: 960)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !704, file: !206, line: 2877, baseType: !709, size: 64, offset: 1024)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !711, line: 172, size: 128, elements: !712)
!711 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!712 = !{!713, !714, !715, !716, !717, !718, !719}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !710, file: !711, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !710, file: !711, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !710, file: !711, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !710, file: !711, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !710, file: !711, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !710, file: !711, line: 195, baseType: !7, size: 32, offset: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !710, file: !711, line: 199, baseType: !513, size: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !516, file: !206, line: 3386, baseType: !679, size: 1216)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !516, file: !206, line: 3387, baseType: !722, size: 1280)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !206, line: 3093, size: 1280, elements: !723)
!723 = !{!724, !725}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !722, file: !206, line: 3094, baseType: !679, size: 1216)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !722, file: !206, line: 3095, baseType: !709, size: 64, offset: 1216)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !516, file: !206, line: 3388, baseType: !727, size: 1216)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !206, line: 2824, size: 1216, elements: !728)
!728 = !{!729, !730, !731, !732, !733, !734}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !727, file: !206, line: 2825, baseType: !630, size: 896)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !727, file: !206, line: 2827, baseType: !513, size: 64, offset: 896)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !727, file: !206, line: 2828, baseType: !513, size: 64, offset: 960)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !727, file: !206, line: 2829, baseType: !513, size: 64, offset: 1024)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !727, file: !206, line: 2830, baseType: !513, size: 64, offset: 1088)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !727, file: !206, line: 2831, baseType: !513, size: 64, offset: 1152)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !516, file: !206, line: 3389, baseType: !736, size: 1024)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !206, line: 2850, size: 1024, elements: !737)
!737 = !{!738, !739, !740}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !736, file: !206, line: 2851, baseType: !668, size: 960)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !736, file: !206, line: 2852, baseType: !506, size: 32, offset: 960)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !736, file: !206, line: 2853, baseType: !506, size: 32, offset: 992)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !516, file: !206, line: 3390, baseType: !742, size: 1024)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !206, line: 2857, size: 1024, elements: !743)
!743 = !{!744, !745}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !742, file: !206, line: 2858, baseType: !668, size: 960)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !742, file: !206, line: 2859, baseType: !709, size: 64, offset: 960)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !516, file: !206, line: 3391, baseType: !747, size: 960)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !206, line: 2862, size: 960, elements: !748)
!748 = !{!749}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !747, file: !206, line: 2863, baseType: !668, size: 960)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !516, file: !206, line: 3392, baseType: !751, size: 1472)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !206, line: 3304, size: 1472, elements: !752)
!752 = !{!753}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !751, file: !206, line: 3305, baseType: !676, size: 1472)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !516, file: !206, line: 3393, baseType: !755, size: 1792)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !206, line: 3248, size: 1792, elements: !756)
!756 = !{!757, !758, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !755, file: !206, line: 3249, baseType: !676, size: 1472)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !755, file: !206, line: 3251, baseType: !759, size: 64, offset: 1472)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !761, line: 463, size: 1152, elements: !762)
!761 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!762 = !{!763, !766, !1083, !1084, !1256, !1259, !1260, !1261, !1262, !1263, !1264, !1288, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !760, file: !761, line: 464, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !761, line: 464, flags: DIFlagFwdDecl)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !760, file: !761, line: 467, baseType: !767, size: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !190, line: 374, size: 640, elements: !769)
!769 = !{!770, !1058, !1059, !1072, !1073, !1074, !1075, !1076, !1077, !1079, !1081, !1082}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !768, file: !190, line: 377, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !514, line: 111, baseType: !772)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !190, line: 217, size: 832, elements: !774)
!774 = !{!775, !1021, !1022, !1023, !1026, !1032, !1033, !1034, !1052, !1053, !1054, !1055, !1056, !1057}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !773, file: !190, line: 219, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !190, line: 151, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !190, line: 151, size: 128, elements: !779)
!779 = !{!780}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !778, file: !190, line: 151, baseType: !781, size: 128)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !190, line: 150, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !190, line: 150, size: 128, elements: !783)
!783 = !{!784, !785, !786}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !782, file: !190, line: 150, baseType: !7, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !782, file: !190, line: 150, baseType: !7, size: 32, offset: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !782, file: !190, line: 150, baseType: !787, size: 64, offset: 64)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !788, size: 64, elements: !596)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !514, line: 108, baseType: !789)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !190, line: 122, size: 512, elements: !791)
!791 = !{!792, !793, !794, !1013, !1014, !1015, !1016, !1017, !1018, !1019}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !790, file: !190, line: 124, baseType: !772, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !790, file: !190, line: 125, baseType: !772, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !790, file: !190, line: 131, baseType: !795, size: 64, offset: 128)
!795 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !190, line: 128, size: 64, elements: !796)
!796 = !{!797, !1012}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !795, file: !190, line: 129, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !514, line: 66, baseType: !799)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !433, line: 143, size: 192, elements: !801)
!801 = !{!802, !1010, !1011}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !800, file: !433, line: 145, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !514, line: 69, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !433, line: 136, size: 192, elements: !806)
!806 = !{!807, !1008, !1009}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !805, file: !433, line: 137, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !514, line: 58, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !433, line: 737, size: 768, elements: !811)
!811 = !{!812, !829, !863, !869, !874, !879, !886, !892, !898, !903, !917, !922, !928, !933, !943, !948, !966, !973, !980, !986, !991, !997, !1003}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !810, file: !433, line: 738, baseType: !813, size: 256)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !433, line: 271, size: 256, elements: !814)
!814 = !{!815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !813, file: !433, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !813, file: !433, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !813, file: !433, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !813, file: !433, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !813, file: !433, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !813, file: !433, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !813, file: !433, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !813, file: !433, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !813, file: !433, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !813, file: !433, line: 312, baseType: !7, size: 32, offset: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !813, file: !433, line: 316, baseType: !622, size: 32, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !813, file: !433, line: 319, baseType: !7, size: 32, offset: 96)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !813, file: !433, line: 323, baseType: !772, size: 64, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !813, file: !433, line: 327, baseType: !513, size: 64, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !810, file: !433, line: 739, baseType: !830, size: 448)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !433, line: 350, size: 448, elements: !831)
!831 = !{!832, !861}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !830, file: !433, line: 353, baseType: !833, size: 384)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !433, line: 333, size: 384, elements: !834)
!834 = !{!835, !836, !844}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !833, file: !433, line: 336, baseType: !813, size: 256)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !833, file: !433, line: 343, baseType: !837, size: 64, offset: 256)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !839, line: 37, size: 128, elements: !840)
!839 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!840 = !{!841, !842}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !838, file: !839, line: 39, baseType: !837, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !838, file: !839, line: 40, baseType: !843, size: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !833, file: !433, line: 344, baseType: !845, size: 64, offset: 320)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !839, line: 45, size: 320, elements: !847)
!847 = !{!848, !849}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !846, file: !839, line: 47, baseType: !845, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !846, file: !839, line: 48, baseType: !850, size: 256, offset: 64)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !206, line: 1883, size: 256, elements: !851)
!851 = !{!852, !854, !855, !860}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !850, file: !206, line: 1884, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !850, file: !206, line: 1885, baseType: !853, size: 64, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !850, file: !206, line: 1891, baseType: !856, size: 64, offset: 128)
!856 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !850, file: !206, line: 1891, size: 64, elements: !857)
!857 = !{!858, !859}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !856, file: !206, line: 1891, baseType: !808, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !856, file: !206, line: 1891, baseType: !513, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !850, file: !206, line: 1892, baseType: !843, size: 64, offset: 192)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !830, file: !433, line: 359, baseType: !862, size: 64, offset: 384)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 64, elements: !596)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !810, file: !433, line: 740, baseType: !864, size: 512)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !433, line: 365, size: 512, elements: !865)
!865 = !{!866, !867, !868}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !864, file: !433, line: 368, baseType: !833, size: 384)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !864, file: !433, line: 373, baseType: !513, size: 64, offset: 384)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !864, file: !433, line: 374, baseType: !513, size: 64, offset: 448)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !810, file: !433, line: 741, baseType: !870, size: 576)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !433, line: 380, size: 576, elements: !871)
!871 = !{!872, !873}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !870, file: !433, line: 383, baseType: !864, size: 512)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !870, file: !433, line: 389, baseType: !862, size: 64, offset: 512)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !810, file: !433, line: 742, baseType: !875, size: 320)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !433, line: 395, size: 320, elements: !876)
!876 = !{!877, !878}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !875, file: !433, line: 397, baseType: !813, size: 256)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !875, file: !433, line: 400, baseType: !798, size: 64, offset: 256)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !810, file: !433, line: 743, baseType: !880, size: 448)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !433, line: 406, size: 448, elements: !881)
!881 = !{!882, !883, !884, !885}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !880, file: !433, line: 408, baseType: !813, size: 256)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !880, file: !433, line: 412, baseType: !513, size: 64, offset: 256)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !880, file: !433, line: 420, baseType: !513, size: 64, offset: 320)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !880, file: !433, line: 423, baseType: !798, size: 64, offset: 384)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !810, file: !433, line: 744, baseType: !887, size: 384)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !433, line: 429, size: 384, elements: !888)
!888 = !{!889, !890, !891}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !887, file: !433, line: 431, baseType: !813, size: 256)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !887, file: !433, line: 434, baseType: !513, size: 64, offset: 256)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !887, file: !433, line: 437, baseType: !798, size: 64, offset: 320)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !810, file: !433, line: 745, baseType: !893, size: 384)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !433, line: 443, size: 384, elements: !894)
!894 = !{!895, !896, !897}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !893, file: !433, line: 445, baseType: !813, size: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !893, file: !433, line: 449, baseType: !513, size: 64, offset: 256)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !893, file: !433, line: 453, baseType: !798, size: 64, offset: 320)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !810, file: !433, line: 746, baseType: !899, size: 320)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !433, line: 459, size: 320, elements: !900)
!900 = !{!901, !902}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !899, file: !433, line: 461, baseType: !813, size: 256)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !899, file: !433, line: 464, baseType: !513, size: 64, offset: 256)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !810, file: !433, line: 747, baseType: !904, size: 768)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !433, line: 469, size: 768, elements: !905)
!905 = !{!906, !907, !908, !909, !910}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !904, file: !433, line: 471, baseType: !813, size: 256)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !904, file: !433, line: 474, baseType: !7, size: 32, offset: 256)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !904, file: !433, line: 475, baseType: !7, size: 32, offset: 288)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !904, file: !433, line: 478, baseType: !513, size: 64, offset: 320)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !904, file: !433, line: 481, baseType: !911, size: 384, offset: 384)
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !912, size: 384, elements: !596)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !206, line: 1917, size: 384, elements: !913)
!913 = !{!914, !915, !916}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !912, file: !206, line: 1920, baseType: !850, size: 256)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !912, file: !206, line: 1921, baseType: !513, size: 64, offset: 256)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !912, file: !206, line: 1922, baseType: !622, size: 32, offset: 320)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !810, file: !433, line: 748, baseType: !918, size: 320)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !433, line: 487, size: 320, elements: !919)
!919 = !{!920, !921}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !918, file: !433, line: 490, baseType: !813, size: 256)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !918, file: !433, line: 494, baseType: !506, size: 32, offset: 256)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !810, file: !433, line: 749, baseType: !923, size: 384)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !433, line: 500, size: 384, elements: !924)
!924 = !{!925, !926, !927}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !923, file: !433, line: 502, baseType: !813, size: 256)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !923, file: !433, line: 506, baseType: !798, size: 64, offset: 256)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !923, file: !433, line: 510, baseType: !798, size: 64, offset: 320)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !810, file: !433, line: 750, baseType: !929, size: 320)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !433, line: 529, size: 320, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !929, file: !433, line: 531, baseType: !813, size: 256)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !929, file: !433, line: 540, baseType: !798, size: 64, offset: 256)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !810, file: !433, line: 751, baseType: !934, size: 704)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !433, line: 546, size: 704, elements: !935)
!935 = !{!936, !937, !938, !939, !940, !941, !942}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !934, file: !433, line: 549, baseType: !864, size: 512)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !934, file: !433, line: 553, baseType: !511, size: 64, offset: 512)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !934, file: !433, line: 557, baseType: !505, size: 8, offset: 576)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !934, file: !433, line: 558, baseType: !505, size: 8, offset: 584)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !934, file: !433, line: 559, baseType: !505, size: 8, offset: 592)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !934, file: !433, line: 560, baseType: !505, size: 8, offset: 600)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !934, file: !433, line: 566, baseType: !862, size: 64, offset: 640)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !810, file: !433, line: 752, baseType: !944, size: 384)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !433, line: 571, size: 384, elements: !945)
!945 = !{!946, !947}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !944, file: !433, line: 573, baseType: !875, size: 320)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !944, file: !433, line: 577, baseType: !513, size: 64, offset: 320)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !810, file: !433, line: 753, baseType: !949, size: 576)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !433, line: 600, size: 576, elements: !950)
!950 = !{!951, !952, !953, !956, !965}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !949, file: !433, line: 602, baseType: !875, size: 320)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !949, file: !433, line: 605, baseType: !513, size: 64, offset: 320)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !949, file: !433, line: 609, baseType: !954, size: 64, offset: 384)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !955, line: 46, baseType: !567)
!955 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!956 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !949, file: !433, line: 612, baseType: !957, size: 64, offset: 448)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !433, line: 581, size: 320, elements: !959)
!959 = !{!960, !961, !962, !963, !964}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !958, file: !433, line: 583, baseType: !238, size: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !958, file: !433, line: 586, baseType: !513, size: 64, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !958, file: !433, line: 589, baseType: !513, size: 64, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !958, file: !433, line: 592, baseType: !513, size: 64, offset: 192)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !958, file: !433, line: 595, baseType: !513, size: 64, offset: 256)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !949, file: !433, line: 616, baseType: !798, size: 64, offset: 512)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !810, file: !433, line: 754, baseType: !967, size: 512)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !433, line: 622, size: 512, elements: !968)
!968 = !{!969, !970, !971, !972}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !967, file: !433, line: 624, baseType: !875, size: 320)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !967, file: !433, line: 628, baseType: !513, size: 64, offset: 320)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !967, file: !433, line: 632, baseType: !513, size: 64, offset: 384)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !967, file: !433, line: 636, baseType: !513, size: 64, offset: 448)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !810, file: !433, line: 755, baseType: !974, size: 704)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !433, line: 642, size: 704, elements: !975)
!975 = !{!976, !977, !978, !979}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !974, file: !433, line: 644, baseType: !967, size: 512)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !974, file: !433, line: 648, baseType: !513, size: 64, offset: 512)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !974, file: !433, line: 652, baseType: !513, size: 64, offset: 576)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !974, file: !433, line: 653, baseType: !513, size: 64, offset: 640)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !810, file: !433, line: 756, baseType: !981, size: 448)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !433, line: 663, size: 448, elements: !982)
!982 = !{!983, !984, !985}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !981, file: !433, line: 665, baseType: !875, size: 320)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !981, file: !433, line: 668, baseType: !513, size: 64, offset: 320)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !981, file: !433, line: 673, baseType: !513, size: 64, offset: 384)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !810, file: !433, line: 757, baseType: !987, size: 384)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !433, line: 694, size: 384, elements: !988)
!988 = !{!989, !990}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !987, file: !433, line: 696, baseType: !875, size: 320)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !987, file: !433, line: 699, baseType: !513, size: 64, offset: 320)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !810, file: !433, line: 758, baseType: !992, size: 384)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !433, line: 681, size: 384, elements: !993)
!993 = !{!994, !995, !996}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !992, file: !433, line: 683, baseType: !813, size: 256)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !992, file: !433, line: 686, baseType: !513, size: 64, offset: 256)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !992, file: !433, line: 689, baseType: !513, size: 64, offset: 320)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !810, file: !433, line: 759, baseType: !998, size: 384)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !433, line: 707, size: 384, elements: !999)
!999 = !{!1000, !1001, !1002}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !998, file: !433, line: 709, baseType: !813, size: 256)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !998, file: !433, line: 712, baseType: !513, size: 64, offset: 256)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !998, file: !433, line: 712, baseType: !513, size: 64, offset: 320)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !810, file: !433, line: 760, baseType: !1004, size: 320)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !433, line: 718, size: 320, elements: !1005)
!1005 = !{!1006, !1007}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1004, file: !433, line: 720, baseType: !813, size: 256)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1004, file: !433, line: 723, baseType: !513, size: 64, offset: 256)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !805, file: !433, line: 138, baseType: !804, size: 64, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !805, file: !433, line: 139, baseType: !804, size: 64, offset: 128)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !800, file: !433, line: 146, baseType: !803, size: 64, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !800, file: !433, line: 152, baseType: !798, size: 64, offset: 128)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !795, file: !190, line: 130, baseType: !672, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !790, file: !190, line: 134, baseType: !510, size: 64, offset: 192)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !790, file: !190, line: 137, baseType: !513, size: 64, offset: 256)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !790, file: !190, line: 138, baseType: !622, size: 32, offset: 320)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !790, file: !190, line: 142, baseType: !7, size: 32, offset: 352)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !790, file: !190, line: 144, baseType: !506, size: 32, offset: 384)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !790, file: !190, line: 145, baseType: !506, size: 32, offset: 416)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !790, file: !190, line: 146, baseType: !1020, size: 64, offset: 448)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !190, line: 119, baseType: !569)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !773, file: !190, line: 220, baseType: !776, size: 64, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !773, file: !190, line: 223, baseType: !510, size: 64, offset: 128)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !773, file: !190, line: 226, baseType: !1024, size: 64, offset: 192)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !190, line: 185, flags: DIFlagFwdDecl)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !773, file: !190, line: 229, baseType: !1027, size: 128, offset: 256)
!1027 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1028, size: 128, elements: !1030)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !190, line: 229, flags: DIFlagFwdDecl)
!1030 = !{!1031}
!1031 = !DISubrange(count: 2)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !773, file: !190, line: 232, baseType: !772, size: 64, offset: 384)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !773, file: !190, line: 233, baseType: !772, size: 64, offset: 448)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !773, file: !190, line: 238, baseType: !1035, size: 64, offset: 512)
!1035 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !190, line: 235, size: 64, elements: !1036)
!1036 = !{!1037, !1043}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1035, file: !190, line: 236, baseType: !1038, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !190, line: 273, size: 128, elements: !1040)
!1040 = !{!1041, !1042}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1039, file: !190, line: 275, baseType: !798, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1039, file: !190, line: 278, baseType: !798, size: 64, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1035, file: !190, line: 237, baseType: !1044, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !190, line: 259, size: 320, elements: !1046)
!1046 = !{!1047, !1048, !1049, !1050, !1051}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1045, file: !190, line: 261, baseType: !672, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1045, file: !190, line: 262, baseType: !672, size: 64, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1045, file: !190, line: 266, baseType: !672, size: 64, offset: 128)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1045, file: !190, line: 267, baseType: !672, size: 64, offset: 192)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1045, file: !190, line: 270, baseType: !506, size: 32, offset: 256)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !773, file: !190, line: 241, baseType: !1020, size: 64, offset: 576)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !773, file: !190, line: 244, baseType: !506, size: 32, offset: 640)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !773, file: !190, line: 247, baseType: !506, size: 32, offset: 672)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !773, file: !190, line: 250, baseType: !506, size: 32, offset: 704)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !773, file: !190, line: 253, baseType: !506, size: 32, offset: 736)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !773, file: !190, line: 256, baseType: !506, size: 32, offset: 768)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !768, file: !190, line: 378, baseType: !771, size: 64, offset: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !768, file: !190, line: 381, baseType: !1060, size: 64, offset: 128)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !190, line: 282, baseType: !1062)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !190, line: 282, size: 128, elements: !1063)
!1063 = !{!1064}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1062, file: !190, line: 282, baseType: !1065, size: 128)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !190, line: 281, baseType: !1066)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !190, line: 281, size: 128, elements: !1067)
!1067 = !{!1068, !1069, !1070}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1066, file: !190, line: 281, baseType: !7, size: 32)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1066, file: !190, line: 281, baseType: !7, size: 32, offset: 32)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1066, file: !190, line: 281, baseType: !1071, size: 64, offset: 64)
!1071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !771, size: 64, elements: !596)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !768, file: !190, line: 384, baseType: !506, size: 32, offset: 192)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !768, file: !190, line: 387, baseType: !506, size: 32, offset: 224)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !768, file: !190, line: 390, baseType: !506, size: 32, offset: 256)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !768, file: !190, line: 394, baseType: !1060, size: 64, offset: 320)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !768, file: !190, line: 396, baseType: !189, size: 32, offset: 384)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !768, file: !190, line: 399, baseType: !1078, size: 64, offset: 416)
!1078 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 64, elements: !1030)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !768, file: !190, line: 402, baseType: !1080, size: 64, offset: 480)
!1080 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1030)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !768, file: !190, line: 406, baseType: !506, size: 32, offset: 544)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !768, file: !190, line: 409, baseType: !506, size: 32, offset: 576)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !760, file: !761, line: 470, baseType: !799, size: 64, offset: 128)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !760, file: !761, line: 473, baseType: !1085, size: 64, offset: 192)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !711, line: 39, size: 1152, elements: !1087)
!1087 = !{!1088, !1138, !1151, !1163, !1164, !1233, !1234, !1238, !1239, !1240, !1241, !1242}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1086, file: !711, line: 41, baseType: !1089, size: 64)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1090, line: 144, baseType: !1091)
!1090 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1090, line: 100, size: 896, elements: !1093)
!1093 = !{!1094, !1102, !1107, !1112, !1114, !1115, !1116, !1117, !1118, !1119, !1124, !1126, !1127, !1132, !1137}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1092, file: !1090, line: 102, baseType: !1095, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1090, line: 52, baseType: !1096)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!1099, !1100}
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1090, line: 47, baseType: !7)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1092, file: !1090, line: 105, baseType: !1103, size: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1090, line: 59, baseType: !1104)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!506, !1100, !1100}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1092, file: !1090, line: 108, baseType: !1108, size: 64, offset: 128)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1090, line: 63, baseType: !1109)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{null, !510}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1092, file: !1090, line: 111, baseType: !1113, size: 64, offset: 192)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1092, file: !1090, line: 114, baseType: !954, size: 64, offset: 256)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1092, file: !1090, line: 117, baseType: !954, size: 64, offset: 320)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1092, file: !1090, line: 120, baseType: !954, size: 64, offset: 384)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1092, file: !1090, line: 124, baseType: !7, size: 32, offset: 448)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1092, file: !1090, line: 128, baseType: !7, size: 32, offset: 480)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1092, file: !1090, line: 131, baseType: !1120, size: 64, offset: 512)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1090, line: 75, baseType: !1121)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!510, !954, !954}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1092, file: !1090, line: 132, baseType: !1125, size: 64, offset: 576)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1090, line: 78, baseType: !1109)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1092, file: !1090, line: 135, baseType: !510, size: 64, offset: 640)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1092, file: !1090, line: 136, baseType: !1128, size: 64, offset: 704)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1090, line: 82, baseType: !1129)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!510, !510, !954, !954}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1092, file: !1090, line: 137, baseType: !1133, size: 64, offset: 768)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1090, line: 83, baseType: !1134)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{null, !510, !510}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1092, file: !1090, line: 141, baseType: !7, size: 32, offset: 832)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1086, file: !711, line: 48, baseType: !1139, size: 64, offset: 64)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !433, line: 35, baseType: !1141)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !433, line: 35, size: 128, elements: !1142)
!1142 = !{!1143}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1141, file: !433, line: 35, baseType: !1144, size: 128)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !433, line: 33, baseType: !1145)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !433, line: 33, size: 128, elements: !1146)
!1146 = !{!1147, !1148, !1149}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1145, file: !433, line: 33, baseType: !7, size: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1145, file: !433, line: 33, baseType: !7, size: 32, offset: 32)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1145, file: !433, line: 33, baseType: !1150, size: 64, offset: 64)
!1150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !808, size: 64, elements: !596)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1086, file: !711, line: 51, baseType: !1152, size: 64, offset: 128)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !206, line: 183, baseType: !1154)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !206, line: 183, size: 128, elements: !1155)
!1155 = !{!1156}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1154, file: !206, line: 183, baseType: !1157, size: 128)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !206, line: 182, baseType: !1158)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !206, line: 182, size: 128, elements: !1159)
!1159 = !{!1160, !1161, !1162}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1158, file: !206, line: 182, baseType: !7, size: 32)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1158, file: !206, line: 182, baseType: !7, size: 32, offset: 32)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1158, file: !206, line: 182, baseType: !862, size: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1086, file: !711, line: 54, baseType: !513, size: 64, offset: 192)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1086, file: !711, line: 57, baseType: !1165, size: 128, offset: 256)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1166, line: 31, size: 128, elements: !1167)
!1166 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1167 = !{!1168, !1169, !1170, !1171, !1172, !1173, !1174}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1165, file: !1166, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1165, file: !1166, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1165, file: !1166, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1165, file: !1166, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1165, file: !1166, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1165, file: !1166, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1165, file: !1166, line: 56, baseType: !1175, size: 64, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !514, line: 47, baseType: !1176)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1178, line: 75, size: 256, elements: !1179)
!1178 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1179 = !{!1180, !1192, !1193, !1194}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1177, file: !1178, line: 76, baseType: !1181, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1178, line: 68, baseType: !1183)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1178, line: 63, size: 320, elements: !1184)
!1184 = !{!1185, !1187, !1188, !1189}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1183, file: !1178, line: 64, baseType: !1186, size: 64)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1183, file: !1178, line: 65, baseType: !1186, size: 64, offset: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1183, file: !1178, line: 66, baseType: !7, size: 32, offset: 128)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1183, file: !1178, line: 67, baseType: !1190, size: 128, offset: 192)
!1190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1191, size: 128, elements: !1030)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1178, line: 29, baseType: !567)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1177, file: !1178, line: 77, baseType: !1181, size: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1177, file: !1178, line: 78, baseType: !7, size: 32, offset: 128)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1177, file: !1178, line: 79, baseType: !1195, size: 64, offset: 192)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1178, line: 49, baseType: !1197)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1178, line: 45, size: 832, elements: !1198)
!1198 = !{!1199, !1200, !1201}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1197, file: !1178, line: 46, baseType: !1186, size: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1197, file: !1178, line: 47, baseType: !1176, size: 64, offset: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1197, file: !1178, line: 48, baseType: !1202, size: 704, offset: 128)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1203, line: 164, size: 704, elements: !1204)
!1203 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1204 = !{!1205, !1206, !1216, !1217, !1218, !1219, !1220, !1221, !1225, !1229, !1230, !1231, !1232}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1202, file: !1203, line: 166, baseType: !569, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1202, file: !1203, line: 167, baseType: !1207, size: 64, offset: 64)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1203, line: 157, size: 192, elements: !1209)
!1209 = !{!1210, !1211, !1212}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1208, file: !1203, line: 159, baseType: !508, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1208, file: !1203, line: 160, baseType: !1207, size: 64, offset: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1208, file: !1203, line: 161, baseType: !1213, size: 32, offset: 128)
!1213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 32, elements: !1214)
!1214 = !{!1215}
!1215 = !DISubrange(count: 4)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1202, file: !1203, line: 168, baseType: !508, size: 64, offset: 128)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1202, file: !1203, line: 169, baseType: !508, size: 64, offset: 192)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1202, file: !1203, line: 170, baseType: !508, size: 64, offset: 256)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1202, file: !1203, line: 171, baseType: !569, size: 64, offset: 320)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1202, file: !1203, line: 172, baseType: !506, size: 32, offset: 384)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1202, file: !1203, line: 176, baseType: !1222, size: 64, offset: 448)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!1207, !510, !569}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1202, file: !1203, line: 177, baseType: !1226, size: 64, offset: 512)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{null, !510, !1207}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1202, file: !1203, line: 178, baseType: !510, size: 64, offset: 576)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1202, file: !1203, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1202, file: !1203, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1202, file: !1203, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1086, file: !711, line: 60, baseType: !1165, size: 128, offset: 384)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1086, file: !711, line: 64, baseType: !1235, size: 64, offset: 512)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1237, line: 33, flags: DIFlagFwdDecl)
!1237 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1086, file: !711, line: 67, baseType: !513, size: 64, offset: 576)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1086, file: !711, line: 73, baseType: !1089, size: 64, offset: 640)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1086, file: !711, line: 77, baseType: !1175, size: 64, offset: 704)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1086, file: !711, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1086, file: !711, line: 82, baseType: !1243, size: 320, offset: 832)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !839, line: 62, size: 320, elements: !1244)
!1244 = !{!1245, !1251, !1252, !1253, !1254, !1255}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1243, file: !839, line: 63, baseType: !1246, size: 64)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !839, line: 56, size: 128, elements: !1248)
!1248 = !{!1249, !1250}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1247, file: !839, line: 57, baseType: !1246, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1247, file: !839, line: 58, baseType: !595, size: 8, offset: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1243, file: !839, line: 64, baseType: !7, size: 32, offset: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1243, file: !839, line: 66, baseType: !7, size: 32, offset: 96)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1243, file: !839, line: 68, baseType: !505, size: 8, offset: 128)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1243, file: !839, line: 70, baseType: !837, size: 64, offset: 192)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1243, file: !839, line: 71, baseType: !845, size: 64, offset: 256)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !760, file: !761, line: 476, baseType: !1257, size: 64, offset: 256)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64)
!1258 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !761, line: 476, flags: DIFlagFwdDecl)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !760, file: !761, line: 479, baseType: !1089, size: 64, offset: 320)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !760, file: !761, line: 484, baseType: !513, size: 64, offset: 384)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !760, file: !761, line: 488, baseType: !513, size: 64, offset: 448)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !760, file: !761, line: 493, baseType: !513, size: 64, offset: 512)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !760, file: !761, line: 496, baseType: !513, size: 64, offset: 576)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !760, file: !761, line: 501, baseType: !1265, size: 64, offset: 640)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !201, line: 2355, size: 576, elements: !1267)
!1267 = !{!1268, !1271, !1272, !1273, !1274, !1276, !1277, !1282, !1283, !1284, !1285, !1286, !1287}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1266, file: !201, line: 2356, baseType: !1269, size: 64)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !201, line: 2356, flags: DIFlagFwdDecl)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1266, file: !201, line: 2357, baseType: !511, size: 64, offset: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1266, file: !201, line: 2358, baseType: !506, size: 32, offset: 128)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1266, file: !201, line: 2359, baseType: !506, size: 32, offset: 160)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1266, file: !201, line: 2360, baseType: !1275, size: 128, offset: 192)
!1275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 128, elements: !1214)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1266, file: !201, line: 2364, baseType: !506, size: 32, offset: 320)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1266, file: !201, line: 2367, baseType: !1278, size: 128, offset: 384)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !201, line: 2349, size: 128, elements: !1279)
!1279 = !{!1280, !1281}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1278, file: !201, line: 2351, baseType: !672, size: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1278, file: !201, line: 2352, baseType: !569, size: 64, offset: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1266, file: !201, line: 2371, baseType: !200, size: 32, offset: 512)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1266, file: !201, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1266, file: !201, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1266, file: !201, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1266, file: !201, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1266, file: !201, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !760, file: !761, line: 504, baseType: !1289, size: 64, offset: 704)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1290 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !761, line: 504, flags: DIFlagFwdDecl)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !760, file: !761, line: 507, baseType: !1089, size: 64, offset: 768)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !760, file: !761, line: 510, baseType: !506, size: 32, offset: 832)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !760, file: !761, line: 513, baseType: !506, size: 32, offset: 864)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !760, file: !761, line: 516, baseType: !622, size: 32, offset: 896)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !760, file: !761, line: 519, baseType: !622, size: 32, offset: 928)
