; ModuleID = 'tree-outof-ssa.bc'
source_filename = "tree-outof-ssa.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!402 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!403 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!404 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!405 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!406 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!407 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!408 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!409 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!410 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!411 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!412 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!413 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!414 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "expand_modifier", file: !415, line: 52, baseType: !5, size: 32, elements: !416)
!415 = !DIFile(filename: "./expr.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!416 = !{!417, !418, !419, !420, !421, !422, !423}
!417 = !DIEnumerator(name: "EXPAND_NORMAL", value: 0, isUnsigned: true)
!418 = !DIEnumerator(name: "EXPAND_STACK_PARM", value: 1, isUnsigned: true)
!419 = !DIEnumerator(name: "EXPAND_SUM", value: 2, isUnsigned: true)
!420 = !DIEnumerator(name: "EXPAND_CONST_ADDRESS", value: 3, isUnsigned: true)
!421 = !DIEnumerator(name: "EXPAND_INITIALIZER", value: 4, isUnsigned: true)
!422 = !DIEnumerator(name: "EXPAND_WRITE", value: 5, isUnsigned: true)
!423 = !DIEnumerator(name: "EXPAND_MEMORY", value: 6, isUnsigned: true)
!424 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !376, line: 727, baseType: !5, size: 32, elements: !425)
!425 = !{!426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449}
!426 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!427 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!428 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!429 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!430 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!431 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!432 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!433 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!434 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!435 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!436 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!437 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!438 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!439 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!440 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!441 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!442 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!443 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!444 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!445 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!446 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!447 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!448 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!449 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!450 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ssa_op_iter_type", file: !451, line: 119, baseType: !5, size: 32, elements: !452)
!451 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!452 = !{!453, !454, !455, !456}
!453 = !DIEnumerator(name: "ssa_op_iter_none", value: 0, isUnsigned: true)
!454 = !DIEnumerator(name: "ssa_op_iter_tree", value: 1, isUnsigned: true)
!455 = !DIEnumerator(name: "ssa_op_iter_use", value: 2, isUnsigned: true)
!456 = !DIEnumerator(name: "ssa_op_iter_def", value: 3, isUnsigned: true)
!457 = !{!458, !459, !460, !461, !464, !465, !467, !1251, !1761, !1767, !1835, !1782, !5, !132, !538, !706, !3, !1844, !921, !462, !584}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!460 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !463)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !468, line: 50, baseType: !469)
!468 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !471, line: 240, size: 384, elements: !472)
!471 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!472 = !{!473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !470, file: !471, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !470, file: !471, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !470, file: !471, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !470, file: !471, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !470, file: !471, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !470, file: !471, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !470, file: !471, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !470, file: !471, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !470, file: !471, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !470, file: !471, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !470, file: !471, line: 321, baseType: !484, size: 320, offset: 64)
!484 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !471, line: 315, size: 320, elements: !485)
!485 = !{!486, !1728, !1730, !1759, !1760}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !484, file: !471, line: 316, baseType: !487, size: 64)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 64, elements: !503)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !471, line: 183, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !471, line: 166, size: 64, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !505, !506, !518, !521, !583, !1706, !1707, !1718, !1725}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !489, file: !471, line: 168, baseType: !460, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !489, file: !471, line: 169, baseType: !5, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !489, file: !471, line: 170, baseType: !465, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !489, file: !471, line: 171, baseType: !467, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !489, file: !471, line: 172, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !468, line: 53, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !471, line: 359, size: 128, elements: !499)
!499 = !{!500, !501}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !498, file: !471, line: 360, baseType: !460, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !498, file: !471, line: 361, baseType: !502, size: 64, offset: 64)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 64, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 1)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !489, file: !471, line: 173, baseType: !3, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !489, file: !471, line: 174, baseType: !507, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !471, line: 133, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !471, line: 115, size: 32, elements: !509)
!509 = !{!510, !511, !512, !513, !514, !515, !516, !517}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !508, file: !471, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !508, file: !471, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !508, file: !471, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !508, file: !471, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !508, file: !471, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !508, file: !471, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !508, file: !471, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !508, file: !471, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !489, file: !471, line: 175, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !471, line: 175, flags: DIFlagFwdDecl)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !489, file: !471, line: 176, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !524, line: 75, size: 256, elements: !525)
!524 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!525 = !{!526, !541, !542, !543}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !523, file: !524, line: 76, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !524, line: 68, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !524, line: 63, size: 320, elements: !530)
!530 = !{!531, !533, !534, !535}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !529, file: !524, line: 64, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !529, file: !524, line: 65, baseType: !532, size: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !529, file: !524, line: 66, baseType: !5, size: 32, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !529, file: !524, line: 67, baseType: !536, size: 128, offset: 192)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !537, size: 128, elements: !539)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !524, line: 29, baseType: !538)
!538 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!539 = !{!540}
!540 = !DISubrange(count: 2)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !523, file: !524, line: 77, baseType: !527, size: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !523, file: !524, line: 78, baseType: !5, size: 32, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !523, file: !524, line: 79, baseType: !544, size: 64, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !524, line: 49, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !524, line: 45, size: 832, elements: !547)
!547 = !{!548, !549, !550}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !546, file: !524, line: 46, baseType: !532, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !546, file: !524, line: 47, baseType: !522, size: 64, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !546, file: !524, line: 48, baseType: !551, size: 704, offset: 128)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !552, line: 164, size: 704, elements: !553)
!552 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!553 = !{!554, !556, !566, !567, !568, !569, !570, !571, !575, !579, !580, !581, !582}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !551, file: !552, line: 166, baseType: !555, size: 64)
!555 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !551, file: !552, line: 167, baseType: !557, size: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !552, line: 157, size: 192, elements: !559)
!559 = !{!560, !561, !562}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !558, file: !552, line: 159, baseType: !462, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !558, file: !552, line: 160, baseType: !557, size: 64, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !558, file: !552, line: 161, baseType: !563, size: 32, offset: 128)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 32, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 4)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !551, file: !552, line: 168, baseType: !462, size: 64, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !551, file: !552, line: 169, baseType: !462, size: 64, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !551, file: !552, line: 170, baseType: !462, size: 64, offset: 256)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !551, file: !552, line: 171, baseType: !555, size: 64, offset: 320)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !551, file: !552, line: 172, baseType: !460, size: 32, offset: 384)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !551, file: !552, line: 176, baseType: !572, size: 64, offset: 448)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{!557, !464, !555}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !551, file: !552, line: 177, baseType: !576, size: 64, offset: 512)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{null, !464, !557}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !551, file: !552, line: 178, baseType: !464, size: 64, offset: 576)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !551, file: !552, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !551, file: !552, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !551, file: !552, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !489, file: !471, line: 177, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !468, line: 56, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !133, line: 3371, size: 1792, elements: !587)
!587 = !{!588, !621, !627, !638, !657, !668, !673, !680, !686, !699, !711, !749, !754, !782, !799, !800, !805, !814, !820, !825, !829, !833, !1355, !1404, !1410, !1416, !1423, !1436, !1450, !1467, !1479, !1501, !1516, !1688}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !586, file: !133, line: 3372, baseType: !589, size: 64)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !133, line: 360, size: 64, elements: !590)
!590 = !{!591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !589, file: !133, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !589, file: !133, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !589, file: !133, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !589, file: !133, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !589, file: !133, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !589, file: !133, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !589, file: !133, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !589, file: !133, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !589, file: !133, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !589, file: !133, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !589, file: !133, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !589, file: !133, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !589, file: !133, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !589, file: !133, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !589, file: !133, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !589, file: !133, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !589, file: !133, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !589, file: !133, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !589, file: !133, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !589, file: !133, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !589, file: !133, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !589, file: !133, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !589, file: !133, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !589, file: !133, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !589, file: !133, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !589, file: !133, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !589, file: !133, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !589, file: !133, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !589, file: !133, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !589, file: !133, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !586, file: !133, line: 3373, baseType: !622, size: 192)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !133, line: 402, size: 192, elements: !623)
!623 = !{!624, !625, !626}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !622, file: !133, line: 403, baseType: !589, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !622, file: !133, line: 404, baseType: !584, size: 64, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !622, file: !133, line: 405, baseType: !584, size: 64, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !586, file: !133, line: 3374, baseType: !628, size: 320)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !133, line: 1384, size: 320, elements: !629)
!629 = !{!630, !631}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !628, file: !133, line: 1385, baseType: !622, size: 192)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !628, file: !133, line: 1386, baseType: !632, size: 128, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !633, line: 58, baseType: !634)
!633 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !633, line: 54, size: 128, elements: !635)
!635 = !{!636, !637}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !634, file: !633, line: 56, baseType: !538, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !634, file: !633, line: 57, baseType: !555, size: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !586, file: !133, line: 3375, baseType: !639, size: 256)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !133, line: 1397, size: 256, elements: !640)
!640 = !{!641, !642}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !639, file: !133, line: 1398, baseType: !622, size: 192)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !639, file: !133, line: 1399, baseType: !643, size: 64, offset: 192)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !645, line: 52, size: 256, elements: !646)
!645 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!646 = !{!647, !648, !649, !650, !651, !652, !653}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !644, file: !645, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !644, file: !645, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !644, file: !645, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !644, file: !645, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !644, file: !645, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !644, file: !645, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !644, file: !645, line: 62, baseType: !654, size: 192, offset: 64)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 192, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 3)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !586, file: !133, line: 3376, baseType: !658, size: 256)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !133, line: 1408, size: 256, elements: !659)
!659 = !{!660, !661}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !658, file: !133, line: 1409, baseType: !622, size: 192)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !658, file: !133, line: 1410, baseType: !662, size: 64, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !664, line: 27, size: 192, elements: !665)
!664 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!665 = !{!666, !667}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !663, file: !664, line: 29, baseType: !632, size: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !663, file: !664, line: 30, baseType: !3, size: 32, offset: 128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !586, file: !133, line: 3377, baseType: !669, size: 256)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !133, line: 1437, size: 256, elements: !670)
!670 = !{!671, !672}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !669, file: !133, line: 1438, baseType: !622, size: 192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !669, file: !133, line: 1439, baseType: !584, size: 64, offset: 192)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !586, file: !133, line: 3378, baseType: !674, size: 256)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !133, line: 1418, size: 256, elements: !675)
!675 = !{!676, !677, !678}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !674, file: !133, line: 1419, baseType: !622, size: 192)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !674, file: !133, line: 1420, baseType: !460, size: 32, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !674, file: !133, line: 1421, baseType: !679, size: 8, offset: 224)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 8, elements: !503)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !586, file: !133, line: 3379, baseType: !681, size: 320)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !133, line: 1428, size: 320, elements: !682)
!682 = !{!683, !684, !685}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !681, file: !133, line: 1429, baseType: !622, size: 192)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !681, file: !133, line: 1430, baseType: !584, size: 64, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !681, file: !133, line: 1431, baseType: !584, size: 64, offset: 256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !586, file: !133, line: 3380, baseType: !687, size: 320)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !133, line: 1460, size: 320, elements: !688)
!688 = !{!689, !690}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !687, file: !133, line: 1461, baseType: !622, size: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !687, file: !133, line: 1462, baseType: !691, size: 128, offset: 192)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !692, line: 31, size: 128, elements: !693)
!692 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!693 = !{!694, !697, !698}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !691, file: !692, line: 32, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !459)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !691, file: !692, line: 33, baseType: !5, size: 32, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !691, file: !692, line: 34, baseType: !5, size: 32, offset: 96)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !586, file: !133, line: 3381, baseType: !700, size: 384)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !133, line: 2507, size: 384, elements: !701)
!701 = !{!702, !703, !708, !709, !710}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !700, file: !133, line: 2508, baseType: !622, size: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !700, file: !133, line: 2509, baseType: !704, size: 32, offset: 192)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !705, line: 58, baseType: !706)
!705 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !707, line: 44, baseType: !5)
!707 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!708 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !700, file: !133, line: 2510, baseType: !5, size: 32, offset: 224)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !700, file: !133, line: 2511, baseType: !584, size: 64, offset: 256)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !700, file: !133, line: 2512, baseType: !584, size: 64, offset: 320)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !586, file: !133, line: 3382, baseType: !712, size: 896)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !133, line: 2652, size: 896, elements: !713)
!713 = !{!714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !712, file: !133, line: 2653, baseType: !700, size: 384)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !712, file: !133, line: 2654, baseType: !584, size: 64, offset: 384)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !712, file: !133, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !712, file: !133, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !712, file: !133, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !712, file: !133, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !712, file: !133, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !712, file: !133, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !712, file: !133, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !712, file: !133, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !712, file: !133, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !712, file: !133, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !712, file: !133, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !712, file: !133, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !712, file: !133, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !712, file: !133, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !712, file: !133, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !712, file: !133, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !712, file: !133, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !712, file: !133, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !712, file: !133, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !712, file: !133, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !712, file: !133, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !712, file: !133, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !712, file: !133, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !712, file: !133, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !712, file: !133, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !712, file: !133, line: 2703, baseType: !5, size: 32, offset: 512)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !712, file: !133, line: 2705, baseType: !584, size: 64, offset: 576)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !712, file: !133, line: 2706, baseType: !584, size: 64, offset: 640)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !712, file: !133, line: 2707, baseType: !584, size: 64, offset: 704)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !712, file: !133, line: 2708, baseType: !584, size: 64, offset: 768)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !712, file: !133, line: 2711, baseType: !747, size: 64, offset: 832)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !133, line: 2711, flags: DIFlagFwdDecl)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !586, file: !133, line: 3383, baseType: !750, size: 960)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !133, line: 2756, size: 960, elements: !751)
!751 = !{!752, !753}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !750, file: !133, line: 2757, baseType: !712, size: 896)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !750, file: !133, line: 2758, baseType: !467, size: 64, offset: 896)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !586, file: !133, line: 3384, baseType: !755, size: 1472)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !133, line: 3114, size: 1472, elements: !756)
!756 = !{!757, !778, !779, !780, !781}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !755, file: !133, line: 3115, baseType: !758, size: 1216)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !133, line: 2984, size: 1216, elements: !759)
!759 = !{!760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !758, file: !133, line: 2985, baseType: !750, size: 960)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !758, file: !133, line: 2986, baseType: !584, size: 64, offset: 960)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !758, file: !133, line: 2987, baseType: !584, size: 64, offset: 1024)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !758, file: !133, line: 2988, baseType: !584, size: 64, offset: 1088)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !758, file: !133, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !758, file: !133, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !758, file: !133, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !758, file: !133, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !758, file: !133, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !758, file: !133, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !758, file: !133, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !758, file: !133, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !758, file: !133, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !758, file: !133, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !758, file: !133, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !758, file: !133, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !758, file: !133, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !758, file: !133, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !755, file: !133, line: 3117, baseType: !584, size: 64, offset: 1216)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !755, file: !133, line: 3119, baseType: !584, size: 64, offset: 1280)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !755, file: !133, line: 3121, baseType: !584, size: 64, offset: 1344)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !755, file: !133, line: 3123, baseType: !584, size: 64, offset: 1408)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !586, file: !133, line: 3385, baseType: !783, size: 1088)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !133, line: 2874, size: 1088, elements: !784)
!784 = !{!785, !786, !787}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !783, file: !133, line: 2875, baseType: !750, size: 960)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !783, file: !133, line: 2876, baseType: !467, size: 64, offset: 960)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !783, file: !133, line: 2877, baseType: !788, size: 64, offset: 1024)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !790, line: 172, size: 128, elements: !791)
!790 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!791 = !{!792, !793, !794, !795, !796, !797, !798}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !789, file: !790, line: 174, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !789, file: !790, line: 178, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !789, file: !790, line: 183, baseType: !5, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !789, file: !790, line: 187, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !789, file: !790, line: 192, baseType: !5, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !789, file: !790, line: 195, baseType: !5, size: 32, offset: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !789, file: !790, line: 199, baseType: !584, size: 64, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !586, file: !133, line: 3386, baseType: !758, size: 1216)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !586, file: !133, line: 3387, baseType: !801, size: 1280)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !133, line: 3093, size: 1280, elements: !802)
!802 = !{!803, !804}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !801, file: !133, line: 3094, baseType: !758, size: 1216)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !801, file: !133, line: 3095, baseType: !788, size: 64, offset: 1216)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !586, file: !133, line: 3388, baseType: !806, size: 1216)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !133, line: 2824, size: 1216, elements: !807)
!807 = !{!808, !809, !810, !811, !812, !813}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !806, file: !133, line: 2825, baseType: !712, size: 896)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !806, file: !133, line: 2827, baseType: !584, size: 64, offset: 896)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !806, file: !133, line: 2828, baseType: !584, size: 64, offset: 960)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !806, file: !133, line: 2829, baseType: !584, size: 64, offset: 1024)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !806, file: !133, line: 2830, baseType: !584, size: 64, offset: 1088)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !806, file: !133, line: 2831, baseType: !584, size: 64, offset: 1152)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !586, file: !133, line: 3389, baseType: !815, size: 1024)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !133, line: 2850, size: 1024, elements: !816)
!816 = !{!817, !818, !819}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !815, file: !133, line: 2851, baseType: !750, size: 960)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !815, file: !133, line: 2852, baseType: !460, size: 32, offset: 960)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !815, file: !133, line: 2853, baseType: !460, size: 32, offset: 992)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !586, file: !133, line: 3390, baseType: !821, size: 1024)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !133, line: 2857, size: 1024, elements: !822)
!822 = !{!823, !824}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !821, file: !133, line: 2858, baseType: !750, size: 960)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !821, file: !133, line: 2859, baseType: !788, size: 64, offset: 960)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !586, file: !133, line: 3391, baseType: !826, size: 960)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !133, line: 2862, size: 960, elements: !827)
!827 = !{!828}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !826, file: !133, line: 2863, baseType: !750, size: 960)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !586, file: !133, line: 3392, baseType: !830, size: 1472)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !133, line: 3304, size: 1472, elements: !831)
!831 = !{!832}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !830, file: !133, line: 3305, baseType: !755, size: 1472)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !586, file: !133, line: 3393, baseType: !834, size: 1792)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !133, line: 3248, size: 1792, elements: !835)
!835 = !{!836, !837, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !834, file: !133, line: 3249, baseType: !755, size: 1472)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !834, file: !133, line: 3251, baseType: !838, size: 64, offset: 1472)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !840, line: 463, size: 1152, elements: !841)
!840 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!841 = !{!842, !845, !1159, !1160, !1275, !1278, !1279, !1280, !1281, !1282, !1283, !1307, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !839, file: !840, line: 464, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !840, line: 464, flags: DIFlagFwdDecl)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !839, file: !840, line: 467, baseType: !846, size: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !328, line: 374, size: 640, elements: !848)
!848 = !{!849, !1134, !1135, !1148, !1149, !1150, !1151, !1152, !1153, !1155, !1157, !1158}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !847, file: !328, line: 377, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !468, line: 111, baseType: !851)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !328, line: 217, size: 832, elements: !853)
!853 = !{!854, !1099, !1100, !1101, !1104, !1108, !1109, !1110, !1128, !1129, !1130, !1131, !1132, !1133}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !852, file: !328, line: 219, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !328, line: 151, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !328, line: 151, size: 128, elements: !858)
!858 = !{!859}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !857, file: !328, line: 151, baseType: !860, size: 128)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !328, line: 150, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !328, line: 150, size: 128, elements: !862)
!862 = !{!863, !864, !865}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !861, file: !328, line: 150, baseType: !5, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !861, file: !328, line: 150, baseType: !5, size: 32, offset: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !861, file: !328, line: 150, baseType: !866, size: 64, offset: 64)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !867, size: 64, elements: !503)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !468, line: 108, baseType: !868)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !328, line: 122, size: 512, elements: !870)
!870 = !{!871, !872, !873, !1091, !1092, !1093, !1094, !1095, !1096, !1097}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !869, file: !328, line: 124, baseType: !851, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !869, file: !328, line: 125, baseType: !851, size: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !869, file: !328, line: 131, baseType: !874, size: 64, offset: 128)
!874 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !328, line: 128, size: 64, elements: !875)
!875 = !{!876, !1090}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !874, file: !328, line: 129, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !468, line: 66, baseType: !878)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !376, line: 143, size: 192, elements: !880)
!880 = !{!881, !1088, !1089}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !879, file: !376, line: 145, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !468, line: 69, baseType: !883)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !376, line: 136, size: 192, elements: !885)
!885 = !{!886, !1086, !1087}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !884, file: !376, line: 137, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !468, line: 58, baseType: !888)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !376, line: 737, size: 768, elements: !890)
!890 = !{!891, !908, !941, !947, !952, !957, !964, !970, !976, !981, !995, !1000, !1006, !1011, !1021, !1026, !1044, !1051, !1058, !1064, !1069, !1075, !1081}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !889, file: !376, line: 738, baseType: !892, size: 256)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !376, line: 271, size: 256, elements: !893)
!893 = !{!894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !892, file: !376, line: 274, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !892, file: !376, line: 277, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !892, file: !376, line: 281, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !892, file: !376, line: 284, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !892, file: !376, line: 291, baseType: !5, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !892, file: !376, line: 295, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !892, file: !376, line: 298, baseType: !5, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !892, file: !376, line: 301, baseType: !5, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !892, file: !376, line: 307, baseType: !5, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !892, file: !376, line: 312, baseType: !5, size: 32, offset: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !892, file: !376, line: 316, baseType: !704, size: 32, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !892, file: !376, line: 319, baseType: !5, size: 32, offset: 96)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !892, file: !376, line: 323, baseType: !851, size: 64, offset: 128)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !892, file: !376, line: 327, baseType: !584, size: 64, offset: 192)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !889, file: !376, line: 739, baseType: !909, size: 448)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !376, line: 350, size: 448, elements: !910)
!910 = !{!911, !939}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !909, file: !376, line: 353, baseType: !912, size: 384)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !376, line: 333, size: 384, elements: !913)
!913 = !{!914, !915, !922}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !912, file: !376, line: 336, baseType: !892, size: 256)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !912, file: !376, line: 343, baseType: !916, size: 64, offset: 256)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !451, line: 37, size: 128, elements: !918)
!918 = !{!919, !920}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !917, file: !451, line: 39, baseType: !916, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !917, file: !451, line: 40, baseType: !921, size: 64, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !912, file: !376, line: 344, baseType: !923, size: 64, offset: 320)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !451, line: 45, size: 320, elements: !925)
!925 = !{!926, !927}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !924, file: !451, line: 47, baseType: !923, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !924, file: !451, line: 48, baseType: !928, size: 256, offset: 64)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !133, line: 1883, size: 256, elements: !929)
!929 = !{!930, !932, !933, !938}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !928, file: !133, line: 1884, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !928, file: !133, line: 1885, baseType: !931, size: 64, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !928, file: !133, line: 1891, baseType: !934, size: 64, offset: 128)
!934 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !928, file: !133, line: 1891, size: 64, elements: !935)
!935 = !{!936, !937}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !934, file: !133, line: 1891, baseType: !887, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !934, file: !133, line: 1891, baseType: !584, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !928, file: !133, line: 1892, baseType: !921, size: 64, offset: 192)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !909, file: !376, line: 359, baseType: !940, size: 64, offset: 384)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !584, size: 64, elements: !503)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !889, file: !376, line: 740, baseType: !942, size: 512)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !376, line: 365, size: 512, elements: !943)
!943 = !{!944, !945, !946}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !942, file: !376, line: 368, baseType: !912, size: 384)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !942, file: !376, line: 373, baseType: !584, size: 64, offset: 384)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !942, file: !376, line: 374, baseType: !584, size: 64, offset: 448)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !889, file: !376, line: 741, baseType: !948, size: 576)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !376, line: 380, size: 576, elements: !949)
!949 = !{!950, !951}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !948, file: !376, line: 383, baseType: !942, size: 512)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !948, file: !376, line: 389, baseType: !940, size: 64, offset: 512)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !889, file: !376, line: 742, baseType: !953, size: 320)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !376, line: 395, size: 320, elements: !954)
!954 = !{!955, !956}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !953, file: !376, line: 397, baseType: !892, size: 256)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !953, file: !376, line: 400, baseType: !877, size: 64, offset: 256)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !889, file: !376, line: 743, baseType: !958, size: 448)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !376, line: 406, size: 448, elements: !959)
!959 = !{!960, !961, !962, !963}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !958, file: !376, line: 408, baseType: !892, size: 256)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !958, file: !376, line: 412, baseType: !584, size: 64, offset: 256)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !958, file: !376, line: 420, baseType: !584, size: 64, offset: 320)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !958, file: !376, line: 423, baseType: !877, size: 64, offset: 384)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !889, file: !376, line: 744, baseType: !965, size: 384)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !376, line: 429, size: 384, elements: !966)
!966 = !{!967, !968, !969}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !965, file: !376, line: 431, baseType: !892, size: 256)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !965, file: !376, line: 434, baseType: !584, size: 64, offset: 256)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !965, file: !376, line: 437, baseType: !877, size: 64, offset: 320)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !889, file: !376, line: 745, baseType: !971, size: 384)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !376, line: 443, size: 384, elements: !972)
!972 = !{!973, !974, !975}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !971, file: !376, line: 445, baseType: !892, size: 256)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !971, file: !376, line: 449, baseType: !584, size: 64, offset: 256)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !971, file: !376, line: 453, baseType: !877, size: 64, offset: 320)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !889, file: !376, line: 746, baseType: !977, size: 320)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !376, line: 459, size: 320, elements: !978)
!978 = !{!979, !980}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !977, file: !376, line: 461, baseType: !892, size: 256)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !977, file: !376, line: 464, baseType: !584, size: 64, offset: 256)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !889, file: !376, line: 747, baseType: !982, size: 768)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !376, line: 469, size: 768, elements: !983)
!983 = !{!984, !985, !986, !987, !988}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !982, file: !376, line: 471, baseType: !892, size: 256)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !982, file: !376, line: 474, baseType: !5, size: 32, offset: 256)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !982, file: !376, line: 475, baseType: !5, size: 32, offset: 288)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !982, file: !376, line: 478, baseType: !584, size: 64, offset: 320)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !982, file: !376, line: 481, baseType: !989, size: 384, offset: 384)
!989 = !DICompositeType(tag: DW_TAG_array_type, baseType: !990, size: 384, elements: !503)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !133, line: 1917, size: 384, elements: !991)
!991 = !{!992, !993, !994}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !990, file: !133, line: 1920, baseType: !928, size: 256)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !990, file: !133, line: 1921, baseType: !584, size: 64, offset: 256)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !990, file: !133, line: 1922, baseType: !704, size: 32, offset: 320)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !889, file: !376, line: 748, baseType: !996, size: 320)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !376, line: 487, size: 320, elements: !997)
!997 = !{!998, !999}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !996, file: !376, line: 490, baseType: !892, size: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !996, file: !376, line: 494, baseType: !460, size: 32, offset: 256)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !889, file: !376, line: 749, baseType: !1001, size: 384)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !376, line: 500, size: 384, elements: !1002)
!1002 = !{!1003, !1004, !1005}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1001, file: !376, line: 502, baseType: !892, size: 256)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1001, file: !376, line: 506, baseType: !877, size: 64, offset: 256)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1001, file: !376, line: 510, baseType: !877, size: 64, offset: 320)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !889, file: !376, line: 750, baseType: !1007, size: 320)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !376, line: 529, size: 320, elements: !1008)
!1008 = !{!1009, !1010}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1007, file: !376, line: 531, baseType: !892, size: 256)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1007, file: !376, line: 540, baseType: !877, size: 64, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !889, file: !376, line: 751, baseType: !1012, size: 704)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !376, line: 546, size: 704, elements: !1013)
!1013 = !{!1014, !1015, !1016, !1017, !1018, !1019, !1020}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1012, file: !376, line: 549, baseType: !942, size: 512)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1012, file: !376, line: 553, baseType: !465, size: 64, offset: 512)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1012, file: !376, line: 557, baseType: !459, size: 8, offset: 576)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1012, file: !376, line: 558, baseType: !459, size: 8, offset: 584)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1012, file: !376, line: 559, baseType: !459, size: 8, offset: 592)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1012, file: !376, line: 560, baseType: !459, size: 8, offset: 600)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1012, file: !376, line: 566, baseType: !940, size: 64, offset: 640)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !889, file: !376, line: 752, baseType: !1022, size: 384)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !376, line: 571, size: 384, elements: !1023)
!1023 = !{!1024, !1025}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1022, file: !376, line: 573, baseType: !953, size: 320)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1022, file: !376, line: 577, baseType: !584, size: 64, offset: 320)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !889, file: !376, line: 753, baseType: !1027, size: 576)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !376, line: 600, size: 576, elements: !1028)
!1028 = !{!1029, !1030, !1031, !1034, !1043}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1027, file: !376, line: 602, baseType: !953, size: 320)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1027, file: !376, line: 605, baseType: !584, size: 64, offset: 320)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1027, file: !376, line: 609, baseType: !1032, size: 64, offset: 384)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1033, line: 46, baseType: !538)
!1033 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1027, file: !376, line: 612, baseType: !1035, size: 64, offset: 448)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !376, line: 581, size: 320, elements: !1037)
!1037 = !{!1038, !1039, !1040, !1041, !1042}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1036, file: !376, line: 583, baseType: !132, size: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1036, file: !376, line: 586, baseType: !584, size: 64, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1036, file: !376, line: 589, baseType: !584, size: 64, offset: 128)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1036, file: !376, line: 592, baseType: !584, size: 64, offset: 192)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1036, file: !376, line: 595, baseType: !584, size: 64, offset: 256)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1027, file: !376, line: 616, baseType: !877, size: 64, offset: 512)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !889, file: !376, line: 754, baseType: !1045, size: 512)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !376, line: 622, size: 512, elements: !1046)
!1046 = !{!1047, !1048, !1049, !1050}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1045, file: !376, line: 624, baseType: !953, size: 320)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1045, file: !376, line: 628, baseType: !584, size: 64, offset: 320)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1045, file: !376, line: 632, baseType: !584, size: 64, offset: 384)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1045, file: !376, line: 636, baseType: !584, size: 64, offset: 448)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !889, file: !376, line: 755, baseType: !1052, size: 704)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !376, line: 642, size: 704, elements: !1053)
!1053 = !{!1054, !1055, !1056, !1057}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1052, file: !376, line: 644, baseType: !1045, size: 512)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1052, file: !376, line: 648, baseType: !584, size: 64, offset: 512)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1052, file: !376, line: 652, baseType: !584, size: 64, offset: 576)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1052, file: !376, line: 653, baseType: !584, size: 64, offset: 640)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !889, file: !376, line: 756, baseType: !1059, size: 448)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !376, line: 663, size: 448, elements: !1060)
!1060 = !{!1061, !1062, !1063}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1059, file: !376, line: 665, baseType: !953, size: 320)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1059, file: !376, line: 668, baseType: !584, size: 64, offset: 320)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1059, file: !376, line: 673, baseType: !584, size: 64, offset: 384)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !889, file: !376, line: 757, baseType: !1065, size: 384)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !376, line: 694, size: 384, elements: !1066)
!1066 = !{!1067, !1068}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1065, file: !376, line: 696, baseType: !953, size: 320)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1065, file: !376, line: 699, baseType: !584, size: 64, offset: 320)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !889, file: !376, line: 758, baseType: !1070, size: 384)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !376, line: 681, size: 384, elements: !1071)
!1071 = !{!1072, !1073, !1074}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1070, file: !376, line: 683, baseType: !892, size: 256)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1070, file: !376, line: 686, baseType: !584, size: 64, offset: 256)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1070, file: !376, line: 689, baseType: !584, size: 64, offset: 320)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !889, file: !376, line: 759, baseType: !1076, size: 384)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !376, line: 707, size: 384, elements: !1077)
!1077 = !{!1078, !1079, !1080}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1076, file: !376, line: 709, baseType: !892, size: 256)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1076, file: !376, line: 712, baseType: !584, size: 64, offset: 256)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1076, file: !376, line: 712, baseType: !584, size: 64, offset: 320)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !889, file: !376, line: 760, baseType: !1082, size: 320)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !376, line: 718, size: 320, elements: !1083)
!1083 = !{!1084, !1085}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1082, file: !376, line: 720, baseType: !892, size: 256)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1082, file: !376, line: 723, baseType: !584, size: 64, offset: 256)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !884, file: !376, line: 138, baseType: !883, size: 64, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !884, file: !376, line: 139, baseType: !883, size: 64, offset: 128)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !879, file: !376, line: 146, baseType: !882, size: 64, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !879, file: !376, line: 152, baseType: !877, size: 64, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !874, file: !328, line: 130, baseType: !467, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !869, file: !328, line: 134, baseType: !464, size: 64, offset: 192)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !869, file: !328, line: 137, baseType: !584, size: 64, offset: 256)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !869, file: !328, line: 138, baseType: !704, size: 32, offset: 320)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !869, file: !328, line: 142, baseType: !5, size: 32, offset: 352)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !869, file: !328, line: 144, baseType: !460, size: 32, offset: 384)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !869, file: !328, line: 145, baseType: !460, size: 32, offset: 416)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !869, file: !328, line: 146, baseType: !1098, size: 64, offset: 448)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !328, line: 119, baseType: !555)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !852, file: !328, line: 220, baseType: !855, size: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !852, file: !328, line: 223, baseType: !464, size: 64, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !852, file: !328, line: 226, baseType: !1102, size: 64, offset: 192)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !328, line: 185, flags: DIFlagFwdDecl)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !852, file: !328, line: 229, baseType: !1105, size: 128, offset: 256)
!1105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1106, size: 128, elements: !539)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !328, line: 229, flags: DIFlagFwdDecl)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !852, file: !328, line: 232, baseType: !851, size: 64, offset: 384)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !852, file: !328, line: 233, baseType: !851, size: 64, offset: 448)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !852, file: !328, line: 238, baseType: !1111, size: 64, offset: 512)
!1111 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !328, line: 235, size: 64, elements: !1112)
!1112 = !{!1113, !1119}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1111, file: !328, line: 236, baseType: !1114, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !328, line: 273, size: 128, elements: !1116)
!1116 = !{!1117, !1118}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1115, file: !328, line: 275, baseType: !877, size: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1115, file: !328, line: 278, baseType: !877, size: 64, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1111, file: !328, line: 237, baseType: !1120, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !328, line: 259, size: 320, elements: !1122)
!1122 = !{!1123, !1124, !1125, !1126, !1127}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1121, file: !328, line: 261, baseType: !467, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1121, file: !328, line: 262, baseType: !467, size: 64, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1121, file: !328, line: 266, baseType: !467, size: 64, offset: 128)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1121, file: !328, line: 267, baseType: !467, size: 64, offset: 192)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1121, file: !328, line: 270, baseType: !460, size: 32, offset: 256)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !852, file: !328, line: 241, baseType: !1098, size: 64, offset: 576)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !852, file: !328, line: 244, baseType: !460, size: 32, offset: 640)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !852, file: !328, line: 247, baseType: !460, size: 32, offset: 672)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !852, file: !328, line: 250, baseType: !460, size: 32, offset: 704)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !852, file: !328, line: 253, baseType: !460, size: 32, offset: 736)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !852, file: !328, line: 256, baseType: !460, size: 32, offset: 768)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !847, file: !328, line: 378, baseType: !850, size: 64, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !847, file: !328, line: 381, baseType: !1136, size: 64, offset: 128)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !328, line: 282, baseType: !1138)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !328, line: 282, size: 128, elements: !1139)
!1139 = !{!1140}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1138, file: !328, line: 282, baseType: !1141, size: 128)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !328, line: 281, baseType: !1142)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !328, line: 281, size: 128, elements: !1143)
!1143 = !{!1144, !1145, !1146}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1142, file: !328, line: 281, baseType: !5, size: 32)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1142, file: !328, line: 281, baseType: !5, size: 32, offset: 32)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1142, file: !328, line: 281, baseType: !1147, size: 64, offset: 64)
!1147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !850, size: 64, elements: !503)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !847, file: !328, line: 384, baseType: !460, size: 32, offset: 192)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !847, file: !328, line: 387, baseType: !460, size: 32, offset: 224)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !847, file: !328, line: 390, baseType: !460, size: 32, offset: 256)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !847, file: !328, line: 394, baseType: !1136, size: 64, offset: 320)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !847, file: !328, line: 396, baseType: !327, size: 32, offset: 384)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !847, file: !328, line: 399, baseType: !1154, size: 64, offset: 416)
!1154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 64, elements: !539)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !847, file: !328, line: 402, baseType: !1156, size: 64, offset: 480)
!1156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !539)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !847, file: !328, line: 406, baseType: !460, size: 32, offset: 544)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !847, file: !328, line: 409, baseType: !460, size: 32, offset: 576)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !839, file: !840, line: 470, baseType: !878, size: 64, offset: 128)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !839, file: !840, line: 473, baseType: !1161, size: 64, offset: 192)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !790, line: 39, size: 1152, elements: !1163)
!1163 = !{!1164, !1214, !1227, !1239, !1240, !1252, !1253, !1257, !1258, !1259, !1260, !1261}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1162, file: !790, line: 41, baseType: !1165, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1166, line: 144, baseType: !1167)
!1166 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1166, line: 100, size: 896, elements: !1169)
!1169 = !{!1170, !1178, !1183, !1188, !1190, !1191, !1192, !1193, !1194, !1195, !1200, !1202, !1203, !1208, !1213}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1168, file: !1166, line: 102, baseType: !1171, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1166, line: 52, baseType: !1172)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = !DISubroutineType(types: !1174)
!1174 = !{!1175, !1176}
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1166, line: 47, baseType: !5)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1168, file: !1166, line: 105, baseType: !1179, size: 64, offset: 64)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1166, line: 59, baseType: !1180)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!460, !1176, !1176}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1168, file: !1166, line: 108, baseType: !1184, size: 64, offset: 128)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1166, line: 63, baseType: !1185)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DISubroutineType(types: !1187)
!1187 = !{null, !464}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1168, file: !1166, line: 111, baseType: !1189, size: 64, offset: 192)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1168, file: !1166, line: 114, baseType: !1032, size: 64, offset: 256)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1168, file: !1166, line: 117, baseType: !1032, size: 64, offset: 320)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1168, file: !1166, line: 120, baseType: !1032, size: 64, offset: 384)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1168, file: !1166, line: 124, baseType: !5, size: 32, offset: 448)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1168, file: !1166, line: 128, baseType: !5, size: 32, offset: 480)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1168, file: !1166, line: 131, baseType: !1196, size: 64, offset: 512)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1166, line: 75, baseType: !1197)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{!464, !1032, !1032}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1168, file: !1166, line: 132, baseType: !1201, size: 64, offset: 576)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1166, line: 78, baseType: !1185)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1168, file: !1166, line: 135, baseType: !464, size: 64, offset: 640)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1168, file: !1166, line: 136, baseType: !1204, size: 64, offset: 704)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1166, line: 82, baseType: !1205)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{!464, !464, !1032, !1032}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1168, file: !1166, line: 137, baseType: !1209, size: 64, offset: 768)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1166, line: 83, baseType: !1210)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{null, !464, !464}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1168, file: !1166, line: 141, baseType: !5, size: 32, offset: 832)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1162, file: !790, line: 48, baseType: !1215, size: 64, offset: 64)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !376, line: 35, baseType: !1217)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !376, line: 35, size: 128, elements: !1218)
!1218 = !{!1219}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1217, file: !376, line: 35, baseType: !1220, size: 128)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !376, line: 33, baseType: !1221)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !376, line: 33, size: 128, elements: !1222)
!1222 = !{!1223, !1224, !1225}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1221, file: !376, line: 33, baseType: !5, size: 32)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1221, file: !376, line: 33, baseType: !5, size: 32, offset: 32)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1221, file: !376, line: 33, baseType: !1226, size: 64, offset: 64)
!1226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !887, size: 64, elements: !503)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1162, file: !790, line: 51, baseType: !1228, size: 64, offset: 128)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !133, line: 183, baseType: !1230)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !133, line: 183, size: 128, elements: !1231)
!1231 = !{!1232}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1230, file: !133, line: 183, baseType: !1233, size: 128)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !133, line: 182, baseType: !1234)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !133, line: 182, size: 128, elements: !1235)
!1235 = !{!1236, !1237, !1238}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1234, file: !133, line: 182, baseType: !5, size: 32)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1234, file: !133, line: 182, baseType: !5, size: 32, offset: 32)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1234, file: !133, line: 182, baseType: !940, size: 64, offset: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1162, file: !790, line: 54, baseType: !584, size: 64, offset: 192)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1162, file: !790, line: 57, baseType: !1241, size: 128, offset: 256)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1242, line: 31, size: 128, elements: !1243)
!1242 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1243 = !{!1244, !1245, !1246, !1247, !1248, !1249, !1250}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1241, file: !1242, line: 35, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1241, file: !1242, line: 39, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1241, file: !1242, line: 42, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
