; ModuleID = 'tree-phinodes.bc'
source_filename = "tree-phinodes.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.VEC_gimple_gc = type { %struct.VEC_gimple_base }
%struct.VEC_gimple_base = type { i32, i32, [1 x %union.gimple_statement_d*] }
%union.gimple_statement_d = type { %struct.gimple_statement_phi }
%struct.gimple_statement_phi = type { %struct.gimple_statement_base, i32, i32, %union.tree_node*, [1 x %struct.phi_arg_d] }
%struct.gimple_statement_base = type { i32, i32, i32, i32, %struct.basic_block_def*, %union.tree_node* }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }
%struct.edge_def = type { %struct.basic_block_def*, %struct.basic_block_def*, %union.edge_def_insns, i8*, %union.tree_node*, i32, i32, i32, i32, i64 }

!328 = !DIEnumerator(name: "EH_FILTER_EXPR", value: 143, isUnsigned: true)
!329 = !DIEnumerator(name: "SCEV_KNOWN", value: 144, isUnsigned: true)
!330 = !DIEnumerator(name: "SCEV_NOT_KNOWN", value: 145, isUnsigned: true)
!331 = !DIEnumerator(name: "POLYNOMIAL_CHREC", value: 146, isUnsigned: true)
!332 = !DIEnumerator(name: "STATEMENT_LIST", value: 147, isUnsigned: true)
!333 = !DIEnumerator(name: "ASSERT_EXPR", value: 148, isUnsigned: true)
!334 = !DIEnumerator(name: "TREE_BINFO", value: 149, isUnsigned: true)
!335 = !DIEnumerator(name: "WITH_SIZE_EXPR", value: 150, isUnsigned: true)
!336 = !DIEnumerator(name: "REALIGN_LOAD_EXPR", value: 151, isUnsigned: true)
!337 = !DIEnumerator(name: "TARGET_MEM_REF", value: 152, isUnsigned: true)
!338 = !DIEnumerator(name: "OMP_PARALLEL", value: 153, isUnsigned: true)
!339 = !DIEnumerator(name: "OMP_TASK", value: 154, isUnsigned: true)
!340 = !DIEnumerator(name: "OMP_FOR", value: 155, isUnsigned: true)
!341 = !DIEnumerator(name: "OMP_SECTIONS", value: 156, isUnsigned: true)
!342 = !DIEnumerator(name: "OMP_SINGLE", value: 157, isUnsigned: true)
!343 = !DIEnumerator(name: "OMP_SECTION", value: 158, isUnsigned: true)
!344 = !DIEnumerator(name: "OMP_MASTER", value: 159, isUnsigned: true)
!345 = !DIEnumerator(name: "OMP_ORDERED", value: 160, isUnsigned: true)
!346 = !DIEnumerator(name: "OMP_CRITICAL", value: 161, isUnsigned: true)
!347 = !DIEnumerator(name: "OMP_ATOMIC", value: 162, isUnsigned: true)
!348 = !DIEnumerator(name: "OMP_CLAUSE", value: 163, isUnsigned: true)
!349 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!350 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!351 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!352 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!353 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!354 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!355 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!356 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!357 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!358 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!359 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!360 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!361 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!362 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!363 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!364 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!365 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!366 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!367 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!368 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!369 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!370 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!371 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!372 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!373 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!374 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!375 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!376 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!377 = !{!378, !379, !380, !381, !384, !385, !183, !387, !389, !712, !1194, !7}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!380 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !383)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !388, line: 44, baseType: !7)
!388 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !390, line: 56, baseType: !391)
!390 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !151, line: 3371, size: 1792, elements: !393)
!393 = !{!394, !427, !433, !446, !465, !476, !481, !490, !496, !509, !519, !557, !1016, !1044, !1061, !1062, !1067, !1076, !1082, !1087, !1091, !1095, !1334, !1381, !1387, !1393, !1400, !1413, !1427, !1444, !1456, !1478, !1493, !1665}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !392, file: !151, line: 3372, baseType: !395, size: 64)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !151, line: 360, size: 64, elements: !396)
!396 = !{!397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !395, file: !151, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !395, file: !151, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !395, file: !151, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !395, file: !151, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !395, file: !151, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !395, file: !151, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !395, file: !151, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !395, file: !151, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !395, file: !151, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !395, file: !151, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !395, file: !151, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !395, file: !151, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !395, file: !151, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !395, file: !151, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !395, file: !151, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !395, file: !151, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !395, file: !151, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !395, file: !151, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !395, file: !151, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !395, file: !151, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !395, file: !151, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !395, file: !151, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !395, file: !151, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !395, file: !151, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !395, file: !151, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !395, file: !151, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !395, file: !151, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !395, file: !151, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !395, file: !151, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !395, file: !151, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !392, file: !151, line: 3373, baseType: !428, size: 192)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !151, line: 402, size: 192, elements: !429)
!429 = !{!430, !431, !432}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !428, file: !151, line: 403, baseType: !395, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !428, file: !151, line: 404, baseType: !389, size: 64, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !428, file: !151, line: 405, baseType: !389, size: 64, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !392, file: !151, line: 3374, baseType: !434, size: 320)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !151, line: 1384, size: 320, elements: !435)
!435 = !{!436, !437}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !434, file: !151, line: 1385, baseType: !428, size: 192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !434, file: !151, line: 1386, baseType: !438, size: 128, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !439, line: 58, baseType: !440)
!439 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 54, size: 128, elements: !441)
!441 = !{!442, !444}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !440, file: !439, line: 56, baseType: !443, size: 64)
!443 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !440, file: !439, line: 57, baseType: !445, size: 64, offset: 64)
!445 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !392, file: !151, line: 3375, baseType: !447, size: 256)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !151, line: 1397, size: 256, elements: !448)
!448 = !{!449, !450}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !447, file: !151, line: 1398, baseType: !428, size: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !447, file: !151, line: 1399, baseType: !451, size: 64, offset: 192)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !453, line: 52, size: 256, elements: !454)
!453 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!454 = !{!455, !456, !457, !458, !459, !460, !461}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !452, file: !453, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !452, file: !453, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !452, file: !453, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !452, file: !453, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !452, file: !453, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !452, file: !453, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !452, file: !453, line: 62, baseType: !462, size: 192, offset: 64)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 192, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 3)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !392, file: !151, line: 3376, baseType: !466, size: 256)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !151, line: 1408, size: 256, elements: !467)
!467 = !{!468, !469}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !466, file: !151, line: 1409, baseType: !428, size: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !466, file: !151, line: 1410, baseType: !470, size: 64, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !472, line: 27, size: 192, elements: !473)
!472 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!473 = !{!474, !475}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !471, file: !472, line: 29, baseType: !438, size: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !471, file: !472, line: 30, baseType: !5, size: 32, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !392, file: !151, line: 3377, baseType: !477, size: 256)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !151, line: 1437, size: 256, elements: !478)
!478 = !{!479, !480}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !477, file: !151, line: 1438, baseType: !428, size: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !477, file: !151, line: 1439, baseType: !389, size: 64, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !392, file: !151, line: 3378, baseType: !482, size: 256)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !151, line: 1418, size: 256, elements: !483)
!483 = !{!484, !485, !486}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !482, file: !151, line: 1419, baseType: !428, size: 192)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !482, file: !151, line: 1420, baseType: !380, size: 32, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !482, file: !151, line: 1421, baseType: !487, size: 8, offset: 224)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 8, elements: !488)
!488 = !{!489}
!489 = !DISubrange(count: 1)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !392, file: !151, line: 3379, baseType: !491, size: 320)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !151, line: 1428, size: 320, elements: !492)
!492 = !{!493, !494, !495}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !491, file: !151, line: 1429, baseType: !428, size: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !491, file: !151, line: 1430, baseType: !389, size: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !491, file: !151, line: 1431, baseType: !389, size: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !392, file: !151, line: 3380, baseType: !497, size: 320)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !151, line: 1460, size: 320, elements: !498)
!498 = !{!499, !500}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !497, file: !151, line: 1461, baseType: !428, size: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !497, file: !151, line: 1462, baseType: !501, size: 128, offset: 192)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !502, line: 31, size: 128, elements: !503)
!502 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!503 = !{!504, !507, !508}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !501, file: !502, line: 32, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !379)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !501, file: !502, line: 33, baseType: !7, size: 32, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !501, file: !502, line: 34, baseType: !7, size: 32, offset: 96)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !392, file: !151, line: 3381, baseType: !510, size: 384)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !151, line: 2507, size: 384, elements: !511)
!511 = !{!512, !513, !516, !517, !518}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !510, file: !151, line: 2508, baseType: !428, size: 192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !510, file: !151, line: 2509, baseType: !514, size: 32, offset: 192)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !515, line: 58, baseType: !387)
!515 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!516 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !510, file: !151, line: 2510, baseType: !7, size: 32, offset: 224)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !510, file: !151, line: 2511, baseType: !389, size: 64, offset: 256)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !510, file: !151, line: 2512, baseType: !389, size: 64, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !392, file: !151, line: 3382, baseType: !520, size: 896)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !151, line: 2652, size: 896, elements: !521)
!521 = !{!522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !520, file: !151, line: 2653, baseType: !510, size: 384)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !520, file: !151, line: 2654, baseType: !389, size: 64, offset: 384)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !520, file: !151, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !520, file: !151, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !520, file: !151, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !520, file: !151, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !520, file: !151, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !520, file: !151, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !520, file: !151, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !520, file: !151, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !520, file: !151, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !520, file: !151, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !520, file: !151, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !520, file: !151, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !520, file: !151, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !520, file: !151, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !520, file: !151, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !520, file: !151, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !520, file: !151, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !520, file: !151, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !520, file: !151, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !520, file: !151, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !520, file: !151, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !520, file: !151, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !520, file: !151, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !520, file: !151, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !520, file: !151, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !520, file: !151, line: 2703, baseType: !7, size: 32, offset: 512)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !520, file: !151, line: 2705, baseType: !389, size: 64, offset: 576)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !520, file: !151, line: 2706, baseType: !389, size: 64, offset: 640)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !520, file: !151, line: 2707, baseType: !389, size: 64, offset: 704)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !520, file: !151, line: 2708, baseType: !389, size: 64, offset: 768)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !520, file: !151, line: 2711, baseType: !555, size: 64, offset: 832)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !151, line: 2711, flags: DIFlagFwdDecl)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !392, file: !151, line: 3383, baseType: !558, size: 960)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !151, line: 2756, size: 960, elements: !559)
!559 = !{!560, !561}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !558, file: !151, line: 2757, baseType: !520, size: 896)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !558, file: !151, line: 2758, baseType: !562, size: 64, offset: 896)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !390, line: 50, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !565, line: 240, size: 384, elements: !566)
!565 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!566 = !{!567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !564, file: !565, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !564, file: !565, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !564, file: !565, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !564, file: !565, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !564, file: !565, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !564, file: !565, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !564, file: !565, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !564, file: !565, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !564, file: !565, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !564, file: !565, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !564, file: !565, line: 321, baseType: !578, size: 320, offset: 64)
!578 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !565, line: 315, size: 320, elements: !579)
!579 = !{!580, !983, !985, !1014, !1015}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !578, file: !565, line: 316, baseType: !581, size: 64)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 64, elements: !488)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !565, line: 183, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !565, line: 166, size: 64, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !597, !598, !610, !613, !673, !674, !960, !973, !980}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !583, file: !565, line: 168, baseType: !380, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !583, file: !565, line: 169, baseType: !7, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !583, file: !565, line: 170, baseType: !385, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !583, file: !565, line: 171, baseType: !562, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !583, file: !565, line: 172, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !390, line: 53, baseType: !591)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !565, line: 359, size: 128, elements: !593)
!593 = !{!594, !595}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !592, file: !565, line: 360, baseType: !380, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !592, file: !565, line: 361, baseType: !596, size: 64, offset: 64)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 64, elements: !488)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !583, file: !565, line: 173, baseType: !5, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !583, file: !565, line: 174, baseType: !599, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !565, line: 133, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !565, line: 115, size: 32, elements: !601)
!601 = !{!602, !603, !604, !605, !606, !607, !608, !609}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !600, file: !565, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !600, file: !565, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !600, file: !565, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !600, file: !565, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !600, file: !565, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !600, file: !565, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !600, file: !565, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !600, file: !565, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !583, file: !565, line: 175, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !565, line: 175, flags: DIFlagFwdDecl)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !583, file: !565, line: 176, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !616, line: 75, size: 256, elements: !617)
!616 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!617 = !{!618, !632, !633, !634}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !615, file: !616, line: 76, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !616, line: 68, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !616, line: 63, size: 320, elements: !622)
!622 = !{!623, !625, !626, !627}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !621, file: !616, line: 64, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !621, file: !616, line: 65, baseType: !624, size: 64, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !621, file: !616, line: 66, baseType: !7, size: 32, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !621, file: !616, line: 67, baseType: !628, size: 128, offset: 192)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !629, size: 128, elements: !630)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !616, line: 29, baseType: !443)
!630 = !{!631}
!631 = !DISubrange(count: 2)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !615, file: !616, line: 77, baseType: !619, size: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !615, file: !616, line: 78, baseType: !7, size: 32, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !615, file: !616, line: 79, baseType: !635, size: 64, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !616, line: 49, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !616, line: 45, size: 832, elements: !638)
!638 = !{!639, !640, !641}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !637, file: !616, line: 46, baseType: !624, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !637, file: !616, line: 47, baseType: !614, size: 64, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !637, file: !616, line: 48, baseType: !642, size: 704, offset: 128)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !643, line: 164, size: 704, elements: !644)
!643 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!644 = !{!645, !646, !656, !657, !658, !659, !660, !661, !665, !669, !670, !671, !672}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !642, file: !643, line: 166, baseType: !445, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !642, file: !643, line: 167, baseType: !647, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !643, line: 157, size: 192, elements: !649)
!649 = !{!650, !651, !652}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !648, file: !643, line: 159, baseType: !382, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !648, file: !643, line: 160, baseType: !647, size: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !648, file: !643, line: 161, baseType: !653, size: 32, offset: 128)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 32, elements: !654)
!654 = !{!655}
!655 = !DISubrange(count: 4)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !642, file: !643, line: 168, baseType: !382, size: 64, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !642, file: !643, line: 169, baseType: !382, size: 64, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !642, file: !643, line: 170, baseType: !382, size: 64, offset: 256)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !642, file: !643, line: 171, baseType: !445, size: 64, offset: 320)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !642, file: !643, line: 172, baseType: !380, size: 32, offset: 384)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !642, file: !643, line: 176, baseType: !662, size: 64, offset: 448)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{!647, !384, !445}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !642, file: !643, line: 177, baseType: !666, size: 64, offset: 512)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DISubroutineType(types: !668)
!668 = !{null, !384, !647}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !642, file: !643, line: 178, baseType: !384, size: 64, offset: 576)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !642, file: !643, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !642, file: !643, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !642, file: !643, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !583, file: !565, line: 177, baseType: !389, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !583, file: !565, line: 178, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !677)
!677 = !{!678, !925, !926, !927, !930, !934, !935, !936, !954, !955, !956, !957, !958, !959}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !676, file: !135, line: 219, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !682)
!682 = !{!683}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !681, file: !135, line: 151, baseType: !684, size: 128)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !686)
!686 = !{!687, !688, !689}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !685, file: !135, line: 150, baseType: !7, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !685, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !685, file: !135, line: 150, baseType: !690, size: 64, offset: 64)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !691, size: 64, elements: !488)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !390, line: 108, baseType: !692)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !694)
!694 = !{!695, !696, !697, !917, !918, !919, !920, !921, !922, !923}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !693, file: !135, line: 124, baseType: !675, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !693, file: !135, line: 125, baseType: !675, size: 64, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !693, file: !135, line: 131, baseType: !698, size: 64, offset: 128)
!698 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !699)
!699 = !{!700, !916}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !698, file: !135, line: 129, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !390, line: 66, baseType: !702)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !704, line: 143, size: 192, elements: !705)
!704 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!705 = !{!706, !914, !915}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !703, file: !704, line: 145, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !390, line: 69, baseType: !708)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !704, line: 136, size: 192, elements: !710)
!710 = !{!711, !912, !913}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !709, file: !704, line: 137, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !390, line: 58, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !704, line: 737, size: 768, elements: !715)
!715 = !{!716, !733, !767, !773, !778, !783, !790, !796, !802, !807, !821, !826, !832, !837, !847, !852, !870, !877, !884, !890, !895, !901, !907}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !714, file: !704, line: 738, baseType: !717, size: 256)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !704, line: 271, size: 256, elements: !718)
!718 = !{!719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !717, file: !704, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !717, file: !704, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !717, file: !704, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !717, file: !704, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !717, file: !704, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !717, file: !704, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !717, file: !704, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !717, file: !704, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !717, file: !704, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !717, file: !704, line: 312, baseType: !7, size: 32, offset: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !717, file: !704, line: 316, baseType: !514, size: 32, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !717, file: !704, line: 319, baseType: !7, size: 32, offset: 96)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !717, file: !704, line: 323, baseType: !675, size: 64, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !717, file: !704, line: 327, baseType: !389, size: 64, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !714, file: !704, line: 739, baseType: !734, size: 448)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !704, line: 350, size: 448, elements: !735)
!735 = !{!736, !765}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !734, file: !704, line: 353, baseType: !737, size: 384)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !704, line: 333, size: 384, elements: !738)
!738 = !{!739, !740, !748}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !737, file: !704, line: 336, baseType: !717, size: 256)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !737, file: !704, line: 343, baseType: !741, size: 64, offset: 256)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !743, line: 37, size: 128, elements: !744)
!743 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !742, file: !743, line: 39, baseType: !741, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !742, file: !743, line: 40, baseType: !747, size: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !737, file: !704, line: 344, baseType: !749, size: 64, offset: 320)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !743, line: 45, size: 320, elements: !751)
!751 = !{!752, !753}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !750, file: !743, line: 47, baseType: !749, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !750, file: !743, line: 48, baseType: !754, size: 256, offset: 64)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !151, line: 1883, size: 256, elements: !755)
!755 = !{!756, !758, !759, !764}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !754, file: !151, line: 1884, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !754, file: !151, line: 1885, baseType: !757, size: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !754, file: !151, line: 1891, baseType: !760, size: 64, offset: 128)
!760 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !754, file: !151, line: 1891, size: 64, elements: !761)
!761 = !{!762, !763}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !760, file: !151, line: 1891, baseType: !712, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !760, file: !151, line: 1891, baseType: !389, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !754, file: !151, line: 1892, baseType: !747, size: 64, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !734, file: !704, line: 359, baseType: !766, size: 64, offset: 384)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 64, elements: !488)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !714, file: !704, line: 740, baseType: !768, size: 512)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !704, line: 365, size: 512, elements: !769)
!769 = !{!770, !771, !772}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !768, file: !704, line: 368, baseType: !737, size: 384)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !768, file: !704, line: 373, baseType: !389, size: 64, offset: 384)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !768, file: !704, line: 374, baseType: !389, size: 64, offset: 448)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !714, file: !704, line: 741, baseType: !774, size: 576)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !704, line: 380, size: 576, elements: !775)
!775 = !{!776, !777}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !774, file: !704, line: 383, baseType: !768, size: 512)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !774, file: !704, line: 389, baseType: !766, size: 64, offset: 512)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !714, file: !704, line: 742, baseType: !779, size: 320)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !704, line: 395, size: 320, elements: !780)
!780 = !{!781, !782}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !779, file: !704, line: 397, baseType: !717, size: 256)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !779, file: !704, line: 400, baseType: !701, size: 64, offset: 256)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !714, file: !704, line: 743, baseType: !784, size: 448)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !704, line: 406, size: 448, elements: !785)
!785 = !{!786, !787, !788, !789}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !784, file: !704, line: 408, baseType: !717, size: 256)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !784, file: !704, line: 412, baseType: !389, size: 64, offset: 256)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !784, file: !704, line: 420, baseType: !389, size: 64, offset: 320)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !784, file: !704, line: 423, baseType: !701, size: 64, offset: 384)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !714, file: !704, line: 744, baseType: !791, size: 384)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !704, line: 429, size: 384, elements: !792)
!792 = !{!793, !794, !795}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !791, file: !704, line: 431, baseType: !717, size: 256)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !791, file: !704, line: 434, baseType: !389, size: 64, offset: 256)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !791, file: !704, line: 437, baseType: !701, size: 64, offset: 320)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !714, file: !704, line: 745, baseType: !797, size: 384)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !704, line: 443, size: 384, elements: !798)
!798 = !{!799, !800, !801}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !797, file: !704, line: 445, baseType: !717, size: 256)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !797, file: !704, line: 449, baseType: !389, size: 64, offset: 256)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !797, file: !704, line: 453, baseType: !701, size: 64, offset: 320)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !714, file: !704, line: 746, baseType: !803, size: 320)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !704, line: 459, size: 320, elements: !804)
!804 = !{!805, !806}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !803, file: !704, line: 461, baseType: !717, size: 256)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !803, file: !704, line: 464, baseType: !389, size: 64, offset: 256)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !714, file: !704, line: 747, baseType: !808, size: 768)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !704, line: 469, size: 768, elements: !809)
!809 = !{!810, !811, !812, !813, !814}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !808, file: !704, line: 471, baseType: !717, size: 256)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !808, file: !704, line: 474, baseType: !7, size: 32, offset: 256)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !808, file: !704, line: 475, baseType: !7, size: 32, offset: 288)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !808, file: !704, line: 478, baseType: !389, size: 64, offset: 320)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !808, file: !704, line: 481, baseType: !815, size: 384, offset: 384)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !816, size: 384, elements: !488)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !151, line: 1917, size: 384, elements: !817)
!817 = !{!818, !819, !820}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !816, file: !151, line: 1920, baseType: !754, size: 256)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !816, file: !151, line: 1921, baseType: !389, size: 64, offset: 256)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !816, file: !151, line: 1922, baseType: !514, size: 32, offset: 320)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !714, file: !704, line: 748, baseType: !822, size: 320)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !704, line: 487, size: 320, elements: !823)
!823 = !{!824, !825}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !822, file: !704, line: 490, baseType: !717, size: 256)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !822, file: !704, line: 494, baseType: !380, size: 32, offset: 256)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !714, file: !704, line: 749, baseType: !827, size: 384)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !704, line: 500, size: 384, elements: !828)
!828 = !{!829, !830, !831}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !827, file: !704, line: 502, baseType: !717, size: 256)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !827, file: !704, line: 506, baseType: !701, size: 64, offset: 256)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !827, file: !704, line: 510, baseType: !701, size: 64, offset: 320)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !714, file: !704, line: 750, baseType: !833, size: 320)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !704, line: 529, size: 320, elements: !834)
!834 = !{!835, !836}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !833, file: !704, line: 531, baseType: !717, size: 256)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !833, file: !704, line: 540, baseType: !701, size: 64, offset: 256)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !714, file: !704, line: 751, baseType: !838, size: 704)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !704, line: 546, size: 704, elements: !839)
!839 = !{!840, !841, !842, !843, !844, !845, !846}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !838, file: !704, line: 549, baseType: !768, size: 512)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !838, file: !704, line: 553, baseType: !385, size: 64, offset: 512)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !838, file: !704, line: 557, baseType: !379, size: 8, offset: 576)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !838, file: !704, line: 558, baseType: !379, size: 8, offset: 584)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !838, file: !704, line: 559, baseType: !379, size: 8, offset: 592)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !838, file: !704, line: 560, baseType: !379, size: 8, offset: 600)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !838, file: !704, line: 566, baseType: !766, size: 64, offset: 640)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !714, file: !704, line: 752, baseType: !848, size: 384)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !704, line: 571, size: 384, elements: !849)
!849 = !{!850, !851}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !848, file: !704, line: 573, baseType: !779, size: 320)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !848, file: !704, line: 577, baseType: !389, size: 64, offset: 320)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !714, file: !704, line: 753, baseType: !853, size: 576)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !704, line: 600, size: 576, elements: !854)
!854 = !{!855, !856, !857, !860, !869}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !853, file: !704, line: 602, baseType: !779, size: 320)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !853, file: !704, line: 605, baseType: !389, size: 64, offset: 320)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !853, file: !704, line: 609, baseType: !858, size: 64, offset: 384)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !859, line: 46, baseType: !443)
!859 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!860 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !853, file: !704, line: 612, baseType: !861, size: 64, offset: 448)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !704, line: 581, size: 320, elements: !863)
!863 = !{!864, !865, !866, !867, !868}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !862, file: !704, line: 583, baseType: !183, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !862, file: !704, line: 586, baseType: !389, size: 64, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !862, file: !704, line: 589, baseType: !389, size: 64, offset: 128)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !862, file: !704, line: 592, baseType: !389, size: 64, offset: 192)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !862, file: !704, line: 595, baseType: !389, size: 64, offset: 256)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !853, file: !704, line: 616, baseType: !701, size: 64, offset: 512)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !714, file: !704, line: 754, baseType: !871, size: 512)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !704, line: 622, size: 512, elements: !872)
!872 = !{!873, !874, !875, !876}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !871, file: !704, line: 624, baseType: !779, size: 320)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !871, file: !704, line: 628, baseType: !389, size: 64, offset: 320)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !871, file: !704, line: 632, baseType: !389, size: 64, offset: 384)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !871, file: !704, line: 636, baseType: !389, size: 64, offset: 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !714, file: !704, line: 755, baseType: !878, size: 704)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !704, line: 642, size: 704, elements: !879)
!879 = !{!880, !881, !882, !883}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !878, file: !704, line: 644, baseType: !871, size: 512)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !878, file: !704, line: 648, baseType: !389, size: 64, offset: 512)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !878, file: !704, line: 652, baseType: !389, size: 64, offset: 576)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !878, file: !704, line: 653, baseType: !389, size: 64, offset: 640)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !714, file: !704, line: 756, baseType: !885, size: 448)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !704, line: 663, size: 448, elements: !886)
!886 = !{!887, !888, !889}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !885, file: !704, line: 665, baseType: !779, size: 320)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !885, file: !704, line: 668, baseType: !389, size: 64, offset: 320)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !885, file: !704, line: 673, baseType: !389, size: 64, offset: 384)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !714, file: !704, line: 757, baseType: !891, size: 384)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !704, line: 694, size: 384, elements: !892)
!892 = !{!893, !894}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !891, file: !704, line: 696, baseType: !779, size: 320)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !891, file: !704, line: 699, baseType: !389, size: 64, offset: 320)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !714, file: !704, line: 758, baseType: !896, size: 384)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !704, line: 681, size: 384, elements: !897)
!897 = !{!898, !899, !900}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !896, file: !704, line: 683, baseType: !717, size: 256)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !896, file: !704, line: 686, baseType: !389, size: 64, offset: 256)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !896, file: !704, line: 689, baseType: !389, size: 64, offset: 320)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !714, file: !704, line: 759, baseType: !902, size: 384)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !704, line: 707, size: 384, elements: !903)
!903 = !{!904, !905, !906}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !902, file: !704, line: 709, baseType: !717, size: 256)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !902, file: !704, line: 712, baseType: !389, size: 64, offset: 256)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !902, file: !704, line: 712, baseType: !389, size: 64, offset: 320)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !714, file: !704, line: 760, baseType: !908, size: 320)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !704, line: 718, size: 320, elements: !909)
!909 = !{!910, !911}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !908, file: !704, line: 720, baseType: !717, size: 256)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !908, file: !704, line: 723, baseType: !389, size: 64, offset: 256)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !709, file: !704, line: 138, baseType: !708, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !709, file: !704, line: 139, baseType: !708, size: 64, offset: 128)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !703, file: !704, line: 146, baseType: !707, size: 64, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !703, file: !704, line: 152, baseType: !701, size: 64, offset: 128)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !698, file: !135, line: 130, baseType: !562, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !693, file: !135, line: 134, baseType: !384, size: 64, offset: 192)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !693, file: !135, line: 137, baseType: !389, size: 64, offset: 256)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !693, file: !135, line: 138, baseType: !514, size: 32, offset: 320)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !693, file: !135, line: 142, baseType: !7, size: 32, offset: 352)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !693, file: !135, line: 144, baseType: !380, size: 32, offset: 384)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !693, file: !135, line: 145, baseType: !380, size: 32, offset: 416)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !693, file: !135, line: 146, baseType: !924, size: 64, offset: 448)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !135, line: 119, baseType: !445)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !676, file: !135, line: 220, baseType: !679, size: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !676, file: !135, line: 223, baseType: !384, size: 64, offset: 128)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !676, file: !135, line: 226, baseType: !928, size: 64, offset: 192)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !135, line: 185, flags: DIFlagFwdDecl)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !676, file: !135, line: 229, baseType: !931, size: 128, offset: 256)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !932, size: 128, elements: !630)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !135, line: 229, flags: DIFlagFwdDecl)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !676, file: !135, line: 232, baseType: !675, size: 64, offset: 384)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !676, file: !135, line: 233, baseType: !675, size: 64, offset: 448)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !676, file: !135, line: 238, baseType: !937, size: 64, offset: 512)
!937 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !135, line: 235, size: 64, elements: !938)
!938 = !{!939, !945}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !937, file: !135, line: 236, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !135, line: 273, size: 128, elements: !942)
!942 = !{!943, !944}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !941, file: !135, line: 275, baseType: !701, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !941, file: !135, line: 278, baseType: !701, size: 64, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !937, file: !135, line: 237, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !135, line: 259, size: 320, elements: !948)
!948 = !{!949, !950, !951, !952, !953}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !947, file: !135, line: 261, baseType: !562, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !947, file: !135, line: 262, baseType: !562, size: 64, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !947, file: !135, line: 266, baseType: !562, size: 64, offset: 128)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !947, file: !135, line: 267, baseType: !562, size: 64, offset: 192)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !947, file: !135, line: 270, baseType: !380, size: 32, offset: 256)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !676, file: !135, line: 241, baseType: !924, size: 64, offset: 576)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !676, file: !135, line: 244, baseType: !380, size: 32, offset: 640)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !676, file: !135, line: 247, baseType: !380, size: 32, offset: 672)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !676, file: !135, line: 250, baseType: !380, size: 32, offset: 704)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !676, file: !135, line: 253, baseType: !380, size: 32, offset: 736)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !676, file: !135, line: 256, baseType: !380, size: 32, offset: 768)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !583, file: !565, line: 179, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !565, line: 150, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !565, line: 142, size: 320, elements: !964)
!964 = !{!965, !966, !967, !968, !971, !972}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !963, file: !565, line: 144, baseType: !389, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !963, file: !565, line: 145, baseType: !562, size: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !963, file: !565, line: 146, baseType: !562, size: 64, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !963, file: !565, line: 147, baseType: !969, size: 32, offset: 192)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !970, line: 31, baseType: !380)
!970 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!971 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !963, file: !565, line: 148, baseType: !7, size: 32, offset: 224)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !963, file: !565, line: 149, baseType: !379, size: 8, offset: 256)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !583, file: !565, line: 180, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !565, line: 162, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !565, line: 159, size: 128, elements: !977)
!977 = !{!978, !979}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !976, file: !565, line: 160, baseType: !389, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !976, file: !565, line: 161, baseType: !445, size: 64, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !583, file: !565, line: 181, baseType: !981, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !565, line: 181, flags: DIFlagFwdDecl)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !578, file: !565, line: 317, baseType: !984, size: 64)
!984 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 64, elements: !488)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !578, file: !565, line: 318, baseType: !986, size: 320)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !565, line: 188, size: 320, elements: !987)
!987 = !{!988, !990, !1013}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !986, file: !565, line: 190, baseType: !989, size: 192)
!989 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 192, elements: !463)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !986, file: !565, line: 193, baseType: !991, size: 64, offset: 192)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !565, line: 206, size: 320, elements: !993)
!993 = !{!994, !998, !999, !1000, !1012}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !992, file: !565, line: 208, baseType: !995, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !390, line: 62, baseType: !997)
!997 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !390, line: 61, flags: DIFlagFwdDecl)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !992, file: !565, line: 211, baseType: !7, size: 32, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !992, file: !565, line: 214, baseType: !445, size: 64, offset: 128)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !992, file: !565, line: 224, baseType: !1001, size: 64, offset: 192)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !565, line: 202, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !565, line: 202, size: 128, elements: !1004)
!1004 = !{!1005}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1003, file: !565, line: 202, baseType: !1006, size: 128)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !565, line: 200, baseType: !1007)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !565, line: 200, size: 128, elements: !1008)
!1008 = !{!1009, !1010, !1011}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1007, file: !565, line: 200, baseType: !7, size: 32)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1007, file: !565, line: 200, baseType: !7, size: 32, offset: 32)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1007, file: !565, line: 200, baseType: !596, size: 64, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !992, file: !565, line: 234, baseType: !1001, size: 64, offset: 256)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !986, file: !565, line: 197, baseType: !445, size: 64, offset: 256)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !578, file: !565, line: 319, baseType: !452, size: 256)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !578, file: !565, line: 320, baseType: !471, size: 192)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !392, file: !151, line: 3384, baseType: !1017, size: 1472)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !151, line: 3114, size: 1472, elements: !1018)
!1018 = !{!1019, !1040, !1041, !1042, !1043}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1017, file: !151, line: 3115, baseType: !1020, size: 1216)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !151, line: 2984, size: 1216, elements: !1021)
!1021 = !{!1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1020, file: !151, line: 2985, baseType: !558, size: 960)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1020, file: !151, line: 2986, baseType: !389, size: 64, offset: 960)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1020, file: !151, line: 2987, baseType: !389, size: 64, offset: 1024)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1020, file: !151, line: 2988, baseType: !389, size: 64, offset: 1088)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1020, file: !151, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1020, file: !151, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1020, file: !151, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1020, file: !151, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1020, file: !151, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1020, file: !151, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1020, file: !151, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1020, file: !151, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1020, file: !151, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1020, file: !151, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1020, file: !151, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1020, file: !151, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1020, file: !151, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1020, file: !151, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1017, file: !151, line: 3117, baseType: !389, size: 64, offset: 1216)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1017, file: !151, line: 3119, baseType: !389, size: 64, offset: 1280)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1017, file: !151, line: 3121, baseType: !389, size: 64, offset: 1344)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1017, file: !151, line: 3123, baseType: !389, size: 64, offset: 1408)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !392, file: !151, line: 3385, baseType: !1045, size: 1088)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !151, line: 2874, size: 1088, elements: !1046)
!1046 = !{!1047, !1048, !1049}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1045, file: !151, line: 2875, baseType: !558, size: 960)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1045, file: !151, line: 2876, baseType: !562, size: 64, offset: 960)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1045, file: !151, line: 2877, baseType: !1050, size: 64, offset: 1024)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1052, line: 172, size: 128, elements: !1053)
!1052 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1053 = !{!1054, !1055, !1056, !1057, !1058, !1059, !1060}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1051, file: !1052, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1051, file: !1052, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1051, file: !1052, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1051, file: !1052, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1051, file: !1052, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1051, file: !1052, line: 195, baseType: !7, size: 32, offset: 32)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1051, file: !1052, line: 199, baseType: !389, size: 64, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !392, file: !151, line: 3386, baseType: !1020, size: 1216)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !392, file: !151, line: 3387, baseType: !1063, size: 1280)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !151, line: 3093, size: 1280, elements: !1064)
!1064 = !{!1065, !1066}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1063, file: !151, line: 3094, baseType: !1020, size: 1216)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1063, file: !151, line: 3095, baseType: !1050, size: 64, offset: 1216)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !392, file: !151, line: 3388, baseType: !1068, size: 1216)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !151, line: 2824, size: 1216, elements: !1069)
!1069 = !{!1070, !1071, !1072, !1073, !1074, !1075}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1068, file: !151, line: 2825, baseType: !520, size: 896)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1068, file: !151, line: 2827, baseType: !389, size: 64, offset: 896)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1068, file: !151, line: 2828, baseType: !389, size: 64, offset: 960)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1068, file: !151, line: 2829, baseType: !389, size: 64, offset: 1024)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1068, file: !151, line: 2830, baseType: !389, size: 64, offset: 1088)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1068, file: !151, line: 2831, baseType: !389, size: 64, offset: 1152)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !392, file: !151, line: 3389, baseType: !1077, size: 1024)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !151, line: 2850, size: 1024, elements: !1078)
!1078 = !{!1079, !1080, !1081}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1077, file: !151, line: 2851, baseType: !558, size: 960)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1077, file: !151, line: 2852, baseType: !380, size: 32, offset: 960)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1077, file: !151, line: 2853, baseType: !380, size: 32, offset: 992)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !392, file: !151, line: 3390, baseType: !1083, size: 1024)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !151, line: 2857, size: 1024, elements: !1084)
!1084 = !{!1085, !1086}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1083, file: !151, line: 2858, baseType: !558, size: 960)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1083, file: !151, line: 2859, baseType: !1050, size: 64, offset: 960)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !392, file: !151, line: 3391, baseType: !1088, size: 960)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !151, line: 2862, size: 960, elements: !1089)
!1089 = !{!1090}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1088, file: !151, line: 2863, baseType: !558, size: 960)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !392, file: !151, line: 3392, baseType: !1092, size: 1472)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !151, line: 3304, size: 1472, elements: !1093)
!1093 = !{!1094}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1092, file: !151, line: 3305, baseType: !1017, size: 1472)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !392, file: !151, line: 3393, baseType: !1096, size: 1792)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !151, line: 3248, size: 1792, elements: !1097)
!1097 = !{!1098, !1099, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1096, file: !151, line: 3249, baseType: !1017, size: 1472)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1096, file: !151, line: 3251, baseType: !1100, size: 64, offset: 1472)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1102, line: 463, size: 1152, elements: !1103)
!1102 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1103 = !{!1104, !1107, !1138, !1139, !1254, !1257, !1258, !1259, !1260, !1261, !1262, !1286, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1101, file: !1102, line: 464, baseType: !1105, size: 64)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1102, line: 464, flags: DIFlagFwdDecl)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1101, file: !1102, line: 467, baseType: !1108, size: 64, offset: 64)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !1110)
!1110 = !{!1111, !1113, !1114, !1127, !1128, !1129, !1130, !1131, !1132, !1134, !1136, !1137}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1109, file: !135, line: 377, baseType: !1112, size: 64)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !390, line: 111, baseType: !675)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1109, file: !135, line: 378, baseType: !1112, size: 64, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1109, file: !135, line: 381, baseType: !1115, size: 64, offset: 128)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !1118)
!1118 = !{!1119}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1117, file: !135, line: 282, baseType: !1120, size: 128)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !1122)
!1122 = !{!1123, !1124, !1125}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1121, file: !135, line: 281, baseType: !7, size: 32)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1121, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1121, file: !135, line: 281, baseType: !1126, size: 64, offset: 64)
!1126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1112, size: 64, elements: !488)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1109, file: !135, line: 384, baseType: !380, size: 32, offset: 192)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1109, file: !135, line: 387, baseType: !380, size: 32, offset: 224)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1109, file: !135, line: 390, baseType: !380, size: 32, offset: 256)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1109, file: !135, line: 394, baseType: !1115, size: 64, offset: 320)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1109, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1109, file: !135, line: 399, baseType: !1133, size: 64, offset: 416)
!1133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !630)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1109, file: !135, line: 402, baseType: !1135, size: 64, offset: 480)
!1135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !630)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1109, file: !135, line: 406, baseType: !380, size: 32, offset: 544)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1109, file: !135, line: 409, baseType: !380, size: 32, offset: 576)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1101, file: !1102, line: 470, baseType: !702, size: 64, offset: 128)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1101, file: !1102, line: 473, baseType: !1140, size: 64, offset: 192)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1052, line: 39, size: 1152, elements: !1142)
!1142 = !{!1143, !1193, !1206, !1218, !1219, !1231, !1232, !1236, !1237, !1238, !1239, !1240}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1141, file: !1052, line: 41, baseType: !1144, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1145, line: 144, baseType: !1146)
!1145 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1145, line: 100, size: 896, elements: !1148)
!1148 = !{!1149, !1157, !1162, !1167, !1169, !1170, !1171, !1172, !1173, !1174, !1179, !1181, !1182, !1187, !1192}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1147, file: !1145, line: 102, baseType: !1150, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1145, line: 52, baseType: !1151)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!1154, !1155}
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1145, line: 47, baseType: !7)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1147, file: !1145, line: 105, baseType: !1158, size: 64, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1145, line: 59, baseType: !1159)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!380, !1155, !1155}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1147, file: !1145, line: 108, baseType: !1163, size: 64, offset: 128)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1145, line: 63, baseType: !1164)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{null, !384}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1147, file: !1145, line: 111, baseType: !1168, size: 64, offset: 192)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1147, file: !1145, line: 114, baseType: !858, size: 64, offset: 256)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1147, file: !1145, line: 117, baseType: !858, size: 64, offset: 320)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1147, file: !1145, line: 120, baseType: !858, size: 64, offset: 384)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1147, file: !1145, line: 124, baseType: !7, size: 32, offset: 448)
