; ModuleID = 'tree-parloops.bc'
source_filename = "tree-parloops.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!428 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!429 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !391, line: 80, baseType: !7, size: 32, elements: !430)
!430 = !{!431, !432, !433, !434}
!431 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!432 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!433 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!434 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!435 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !391, line: 727, baseType: !7, size: 32, elements: !436)
!436 = !{!437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460}
!437 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!438 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!439 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!440 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!441 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!442 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!443 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!444 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!445 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!446 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!447 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!448 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!449 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!450 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!451 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!452 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!453 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!454 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!455 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!456 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!457 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!458 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!459 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!460 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!461 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ssa_op_iter_type", file: !462, line: 119, baseType: !7, size: 32, elements: !463)
!462 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!463 = !{!464, !465, !466, !467}
!464 = !DIEnumerator(name: "ssa_op_iter_none", value: 0, isUnsigned: true)
!465 = !DIEnumerator(name: "ssa_op_iter_tree", value: 1, isUnsigned: true)
!466 = !DIEnumerator(name: "ssa_op_iter_use", value: 2, isUnsigned: true)
!467 = !DIEnumerator(name: "ssa_op_iter_def", value: 3, isUnsigned: true)
!468 = !{!469, !470, !471, !472, !475, !476, !478, !479, !481, !1842, !1112, !183, !1855, !429, !488, !1856, !665, !1076, !473, !1858, !1861, !1933, !1993, !1113, !1994, !927, !1999, !2024, !2029, !969, !2036, !2037, !2038, !620, !2045}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!471 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !474)
!478 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !480, line: 44, baseType: !7)
!480 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reduction_info", file: !3, line: 167, size: 512, elements: !484)
!484 = !{!485, !1835, !1836, !1837, !1838, !1839, !1840, !1841}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "reduc_stmt", scope: !483, file: !3, line: 169, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !487, line: 58, baseType: !488)
!487 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !391, line: 737, size: 768, elements: !490)
!490 = !{!491, !1682, !1692, !1698, !1703, !1708, !1715, !1721, !1727, !1732, !1746, !1751, !1757, !1762, !1772, !1777, !1793, !1800, !1807, !1813, !1818, !1824, !1830}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !489, file: !391, line: 738, baseType: !492, size: 256)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !391, line: 271, size: 256, elements: !493)
!493 = !{!494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !507, !508, !1681}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !492, file: !391, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !492, file: !391, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !492, file: !391, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !492, file: !391, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !492, file: !391, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !492, file: !391, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !492, file: !391, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !492, file: !391, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !492, file: !391, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !492, file: !391, line: 312, baseType: !7, size: 32, offset: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !492, file: !391, line: 316, baseType: !505, size: 32, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !506, line: 58, baseType: !479)
!506 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!507 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !492, file: !391, line: 319, baseType: !7, size: 32, offset: 96)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !492, file: !391, line: 323, baseType: !509, size: 64, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !511)
!511 = !{!512, !1648, !1649, !1650, !1651, !1655, !1656, !1657, !1675, !1676, !1677, !1678, !1679, !1680}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !510, file: !135, line: 219, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !516)
!516 = !{!517}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !515, file: !135, line: 151, baseType: !518, size: 128)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !520)
!520 = !{!521, !522, !523}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !519, file: !135, line: 150, baseType: !7, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !519, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !519, file: !135, line: 150, baseType: !524, size: 64, offset: 64)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !525, size: 64, elements: !585)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !487, line: 108, baseType: !526)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !528)
!528 = !{!529, !530, !531, !1640, !1641, !1642, !1643, !1644, !1645, !1646}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !527, file: !135, line: 124, baseType: !509, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !527, file: !135, line: 125, baseType: !509, size: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !527, file: !135, line: 131, baseType: !532, size: 64, offset: 128)
!532 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !533)
!533 = !{!534, !549}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !532, file: !135, line: 129, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !487, line: 66, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !391, line: 143, size: 192, elements: !538)
!538 = !{!539, !547, !548}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !537, file: !391, line: 145, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !487, line: 69, baseType: !541)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !391, line: 136, size: 192, elements: !543)
!543 = !{!544, !545, !546}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !542, file: !391, line: 137, baseType: !486, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !542, file: !391, line: 138, baseType: !541, size: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !542, file: !391, line: 139, baseType: !541, size: 64, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !537, file: !391, line: 146, baseType: !540, size: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !537, file: !391, line: 152, baseType: !535, size: 64, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !532, file: !135, line: 130, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !487, line: 50, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !553, line: 240, size: 384, elements: !554)
!553 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!554 = !{!555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !552, file: !553, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !552, file: !553, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !552, file: !553, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !552, file: !553, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !552, file: !553, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !552, file: !553, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !552, file: !553, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !552, file: !553, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !552, file: !553, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !552, file: !553, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !552, file: !553, line: 321, baseType: !566, size: 320, offset: 64)
!566 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !553, line: 315, size: 320, elements: !567)
!567 = !{!568, !1607, !1609, !1638, !1639}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !566, file: !553, line: 316, baseType: !569, size: 64)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !570, size: 64, elements: !585)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !553, line: 183, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !553, line: 166, size: 64, elements: !572)
!572 = !{!573, !574, !575, !576, !577, !587, !588, !600, !603, !664, !1585, !1586, !1597, !1604}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !571, file: !553, line: 168, baseType: !471, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !571, file: !553, line: 169, baseType: !7, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !571, file: !553, line: 170, baseType: !476, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !571, file: !553, line: 171, baseType: !550, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !571, file: !553, line: 172, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !487, line: 53, baseType: !579)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !553, line: 359, size: 128, elements: !581)
!581 = !{!582, !583}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !580, file: !553, line: 360, baseType: !471, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !580, file: !553, line: 361, baseType: !584, size: 64, offset: 64)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 64, elements: !585)
!585 = !{!586}
!586 = !DISubrange(count: 1)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !571, file: !553, line: 173, baseType: !5, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !571, file: !553, line: 174, baseType: !589, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !553, line: 133, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !553, line: 115, size: 32, elements: !591)
!591 = !{!592, !593, !594, !595, !596, !597, !598, !599}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !590, file: !553, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !590, file: !553, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !590, file: !553, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !590, file: !553, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !590, file: !553, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !590, file: !553, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !590, file: !553, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !590, file: !553, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !571, file: !553, line: 175, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !553, line: 175, flags: DIFlagFwdDecl)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !571, file: !553, line: 176, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !606, line: 75, size: 256, elements: !607)
!606 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!607 = !{!608, !623, !624, !625}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !605, file: !606, line: 76, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !606, line: 68, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !606, line: 63, size: 320, elements: !612)
!612 = !{!613, !615, !616, !617}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !611, file: !606, line: 64, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !611, file: !606, line: 65, baseType: !614, size: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !611, file: !606, line: 66, baseType: !7, size: 32, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !611, file: !606, line: 67, baseType: !618, size: 128, offset: 192)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !619, size: 128, elements: !621)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !606, line: 29, baseType: !620)
!620 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!621 = !{!622}
!622 = !DISubrange(count: 2)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !605, file: !606, line: 77, baseType: !609, size: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !605, file: !606, line: 78, baseType: !7, size: 32, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !605, file: !606, line: 79, baseType: !626, size: 64, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !606, line: 49, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !606, line: 45, size: 832, elements: !629)
!629 = !{!630, !631, !632}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !628, file: !606, line: 46, baseType: !614, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !628, file: !606, line: 47, baseType: !604, size: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !628, file: !606, line: 48, baseType: !633, size: 704, offset: 128)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !634, line: 164, size: 704, elements: !635)
!634 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!635 = !{!636, !637, !647, !648, !649, !650, !651, !652, !656, !660, !661, !662, !663}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !633, file: !634, line: 166, baseType: !478, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !633, file: !634, line: 167, baseType: !638, size: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !634, line: 157, size: 192, elements: !640)
!640 = !{!641, !642, !643}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !639, file: !634, line: 159, baseType: !473, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !639, file: !634, line: 160, baseType: !638, size: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !639, file: !634, line: 161, baseType: !644, size: 32, offset: 128)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 32, elements: !645)
!645 = !{!646}
!646 = !DISubrange(count: 4)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !633, file: !634, line: 168, baseType: !473, size: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !633, file: !634, line: 169, baseType: !473, size: 64, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !633, file: !634, line: 170, baseType: !473, size: 64, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !633, file: !634, line: 171, baseType: !478, size: 64, offset: 320)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !633, file: !634, line: 172, baseType: !471, size: 32, offset: 384)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !633, file: !634, line: 176, baseType: !653, size: 64, offset: 448)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DISubroutineType(types: !655)
!655 = !{!638, !475, !478}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !633, file: !634, line: 177, baseType: !657, size: 64, offset: 512)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{null, !475, !638}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !633, file: !634, line: 178, baseType: !475, size: 64, offset: 576)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !633, file: !634, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !633, file: !634, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !633, file: !634, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !571, file: !553, line: 177, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !487, line: 56, baseType: !666)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !151, line: 3371, size: 1792, elements: !668)
!668 = !{!669, !702, !708, !719, !738, !749, !754, !761, !767, !780, !788, !826, !831, !859, !876, !877, !882, !891, !897, !902, !906, !910, !1234, !1283, !1289, !1295, !1302, !1315, !1329, !1346, !1358, !1380, !1395, !1567}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !667, file: !151, line: 3372, baseType: !670, size: 64)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !151, line: 360, size: 64, elements: !671)
!671 = !{!672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !670, file: !151, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !670, file: !151, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !670, file: !151, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !670, file: !151, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !670, file: !151, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !670, file: !151, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !670, file: !151, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !670, file: !151, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !670, file: !151, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !670, file: !151, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !670, file: !151, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !670, file: !151, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !670, file: !151, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !670, file: !151, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !670, file: !151, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !670, file: !151, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !670, file: !151, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !670, file: !151, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !670, file: !151, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !670, file: !151, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !670, file: !151, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !670, file: !151, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !670, file: !151, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !670, file: !151, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !670, file: !151, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !670, file: !151, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !670, file: !151, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !670, file: !151, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !670, file: !151, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !670, file: !151, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !667, file: !151, line: 3373, baseType: !703, size: 192)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !151, line: 402, size: 192, elements: !704)
!704 = !{!705, !706, !707}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !703, file: !151, line: 403, baseType: !670, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !703, file: !151, line: 404, baseType: !665, size: 64, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !703, file: !151, line: 405, baseType: !665, size: 64, offset: 128)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !667, file: !151, line: 3374, baseType: !709, size: 320)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !151, line: 1384, size: 320, elements: !710)
!710 = !{!711, !712}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !709, file: !151, line: 1385, baseType: !703, size: 192)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !709, file: !151, line: 1386, baseType: !713, size: 128, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !714, line: 58, baseType: !715)
!714 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !714, line: 54, size: 128, elements: !716)
!716 = !{!717, !718}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !715, file: !714, line: 56, baseType: !620, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !715, file: !714, line: 57, baseType: !478, size: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !667, file: !151, line: 3375, baseType: !720, size: 256)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !151, line: 1397, size: 256, elements: !721)
!721 = !{!722, !723}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !720, file: !151, line: 1398, baseType: !703, size: 192)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !720, file: !151, line: 1399, baseType: !724, size: 64, offset: 192)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !726, line: 52, size: 256, elements: !727)
!726 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!727 = !{!728, !729, !730, !731, !732, !733, !734}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !725, file: !726, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !725, file: !726, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !725, file: !726, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !725, file: !726, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !725, file: !726, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !725, file: !726, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !725, file: !726, line: 62, baseType: !735, size: 192, offset: 64)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !620, size: 192, elements: !736)
!736 = !{!737}
!737 = !DISubrange(count: 3)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !667, file: !151, line: 3376, baseType: !739, size: 256)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !151, line: 1408, size: 256, elements: !740)
!740 = !{!741, !742}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !739, file: !151, line: 1409, baseType: !703, size: 192)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !739, file: !151, line: 1410, baseType: !743, size: 64, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !745, line: 27, size: 192, elements: !746)
!745 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!746 = !{!747, !748}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !744, file: !745, line: 29, baseType: !713, size: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !744, file: !745, line: 30, baseType: !5, size: 32, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !667, file: !151, line: 3377, baseType: !750, size: 256)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !151, line: 1437, size: 256, elements: !751)
!751 = !{!752, !753}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !750, file: !151, line: 1438, baseType: !703, size: 192)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !750, file: !151, line: 1439, baseType: !665, size: 64, offset: 192)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !667, file: !151, line: 3378, baseType: !755, size: 256)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !151, line: 1418, size: 256, elements: !756)
!756 = !{!757, !758, !759}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !755, file: !151, line: 1419, baseType: !703, size: 192)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !755, file: !151, line: 1420, baseType: !471, size: 32, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !755, file: !151, line: 1421, baseType: !760, size: 8, offset: 224)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 8, elements: !585)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !667, file: !151, line: 3379, baseType: !762, size: 320)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !151, line: 1428, size: 320, elements: !763)
!763 = !{!764, !765, !766}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !762, file: !151, line: 1429, baseType: !703, size: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !762, file: !151, line: 1430, baseType: !665, size: 64, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !762, file: !151, line: 1431, baseType: !665, size: 64, offset: 256)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !667, file: !151, line: 3380, baseType: !768, size: 320)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !151, line: 1460, size: 320, elements: !769)
!769 = !{!770, !771}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !768, file: !151, line: 1461, baseType: !703, size: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !768, file: !151, line: 1462, baseType: !772, size: 128, offset: 192)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !773, line: 31, size: 128, elements: !774)
!773 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!774 = !{!775, !778, !779}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !772, file: !773, line: 32, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !470)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !772, file: !773, line: 33, baseType: !7, size: 32, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !772, file: !773, line: 34, baseType: !7, size: 32, offset: 96)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !667, file: !151, line: 3381, baseType: !781, size: 384)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !151, line: 2507, size: 384, elements: !782)
!782 = !{!783, !784, !785, !786, !787}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !781, file: !151, line: 2508, baseType: !703, size: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !781, file: !151, line: 2509, baseType: !505, size: 32, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !781, file: !151, line: 2510, baseType: !7, size: 32, offset: 224)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !781, file: !151, line: 2511, baseType: !665, size: 64, offset: 256)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !781, file: !151, line: 2512, baseType: !665, size: 64, offset: 320)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !667, file: !151, line: 3382, baseType: !789, size: 896)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !151, line: 2652, size: 896, elements: !790)
!790 = !{!791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !789, file: !151, line: 2653, baseType: !781, size: 384)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !789, file: !151, line: 2654, baseType: !665, size: 64, offset: 384)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !789, file: !151, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !789, file: !151, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !789, file: !151, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !789, file: !151, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !789, file: !151, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !789, file: !151, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !789, file: !151, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !789, file: !151, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !789, file: !151, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !789, file: !151, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !789, file: !151, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !789, file: !151, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !789, file: !151, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !789, file: !151, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !789, file: !151, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !789, file: !151, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !789, file: !151, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !789, file: !151, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !789, file: !151, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !789, file: !151, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !789, file: !151, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !789, file: !151, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !789, file: !151, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !789, file: !151, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !789, file: !151, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !789, file: !151, line: 2703, baseType: !7, size: 32, offset: 512)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !789, file: !151, line: 2705, baseType: !665, size: 64, offset: 576)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !789, file: !151, line: 2706, baseType: !665, size: 64, offset: 640)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !789, file: !151, line: 2707, baseType: !665, size: 64, offset: 704)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !789, file: !151, line: 2708, baseType: !665, size: 64, offset: 768)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !789, file: !151, line: 2711, baseType: !824, size: 64, offset: 832)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !151, line: 2711, flags: DIFlagFwdDecl)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !667, file: !151, line: 3383, baseType: !827, size: 960)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !151, line: 2756, size: 960, elements: !828)
!828 = !{!829, !830}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !827, file: !151, line: 2757, baseType: !789, size: 896)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !827, file: !151, line: 2758, baseType: !550, size: 64, offset: 896)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !667, file: !151, line: 3384, baseType: !832, size: 1472)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !151, line: 3114, size: 1472, elements: !833)
!833 = !{!834, !855, !856, !857, !858}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !832, file: !151, line: 3115, baseType: !835, size: 1216)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !151, line: 2984, size: 1216, elements: !836)
!836 = !{!837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !835, file: !151, line: 2985, baseType: !827, size: 960)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !835, file: !151, line: 2986, baseType: !665, size: 64, offset: 960)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !835, file: !151, line: 2987, baseType: !665, size: 64, offset: 1024)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !835, file: !151, line: 2988, baseType: !665, size: 64, offset: 1088)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !835, file: !151, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !835, file: !151, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !835, file: !151, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !835, file: !151, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !835, file: !151, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !835, file: !151, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !835, file: !151, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !835, file: !151, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !835, file: !151, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !835, file: !151, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !835, file: !151, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !835, file: !151, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !835, file: !151, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !835, file: !151, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !832, file: !151, line: 3117, baseType: !665, size: 64, offset: 1216)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !832, file: !151, line: 3119, baseType: !665, size: 64, offset: 1280)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !832, file: !151, line: 3121, baseType: !665, size: 64, offset: 1344)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !832, file: !151, line: 3123, baseType: !665, size: 64, offset: 1408)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !667, file: !151, line: 3385, baseType: !860, size: 1088)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !151, line: 2874, size: 1088, elements: !861)
!861 = !{!862, !863, !864}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !860, file: !151, line: 2875, baseType: !827, size: 960)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !860, file: !151, line: 2876, baseType: !550, size: 64, offset: 960)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !860, file: !151, line: 2877, baseType: !865, size: 64, offset: 1024)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !867, line: 172, size: 128, elements: !868)
!867 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!868 = !{!869, !870, !871, !872, !873, !874, !875}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !866, file: !867, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !866, file: !867, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !866, file: !867, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !866, file: !867, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !866, file: !867, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !866, file: !867, line: 195, baseType: !7, size: 32, offset: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !866, file: !867, line: 199, baseType: !665, size: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !667, file: !151, line: 3386, baseType: !835, size: 1216)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !667, file: !151, line: 3387, baseType: !878, size: 1280)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !151, line: 3093, size: 1280, elements: !879)
!879 = !{!880, !881}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !878, file: !151, line: 3094, baseType: !835, size: 1216)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !878, file: !151, line: 3095, baseType: !865, size: 64, offset: 1216)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !667, file: !151, line: 3388, baseType: !883, size: 1216)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !151, line: 2824, size: 1216, elements: !884)
!884 = !{!885, !886, !887, !888, !889, !890}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !883, file: !151, line: 2825, baseType: !789, size: 896)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !883, file: !151, line: 2827, baseType: !665, size: 64, offset: 896)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !883, file: !151, line: 2828, baseType: !665, size: 64, offset: 960)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !883, file: !151, line: 2829, baseType: !665, size: 64, offset: 1024)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !883, file: !151, line: 2830, baseType: !665, size: 64, offset: 1088)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !883, file: !151, line: 2831, baseType: !665, size: 64, offset: 1152)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !667, file: !151, line: 3389, baseType: !892, size: 1024)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !151, line: 2850, size: 1024, elements: !893)
!893 = !{!894, !895, !896}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !892, file: !151, line: 2851, baseType: !827, size: 960)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !892, file: !151, line: 2852, baseType: !471, size: 32, offset: 960)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !892, file: !151, line: 2853, baseType: !471, size: 32, offset: 992)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !667, file: !151, line: 3390, baseType: !898, size: 1024)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !151, line: 2857, size: 1024, elements: !899)
!899 = !{!900, !901}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !898, file: !151, line: 2858, baseType: !827, size: 960)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !898, file: !151, line: 2859, baseType: !865, size: 64, offset: 960)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !667, file: !151, line: 3391, baseType: !903, size: 960)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !151, line: 2862, size: 960, elements: !904)
!904 = !{!905}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !903, file: !151, line: 2863, baseType: !827, size: 960)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !667, file: !151, line: 3392, baseType: !907, size: 1472)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !151, line: 3304, size: 1472, elements: !908)
!908 = !{!909}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !907, file: !151, line: 3305, baseType: !832, size: 1472)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !667, file: !151, line: 3393, baseType: !911, size: 1792)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !151, line: 3248, size: 1792, elements: !912)
!912 = !{!913, !914, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !911, file: !151, line: 3249, baseType: !832, size: 1472)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !911, file: !151, line: 3251, baseType: !915, size: 64, offset: 1472)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !917, line: 463, size: 1152, elements: !918)
!917 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!918 = !{!919, !922, !953, !954, !1094, !1157, !1158, !1159, !1160, !1161, !1162, !1186, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !916, file: !917, line: 464, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !917, line: 464, flags: DIFlagFwdDecl)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !916, file: !917, line: 467, baseType: !923, size: 64, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !925)
!925 = !{!926, !928, !929, !942, !943, !944, !945, !946, !947, !949, !951, !952}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !924, file: !135, line: 377, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !487, line: 111, baseType: !509)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !924, file: !135, line: 378, baseType: !927, size: 64, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !924, file: !135, line: 381, baseType: !930, size: 64, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !933)
!933 = !{!934}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !932, file: !135, line: 282, baseType: !935, size: 128)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !937)
!937 = !{!938, !939, !940}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !936, file: !135, line: 281, baseType: !7, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !936, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !936, file: !135, line: 281, baseType: !941, size: 64, offset: 64)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !927, size: 64, elements: !585)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !924, file: !135, line: 384, baseType: !471, size: 32, offset: 192)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !924, file: !135, line: 387, baseType: !471, size: 32, offset: 224)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !924, file: !135, line: 390, baseType: !471, size: 32, offset: 256)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !924, file: !135, line: 394, baseType: !930, size: 64, offset: 320)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !924, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !924, file: !135, line: 399, baseType: !948, size: 64, offset: 416)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !621)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !924, file: !135, line: 402, baseType: !950, size: 64, offset: 480)
!950 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !621)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !924, file: !135, line: 406, baseType: !471, size: 32, offset: 544)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !924, file: !135, line: 409, baseType: !471, size: 32, offset: 576)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !916, file: !917, line: 470, baseType: !536, size: 64, offset: 128)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !916, file: !917, line: 473, baseType: !955, size: 64, offset: 192)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !867, line: 39, size: 1152, elements: !957)
!957 = !{!958, !1010, !1023, !1036, !1037, !1049, !1050, !1054, !1055, !1056, !1057, !1058}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !956, file: !867, line: 41, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !960, line: 144, baseType: !961)
!960 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !960, line: 100, size: 896, elements: !963)
!963 = !{!964, !972, !977, !982, !984, !987, !988, !989, !990, !991, !996, !998, !999, !1004, !1009}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !962, file: !960, line: 102, baseType: !965, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !960, line: 52, baseType: !966)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!969, !970}
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !960, line: 47, baseType: !7)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !962, file: !960, line: 105, baseType: !973, size: 64, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !960, line: 59, baseType: !974)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!471, !970, !970}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !962, file: !960, line: 108, baseType: !978, size: 64, offset: 128)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !960, line: 63, baseType: !979)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{null, !475}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !962, file: !960, line: 111, baseType: !983, size: 64, offset: 192)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !962, file: !960, line: 114, baseType: !985, size: 64, offset: 256)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !986, line: 46, baseType: !620)
!986 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!987 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !962, file: !960, line: 117, baseType: !985, size: 64, offset: 320)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !962, file: !960, line: 120, baseType: !985, size: 64, offset: 384)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !962, file: !960, line: 124, baseType: !7, size: 32, offset: 448)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !962, file: !960, line: 128, baseType: !7, size: 32, offset: 480)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !962, file: !960, line: 131, baseType: !992, size: 64, offset: 512)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !960, line: 75, baseType: !993)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!475, !985, !985}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !962, file: !960, line: 132, baseType: !997, size: 64, offset: 576)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !960, line: 78, baseType: !979)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !962, file: !960, line: 135, baseType: !475, size: 64, offset: 640)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !962, file: !960, line: 136, baseType: !1000, size: 64, offset: 704)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !960, line: 82, baseType: !1001)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!475, !475, !985, !985}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !962, file: !960, line: 137, baseType: !1005, size: 64, offset: 768)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !960, line: 83, baseType: !1006)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{null, !475, !475}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !962, file: !960, line: 141, baseType: !7, size: 32, offset: 832)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !956, file: !867, line: 48, baseType: !1011, size: 64, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !391, line: 35, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !391, line: 35, size: 128, elements: !1014)
!1014 = !{!1015}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1013, file: !391, line: 35, baseType: !1016, size: 128)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !391, line: 33, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !391, line: 33, size: 128, elements: !1018)
!1018 = !{!1019, !1020, !1021}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1017, file: !391, line: 33, baseType: !7, size: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1017, file: !391, line: 33, baseType: !7, size: 32, offset: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1017, file: !391, line: 33, baseType: !1022, size: 64, offset: 64)
!1022 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 64, elements: !585)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !956, file: !867, line: 51, baseType: !1024, size: 64, offset: 128)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !151, line: 183, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !151, line: 183, size: 128, elements: !1027)
!1027 = !{!1028}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1026, file: !151, line: 183, baseType: !1029, size: 128)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !151, line: 182, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !151, line: 182, size: 128, elements: !1031)
!1031 = !{!1032, !1033, !1034}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1030, file: !151, line: 182, baseType: !7, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1030, file: !151, line: 182, baseType: !7, size: 32, offset: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1030, file: !151, line: 182, baseType: !1035, size: 64, offset: 64)
!1035 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 64, elements: !585)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !956, file: !867, line: 54, baseType: !665, size: 64, offset: 192)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !956, file: !867, line: 57, baseType: !1038, size: 128, offset: 256)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1039, line: 31, size: 128, elements: !1040)
!1039 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1040 = !{!1041, !1042, !1043, !1044, !1045, !1046, !1047}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1038, file: !1039, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1038, file: !1039, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1038, file: !1039, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1038, file: !1039, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1038, file: !1039, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1038, file: !1039, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1038, file: !1039, line: 56, baseType: !1048, size: 64, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !487, line: 47, baseType: !604)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !956, file: !867, line: 60, baseType: !1038, size: 128, offset: 384)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !956, file: !867, line: 64, baseType: !1051, size: 64, offset: 512)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1053, line: 33, flags: DIFlagFwdDecl)
!1053 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !956, file: !867, line: 67, baseType: !665, size: 64, offset: 576)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !956, file: !867, line: 73, baseType: !959, size: 64, offset: 640)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !956, file: !867, line: 77, baseType: !1048, size: 64, offset: 704)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !956, file: !867, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !956, file: !867, line: 82, baseType: !1059, size: 320, offset: 832)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !462, line: 62, size: 320, elements: !1060)
!1060 = !{!1061, !1067, !1068, !1069, !1070, !1077}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1059, file: !462, line: 63, baseType: !1062, size: 64)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !462, line: 56, size: 128, elements: !1064)
!1064 = !{!1065, !1066}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1063, file: !462, line: 57, baseType: !1062, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1063, file: !462, line: 58, baseType: !760, size: 8, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1059, file: !462, line: 64, baseType: !7, size: 32, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1059, file: !462, line: 66, baseType: !7, size: 32, offset: 96)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1059, file: !462, line: 68, baseType: !470, size: 8, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1059, file: !462, line: 70, baseType: !1071, size: 64, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !462, line: 37, size: 128, elements: !1073)
!1073 = !{!1074, !1075}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1072, file: !462, line: 39, baseType: !1071, size: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1072, file: !462, line: 40, baseType: !1076, size: 64, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1059, file: !462, line: 71, baseType: !1078, size: 64, offset: 256)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !462, line: 45, size: 320, elements: !1080)
!1080 = !{!1081, !1082}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1079, file: !462, line: 47, baseType: !1078, size: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1079, file: !462, line: 48, baseType: !1083, size: 256, offset: 64)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !151, line: 1883, size: 256, elements: !1084)
!1084 = !{!1085, !1087, !1088, !1093}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1083, file: !151, line: 1884, baseType: !1086, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1083, file: !151, line: 1885, baseType: !1086, size: 64, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1083, file: !151, line: 1891, baseType: !1089, size: 64, offset: 128)
!1089 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1083, file: !151, line: 1891, size: 64, elements: !1090)
!1090 = !{!1091, !1092}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1089, file: !151, line: 1891, baseType: !486, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1089, file: !151, line: 1891, baseType: !665, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1083, file: !151, line: 1892, baseType: !1076, size: 64, offset: 192)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !916, file: !917, line: 476, baseType: !1095, size: 64, offset: 256)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !378, line: 187, size: 256, elements: !1097)
!1097 = !{!1098, !1099, !1155, !1156}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1096, file: !378, line: 189, baseType: !471, size: 32)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1096, file: !378, line: 192, baseType: !1100, size: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !378, line: 87, baseType: !1102)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !378, line: 87, size: 128, elements: !1103)
!1103 = !{!1104}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1102, file: !378, line: 87, baseType: !1105, size: 128)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !378, line: 85, baseType: !1106)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !378, line: 85, size: 128, elements: !1107)
!1107 = !{!1108, !1109, !1110}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1106, file: !378, line: 85, baseType: !7, size: 32)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1106, file: !378, line: 85, baseType: !7, size: 32, offset: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1106, file: !378, line: 85, baseType: !1111, size: 64, offset: 64)
!1111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1112, size: 64, elements: !585)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !378, line: 84, baseType: !1113)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !378, line: 100, size: 1216, elements: !1115)
!1115 = !{!1116, !1117, !1118, !1119, !1120, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1145, !1153, !1154}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1114, file: !378, line: 102, baseType: !471, size: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1114, file: !378, line: 105, baseType: !7, size: 32, offset: 32)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1114, file: !378, line: 108, baseType: !509, size: 64, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1114, file: !378, line: 111, baseType: !509, size: 64, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1114, file: !378, line: 114, baseType: !1121, size: 64, offset: 192)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !378, line: 41, size: 64, elements: !1122)
!1122 = !{!1123, !1124}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1121, file: !378, line: 42, baseType: !377, size: 32)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1121, file: !378, line: 43, baseType: !7, size: 32, offset: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1114, file: !378, line: 117, baseType: !7, size: 32, offset: 256)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1114, file: !378, line: 120, baseType: !7, size: 32, offset: 288)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1114, file: !378, line: 123, baseType: !1100, size: 64, offset: 320)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1114, file: !378, line: 126, baseType: !1113, size: 64, offset: 384)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1114, file: !378, line: 129, baseType: !1113, size: 64, offset: 448)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1114, file: !378, line: 132, baseType: !475, size: 64, offset: 512)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1114, file: !378, line: 139, baseType: !665, size: 64, offset: 576)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1114, file: !378, line: 143, baseType: !713, size: 128, offset: 640)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1114, file: !378, line: 146, baseType: !713, size: 128, offset: 768)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1114, file: !378, line: 148, baseType: !470, size: 8, offset: 896)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1114, file: !378, line: 149, baseType: !470, size: 8, offset: 904)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1114, file: !378, line: 153, baseType: !386, size: 32, offset: 928)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1114, file: !378, line: 156, baseType: !1138, size: 64, offset: 960)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !378, line: 48, size: 320, elements: !1140)
!1140 = !{!1141, !1142, !1143, !1144}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1139, file: !378, line: 50, baseType: !486, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1139, file: !378, line: 59, baseType: !713, size: 128, offset: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1139, file: !378, line: 64, baseType: !470, size: 8, offset: 192)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1139, file: !378, line: 67, baseType: !1138, size: 64, offset: 256)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1114, file: !378, line: 159, baseType: !1146, size: 64, offset: 1024)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !378, line: 72, size: 256, elements: !1148)
!1148 = !{!1149, !1150, !1151, !1152}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1147, file: !378, line: 74, baseType: !526, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1147, file: !378, line: 77, baseType: !1146, size: 64, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1147, file: !378, line: 78, baseType: !1146, size: 64, offset: 128)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1147, file: !378, line: 81, baseType: !1146, size: 64, offset: 192)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1114, file: !378, line: 162, baseType: !470, size: 8, offset: 1088)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1114, file: !378, line: 166, baseType: !665, size: 64, offset: 1152)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1096, file: !378, line: 197, baseType: !959, size: 64, offset: 128)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1096, file: !378, line: 200, baseType: !1113, size: 64, offset: 192)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !916, file: !917, line: 479, baseType: !959, size: 64, offset: 320)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !916, file: !917, line: 484, baseType: !665, size: 64, offset: 384)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !916, file: !917, line: 488, baseType: !665, size: 64, offset: 448)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !916, file: !917, line: 493, baseType: !665, size: 64, offset: 512)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !916, file: !917, line: 496, baseType: !665, size: 64, offset: 576)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !916, file: !917, line: 501, baseType: !1163, size: 64, offset: 640)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !146, line: 2355, size: 576, elements: !1165)
!1165 = !{!1166, !1169, !1170, !1171, !1172, !1174, !1175, !1180, !1181, !1182, !1183, !1184, !1185}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1164, file: !146, line: 2356, baseType: !1167, size: 64)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !146, line: 2356, flags: DIFlagFwdDecl)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1164, file: !146, line: 2357, baseType: !476, size: 64, offset: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1164, file: !146, line: 2358, baseType: !471, size: 32, offset: 128)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1164, file: !146, line: 2359, baseType: !471, size: 32, offset: 160)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1164, file: !146, line: 2360, baseType: !1173, size: 128, offset: 192)
!1173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 128, elements: !645)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1164, file: !146, line: 2364, baseType: !471, size: 32, offset: 320)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1164, file: !146, line: 2367, baseType: !1176, size: 128, offset: 384)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !146, line: 2349, size: 128, elements: !1177)
!1177 = !{!1178, !1179}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1176, file: !146, line: 2351, baseType: !550, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1176, file: !146, line: 2352, baseType: !478, size: 64, offset: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1164, file: !146, line: 2371, baseType: !145, size: 32, offset: 512)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1164, file: !146, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1164, file: !146, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1164, file: !146, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1164, file: !146, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1164, file: !146, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !916, file: !917, line: 504, baseType: !1187, size: 64, offset: 704)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !917, line: 504, flags: DIFlagFwdDecl)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !916, file: !917, line: 507, baseType: !959, size: 64, offset: 768)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !916, file: !917, line: 510, baseType: !471, size: 32, offset: 832)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !916, file: !917, line: 513, baseType: !471, size: 32, offset: 864)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !916, file: !917, line: 516, baseType: !505, size: 32, offset: 896)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !916, file: !917, line: 519, baseType: !505, size: 32, offset: 928)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !916, file: !917, line: 522, baseType: !7, size: 32, offset: 960)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !916, file: !917, line: 523, baseType: !7, size: 32, offset: 992)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !916, file: !917, line: 528, baseType: !476, size: 64, offset: 1024)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !916, file: !917, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !916, file: !917, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !916, file: !917, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !916, file: !917, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !916, file: !917, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !916, file: !917, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !916, file: !917, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !916, file: !917, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !916, file: !917, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !916, file: !917, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !916, file: !917, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !916, file: !917, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !916, file: !917, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !916, file: !917, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !916, file: !917, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !916, file: !917, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !911, file: !151, line: 3254, baseType: !665, size: 64, offset: 1536)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !911, file: !151, line: 3257, baseType: !665, size: 64, offset: 1600)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !911, file: !151, line: 3258, baseType: !665, size: 64, offset: 1664)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !911, file: !151, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !911, file: !151, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !911, file: !151, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !911, file: !151, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !911, file: !151, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !911, file: !151, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !911, file: !151, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !911, file: !151, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !911, file: !151, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !911, file: !151, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !911, file: !151, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !911, file: !151, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !911, file: !151, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !911, file: !151, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !911, file: !151, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !911, file: !151, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !911, file: !151, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !911, file: !151, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !667, file: !151, line: 3394, baseType: !1235, size: 1344)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !151, line: 2279, size: 1344, elements: !1236)
