; ModuleID = 'tree-vectorizer.bc'
source_filename = "tree-vectorizer.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }

!532 = !DIEnumerator(name: "TV_LOWER_SUBREG", value: 118, isUnsigned: true)
!533 = !DIEnumerator(name: "TV_JUMP", value: 119, isUnsigned: true)
!534 = !DIEnumerator(name: "TV_FWPROP", value: 120, isUnsigned: true)
!535 = !DIEnumerator(name: "TV_CSE", value: 121, isUnsigned: true)
!536 = !DIEnumerator(name: "TV_DCE", value: 122, isUnsigned: true)
!537 = !DIEnumerator(name: "TV_DSE1", value: 123, isUnsigned: true)
!538 = !DIEnumerator(name: "TV_DSE2", value: 124, isUnsigned: true)
!539 = !DIEnumerator(name: "TV_LOOP", value: 125, isUnsigned: true)
!540 = !DIEnumerator(name: "TV_LOOP_MOVE_INVARIANTS", value: 126, isUnsigned: true)
!541 = !DIEnumerator(name: "TV_LOOP_UNSWITCH", value: 127, isUnsigned: true)
!542 = !DIEnumerator(name: "TV_LOOP_UNROLL", value: 128, isUnsigned: true)
!543 = !DIEnumerator(name: "TV_LOOP_DOLOOP", value: 129, isUnsigned: true)
!544 = !DIEnumerator(name: "TV_CPROP", value: 130, isUnsigned: true)
!545 = !DIEnumerator(name: "TV_PRE", value: 131, isUnsigned: true)
!546 = !DIEnumerator(name: "TV_HOIST", value: 132, isUnsigned: true)
!547 = !DIEnumerator(name: "TV_LSM", value: 133, isUnsigned: true)
!548 = !DIEnumerator(name: "TV_TRACER", value: 134, isUnsigned: true)
!549 = !DIEnumerator(name: "TV_WEB", value: 135, isUnsigned: true)
!550 = !DIEnumerator(name: "TV_AUTO_INC_DEC", value: 136, isUnsigned: true)
!551 = !DIEnumerator(name: "TV_CSE2", value: 137, isUnsigned: true)
!552 = !DIEnumerator(name: "TV_BRANCH_PROB", value: 138, isUnsigned: true)
!553 = !DIEnumerator(name: "TV_VPT", value: 139, isUnsigned: true)
!554 = !DIEnumerator(name: "TV_COMBINE", value: 140, isUnsigned: true)
!555 = !DIEnumerator(name: "TV_IFCVT", value: 141, isUnsigned: true)
!556 = !DIEnumerator(name: "TV_REGMOVE", value: 142, isUnsigned: true)
!557 = !DIEnumerator(name: "TV_MODE_SWITCH", value: 143, isUnsigned: true)
!558 = !DIEnumerator(name: "TV_SMS", value: 144, isUnsigned: true)
!559 = !DIEnumerator(name: "TV_SCHED", value: 145, isUnsigned: true)
!560 = !DIEnumerator(name: "TV_LOCAL_ALLOC", value: 146, isUnsigned: true)
!561 = !DIEnumerator(name: "TV_GLOBAL_ALLOC", value: 147, isUnsigned: true)
!562 = !DIEnumerator(name: "TV_IRA", value: 148, isUnsigned: true)
!563 = !DIEnumerator(name: "TV_RELOAD", value: 149, isUnsigned: true)
!564 = !DIEnumerator(name: "TV_RELOAD_CSE_REGS", value: 150, isUnsigned: true)
!565 = !DIEnumerator(name: "TV_SEQABSTR", value: 151, isUnsigned: true)
!566 = !DIEnumerator(name: "TV_GCSE_AFTER_RELOAD", value: 152, isUnsigned: true)
!567 = !DIEnumerator(name: "TV_THREAD_PROLOGUE_AND_EPILOGUE", value: 153, isUnsigned: true)
!568 = !DIEnumerator(name: "TV_IFCVT2", value: 154, isUnsigned: true)
!569 = !DIEnumerator(name: "TV_COMBINE_STACK_ADJUST", value: 155, isUnsigned: true)
!570 = !DIEnumerator(name: "TV_PEEPHOLE2", value: 156, isUnsigned: true)
!571 = !DIEnumerator(name: "TV_RENAME_REGISTERS", value: 157, isUnsigned: true)
!572 = !DIEnumerator(name: "TV_CPROP_REGISTERS", value: 158, isUnsigned: true)
!573 = !DIEnumerator(name: "TV_SCHED2", value: 159, isUnsigned: true)
!574 = !DIEnumerator(name: "TV_MACH_DEP", value: 160, isUnsigned: true)
!575 = !DIEnumerator(name: "TV_DBR_SCHED", value: 161, isUnsigned: true)
!576 = !DIEnumerator(name: "TV_REORDER_BLOCKS", value: 162, isUnsigned: true)
!577 = !DIEnumerator(name: "TV_SHORTEN_BRANCH", value: 163, isUnsigned: true)
!578 = !DIEnumerator(name: "TV_REG_STACK", value: 164, isUnsigned: true)
!579 = !DIEnumerator(name: "TV_FINAL", value: 165, isUnsigned: true)
!580 = !DIEnumerator(name: "TV_SYMOUT", value: 166, isUnsigned: true)
!581 = !DIEnumerator(name: "TV_VAR_TRACKING", value: 167, isUnsigned: true)
!582 = !DIEnumerator(name: "TV_TREE_IFCOMBINE", value: 168, isUnsigned: true)
!583 = !DIEnumerator(name: "TV_PLUGIN_INIT", value: 169, isUnsigned: true)
!584 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!585 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!586 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!587 = !{!588, !589, !590, !591, !594, !595, !5, !597, !599, !2150, !1292, !197}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!590 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !593)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !598, line: 44, baseType: !7)
!598 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_vec_info", file: !6, line: 245, baseType: !600)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_loop_vec_info", file: !6, line: 176, size: 1024, elements: !602)
!602 = !{!603, !1956, !1958, !1959, !1960, !1961, !1962, !1963, !2023, !2024, !2025, !2039, !2100, !2101, !2107, !2109, !2110, !2177}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "loop", scope: !601, file: !6, line: 179, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !392, line: 100, size: 1216, elements: !606)
!606 = !{!607, !608, !609, !1920, !1921, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1946, !1954, !1955}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !605, file: !392, line: 102, baseType: !590, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !605, file: !392, line: 105, baseType: !7, size: 32, offset: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !605, file: !392, line: 108, baseType: !610, size: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !149, line: 217, size: 832, elements: !612)
!612 = !{!613, !1887, !1888, !1889, !1890, !1894, !1895, !1896, !1914, !1915, !1916, !1917, !1918, !1919}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !611, file: !149, line: 219, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !149, line: 151, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !149, line: 151, size: 128, elements: !617)
!617 = !{!618}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !616, file: !149, line: 151, baseType: !619, size: 128)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !149, line: 150, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !149, line: 150, size: 128, elements: !621)
!621 = !{!622, !623, !624}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !620, file: !149, line: 150, baseType: !7, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !620, file: !149, line: 150, baseType: !7, size: 32, offset: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !620, file: !149, line: 150, baseType: !625, size: 64, offset: 64)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 64, elements: !769)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !627, line: 108, baseType: !628)
!627 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !149, line: 122, size: 512, elements: !630)
!630 = !{!631, !632, !633, !1879, !1880, !1881, !1882, !1883, !1884, !1885}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !629, file: !149, line: 124, baseType: !610, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !629, file: !149, line: 125, baseType: !610, size: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !629, file: !149, line: 131, baseType: !634, size: 64, offset: 128)
!634 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !149, line: 128, size: 64, elements: !635)
!635 = !{!636, !1878}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !634, file: !149, line: 129, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !627, line: 66, baseType: !638)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !640, line: 143, size: 192, elements: !641)
!640 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!641 = !{!642, !1876, !1877}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !639, file: !640, line: 145, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !627, line: 69, baseType: !644)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !640, line: 136, size: 192, elements: !646)
!646 = !{!647, !1874, !1875}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !645, file: !640, line: 137, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !627, line: 58, baseType: !649)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !640, line: 737, size: 768, elements: !651)
!651 = !{!652, !1721, !1731, !1737, !1742, !1747, !1754, !1760, !1766, !1771, !1785, !1790, !1796, !1801, !1811, !1816, !1832, !1839, !1846, !1852, !1857, !1863, !1869}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !650, file: !640, line: 738, baseType: !653, size: 256)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !640, line: 271, size: 256, elements: !654)
!654 = !{!655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !668, !669, !670}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !653, file: !640, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !653, file: !640, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !653, file: !640, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !653, file: !640, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !653, file: !640, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !653, file: !640, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !653, file: !640, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !653, file: !640, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !653, file: !640, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !653, file: !640, line: 312, baseType: !7, size: 32, offset: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !653, file: !640, line: 316, baseType: !666, size: 32, offset: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !667, line: 58, baseType: !597)
!667 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!668 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !653, file: !640, line: 319, baseType: !7, size: 32, offset: 96)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !653, file: !640, line: 323, baseType: !610, size: 64, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !653, file: !640, line: 327, baseType: !671, size: 64, offset: 192)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !627, line: 56, baseType: !672)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !165, line: 3371, size: 1792, elements: !674)
!674 = !{!675, !708, !714, !727, !746, !757, !762, !771, !777, !790, !798, !836, !1010, !1038, !1055, !1056, !1061, !1070, !1076, !1081, !1085, !1089, !1372, !1419, !1425, !1431, !1438, !1451, !1465, !1482, !1494, !1516, !1531, !1703}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !673, file: !165, line: 3372, baseType: !676, size: 64)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !165, line: 360, size: 64, elements: !677)
!677 = !{!678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !676, file: !165, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !676, file: !165, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !676, file: !165, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !676, file: !165, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !676, file: !165, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !676, file: !165, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !676, file: !165, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !676, file: !165, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !676, file: !165, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !676, file: !165, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !676, file: !165, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !676, file: !165, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !676, file: !165, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !676, file: !165, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !676, file: !165, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !676, file: !165, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !676, file: !165, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !676, file: !165, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !676, file: !165, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !676, file: !165, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !676, file: !165, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !676, file: !165, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !676, file: !165, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !676, file: !165, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !676, file: !165, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !676, file: !165, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !676, file: !165, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !676, file: !165, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !676, file: !165, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !676, file: !165, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !673, file: !165, line: 3373, baseType: !709, size: 192)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !165, line: 402, size: 192, elements: !710)
!710 = !{!711, !712, !713}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !709, file: !165, line: 403, baseType: !676, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !709, file: !165, line: 404, baseType: !671, size: 64, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !709, file: !165, line: 405, baseType: !671, size: 64, offset: 128)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !673, file: !165, line: 3374, baseType: !715, size: 320)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !165, line: 1384, size: 320, elements: !716)
!716 = !{!717, !718}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !715, file: !165, line: 1385, baseType: !709, size: 192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !715, file: !165, line: 1386, baseType: !719, size: 128, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !720, line: 58, baseType: !721)
!720 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !720, line: 54, size: 128, elements: !722)
!722 = !{!723, !725}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !721, file: !720, line: 56, baseType: !724, size: 64)
!724 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !721, file: !720, line: 57, baseType: !726, size: 64, offset: 64)
!726 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !673, file: !165, line: 3375, baseType: !728, size: 256)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !165, line: 1397, size: 256, elements: !729)
!729 = !{!730, !731}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !728, file: !165, line: 1398, baseType: !709, size: 192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !728, file: !165, line: 1399, baseType: !732, size: 64, offset: 192)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !734, line: 52, size: 256, elements: !735)
!734 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!735 = !{!736, !737, !738, !739, !740, !741, !742}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !733, file: !734, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !733, file: !734, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !733, file: !734, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !733, file: !734, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !733, file: !734, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !733, file: !734, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !733, file: !734, line: 62, baseType: !743, size: 192, offset: 64)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !724, size: 192, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 3)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !673, file: !165, line: 3376, baseType: !747, size: 256)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !165, line: 1408, size: 256, elements: !748)
!748 = !{!749, !750}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !747, file: !165, line: 1409, baseType: !709, size: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !747, file: !165, line: 1410, baseType: !751, size: 64, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !753, line: 27, size: 192, elements: !754)
!753 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!754 = !{!755, !756}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !752, file: !753, line: 29, baseType: !719, size: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !752, file: !753, line: 30, baseType: !20, size: 32, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !673, file: !165, line: 3377, baseType: !758, size: 256)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !165, line: 1437, size: 256, elements: !759)
!759 = !{!760, !761}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !758, file: !165, line: 1438, baseType: !709, size: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !758, file: !165, line: 1439, baseType: !671, size: 64, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !673, file: !165, line: 3378, baseType: !763, size: 256)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !165, line: 1418, size: 256, elements: !764)
!764 = !{!765, !766, !767}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !763, file: !165, line: 1419, baseType: !709, size: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !763, file: !165, line: 1420, baseType: !590, size: 32, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !763, file: !165, line: 1421, baseType: !768, size: 8, offset: 224)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !593, size: 8, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 1)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !673, file: !165, line: 3379, baseType: !772, size: 320)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !165, line: 1428, size: 320, elements: !773)
!773 = !{!774, !775, !776}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !772, file: !165, line: 1429, baseType: !709, size: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !772, file: !165, line: 1430, baseType: !671, size: 64, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !772, file: !165, line: 1431, baseType: !671, size: 64, offset: 256)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !673, file: !165, line: 3380, baseType: !778, size: 320)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !165, line: 1460, size: 320, elements: !779)
!779 = !{!780, !781}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !778, file: !165, line: 1461, baseType: !709, size: 192)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !778, file: !165, line: 1462, baseType: !782, size: 128, offset: 192)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !783, line: 31, size: 128, elements: !784)
!783 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!784 = !{!785, !788, !789}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !782, file: !783, line: 32, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !589)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !782, file: !783, line: 33, baseType: !7, size: 32, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !782, file: !783, line: 34, baseType: !7, size: 32, offset: 96)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !673, file: !165, line: 3381, baseType: !791, size: 384)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !165, line: 2507, size: 384, elements: !792)
!792 = !{!793, !794, !795, !796, !797}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !791, file: !165, line: 2508, baseType: !709, size: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !791, file: !165, line: 2509, baseType: !666, size: 32, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !791, file: !165, line: 2510, baseType: !7, size: 32, offset: 224)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !791, file: !165, line: 2511, baseType: !671, size: 64, offset: 256)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !791, file: !165, line: 2512, baseType: !671, size: 64, offset: 320)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !673, file: !165, line: 3382, baseType: !799, size: 896)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !165, line: 2652, size: 896, elements: !800)
!800 = !{!801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !799, file: !165, line: 2653, baseType: !791, size: 384)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !799, file: !165, line: 2654, baseType: !671, size: 64, offset: 384)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !799, file: !165, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !799, file: !165, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !799, file: !165, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !799, file: !165, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !799, file: !165, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !799, file: !165, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !799, file: !165, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !799, file: !165, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !799, file: !165, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !799, file: !165, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !799, file: !165, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !799, file: !165, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !799, file: !165, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !799, file: !165, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !799, file: !165, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !799, file: !165, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !799, file: !165, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !799, file: !165, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !799, file: !165, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !799, file: !165, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !799, file: !165, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !799, file: !165, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !799, file: !165, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !799, file: !165, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !799, file: !165, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !799, file: !165, line: 2703, baseType: !7, size: 32, offset: 512)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !799, file: !165, line: 2705, baseType: !671, size: 64, offset: 576)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !799, file: !165, line: 2706, baseType: !671, size: 64, offset: 640)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !799, file: !165, line: 2707, baseType: !671, size: 64, offset: 704)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !799, file: !165, line: 2708, baseType: !671, size: 64, offset: 768)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !799, file: !165, line: 2711, baseType: !834, size: 64, offset: 832)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !165, line: 2711, flags: DIFlagFwdDecl)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !673, file: !165, line: 3383, baseType: !837, size: 960)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !165, line: 2756, size: 960, elements: !838)
!838 = !{!839, !840}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !837, file: !165, line: 2757, baseType: !799, size: 896)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !837, file: !165, line: 2758, baseType: !841, size: 64, offset: 896)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !627, line: 50, baseType: !842)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !844, line: 240, size: 384, elements: !845)
!844 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!845 = !{!846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !843, file: !844, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !843, file: !844, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !843, file: !844, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !843, file: !844, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !843, file: !844, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !843, file: !844, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !843, file: !844, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !843, file: !844, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !843, file: !844, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !843, file: !844, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !843, file: !844, line: 321, baseType: !857, size: 320, offset: 64)
!857 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !844, line: 315, size: 320, elements: !858)
!858 = !{!859, !977, !979, !1008, !1009}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !857, file: !844, line: 316, baseType: !860, size: 64)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !861, size: 64, elements: !769)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !844, line: 183, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !844, line: 166, size: 64, elements: !863)
!863 = !{!864, !865, !866, !867, !868, !876, !877, !889, !892, !952, !953, !954, !967, !974}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !862, file: !844, line: 168, baseType: !590, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !862, file: !844, line: 169, baseType: !7, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !862, file: !844, line: 170, baseType: !595, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !862, file: !844, line: 171, baseType: !841, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !862, file: !844, line: 172, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !627, line: 53, baseType: !870)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !844, line: 359, size: 128, elements: !872)
!872 = !{!873, !874}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !871, file: !844, line: 360, baseType: !590, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !871, file: !844, line: 361, baseType: !875, size: 64, offset: 64)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !841, size: 64, elements: !769)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !862, file: !844, line: 173, baseType: !20, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !862, file: !844, line: 174, baseType: !878, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !844, line: 133, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !844, line: 115, size: 32, elements: !880)
!880 = !{!881, !882, !883, !884, !885, !886, !887, !888}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !879, file: !844, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !879, file: !844, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !879, file: !844, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !879, file: !844, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !879, file: !844, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !879, file: !844, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !879, file: !844, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !879, file: !844, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !862, file: !844, line: 175, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !844, line: 175, flags: DIFlagFwdDecl)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !862, file: !844, line: 176, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !895, line: 75, size: 256, elements: !896)
!895 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!896 = !{!897, !911, !912, !913}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !894, file: !895, line: 76, baseType: !898, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !895, line: 68, baseType: !900)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !895, line: 63, size: 320, elements: !901)
!901 = !{!902, !904, !905, !906}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !900, file: !895, line: 64, baseType: !903, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !900, file: !895, line: 65, baseType: !903, size: 64, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !900, file: !895, line: 66, baseType: !7, size: 32, offset: 128)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !900, file: !895, line: 67, baseType: !907, size: 128, offset: 192)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !908, size: 128, elements: !909)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !895, line: 29, baseType: !724)
!909 = !{!910}
!910 = !DISubrange(count: 2)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !894, file: !895, line: 77, baseType: !898, size: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !894, file: !895, line: 78, baseType: !7, size: 32, offset: 128)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !894, file: !895, line: 79, baseType: !914, size: 64, offset: 192)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !895, line: 49, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !895, line: 45, size: 832, elements: !917)
!917 = !{!918, !919, !920}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !916, file: !895, line: 46, baseType: !903, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !916, file: !895, line: 47, baseType: !893, size: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !916, file: !895, line: 48, baseType: !921, size: 704, offset: 128)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !922, line: 164, size: 704, elements: !923)
!922 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!923 = !{!924, !925, !935, !936, !937, !938, !939, !940, !944, !948, !949, !950, !951}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !921, file: !922, line: 166, baseType: !726, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !921, file: !922, line: 167, baseType: !926, size: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !922, line: 157, size: 192, elements: !928)
!928 = !{!929, !930, !931}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !927, file: !922, line: 159, baseType: !592, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !927, file: !922, line: 160, baseType: !926, size: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !927, file: !922, line: 161, baseType: !932, size: 32, offset: 128)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !593, size: 32, elements: !933)
!933 = !{!934}
!934 = !DISubrange(count: 4)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !921, file: !922, line: 168, baseType: !592, size: 64, offset: 128)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !921, file: !922, line: 169, baseType: !592, size: 64, offset: 192)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !921, file: !922, line: 170, baseType: !592, size: 64, offset: 256)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !921, file: !922, line: 171, baseType: !726, size: 64, offset: 320)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !921, file: !922, line: 172, baseType: !590, size: 32, offset: 384)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !921, file: !922, line: 176, baseType: !941, size: 64, offset: 448)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!926, !594, !726}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !921, file: !922, line: 177, baseType: !945, size: 64, offset: 512)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{null, !594, !926}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !921, file: !922, line: 178, baseType: !594, size: 64, offset: 576)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !921, file: !922, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !921, file: !922, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !921, file: !922, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !862, file: !844, line: 177, baseType: !671, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !862, file: !844, line: 178, baseType: !610, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !862, file: !844, line: 179, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !844, line: 150, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !844, line: 142, size: 320, elements: !958)
!958 = !{!959, !960, !961, !962, !965, !966}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !957, file: !844, line: 144, baseType: !671, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !957, file: !844, line: 145, baseType: !841, size: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !957, file: !844, line: 146, baseType: !841, size: 64, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !957, file: !844, line: 147, baseType: !963, size: 32, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !964, line: 31, baseType: !590)
!964 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!965 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !957, file: !844, line: 148, baseType: !7, size: 32, offset: 224)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !957, file: !844, line: 149, baseType: !589, size: 8, offset: 256)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !862, file: !844, line: 180, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !844, line: 162, baseType: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !844, line: 159, size: 128, elements: !971)
!971 = !{!972, !973}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !970, file: !844, line: 160, baseType: !671, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !970, file: !844, line: 161, baseType: !726, size: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !862, file: !844, line: 181, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !844, line: 181, flags: DIFlagFwdDecl)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !857, file: !844, line: 317, baseType: !978, size: 64)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !726, size: 64, elements: !769)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !857, file: !844, line: 318, baseType: !980, size: 320)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !844, line: 188, size: 320, elements: !981)
!981 = !{!982, !984, !1007}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !980, file: !844, line: 190, baseType: !983, size: 192)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !861, size: 192, elements: !744)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !980, file: !844, line: 193, baseType: !985, size: 64, offset: 192)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !844, line: 206, size: 320, elements: !987)
!987 = !{!988, !992, !993, !994, !1006}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !986, file: !844, line: 208, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !627, line: 62, baseType: !991)
!991 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !627, line: 61, flags: DIFlagFwdDecl)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !986, file: !844, line: 211, baseType: !7, size: 32, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !986, file: !844, line: 214, baseType: !726, size: 64, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !986, file: !844, line: 224, baseType: !995, size: 64, offset: 192)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !844, line: 202, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !844, line: 202, size: 128, elements: !998)
!998 = !{!999}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !997, file: !844, line: 202, baseType: !1000, size: 128)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !844, line: 200, baseType: !1001)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !844, line: 200, size: 128, elements: !1002)
!1002 = !{!1003, !1004, !1005}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1001, file: !844, line: 200, baseType: !7, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1001, file: !844, line: 200, baseType: !7, size: 32, offset: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1001, file: !844, line: 200, baseType: !875, size: 64, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !986, file: !844, line: 234, baseType: !995, size: 64, offset: 256)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !980, file: !844, line: 197, baseType: !726, size: 64, offset: 256)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !857, file: !844, line: 319, baseType: !733, size: 256)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !857, file: !844, line: 320, baseType: !752, size: 192)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !673, file: !165, line: 3384, baseType: !1011, size: 1472)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !165, line: 3114, size: 1472, elements: !1012)
!1012 = !{!1013, !1034, !1035, !1036, !1037}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1011, file: !165, line: 3115, baseType: !1014, size: 1216)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !165, line: 2984, size: 1216, elements: !1015)
!1015 = !{!1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1014, file: !165, line: 2985, baseType: !837, size: 960)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1014, file: !165, line: 2986, baseType: !671, size: 64, offset: 960)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1014, file: !165, line: 2987, baseType: !671, size: 64, offset: 1024)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1014, file: !165, line: 2988, baseType: !671, size: 64, offset: 1088)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1014, file: !165, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1014, file: !165, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1014, file: !165, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1014, file: !165, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1014, file: !165, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1014, file: !165, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1014, file: !165, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1014, file: !165, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1014, file: !165, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1014, file: !165, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1014, file: !165, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1014, file: !165, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1014, file: !165, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1014, file: !165, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1011, file: !165, line: 3117, baseType: !671, size: 64, offset: 1216)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1011, file: !165, line: 3119, baseType: !671, size: 64, offset: 1280)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1011, file: !165, line: 3121, baseType: !671, size: 64, offset: 1344)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1011, file: !165, line: 3123, baseType: !671, size: 64, offset: 1408)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !673, file: !165, line: 3385, baseType: !1039, size: 1088)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !165, line: 2874, size: 1088, elements: !1040)
!1040 = !{!1041, !1042, !1043}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1039, file: !165, line: 2875, baseType: !837, size: 960)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1039, file: !165, line: 2876, baseType: !841, size: 64, offset: 960)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1039, file: !165, line: 2877, baseType: !1044, size: 64, offset: 1024)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1046, line: 172, size: 128, elements: !1047)
!1046 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1047 = !{!1048, !1049, !1050, !1051, !1052, !1053, !1054}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1045, file: !1046, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1045, file: !1046, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1045, file: !1046, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1045, file: !1046, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1045, file: !1046, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1045, file: !1046, line: 195, baseType: !7, size: 32, offset: 32)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1045, file: !1046, line: 199, baseType: !671, size: 64, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !673, file: !165, line: 3386, baseType: !1014, size: 1216)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !673, file: !165, line: 3387, baseType: !1057, size: 1280)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !165, line: 3093, size: 1280, elements: !1058)
!1058 = !{!1059, !1060}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1057, file: !165, line: 3094, baseType: !1014, size: 1216)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1057, file: !165, line: 3095, baseType: !1044, size: 64, offset: 1216)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !673, file: !165, line: 3388, baseType: !1062, size: 1216)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !165, line: 2824, size: 1216, elements: !1063)
!1063 = !{!1064, !1065, !1066, !1067, !1068, !1069}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1062, file: !165, line: 2825, baseType: !799, size: 896)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1062, file: !165, line: 2827, baseType: !671, size: 64, offset: 896)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1062, file: !165, line: 2828, baseType: !671, size: 64, offset: 960)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1062, file: !165, line: 2829, baseType: !671, size: 64, offset: 1024)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1062, file: !165, line: 2830, baseType: !671, size: 64, offset: 1088)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1062, file: !165, line: 2831, baseType: !671, size: 64, offset: 1152)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !673, file: !165, line: 3389, baseType: !1071, size: 1024)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !165, line: 2850, size: 1024, elements: !1072)
!1072 = !{!1073, !1074, !1075}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1071, file: !165, line: 2851, baseType: !837, size: 960)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1071, file: !165, line: 2852, baseType: !590, size: 32, offset: 960)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1071, file: !165, line: 2853, baseType: !590, size: 32, offset: 992)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !673, file: !165, line: 3390, baseType: !1077, size: 1024)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !165, line: 2857, size: 1024, elements: !1078)
!1078 = !{!1079, !1080}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1077, file: !165, line: 2858, baseType: !837, size: 960)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1077, file: !165, line: 2859, baseType: !1044, size: 64, offset: 960)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !673, file: !165, line: 3391, baseType: !1082, size: 960)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !165, line: 2862, size: 960, elements: !1083)
!1083 = !{!1084}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1082, file: !165, line: 2863, baseType: !837, size: 960)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !673, file: !165, line: 3392, baseType: !1086, size: 1472)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !165, line: 3304, size: 1472, elements: !1087)
!1087 = !{!1088}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1086, file: !165, line: 3305, baseType: !1011, size: 1472)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !673, file: !165, line: 3393, baseType: !1090, size: 1792)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !165, line: 3248, size: 1792, elements: !1091)
!1091 = !{!1092, !1093, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1090, file: !165, line: 3249, baseType: !1011, size: 1472)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1090, file: !165, line: 3251, baseType: !1094, size: 64, offset: 1472)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1096, line: 463, size: 1152, elements: !1097)
!1096 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1097 = !{!1098, !1101, !1132, !1133, !1274, !1295, !1296, !1297, !1298, !1299, !1300, !1324, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1095, file: !1096, line: 464, baseType: !1099, size: 64)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1096, line: 464, flags: DIFlagFwdDecl)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1095, file: !1096, line: 467, baseType: !1102, size: 64, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !149, line: 374, size: 640, elements: !1104)
!1104 = !{!1105, !1107, !1108, !1121, !1122, !1123, !1124, !1125, !1126, !1128, !1130, !1131}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1103, file: !149, line: 377, baseType: !1106, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !627, line: 111, baseType: !610)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1103, file: !149, line: 378, baseType: !1106, size: 64, offset: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1103, file: !149, line: 381, baseType: !1109, size: 64, offset: 128)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !149, line: 282, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !149, line: 282, size: 128, elements: !1112)
!1112 = !{!1113}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1111, file: !149, line: 282, baseType: !1114, size: 128)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !149, line: 281, baseType: !1115)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !149, line: 281, size: 128, elements: !1116)
!1116 = !{!1117, !1118, !1119}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1115, file: !149, line: 281, baseType: !7, size: 32)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1115, file: !149, line: 281, baseType: !7, size: 32, offset: 32)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1115, file: !149, line: 281, baseType: !1120, size: 64, offset: 64)
!1120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1106, size: 64, elements: !769)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1103, file: !149, line: 384, baseType: !590, size: 32, offset: 192)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1103, file: !149, line: 387, baseType: !590, size: 32, offset: 224)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1103, file: !149, line: 390, baseType: !590, size: 32, offset: 256)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1103, file: !149, line: 394, baseType: !1109, size: 64, offset: 320)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1103, file: !149, line: 396, baseType: !148, size: 32, offset: 384)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1103, file: !149, line: 399, baseType: !1127, size: 64, offset: 416)
!1127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 64, elements: !909)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1103, file: !149, line: 402, baseType: !1129, size: 64, offset: 480)
!1129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !909)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1103, file: !149, line: 406, baseType: !590, size: 32, offset: 544)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1103, file: !149, line: 409, baseType: !590, size: 32, offset: 576)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1095, file: !1096, line: 470, baseType: !638, size: 64, offset: 128)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1095, file: !1096, line: 473, baseType: !1134, size: 64, offset: 192)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1046, line: 39, size: 1152, elements: !1136)
!1136 = !{!1137, !1189, !1202, !1215, !1216, !1228, !1229, !1233, !1234, !1235, !1236, !1237}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1135, file: !1046, line: 41, baseType: !1138, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1139, line: 144, baseType: !1140)
!1139 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1139, line: 100, size: 896, elements: !1142)
!1142 = !{!1143, !1151, !1156, !1161, !1163, !1166, !1167, !1168, !1169, !1170, !1175, !1177, !1178, !1183, !1188}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1141, file: !1139, line: 102, baseType: !1144, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1139, line: 52, baseType: !1145)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!1148, !1149}
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1139, line: 47, baseType: !7)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1141, file: !1139, line: 105, baseType: !1152, size: 64, offset: 64)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1139, line: 59, baseType: !1153)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!590, !1149, !1149}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1141, file: !1139, line: 108, baseType: !1157, size: 64, offset: 128)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1139, line: 63, baseType: !1158)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{null, !594}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1141, file: !1139, line: 111, baseType: !1162, size: 64, offset: 192)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1141, file: !1139, line: 114, baseType: !1164, size: 64, offset: 256)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1165, line: 46, baseType: !724)
!1165 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1141, file: !1139, line: 117, baseType: !1164, size: 64, offset: 320)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1141, file: !1139, line: 120, baseType: !1164, size: 64, offset: 384)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1141, file: !1139, line: 124, baseType: !7, size: 32, offset: 448)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1141, file: !1139, line: 128, baseType: !7, size: 32, offset: 480)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1141, file: !1139, line: 131, baseType: !1171, size: 64, offset: 512)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1139, line: 75, baseType: !1172)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = !DISubroutineType(types: !1174)
!1174 = !{!594, !1164, !1164}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1141, file: !1139, line: 132, baseType: !1176, size: 64, offset: 576)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1139, line: 78, baseType: !1158)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1141, file: !1139, line: 135, baseType: !594, size: 64, offset: 640)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1141, file: !1139, line: 136, baseType: !1179, size: 64, offset: 704)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1139, line: 82, baseType: !1180)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!594, !594, !1164, !1164}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1141, file: !1139, line: 137, baseType: !1184, size: 64, offset: 768)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1139, line: 83, baseType: !1185)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DISubroutineType(types: !1187)
!1187 = !{null, !594, !594}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1141, file: !1139, line: 141, baseType: !7, size: 32, offset: 832)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1135, file: !1046, line: 48, baseType: !1190, size: 64, offset: 64)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !640, line: 35, baseType: !1192)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !640, line: 35, size: 128, elements: !1193)
!1193 = !{!1194}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1192, file: !640, line: 35, baseType: !1195, size: 128)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !640, line: 33, baseType: !1196)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !640, line: 33, size: 128, elements: !1197)
!1197 = !{!1198, !1199, !1200}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1196, file: !640, line: 33, baseType: !7, size: 32)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1196, file: !640, line: 33, baseType: !7, size: 32, offset: 32)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1196, file: !640, line: 33, baseType: !1201, size: 64, offset: 64)
!1201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !648, size: 64, elements: !769)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1135, file: !1046, line: 51, baseType: !1203, size: 64, offset: 128)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !165, line: 183, baseType: !1205)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !165, line: 183, size: 128, elements: !1206)
!1206 = !{!1207}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1205, file: !165, line: 183, baseType: !1208, size: 128)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !165, line: 182, baseType: !1209)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !165, line: 182, size: 128, elements: !1210)
!1210 = !{!1211, !1212, !1213}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1209, file: !165, line: 182, baseType: !7, size: 32)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1209, file: !165, line: 182, baseType: !7, size: 32, offset: 32)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1209, file: !165, line: 182, baseType: !1214, size: 64, offset: 64)
!1214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !671, size: 64, elements: !769)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1135, file: !1046, line: 54, baseType: !671, size: 64, offset: 192)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1135, file: !1046, line: 57, baseType: !1217, size: 128, offset: 256)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1218, line: 31, size: 128, elements: !1219)
!1218 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1219 = !{!1220, !1221, !1222, !1223, !1224, !1225, !1226}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1217, file: !1218, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1217, file: !1218, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1217, file: !1218, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1217, file: !1218, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1217, file: !1218, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1217, file: !1218, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1217, file: !1218, line: 56, baseType: !1227, size: 64, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !627, line: 47, baseType: !893)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1135, file: !1046, line: 60, baseType: !1217, size: 128, offset: 384)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1135, file: !1046, line: 64, baseType: !1230, size: 64, offset: 512)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1232, line: 33, flags: DIFlagFwdDecl)
!1232 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1135, file: !1046, line: 67, baseType: !671, size: 64, offset: 576)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1135, file: !1046, line: 73, baseType: !1138, size: 64, offset: 640)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1135, file: !1046, line: 77, baseType: !1227, size: 64, offset: 704)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1135, file: !1046, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1135, file: !1046, line: 82, baseType: !1238, size: 320, offset: 832)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !1239, line: 62, size: 320, elements: !1240)
!1239 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1240 = !{!1241, !1247, !1248, !1249, !1250, !1257}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1238, file: !1239, line: 63, baseType: !1242, size: 64)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !1239, line: 56, size: 128, elements: !1244)
!1244 = !{!1245, !1246}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1243, file: !1239, line: 57, baseType: !1242, size: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1243, file: !1239, line: 58, baseType: !768, size: 8, offset: 64)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1238, file: !1239, line: 64, baseType: !7, size: 32, offset: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1238, file: !1239, line: 66, baseType: !7, size: 32, offset: 96)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1238, file: !1239, line: 68, baseType: !589, size: 8, offset: 128)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1238, file: !1239, line: 70, baseType: !1251, size: 64, offset: 192)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1239, line: 37, size: 128, elements: !1253)
!1253 = !{!1254, !1255}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1252, file: !1239, line: 39, baseType: !1251, size: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1252, file: !1239, line: 40, baseType: !1256, size: 64, offset: 64)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1238, file: !1239, line: 71, baseType: !1258, size: 64, offset: 256)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1239, line: 45, size: 320, elements: !1260)
!1260 = !{!1261, !1262}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1259, file: !1239, line: 47, baseType: !1258, size: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1259, file: !1239, line: 48, baseType: !1263, size: 256, offset: 64)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !165, line: 1883, size: 256, elements: !1264)
!1264 = !{!1265, !1267, !1268, !1273}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1263, file: !165, line: 1884, baseType: !1266, size: 64)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1263, file: !165, line: 1885, baseType: !1266, size: 64, offset: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1263, file: !165, line: 1891, baseType: !1269, size: 64, offset: 128)
!1269 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1263, file: !165, line: 1891, size: 64, elements: !1270)
!1270 = !{!1271, !1272}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1269, file: !165, line: 1891, baseType: !648, size: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1269, file: !165, line: 1891, baseType: !671, size: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1263, file: !165, line: 1892, baseType: !1256, size: 64, offset: 192)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1095, file: !1096, line: 476, baseType: !1275, size: 64, offset: 256)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !392, line: 187, size: 256, elements: !1277)
!1277 = !{!1278, !1279, !1293, !1294}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1276, file: !392, line: 189, baseType: !590, size: 32)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1276, file: !392, line: 192, baseType: !1280, size: 64, offset: 64)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !392, line: 87, baseType: !1282)
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !392, line: 87, size: 128, elements: !1283)
!1283 = !{!1284}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1282, file: !392, line: 87, baseType: !1285, size: 128)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !392, line: 85, baseType: !1286)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !392, line: 85, size: 128, elements: !1287)
!1287 = !{!1288, !1289, !1290}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1286, file: !392, line: 85, baseType: !7, size: 32)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1286, file: !392, line: 85, baseType: !7, size: 32, offset: 32)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1286, file: !392, line: 85, baseType: !1291, size: 64, offset: 64)
!1291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1292, size: 64, elements: !769)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !392, line: 84, baseType: !604)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1276, file: !392, line: 197, baseType: !1138, size: 64, offset: 128)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1276, file: !392, line: 200, baseType: !604, size: 64, offset: 192)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1095, file: !1096, line: 479, baseType: !1138, size: 64, offset: 320)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1095, file: !1096, line: 484, baseType: !671, size: 64, offset: 384)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1095, file: !1096, line: 488, baseType: !671, size: 64, offset: 448)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1095, file: !1096, line: 493, baseType: !671, size: 64, offset: 512)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1095, file: !1096, line: 496, baseType: !671, size: 64, offset: 576)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1095, file: !1096, line: 501, baseType: !1301, size: 64, offset: 640)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !160, line: 2355, size: 576, elements: !1303)
!1303 = !{!1304, !1307, !1308, !1309, !1310, !1312, !1313, !1318, !1319, !1320, !1321, !1322, !1323}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1302, file: !160, line: 2356, baseType: !1305, size: 64)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64)
!1306 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !160, line: 2356, flags: DIFlagFwdDecl)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1302, file: !160, line: 2357, baseType: !595, size: 64, offset: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1302, file: !160, line: 2358, baseType: !590, size: 32, offset: 128)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1302, file: !160, line: 2359, baseType: !590, size: 32, offset: 160)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1302, file: !160, line: 2360, baseType: !1311, size: 128, offset: 192)
!1311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 128, elements: !933)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1302, file: !160, line: 2364, baseType: !590, size: 32, offset: 320)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1302, file: !160, line: 2367, baseType: !1314, size: 128, offset: 384)
!1314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !160, line: 2349, size: 128, elements: !1315)
!1315 = !{!1316, !1317}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1314, file: !160, line: 2351, baseType: !841, size: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1314, file: !160, line: 2352, baseType: !726, size: 64, offset: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1302, file: !160, line: 2371, baseType: !159, size: 32, offset: 512)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1302, file: !160, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1302, file: !160, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1302, file: !160, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1302, file: !160, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1302, file: !160, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1095, file: !1096, line: 504, baseType: !1325, size: 64, offset: 704)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64)
!1326 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1096, line: 504, flags: DIFlagFwdDecl)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1095, file: !1096, line: 507, baseType: !1138, size: 64, offset: 768)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1095, file: !1096, line: 510, baseType: !590, size: 32, offset: 832)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1095, file: !1096, line: 513, baseType: !590, size: 32, offset: 864)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1095, file: !1096, line: 516, baseType: !666, size: 32, offset: 896)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1095, file: !1096, line: 519, baseType: !666, size: 32, offset: 928)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1095, file: !1096, line: 522, baseType: !7, size: 32, offset: 960)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1095, file: !1096, line: 523, baseType: !7, size: 32, offset: 992)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1095, file: !1096, line: 528, baseType: !595, size: 64, offset: 1024)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1095, file: !1096, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1095, file: !1096, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1095, file: !1096, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1095, file: !1096, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1095, file: !1096, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1095, file: !1096, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1095, file: !1096, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1095, file: !1096, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1095, file: !1096, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1095, file: !1096, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1095, file: !1096, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1095, file: !1096, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1095, file: !1096, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1095, file: !1096, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1095, file: !1096, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1095, file: !1096, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1090, file: !165, line: 3254, baseType: !671, size: 64, offset: 1536)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1090, file: !165, line: 3257, baseType: !671, size: 64, offset: 1600)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1090, file: !165, line: 3258, baseType: !671, size: 64, offset: 1664)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1090, file: !165, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1090, file: !165, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1090, file: !165, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1090, file: !165, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1090, file: !165, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1090, file: !165, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
