; ModuleID = 'tree-ssa-threadedge.bc'
source_filename = "tree-ssa-threadedge.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.VEC_tree_heap = type { %struct.VEC_tree_base }
%struct.VEC_tree_base = type { i32, i32, [1 x %union.tree_node*] }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }

!412 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!413 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!414 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!415 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!416 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!417 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!418 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!419 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!420 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!421 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!422 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!423 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!424 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!425 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!426 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!427 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!428 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!429 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!430 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!431 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!432 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!433 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!434 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!435 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!436 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !398, line: 727, baseType: !7, size: 32, elements: !437)
!437 = !{!438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461}
!438 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!439 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!440 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!441 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!442 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!443 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!444 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!445 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!446 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!447 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!448 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!449 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!450 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!451 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!452 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!453 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!454 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!455 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!456 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!457 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!458 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!459 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!460 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!461 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!462 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !398, line: 80, baseType: !7, size: 32, elements: !463)
!463 = !{!464, !465, !466, !467}
!464 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!465 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!466 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!467 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!468 = !{!469, !470, !471, !472, !475, !476, !134, !7, !478, !490, !1867, !848, !815, !1870, !473, !617, !462}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!471 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !474)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_heap", file: !135, line: 184, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_heap", file: !135, line: 184, size: 128, elements: !481)
!481 = !{!482}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !480, file: !135, line: 184, baseType: !483, size: 128)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !135, line: 182, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !135, line: 182, size: 128, elements: !485)
!485 = !{!486, !487, !488}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !484, file: !135, line: 182, baseType: !7, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !484, file: !135, line: 182, baseType: !7, size: 32, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !484, file: !135, line: 182, baseType: !489, size: 64, offset: 64)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 64, elements: !589)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !491, line: 56, baseType: !492)
!491 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !494)
!494 = !{!495, !528, !534, !547, !566, !577, !582, !591, !597, !610, !622, !660, !1203, !1231, !1248, !1249, !1254, !1263, !1269, !1274, !1278, !1282, !1518, !1565, !1571, !1577, !1584, !1597, !1611, !1628, !1640, !1662, !1677, !1849}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !493, file: !135, line: 3372, baseType: !496, size: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !497)
!497 = !{!498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !496, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !496, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !496, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !496, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !496, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !496, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !496, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !496, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !496, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !496, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !496, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !496, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !496, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !496, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !496, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !496, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !496, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !496, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !496, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !496, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !496, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !496, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !496, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !496, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !496, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !496, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !496, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !496, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !496, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !496, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !493, file: !135, line: 3373, baseType: !529, size: 192)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !530)
!530 = !{!531, !532, !533}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !529, file: !135, line: 403, baseType: !496, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !529, file: !135, line: 404, baseType: !490, size: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !529, file: !135, line: 405, baseType: !490, size: 64, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !493, file: !135, line: 3374, baseType: !535, size: 320)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !536)
!536 = !{!537, !538}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !535, file: !135, line: 1385, baseType: !529, size: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !535, file: !135, line: 1386, baseType: !539, size: 128, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !540, line: 58, baseType: !541)
!540 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !540, line: 54, size: 128, elements: !542)
!542 = !{!543, !545}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !541, file: !540, line: 56, baseType: !544, size: 64)
!544 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !541, file: !540, line: 57, baseType: !546, size: 64, offset: 64)
!546 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !493, file: !135, line: 3375, baseType: !548, size: 256)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !549)
!549 = !{!550, !551}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !548, file: !135, line: 1398, baseType: !529, size: 192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !548, file: !135, line: 1399, baseType: !552, size: 64, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !554, line: 52, size: 256, elements: !555)
!554 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!555 = !{!556, !557, !558, !559, !560, !561, !562}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !553, file: !554, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !553, file: !554, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !553, file: !554, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !553, file: !554, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !553, file: !554, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !553, file: !554, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !553, file: !554, line: 62, baseType: !563, size: 192, offset: 64)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 192, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 3)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !493, file: !135, line: 3376, baseType: !567, size: 256)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !568)
!568 = !{!569, !570}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !567, file: !135, line: 1409, baseType: !529, size: 192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !567, file: !135, line: 1410, baseType: !571, size: 64, offset: 192)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !573, line: 27, size: 192, elements: !574)
!573 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!574 = !{!575, !576}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !572, file: !573, line: 29, baseType: !539, size: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !572, file: !573, line: 30, baseType: !5, size: 32, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !493, file: !135, line: 3377, baseType: !578, size: 256)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !579)
!579 = !{!580, !581}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !578, file: !135, line: 1438, baseType: !529, size: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !578, file: !135, line: 1439, baseType: !490, size: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !493, file: !135, line: 3378, baseType: !583, size: 256)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !584)
!584 = !{!585, !586, !587}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !583, file: !135, line: 1419, baseType: !529, size: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !583, file: !135, line: 1420, baseType: !471, size: 32, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !583, file: !135, line: 1421, baseType: !588, size: 8, offset: 224)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 8, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 1)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !493, file: !135, line: 3379, baseType: !592, size: 320)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !593)
!593 = !{!594, !595, !596}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !592, file: !135, line: 1429, baseType: !529, size: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !592, file: !135, line: 1430, baseType: !490, size: 64, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !592, file: !135, line: 1431, baseType: !490, size: 64, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !493, file: !135, line: 3380, baseType: !598, size: 320)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !599)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !598, file: !135, line: 1461, baseType: !529, size: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !598, file: !135, line: 1462, baseType: !602, size: 128, offset: 192)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !603, line: 31, size: 128, elements: !604)
!603 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!604 = !{!605, !608, !609}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !602, file: !603, line: 32, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !470)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !602, file: !603, line: 33, baseType: !7, size: 32, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !602, file: !603, line: 34, baseType: !7, size: 32, offset: 96)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !493, file: !135, line: 3381, baseType: !611, size: 384)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !612)
!612 = !{!613, !614, !619, !620, !621}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !611, file: !135, line: 2508, baseType: !529, size: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !611, file: !135, line: 2509, baseType: !615, size: 32, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !616, line: 58, baseType: !617)
!616 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !618, line: 44, baseType: !7)
!618 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!619 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !611, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !611, file: !135, line: 2511, baseType: !490, size: 64, offset: 256)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !611, file: !135, line: 2512, baseType: !490, size: 64, offset: 320)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !493, file: !135, line: 3382, baseType: !623, size: 896)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !624)
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !623, file: !135, line: 2653, baseType: !611, size: 384)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !623, file: !135, line: 2654, baseType: !490, size: 64, offset: 384)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !623, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !623, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !623, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !623, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !623, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !623, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !623, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !623, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !623, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !623, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !623, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !623, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !623, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !623, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !623, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !623, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !623, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !623, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !623, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !623, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !623, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !623, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !623, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !623, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !623, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !623, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !623, file: !135, line: 2705, baseType: !490, size: 64, offset: 576)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !623, file: !135, line: 2706, baseType: !490, size: 64, offset: 640)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !623, file: !135, line: 2707, baseType: !490, size: 64, offset: 704)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !623, file: !135, line: 2708, baseType: !490, size: 64, offset: 768)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !623, file: !135, line: 2711, baseType: !658, size: 64, offset: 832)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !493, file: !135, line: 3383, baseType: !661, size: 960)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !662)
!662 = !{!663, !664}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !661, file: !135, line: 2757, baseType: !623, size: 896)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !661, file: !135, line: 2758, baseType: !665, size: 64, offset: 896)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !491, line: 50, baseType: !666)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !668, line: 240, size: 384, elements: !669)
!668 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!669 = !{!670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !667, file: !668, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !667, file: !668, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !667, file: !668, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !667, file: !668, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !667, file: !668, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !667, file: !668, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !667, file: !668, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !667, file: !668, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !667, file: !668, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !667, file: !668, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !667, file: !668, line: 321, baseType: !681, size: 320, offset: 64)
!681 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !668, line: 315, size: 320, elements: !682)
!682 = !{!683, !1136, !1138, !1201, !1202}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !681, file: !668, line: 316, baseType: !684, size: 64)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !685, size: 64, elements: !589)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !668, line: 183, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !668, line: 166, size: 64, elements: !687)
!687 = !{!688, !689, !690, !691, !692, !700, !701, !713, !716, !776, !777, !1113, !1126, !1133}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !686, file: !668, line: 168, baseType: !471, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !686, file: !668, line: 169, baseType: !7, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !686, file: !668, line: 170, baseType: !476, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !686, file: !668, line: 171, baseType: !665, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !686, file: !668, line: 172, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !491, line: 53, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !668, line: 359, size: 128, elements: !696)
!696 = !{!697, !698}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !695, file: !668, line: 360, baseType: !471, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !695, file: !668, line: 361, baseType: !699, size: 64, offset: 64)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 64, elements: !589)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !686, file: !668, line: 173, baseType: !5, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !686, file: !668, line: 174, baseType: !702, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !668, line: 133, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !668, line: 115, size: 32, elements: !704)
!704 = !{!705, !706, !707, !708, !709, !710, !711, !712}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !703, file: !668, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !703, file: !668, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !703, file: !668, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !703, file: !668, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !703, file: !668, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !703, file: !668, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !703, file: !668, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !703, file: !668, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !686, file: !668, line: 175, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !668, line: 175, flags: DIFlagFwdDecl)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !686, file: !668, line: 176, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !719, line: 75, size: 256, elements: !720)
!719 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!720 = !{!721, !735, !736, !737}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !718, file: !719, line: 76, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !719, line: 68, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !719, line: 63, size: 320, elements: !725)
!725 = !{!726, !728, !729, !730}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !724, file: !719, line: 64, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !724, file: !719, line: 65, baseType: !727, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !724, file: !719, line: 66, baseType: !7, size: 32, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !724, file: !719, line: 67, baseType: !731, size: 128, offset: 192)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !732, size: 128, elements: !733)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !719, line: 29, baseType: !544)
!733 = !{!734}
!734 = !DISubrange(count: 2)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !718, file: !719, line: 77, baseType: !722, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !718, file: !719, line: 78, baseType: !7, size: 32, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !718, file: !719, line: 79, baseType: !738, size: 64, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !719, line: 49, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !719, line: 45, size: 832, elements: !741)
!741 = !{!742, !743, !744}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !740, file: !719, line: 46, baseType: !727, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !740, file: !719, line: 47, baseType: !717, size: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !740, file: !719, line: 48, baseType: !745, size: 704, offset: 128)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !746, line: 164, size: 704, elements: !747)
!746 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!747 = !{!748, !749, !759, !760, !761, !762, !763, !764, !768, !772, !773, !774, !775}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !745, file: !746, line: 166, baseType: !546, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !745, file: !746, line: 167, baseType: !750, size: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !746, line: 157, size: 192, elements: !752)
!752 = !{!753, !754, !755}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !751, file: !746, line: 159, baseType: !473, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !751, file: !746, line: 160, baseType: !750, size: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !751, file: !746, line: 161, baseType: !756, size: 32, offset: 128)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 32, elements: !757)
!757 = !{!758}
!758 = !DISubrange(count: 4)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !745, file: !746, line: 168, baseType: !473, size: 64, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !745, file: !746, line: 169, baseType: !473, size: 64, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !745, file: !746, line: 170, baseType: !473, size: 64, offset: 256)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !745, file: !746, line: 171, baseType: !546, size: 64, offset: 320)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !745, file: !746, line: 172, baseType: !471, size: 32, offset: 384)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !745, file: !746, line: 176, baseType: !765, size: 64, offset: 448)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!750, !475, !546}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !745, file: !746, line: 177, baseType: !769, size: 64, offset: 512)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{null, !475, !750}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !745, file: !746, line: 178, baseType: !475, size: 64, offset: 576)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !745, file: !746, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !745, file: !746, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !745, file: !746, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !686, file: !668, line: 177, baseType: !490, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !686, file: !668, line: 178, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !343, line: 217, size: 832, elements: !780)
!780 = !{!781, !1025, !1026, !1027, !1083, !1087, !1088, !1089, !1107, !1108, !1109, !1110, !1111, !1112}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !779, file: !343, line: 219, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !343, line: 151, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !343, line: 151, size: 128, elements: !785)
!785 = !{!786}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !784, file: !343, line: 151, baseType: !787, size: 128)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !343, line: 150, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !343, line: 150, size: 128, elements: !789)
!789 = !{!790, !791, !792}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !788, file: !343, line: 150, baseType: !7, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !788, file: !343, line: 150, baseType: !7, size: 32, offset: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !788, file: !343, line: 150, baseType: !793, size: 64, offset: 64)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 64, elements: !589)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !491, line: 108, baseType: !795)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !343, line: 122, size: 512, elements: !797)
!797 = !{!798, !799, !800, !1017, !1018, !1019, !1020, !1021, !1022, !1023}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !796, file: !343, line: 124, baseType: !778, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !796, file: !343, line: 125, baseType: !778, size: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !796, file: !343, line: 131, baseType: !801, size: 64, offset: 128)
!801 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !343, line: 128, size: 64, elements: !802)
!802 = !{!803, !1016}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !801, file: !343, line: 129, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !491, line: 66, baseType: !805)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !398, line: 143, size: 192, elements: !807)
!807 = !{!808, !1014, !1015}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !806, file: !398, line: 145, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !491, line: 69, baseType: !810)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !398, line: 136, size: 192, elements: !812)
!812 = !{!813, !1012, !1013}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !811, file: !398, line: 137, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !491, line: 58, baseType: !815)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !398, line: 737, size: 768, elements: !817)
!817 = !{!818, !835, !867, !873, !878, !883, !890, !896, !902, !907, !921, !926, !932, !937, !947, !952, !970, !977, !984, !990, !995, !1001, !1007}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !816, file: !398, line: 738, baseType: !819, size: 256)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !398, line: 271, size: 256, elements: !820)
!820 = !{!821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !819, file: !398, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !819, file: !398, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !819, file: !398, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !819, file: !398, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !819, file: !398, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !819, file: !398, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !819, file: !398, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !819, file: !398, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !819, file: !398, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !819, file: !398, line: 312, baseType: !7, size: 32, offset: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !819, file: !398, line: 316, baseType: !615, size: 32, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !819, file: !398, line: 319, baseType: !7, size: 32, offset: 96)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !819, file: !398, line: 323, baseType: !778, size: 64, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !819, file: !398, line: 327, baseType: !490, size: 64, offset: 192)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !816, file: !398, line: 739, baseType: !836, size: 448)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !398, line: 350, size: 448, elements: !837)
!837 = !{!838, !866}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !836, file: !398, line: 353, baseType: !839, size: 384)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !398, line: 333, size: 384, elements: !840)
!840 = !{!841, !842, !849}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !839, file: !398, line: 336, baseType: !819, size: 256)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !839, file: !398, line: 343, baseType: !843, size: 64, offset: 256)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !391, line: 37, size: 128, elements: !845)
!845 = !{!846, !847}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !844, file: !391, line: 39, baseType: !843, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !844, file: !391, line: 40, baseType: !848, size: 64, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !839, file: !398, line: 344, baseType: !850, size: 64, offset: 320)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !391, line: 45, size: 320, elements: !852)
!852 = !{!853, !854}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !851, file: !391, line: 47, baseType: !850, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !851, file: !391, line: 48, baseType: !855, size: 256, offset: 64)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !856)
!856 = !{!857, !859, !860, !865}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !855, file: !135, line: 1884, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !855, file: !135, line: 1885, baseType: !858, size: 64, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !855, file: !135, line: 1891, baseType: !861, size: 64, offset: 128)
!861 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !855, file: !135, line: 1891, size: 64, elements: !862)
!862 = !{!863, !864}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !861, file: !135, line: 1891, baseType: !814, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !861, file: !135, line: 1891, baseType: !490, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !855, file: !135, line: 1892, baseType: !848, size: 64, offset: 192)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !836, file: !398, line: 359, baseType: !489, size: 64, offset: 384)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !816, file: !398, line: 740, baseType: !868, size: 512)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !398, line: 365, size: 512, elements: !869)
!869 = !{!870, !871, !872}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !868, file: !398, line: 368, baseType: !839, size: 384)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !868, file: !398, line: 373, baseType: !490, size: 64, offset: 384)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !868, file: !398, line: 374, baseType: !490, size: 64, offset: 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !816, file: !398, line: 741, baseType: !874, size: 576)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !398, line: 380, size: 576, elements: !875)
!875 = !{!876, !877}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !874, file: !398, line: 383, baseType: !868, size: 512)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !874, file: !398, line: 389, baseType: !489, size: 64, offset: 512)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !816, file: !398, line: 742, baseType: !879, size: 320)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !398, line: 395, size: 320, elements: !880)
!880 = !{!881, !882}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !879, file: !398, line: 397, baseType: !819, size: 256)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !879, file: !398, line: 400, baseType: !804, size: 64, offset: 256)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !816, file: !398, line: 743, baseType: !884, size: 448)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !398, line: 406, size: 448, elements: !885)
!885 = !{!886, !887, !888, !889}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !884, file: !398, line: 408, baseType: !819, size: 256)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !884, file: !398, line: 412, baseType: !490, size: 64, offset: 256)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !884, file: !398, line: 420, baseType: !490, size: 64, offset: 320)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !884, file: !398, line: 423, baseType: !804, size: 64, offset: 384)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !816, file: !398, line: 744, baseType: !891, size: 384)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !398, line: 429, size: 384, elements: !892)
!892 = !{!893, !894, !895}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !891, file: !398, line: 431, baseType: !819, size: 256)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !891, file: !398, line: 434, baseType: !490, size: 64, offset: 256)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !891, file: !398, line: 437, baseType: !804, size: 64, offset: 320)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !816, file: !398, line: 745, baseType: !897, size: 384)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !398, line: 443, size: 384, elements: !898)
!898 = !{!899, !900, !901}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !897, file: !398, line: 445, baseType: !819, size: 256)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !897, file: !398, line: 449, baseType: !490, size: 64, offset: 256)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !897, file: !398, line: 453, baseType: !804, size: 64, offset: 320)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !816, file: !398, line: 746, baseType: !903, size: 320)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !398, line: 459, size: 320, elements: !904)
!904 = !{!905, !906}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !903, file: !398, line: 461, baseType: !819, size: 256)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !903, file: !398, line: 464, baseType: !490, size: 64, offset: 256)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !816, file: !398, line: 747, baseType: !908, size: 768)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !398, line: 469, size: 768, elements: !909)
!909 = !{!910, !911, !912, !913, !914}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !908, file: !398, line: 471, baseType: !819, size: 256)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !908, file: !398, line: 474, baseType: !7, size: 32, offset: 256)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !908, file: !398, line: 475, baseType: !7, size: 32, offset: 288)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !908, file: !398, line: 478, baseType: !490, size: 64, offset: 320)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !908, file: !398, line: 481, baseType: !915, size: 384, offset: 384)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !916, size: 384, elements: !589)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !917)
!917 = !{!918, !919, !920}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !916, file: !135, line: 1920, baseType: !855, size: 256)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !916, file: !135, line: 1921, baseType: !490, size: 64, offset: 256)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !916, file: !135, line: 1922, baseType: !615, size: 32, offset: 320)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !816, file: !398, line: 748, baseType: !922, size: 320)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !398, line: 487, size: 320, elements: !923)
!923 = !{!924, !925}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !922, file: !398, line: 490, baseType: !819, size: 256)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !922, file: !398, line: 494, baseType: !471, size: 32, offset: 256)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !816, file: !398, line: 749, baseType: !927, size: 384)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !398, line: 500, size: 384, elements: !928)
!928 = !{!929, !930, !931}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !927, file: !398, line: 502, baseType: !819, size: 256)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !927, file: !398, line: 506, baseType: !804, size: 64, offset: 256)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !927, file: !398, line: 510, baseType: !804, size: 64, offset: 320)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !816, file: !398, line: 750, baseType: !933, size: 320)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !398, line: 529, size: 320, elements: !934)
!934 = !{!935, !936}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !933, file: !398, line: 531, baseType: !819, size: 256)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !933, file: !398, line: 540, baseType: !804, size: 64, offset: 256)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !816, file: !398, line: 751, baseType: !938, size: 704)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !398, line: 546, size: 704, elements: !939)
!939 = !{!940, !941, !942, !943, !944, !945, !946}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !938, file: !398, line: 549, baseType: !868, size: 512)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !938, file: !398, line: 553, baseType: !476, size: 64, offset: 512)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !938, file: !398, line: 557, baseType: !470, size: 8, offset: 576)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !938, file: !398, line: 558, baseType: !470, size: 8, offset: 584)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !938, file: !398, line: 559, baseType: !470, size: 8, offset: 592)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !938, file: !398, line: 560, baseType: !470, size: 8, offset: 600)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !938, file: !398, line: 566, baseType: !489, size: 64, offset: 640)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !816, file: !398, line: 752, baseType: !948, size: 384)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !398, line: 571, size: 384, elements: !949)
!949 = !{!950, !951}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !948, file: !398, line: 573, baseType: !879, size: 320)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !948, file: !398, line: 577, baseType: !490, size: 64, offset: 320)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !816, file: !398, line: 753, baseType: !953, size: 576)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !398, line: 600, size: 576, elements: !954)
!954 = !{!955, !956, !957, !960, !969}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !953, file: !398, line: 602, baseType: !879, size: 320)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !953, file: !398, line: 605, baseType: !490, size: 64, offset: 320)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !953, file: !398, line: 609, baseType: !958, size: 64, offset: 384)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !959, line: 46, baseType: !544)
!959 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!960 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !953, file: !398, line: 612, baseType: !961, size: 64, offset: 448)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !398, line: 581, size: 320, elements: !963)
!963 = !{!964, !965, !966, !967, !968}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !962, file: !398, line: 583, baseType: !134, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !962, file: !398, line: 586, baseType: !490, size: 64, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !962, file: !398, line: 589, baseType: !490, size: 64, offset: 128)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !962, file: !398, line: 592, baseType: !490, size: 64, offset: 192)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !962, file: !398, line: 595, baseType: !490, size: 64, offset: 256)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !953, file: !398, line: 616, baseType: !804, size: 64, offset: 512)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !816, file: !398, line: 754, baseType: !971, size: 512)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !398, line: 622, size: 512, elements: !972)
!972 = !{!973, !974, !975, !976}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !971, file: !398, line: 624, baseType: !879, size: 320)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !971, file: !398, line: 628, baseType: !490, size: 64, offset: 320)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !971, file: !398, line: 632, baseType: !490, size: 64, offset: 384)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !971, file: !398, line: 636, baseType: !490, size: 64, offset: 448)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !816, file: !398, line: 755, baseType: !978, size: 704)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !398, line: 642, size: 704, elements: !979)
!979 = !{!980, !981, !982, !983}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !978, file: !398, line: 644, baseType: !971, size: 512)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !978, file: !398, line: 648, baseType: !490, size: 64, offset: 512)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !978, file: !398, line: 652, baseType: !490, size: 64, offset: 576)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !978, file: !398, line: 653, baseType: !490, size: 64, offset: 640)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !816, file: !398, line: 756, baseType: !985, size: 448)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !398, line: 663, size: 448, elements: !986)
!986 = !{!987, !988, !989}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !985, file: !398, line: 665, baseType: !879, size: 320)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !985, file: !398, line: 668, baseType: !490, size: 64, offset: 320)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !985, file: !398, line: 673, baseType: !490, size: 64, offset: 384)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !816, file: !398, line: 757, baseType: !991, size: 384)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !398, line: 694, size: 384, elements: !992)
!992 = !{!993, !994}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !991, file: !398, line: 696, baseType: !879, size: 320)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !991, file: !398, line: 699, baseType: !490, size: 64, offset: 320)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !816, file: !398, line: 758, baseType: !996, size: 384)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !398, line: 681, size: 384, elements: !997)
!997 = !{!998, !999, !1000}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !996, file: !398, line: 683, baseType: !819, size: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !996, file: !398, line: 686, baseType: !490, size: 64, offset: 256)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !996, file: !398, line: 689, baseType: !490, size: 64, offset: 320)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !816, file: !398, line: 759, baseType: !1002, size: 384)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !398, line: 707, size: 384, elements: !1003)
!1003 = !{!1004, !1005, !1006}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1002, file: !398, line: 709, baseType: !819, size: 256)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1002, file: !398, line: 712, baseType: !490, size: 64, offset: 256)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1002, file: !398, line: 712, baseType: !490, size: 64, offset: 320)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !816, file: !398, line: 760, baseType: !1008, size: 320)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !398, line: 718, size: 320, elements: !1009)
!1009 = !{!1010, !1011}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1008, file: !398, line: 720, baseType: !819, size: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1008, file: !398, line: 723, baseType: !490, size: 64, offset: 256)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !811, file: !398, line: 138, baseType: !810, size: 64, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !811, file: !398, line: 139, baseType: !810, size: 64, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !806, file: !398, line: 146, baseType: !809, size: 64, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !806, file: !398, line: 152, baseType: !804, size: 64, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !801, file: !343, line: 130, baseType: !665, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !796, file: !343, line: 134, baseType: !475, size: 64, offset: 192)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !796, file: !343, line: 137, baseType: !490, size: 64, offset: 256)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !796, file: !343, line: 138, baseType: !615, size: 32, offset: 320)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !796, file: !343, line: 142, baseType: !7, size: 32, offset: 352)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !796, file: !343, line: 144, baseType: !471, size: 32, offset: 384)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !796, file: !343, line: 145, baseType: !471, size: 32, offset: 416)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !796, file: !343, line: 146, baseType: !1024, size: 64, offset: 448)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !343, line: 119, baseType: !546)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !779, file: !343, line: 220, baseType: !782, size: 64, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !779, file: !343, line: 223, baseType: !475, size: 64, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !779, file: !343, line: 226, baseType: !1028, size: 64, offset: 192)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 100, size: 1216, elements: !1030)
!1030 = !{!1031, !1032, !1033, !1034, !1035, !1040, !1041, !1042, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1073, !1081, !1082}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1029, file: !330, line: 102, baseType: !471, size: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1029, file: !330, line: 105, baseType: !7, size: 32, offset: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1029, file: !330, line: 108, baseType: !778, size: 64, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1029, file: !330, line: 111, baseType: !778, size: 64, offset: 128)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1029, file: !330, line: 114, baseType: !1036, size: 64, offset: 192)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !330, line: 41, size: 64, elements: !1037)
!1037 = !{!1038, !1039}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1036, file: !330, line: 42, baseType: !329, size: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1036, file: !330, line: 43, baseType: !7, size: 32, offset: 32)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1029, file: !330, line: 117, baseType: !7, size: 32, offset: 256)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1029, file: !330, line: 120, baseType: !7, size: 32, offset: 288)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1029, file: !330, line: 123, baseType: !1043, size: 64, offset: 320)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !330, line: 87, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !330, line: 87, size: 128, elements: !1046)
!1046 = !{!1047}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1045, file: !330, line: 87, baseType: !1048, size: 128)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !330, line: 85, baseType: !1049)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !330, line: 85, size: 128, elements: !1050)
!1050 = !{!1051, !1052, !1053}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1049, file: !330, line: 85, baseType: !7, size: 32)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1049, file: !330, line: 85, baseType: !7, size: 32, offset: 32)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1049, file: !330, line: 85, baseType: !1054, size: 64, offset: 64)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1055, size: 64, elements: !589)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !330, line: 84, baseType: !1028)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1029, file: !330, line: 126, baseType: !1028, size: 64, offset: 384)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1029, file: !330, line: 129, baseType: !1028, size: 64, offset: 448)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1029, file: !330, line: 132, baseType: !475, size: 64, offset: 512)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1029, file: !330, line: 139, baseType: !490, size: 64, offset: 576)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1029, file: !330, line: 143, baseType: !539, size: 128, offset: 640)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1029, file: !330, line: 146, baseType: !539, size: 128, offset: 768)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1029, file: !330, line: 148, baseType: !470, size: 8, offset: 896)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1029, file: !330, line: 149, baseType: !470, size: 8, offset: 904)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1029, file: !330, line: 153, baseType: !338, size: 32, offset: 928)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1029, file: !330, line: 156, baseType: !1066, size: 64, offset: 960)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !330, line: 48, size: 320, elements: !1068)
!1068 = !{!1069, !1070, !1071, !1072}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1067, file: !330, line: 50, baseType: !814, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1067, file: !330, line: 59, baseType: !539, size: 128, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1067, file: !330, line: 64, baseType: !470, size: 8, offset: 192)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1067, file: !330, line: 67, baseType: !1066, size: 64, offset: 256)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1029, file: !330, line: 159, baseType: !1074, size: 64, offset: 1024)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !330, line: 72, size: 256, elements: !1076)
!1076 = !{!1077, !1078, !1079, !1080}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1075, file: !330, line: 74, baseType: !795, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1075, file: !330, line: 77, baseType: !1074, size: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1075, file: !330, line: 78, baseType: !1074, size: 64, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1075, file: !330, line: 81, baseType: !1074, size: 64, offset: 192)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1029, file: !330, line: 162, baseType: !470, size: 8, offset: 1088)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1029, file: !330, line: 166, baseType: !490, size: 64, offset: 1152)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !779, file: !343, line: 229, baseType: !1084, size: 128, offset: 256)
!1084 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1085, size: 128, elements: !733)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !343, line: 229, flags: DIFlagFwdDecl)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !779, file: !343, line: 232, baseType: !778, size: 64, offset: 384)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !779, file: !343, line: 233, baseType: !778, size: 64, offset: 448)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !779, file: !343, line: 238, baseType: !1090, size: 64, offset: 512)
!1090 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !343, line: 235, size: 64, elements: !1091)
!1091 = !{!1092, !1098}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1090, file: !343, line: 236, baseType: !1093, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !343, line: 273, size: 128, elements: !1095)
!1095 = !{!1096, !1097}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1094, file: !343, line: 275, baseType: !804, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1094, file: !343, line: 278, baseType: !804, size: 64, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1090, file: !343, line: 237, baseType: !1099, size: 64)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !343, line: 259, size: 320, elements: !1101)
!1101 = !{!1102, !1103, !1104, !1105, !1106}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1100, file: !343, line: 261, baseType: !665, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1100, file: !343, line: 262, baseType: !665, size: 64, offset: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1100, file: !343, line: 266, baseType: !665, size: 64, offset: 128)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1100, file: !343, line: 267, baseType: !665, size: 64, offset: 192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1100, file: !343, line: 270, baseType: !471, size: 32, offset: 256)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !779, file: !343, line: 241, baseType: !1024, size: 64, offset: 576)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !779, file: !343, line: 244, baseType: !471, size: 32, offset: 640)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !779, file: !343, line: 247, baseType: !471, size: 32, offset: 672)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !779, file: !343, line: 250, baseType: !471, size: 32, offset: 704)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !779, file: !343, line: 253, baseType: !471, size: 32, offset: 736)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !779, file: !343, line: 256, baseType: !471, size: 32, offset: 768)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !686, file: !668, line: 179, baseType: !1114, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !668, line: 150, baseType: !1116)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !668, line: 142, size: 320, elements: !1117)
!1117 = !{!1118, !1119, !1120, !1121, !1124, !1125}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1116, file: !668, line: 144, baseType: !490, size: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1116, file: !668, line: 145, baseType: !665, size: 64, offset: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1116, file: !668, line: 146, baseType: !665, size: 64, offset: 128)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1116, file: !668, line: 147, baseType: !1122, size: 32, offset: 192)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1123, line: 31, baseType: !471)
!1123 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1116, file: !668, line: 148, baseType: !7, size: 32, offset: 224)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1116, file: !668, line: 149, baseType: !470, size: 8, offset: 256)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !686, file: !668, line: 180, baseType: !1127, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !668, line: 162, baseType: !1129)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !668, line: 159, size: 128, elements: !1130)
!1130 = !{!1131, !1132}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1129, file: !668, line: 160, baseType: !490, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1129, file: !668, line: 161, baseType: !546, size: 64, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !686, file: !668, line: 181, baseType: !1134, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !668, line: 181, flags: DIFlagFwdDecl)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !681, file: !668, line: 317, baseType: !1137, size: 64)
!1137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 64, elements: !589)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !681, file: !668, line: 318, baseType: !1139, size: 320)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !668, line: 188, size: 320, elements: !1140)
!1140 = !{!1141, !1143, !1200}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1139, file: !668, line: 190, baseType: !1142, size: 192)
!1142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !685, size: 192, elements: !564)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1139, file: !668, line: 193, baseType: !1144, size: 64, offset: 192)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !668, line: 206, size: 320, elements: !1146)
!1146 = !{!1147, !1185, !1186, !1187, !1199}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1145, file: !668, line: 208, baseType: !1148, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !491, line: 62, baseType: !1150)
!1150 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1151, line: 538, size: 256, elements: !1152)
!1151 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1152 = !{!1153, !1157, !1163, !1176}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1150, file: !1151, line: 539, baseType: !1154, size: 32)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1151, line: 482, size: 32, elements: !1155)
!1155 = !{!1156}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1154, file: !1151, line: 484, baseType: !7, size: 32)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1150, file: !1151, line: 540, baseType: !1158, size: 192)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1151, line: 488, size: 192, elements: !1159)
!1159 = !{!1160, !1161, !1162}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1158, file: !1151, line: 489, baseType: !1154, size: 32)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1158, file: !1151, line: 492, baseType: !476, size: 64, offset: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1158, file: !1151, line: 496, baseType: !490, size: 64, offset: 128)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1150, file: !1151, line: 541, baseType: !1164, size: 256)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1151, line: 504, size: 256, elements: !1165)
!1165 = !{!1166, !1167, !1174, !1175}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1164, file: !1151, line: 505, baseType: !1154, size: 32)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1164, file: !1151, line: 509, baseType: !1168, size: 64, offset: 64)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1151, line: 501, baseType: !1169)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{null, !1172}
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1164, file: !1151, line: 510, baseType: !1172, size: 64, offset: 128)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1164, file: !1151, line: 513, baseType: !1148, size: 64, offset: 192)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1150, file: !1151, line: 542, baseType: !1177, size: 128)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1151, line: 530, size: 128, elements: !1178)
!1178 = !{!1179, !1180}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1177, file: !1151, line: 531, baseType: !1154, size: 32)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1177, file: !1151, line: 534, baseType: !1181, size: 64, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1151, line: 525, baseType: !1182)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{!470, !490, !476, !544, !544}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1145, file: !668, line: 211, baseType: !7, size: 32, offset: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1145, file: !668, line: 214, baseType: !546, size: 64, offset: 128)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1145, file: !668, line: 224, baseType: !1188, size: 64, offset: 192)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !668, line: 202, baseType: !1190)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !668, line: 202, size: 128, elements: !1191)
!1191 = !{!1192}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1190, file: !668, line: 202, baseType: !1193, size: 128)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !668, line: 200, baseType: !1194)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !668, line: 200, size: 128, elements: !1195)
!1195 = !{!1196, !1197, !1198}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1194, file: !668, line: 200, baseType: !7, size: 32)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1194, file: !668, line: 200, baseType: !7, size: 32, offset: 32)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1194, file: !668, line: 200, baseType: !699, size: 64, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1145, file: !668, line: 234, baseType: !1188, size: 64, offset: 256)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1139, file: !668, line: 197, baseType: !546, size: 64, offset: 256)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !681, file: !668, line: 319, baseType: !553, size: 256)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !681, file: !668, line: 320, baseType: !572, size: 192)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !493, file: !135, line: 3384, baseType: !1204, size: 1472)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1205)
!1205 = !{!1206, !1227, !1228, !1229, !1230}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1204, file: !135, line: 3115, baseType: !1207, size: 1216)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1208)
!1208 = !{!1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1207, file: !135, line: 2985, baseType: !661, size: 960)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1207, file: !135, line: 2986, baseType: !490, size: 64, offset: 960)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1207, file: !135, line: 2987, baseType: !490, size: 64, offset: 1024)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1207, file: !135, line: 2988, baseType: !490, size: 64, offset: 1088)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1207, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1207, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1207, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1207, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1207, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1207, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1207, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1207, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1207, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1207, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1207, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1207, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1207, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1207, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1204, file: !135, line: 3117, baseType: !490, size: 64, offset: 1216)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1204, file: !135, line: 3119, baseType: !490, size: 64, offset: 1280)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1204, file: !135, line: 3121, baseType: !490, size: 64, offset: 1344)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1204, file: !135, line: 3123, baseType: !490, size: 64, offset: 1408)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !493, file: !135, line: 3385, baseType: !1232, size: 1088)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1233)
!1233 = !{!1234, !1235, !1236}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1232, file: !135, line: 2875, baseType: !661, size: 960)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1232, file: !135, line: 2876, baseType: !665, size: 64, offset: 960)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1232, file: !135, line: 2877, baseType: !1237, size: 64, offset: 1024)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1239, line: 172, size: 128, elements: !1240)
!1239 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1240 = !{!1241, !1242, !1243, !1244, !1245, !1246, !1247}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1238, file: !1239, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1238, file: !1239, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1238, file: !1239, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1238, file: !1239, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1238, file: !1239, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1238, file: !1239, line: 195, baseType: !7, size: 32, offset: 32)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1238, file: !1239, line: 199, baseType: !490, size: 64, offset: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !493, file: !135, line: 3386, baseType: !1207, size: 1216)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !493, file: !135, line: 3387, baseType: !1250, size: 1280)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1251)
!1251 = !{!1252, !1253}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1250, file: !135, line: 3094, baseType: !1207, size: 1216)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1250, file: !135, line: 3095, baseType: !1237, size: 64, offset: 1216)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !493, file: !135, line: 3388, baseType: !1255, size: 1216)
!1255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1256)
!1256 = !{!1257, !1258, !1259, !1260, !1261, !1262}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1255, file: !135, line: 2825, baseType: !623, size: 896)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1255, file: !135, line: 2827, baseType: !490, size: 64, offset: 896)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1255, file: !135, line: 2828, baseType: !490, size: 64, offset: 960)
