; ModuleID = 'tree-ssa-uncprop.bc'
source_filename = "tree-ssa-uncprop.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.htab = type { i32 (i8*)*, i32 (i8*, i8*)*, void (i8*)*, i8**, i64, i64, i64, i32, i32, i8* (i64, i64)*, void (i8*)*, i8*, i8* (i8*, i64, i64)*, void (i8*, i8*)*, i32 }
%struct.VEC_tree_heap = type { %struct.VEC_tree_base }
%struct.VEC_tree_base = type { i32, i32, [1 x %union.tree_node*] }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }

!601 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!602 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!603 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!604 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!605 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!606 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!607 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!608 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!609 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!610 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!611 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!612 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!613 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!614 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!615 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!616 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!617 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!618 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!619 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!620 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!621 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !583, line: 727, baseType: !7, size: 32, elements: !622)
!622 = !{!623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646}
!623 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!624 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!625 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!626 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!627 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!628 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!629 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!630 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!631 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!632 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!633 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!634 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!635 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!636 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!637 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!638 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!639 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!640 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!641 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!642 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!643 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!644 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!645 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!646 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!647 = !{!648, !649, !650, !651, !654, !655, !366, !657, !560, !189, !1020, !788, !986, !1989, !661, !652, !1991, !2002, !1997, !7}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!650 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !653)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_equivalency", file: !3, line: 47, size: 128, elements: !659)
!659 = !{!660, !1988}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !658, file: !3, line: 49, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !662, line: 56, baseType: !663)
!662 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !334, line: 3371, size: 1792, elements: !665)
!665 = !{!666, !699, !705, !718, !737, !748, !753, !762, !768, !781, !793, !831, !1323, !1351, !1368, !1369, !1374, !1383, !1389, !1394, !1398, !1402, !1639, !1686, !1692, !1698, !1705, !1718, !1732, !1749, !1761, !1783, !1798, !1970}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !664, file: !334, line: 3372, baseType: !667, size: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !334, line: 360, size: 64, elements: !668)
!668 = !{!669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !667, file: !334, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !667, file: !334, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !667, file: !334, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !667, file: !334, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !667, file: !334, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !667, file: !334, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !667, file: !334, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !667, file: !334, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !667, file: !334, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !667, file: !334, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !667, file: !334, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !667, file: !334, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !667, file: !334, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !667, file: !334, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !667, file: !334, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !667, file: !334, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !667, file: !334, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !667, file: !334, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !667, file: !334, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !667, file: !334, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !667, file: !334, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !667, file: !334, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !667, file: !334, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !667, file: !334, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !667, file: !334, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !667, file: !334, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !667, file: !334, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !667, file: !334, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !667, file: !334, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !667, file: !334, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !664, file: !334, line: 3373, baseType: !700, size: 192)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !334, line: 402, size: 192, elements: !701)
!701 = !{!702, !703, !704}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !700, file: !334, line: 403, baseType: !667, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !700, file: !334, line: 404, baseType: !661, size: 64, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !700, file: !334, line: 405, baseType: !661, size: 64, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !664, file: !334, line: 3374, baseType: !706, size: 320)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !334, line: 1384, size: 320, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !706, file: !334, line: 1385, baseType: !700, size: 192)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !706, file: !334, line: 1386, baseType: !710, size: 128, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !711, line: 58, baseType: !712)
!711 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !711, line: 54, size: 128, elements: !713)
!713 = !{!714, !716}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !712, file: !711, line: 56, baseType: !715, size: 64)
!715 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !712, file: !711, line: 57, baseType: !717, size: 64, offset: 64)
!717 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !664, file: !334, line: 3375, baseType: !719, size: 256)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !334, line: 1397, size: 256, elements: !720)
!720 = !{!721, !722}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !719, file: !334, line: 1398, baseType: !700, size: 192)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !719, file: !334, line: 1399, baseType: !723, size: 64, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !725, line: 52, size: 256, elements: !726)
!725 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!726 = !{!727, !728, !729, !730, !731, !732, !733}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !724, file: !725, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !724, file: !725, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !724, file: !725, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !724, file: !725, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !724, file: !725, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !724, file: !725, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !724, file: !725, line: 62, baseType: !734, size: 192, offset: 64)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !715, size: 192, elements: !735)
!735 = !{!736}
!736 = !DISubrange(count: 3)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !664, file: !334, line: 3376, baseType: !738, size: 256)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !334, line: 1408, size: 256, elements: !739)
!739 = !{!740, !741}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !738, file: !334, line: 1409, baseType: !700, size: 192)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !738, file: !334, line: 1410, baseType: !742, size: 64, offset: 192)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !744, line: 27, size: 192, elements: !745)
!744 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!745 = !{!746, !747}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !743, file: !744, line: 29, baseType: !710, size: 128)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !743, file: !744, line: 30, baseType: !189, size: 32, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !664, file: !334, line: 3377, baseType: !749, size: 256)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !334, line: 1437, size: 256, elements: !750)
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !749, file: !334, line: 1438, baseType: !700, size: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !749, file: !334, line: 1439, baseType: !661, size: 64, offset: 192)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !664, file: !334, line: 3378, baseType: !754, size: 256)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !334, line: 1418, size: 256, elements: !755)
!755 = !{!756, !757, !758}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !754, file: !334, line: 1419, baseType: !700, size: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !754, file: !334, line: 1420, baseType: !650, size: 32, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !754, file: !334, line: 1421, baseType: !759, size: 8, offset: 224)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !653, size: 8, elements: !760)
!760 = !{!761}
!761 = !DISubrange(count: 1)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !664, file: !334, line: 3379, baseType: !763, size: 320)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !334, line: 1428, size: 320, elements: !764)
!764 = !{!765, !766, !767}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !763, file: !334, line: 1429, baseType: !700, size: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !763, file: !334, line: 1430, baseType: !661, size: 64, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !763, file: !334, line: 1431, baseType: !661, size: 64, offset: 256)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !664, file: !334, line: 3380, baseType: !769, size: 320)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !334, line: 1460, size: 320, elements: !770)
!770 = !{!771, !772}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !769, file: !334, line: 1461, baseType: !700, size: 192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !769, file: !334, line: 1462, baseType: !773, size: 128, offset: 192)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !774, line: 31, size: 128, elements: !775)
!774 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!775 = !{!776, !779, !780}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !773, file: !774, line: 32, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !649)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !773, file: !774, line: 33, baseType: !7, size: 32, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !773, file: !774, line: 34, baseType: !7, size: 32, offset: 96)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !664, file: !334, line: 3381, baseType: !782, size: 384)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !334, line: 2507, size: 384, elements: !783)
!783 = !{!784, !785, !790, !791, !792}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !782, file: !334, line: 2508, baseType: !700, size: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !782, file: !334, line: 2509, baseType: !786, size: 32, offset: 192)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !787, line: 58, baseType: !788)
!787 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !789, line: 44, baseType: !7)
!789 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!790 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !782, file: !334, line: 2510, baseType: !7, size: 32, offset: 224)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !782, file: !334, line: 2511, baseType: !661, size: 64, offset: 256)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !782, file: !334, line: 2512, baseType: !661, size: 64, offset: 320)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !664, file: !334, line: 3382, baseType: !794, size: 896)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !334, line: 2652, size: 896, elements: !795)
!795 = !{!796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !794, file: !334, line: 2653, baseType: !782, size: 384)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !794, file: !334, line: 2654, baseType: !661, size: 64, offset: 384)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !794, file: !334, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !794, file: !334, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !794, file: !334, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !794, file: !334, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !794, file: !334, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !794, file: !334, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !794, file: !334, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !794, file: !334, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !794, file: !334, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !794, file: !334, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !794, file: !334, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !794, file: !334, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !794, file: !334, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !794, file: !334, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !794, file: !334, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !794, file: !334, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !794, file: !334, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !794, file: !334, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !794, file: !334, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !794, file: !334, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !794, file: !334, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !794, file: !334, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !794, file: !334, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !794, file: !334, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !794, file: !334, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !794, file: !334, line: 2703, baseType: !7, size: 32, offset: 512)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !794, file: !334, line: 2705, baseType: !661, size: 64, offset: 576)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !794, file: !334, line: 2706, baseType: !661, size: 64, offset: 640)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !794, file: !334, line: 2707, baseType: !661, size: 64, offset: 704)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !794, file: !334, line: 2708, baseType: !661, size: 64, offset: 768)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !794, file: !334, line: 2711, baseType: !829, size: 64, offset: 832)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !334, line: 2711, flags: DIFlagFwdDecl)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !664, file: !334, line: 3383, baseType: !832, size: 960)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !334, line: 2756, size: 960, elements: !833)
!833 = !{!834, !835}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !832, file: !334, line: 2757, baseType: !794, size: 896)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !832, file: !334, line: 2758, baseType: !836, size: 64, offset: 896)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !662, line: 50, baseType: !837)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !839, line: 240, size: 384, elements: !840)
!839 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!840 = !{!841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !838, file: !839, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !838, file: !839, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !838, file: !839, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !838, file: !839, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !838, file: !839, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !838, file: !839, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !838, file: !839, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !838, file: !839, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !838, file: !839, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !838, file: !839, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !838, file: !839, line: 321, baseType: !852, size: 320, offset: 64)
!852 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !839, line: 315, size: 320, elements: !853)
!853 = !{!854, !1256, !1258, !1321, !1322}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !852, file: !839, line: 316, baseType: !855, size: 64)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !856, size: 64, elements: !760)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !839, line: 183, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !839, line: 166, size: 64, elements: !858)
!858 = !{!859, !860, !861, !862, !863, !871, !872, !884, !887, !947, !948, !1233, !1246, !1253}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !857, file: !839, line: 168, baseType: !650, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !857, file: !839, line: 169, baseType: !7, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !857, file: !839, line: 170, baseType: !655, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !857, file: !839, line: 171, baseType: !836, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !857, file: !839, line: 172, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !662, line: 53, baseType: !865)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !839, line: 359, size: 128, elements: !867)
!867 = !{!868, !869}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !866, file: !839, line: 360, baseType: !650, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !866, file: !839, line: 361, baseType: !870, size: 64, offset: 64)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !836, size: 64, elements: !760)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !857, file: !839, line: 173, baseType: !189, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !857, file: !839, line: 174, baseType: !873, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !839, line: 133, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !839, line: 115, size: 32, elements: !875)
!875 = !{!876, !877, !878, !879, !880, !881, !882, !883}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !874, file: !839, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !874, file: !839, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !874, file: !839, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !874, file: !839, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !874, file: !839, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !874, file: !839, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !874, file: !839, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !874, file: !839, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !857, file: !839, line: 175, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !839, line: 175, flags: DIFlagFwdDecl)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !857, file: !839, line: 176, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !890, line: 75, size: 256, elements: !891)
!890 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!891 = !{!892, !906, !907, !908}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !889, file: !890, line: 76, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !890, line: 68, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !890, line: 63, size: 320, elements: !896)
!896 = !{!897, !899, !900, !901}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !895, file: !890, line: 64, baseType: !898, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !895, file: !890, line: 65, baseType: !898, size: 64, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !895, file: !890, line: 66, baseType: !7, size: 32, offset: 128)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !895, file: !890, line: 67, baseType: !902, size: 128, offset: 192)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 128, elements: !904)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !890, line: 29, baseType: !715)
!904 = !{!905}
!905 = !DISubrange(count: 2)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !889, file: !890, line: 77, baseType: !893, size: 64, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !889, file: !890, line: 78, baseType: !7, size: 32, offset: 128)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !889, file: !890, line: 79, baseType: !909, size: 64, offset: 192)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !890, line: 49, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !890, line: 45, size: 832, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !911, file: !890, line: 46, baseType: !898, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !911, file: !890, line: 47, baseType: !888, size: 64, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !911, file: !890, line: 48, baseType: !916, size: 704, offset: 128)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !917, line: 164, size: 704, elements: !918)
!917 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!918 = !{!919, !920, !930, !931, !932, !933, !934, !935, !939, !943, !944, !945, !946}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !916, file: !917, line: 166, baseType: !717, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !916, file: !917, line: 167, baseType: !921, size: 64, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !917, line: 157, size: 192, elements: !923)
!923 = !{!924, !925, !926}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !922, file: !917, line: 159, baseType: !652, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !922, file: !917, line: 160, baseType: !921, size: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !922, file: !917, line: 161, baseType: !927, size: 32, offset: 128)
!927 = !DICompositeType(tag: DW_TAG_array_type, baseType: !653, size: 32, elements: !928)
!928 = !{!929}
!929 = !DISubrange(count: 4)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !916, file: !917, line: 168, baseType: !652, size: 64, offset: 128)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !916, file: !917, line: 169, baseType: !652, size: 64, offset: 192)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !916, file: !917, line: 170, baseType: !652, size: 64, offset: 256)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !916, file: !917, line: 171, baseType: !717, size: 64, offset: 320)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !916, file: !917, line: 172, baseType: !650, size: 32, offset: 384)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !916, file: !917, line: 176, baseType: !936, size: 64, offset: 448)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!921, !654, !717}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !916, file: !917, line: 177, baseType: !940, size: 64, offset: 512)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{null, !654, !921}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !916, file: !917, line: 178, baseType: !654, size: 64, offset: 576)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !916, file: !917, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !916, file: !917, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !916, file: !917, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !857, file: !839, line: 177, baseType: !661, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !857, file: !839, line: 178, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !318, line: 217, size: 832, elements: !951)
!951 = !{!952, !1198, !1199, !1200, !1203, !1207, !1208, !1209, !1227, !1228, !1229, !1230, !1231, !1232}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !950, file: !318, line: 219, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !318, line: 151, baseType: !955)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !318, line: 151, size: 128, elements: !956)
!956 = !{!957}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !955, file: !318, line: 151, baseType: !958, size: 128)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !318, line: 150, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !318, line: 150, size: 128, elements: !960)
!960 = !{!961, !962, !963}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !959, file: !318, line: 150, baseType: !7, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !959, file: !318, line: 150, baseType: !7, size: 32, offset: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !959, file: !318, line: 150, baseType: !964, size: 64, offset: 64)
!964 = !DICompositeType(tag: DW_TAG_array_type, baseType: !965, size: 64, elements: !760)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !662, line: 108, baseType: !966)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !318, line: 122, size: 512, elements: !968)
!968 = !{!969, !970, !971, !1190, !1191, !1192, !1193, !1194, !1195, !1196}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !967, file: !318, line: 124, baseType: !949, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !967, file: !318, line: 125, baseType: !949, size: 64, offset: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !967, file: !318, line: 131, baseType: !972, size: 64, offset: 128)
!972 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !318, line: 128, size: 64, elements: !973)
!973 = !{!974, !1189}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !972, file: !318, line: 129, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !662, line: 66, baseType: !976)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !583, line: 143, size: 192, elements: !978)
!978 = !{!979, !1187, !1188}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !977, file: !583, line: 145, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !662, line: 69, baseType: !981)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !583, line: 136, size: 192, elements: !983)
!983 = !{!984, !1185, !1186}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !982, file: !583, line: 137, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !662, line: 58, baseType: !986)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !583, line: 737, size: 768, elements: !988)
!988 = !{!989, !1006, !1040, !1046, !1051, !1056, !1063, !1069, !1075, !1080, !1094, !1099, !1105, !1110, !1120, !1125, !1143, !1150, !1157, !1163, !1168, !1174, !1180}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !987, file: !583, line: 738, baseType: !990, size: 256)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !583, line: 271, size: 256, elements: !991)
!991 = !{!992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !990, file: !583, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !990, file: !583, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !990, file: !583, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !990, file: !583, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !990, file: !583, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !990, file: !583, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !990, file: !583, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !990, file: !583, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !990, file: !583, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !990, file: !583, line: 312, baseType: !7, size: 32, offset: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !990, file: !583, line: 316, baseType: !786, size: 32, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !990, file: !583, line: 319, baseType: !7, size: 32, offset: 96)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !990, file: !583, line: 323, baseType: !949, size: 64, offset: 128)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !990, file: !583, line: 327, baseType: !661, size: 64, offset: 192)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !987, file: !583, line: 739, baseType: !1007, size: 448)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !583, line: 350, size: 448, elements: !1008)
!1008 = !{!1009, !1038}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1007, file: !583, line: 353, baseType: !1010, size: 384)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !583, line: 333, size: 384, elements: !1011)
!1011 = !{!1012, !1013, !1021}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1010, file: !583, line: 336, baseType: !990, size: 256)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1010, file: !583, line: 343, baseType: !1014, size: 64, offset: 256)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1016, line: 37, size: 128, elements: !1017)
!1016 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1017 = !{!1018, !1019}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1015, file: !1016, line: 39, baseType: !1014, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1015, file: !1016, line: 40, baseType: !1020, size: 64, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1010, file: !583, line: 344, baseType: !1022, size: 64, offset: 320)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1016, line: 45, size: 320, elements: !1024)
!1024 = !{!1025, !1026}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1023, file: !1016, line: 47, baseType: !1022, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1023, file: !1016, line: 48, baseType: !1027, size: 256, offset: 64)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !334, line: 1883, size: 256, elements: !1028)
!1028 = !{!1029, !1031, !1032, !1037}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1027, file: !334, line: 1884, baseType: !1030, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1027, file: !334, line: 1885, baseType: !1030, size: 64, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1027, file: !334, line: 1891, baseType: !1033, size: 64, offset: 128)
!1033 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1027, file: !334, line: 1891, size: 64, elements: !1034)
!1034 = !{!1035, !1036}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1033, file: !334, line: 1891, baseType: !985, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1033, file: !334, line: 1891, baseType: !661, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1027, file: !334, line: 1892, baseType: !1020, size: 64, offset: 192)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1007, file: !583, line: 359, baseType: !1039, size: 64, offset: 384)
!1039 = !DICompositeType(tag: DW_TAG_array_type, baseType: !661, size: 64, elements: !760)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !987, file: !583, line: 740, baseType: !1041, size: 512)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !583, line: 365, size: 512, elements: !1042)
!1042 = !{!1043, !1044, !1045}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1041, file: !583, line: 368, baseType: !1010, size: 384)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1041, file: !583, line: 373, baseType: !661, size: 64, offset: 384)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1041, file: !583, line: 374, baseType: !661, size: 64, offset: 448)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !987, file: !583, line: 741, baseType: !1047, size: 576)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !583, line: 380, size: 576, elements: !1048)
!1048 = !{!1049, !1050}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1047, file: !583, line: 383, baseType: !1041, size: 512)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1047, file: !583, line: 389, baseType: !1039, size: 64, offset: 512)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !987, file: !583, line: 742, baseType: !1052, size: 320)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !583, line: 395, size: 320, elements: !1053)
!1053 = !{!1054, !1055}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1052, file: !583, line: 397, baseType: !990, size: 256)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1052, file: !583, line: 400, baseType: !975, size: 64, offset: 256)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !987, file: !583, line: 743, baseType: !1057, size: 448)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !583, line: 406, size: 448, elements: !1058)
!1058 = !{!1059, !1060, !1061, !1062}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1057, file: !583, line: 408, baseType: !990, size: 256)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1057, file: !583, line: 412, baseType: !661, size: 64, offset: 256)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1057, file: !583, line: 420, baseType: !661, size: 64, offset: 320)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1057, file: !583, line: 423, baseType: !975, size: 64, offset: 384)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !987, file: !583, line: 744, baseType: !1064, size: 384)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !583, line: 429, size: 384, elements: !1065)
!1065 = !{!1066, !1067, !1068}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1064, file: !583, line: 431, baseType: !990, size: 256)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1064, file: !583, line: 434, baseType: !661, size: 64, offset: 256)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1064, file: !583, line: 437, baseType: !975, size: 64, offset: 320)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !987, file: !583, line: 745, baseType: !1070, size: 384)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !583, line: 443, size: 384, elements: !1071)
!1071 = !{!1072, !1073, !1074}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1070, file: !583, line: 445, baseType: !990, size: 256)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1070, file: !583, line: 449, baseType: !661, size: 64, offset: 256)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1070, file: !583, line: 453, baseType: !975, size: 64, offset: 320)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !987, file: !583, line: 746, baseType: !1076, size: 320)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !583, line: 459, size: 320, elements: !1077)
!1077 = !{!1078, !1079}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1076, file: !583, line: 461, baseType: !990, size: 256)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1076, file: !583, line: 464, baseType: !661, size: 64, offset: 256)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !987, file: !583, line: 747, baseType: !1081, size: 768)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !583, line: 469, size: 768, elements: !1082)
!1082 = !{!1083, !1084, !1085, !1086, !1087}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1081, file: !583, line: 471, baseType: !990, size: 256)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1081, file: !583, line: 474, baseType: !7, size: 32, offset: 256)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1081, file: !583, line: 475, baseType: !7, size: 32, offset: 288)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1081, file: !583, line: 478, baseType: !661, size: 64, offset: 320)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1081, file: !583, line: 481, baseType: !1088, size: 384, offset: 384)
!1088 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1089, size: 384, elements: !760)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !334, line: 1917, size: 384, elements: !1090)
!1090 = !{!1091, !1092, !1093}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1089, file: !334, line: 1920, baseType: !1027, size: 256)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1089, file: !334, line: 1921, baseType: !661, size: 64, offset: 256)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1089, file: !334, line: 1922, baseType: !786, size: 32, offset: 320)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !987, file: !583, line: 748, baseType: !1095, size: 320)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !583, line: 487, size: 320, elements: !1096)
!1096 = !{!1097, !1098}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1095, file: !583, line: 490, baseType: !990, size: 256)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1095, file: !583, line: 494, baseType: !650, size: 32, offset: 256)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !987, file: !583, line: 749, baseType: !1100, size: 384)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !583, line: 500, size: 384, elements: !1101)
!1101 = !{!1102, !1103, !1104}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1100, file: !583, line: 502, baseType: !990, size: 256)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1100, file: !583, line: 506, baseType: !975, size: 64, offset: 256)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1100, file: !583, line: 510, baseType: !975, size: 64, offset: 320)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !987, file: !583, line: 750, baseType: !1106, size: 320)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !583, line: 529, size: 320, elements: !1107)
!1107 = !{!1108, !1109}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1106, file: !583, line: 531, baseType: !990, size: 256)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1106, file: !583, line: 540, baseType: !975, size: 64, offset: 256)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !987, file: !583, line: 751, baseType: !1111, size: 704)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !583, line: 546, size: 704, elements: !1112)
!1112 = !{!1113, !1114, !1115, !1116, !1117, !1118, !1119}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1111, file: !583, line: 549, baseType: !1041, size: 512)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1111, file: !583, line: 553, baseType: !655, size: 64, offset: 512)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1111, file: !583, line: 557, baseType: !649, size: 8, offset: 576)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1111, file: !583, line: 558, baseType: !649, size: 8, offset: 584)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1111, file: !583, line: 559, baseType: !649, size: 8, offset: 592)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1111, file: !583, line: 560, baseType: !649, size: 8, offset: 600)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1111, file: !583, line: 566, baseType: !1039, size: 64, offset: 640)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !987, file: !583, line: 752, baseType: !1121, size: 384)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !583, line: 571, size: 384, elements: !1122)
!1122 = !{!1123, !1124}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1121, file: !583, line: 573, baseType: !1052, size: 320)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1121, file: !583, line: 577, baseType: !661, size: 64, offset: 320)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !987, file: !583, line: 753, baseType: !1126, size: 576)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !583, line: 600, size: 576, elements: !1127)
!1127 = !{!1128, !1129, !1130, !1133, !1142}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1126, file: !583, line: 602, baseType: !1052, size: 320)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1126, file: !583, line: 605, baseType: !661, size: 64, offset: 320)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1126, file: !583, line: 609, baseType: !1131, size: 64, offset: 384)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1132, line: 46, baseType: !715)
!1132 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1126, file: !583, line: 612, baseType: !1134, size: 64, offset: 448)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !583, line: 581, size: 320, elements: !1136)
!1136 = !{!1137, !1138, !1139, !1140, !1141}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1135, file: !583, line: 583, baseType: !366, size: 32)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1135, file: !583, line: 586, baseType: !661, size: 64, offset: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1135, file: !583, line: 589, baseType: !661, size: 64, offset: 128)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1135, file: !583, line: 592, baseType: !661, size: 64, offset: 192)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1135, file: !583, line: 595, baseType: !661, size: 64, offset: 256)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1126, file: !583, line: 616, baseType: !975, size: 64, offset: 512)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !987, file: !583, line: 754, baseType: !1144, size: 512)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !583, line: 622, size: 512, elements: !1145)
!1145 = !{!1146, !1147, !1148, !1149}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1144, file: !583, line: 624, baseType: !1052, size: 320)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1144, file: !583, line: 628, baseType: !661, size: 64, offset: 320)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1144, file: !583, line: 632, baseType: !661, size: 64, offset: 384)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1144, file: !583, line: 636, baseType: !661, size: 64, offset: 448)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !987, file: !583, line: 755, baseType: !1151, size: 704)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !583, line: 642, size: 704, elements: !1152)
!1152 = !{!1153, !1154, !1155, !1156}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1151, file: !583, line: 644, baseType: !1144, size: 512)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1151, file: !583, line: 648, baseType: !661, size: 64, offset: 512)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1151, file: !583, line: 652, baseType: !661, size: 64, offset: 576)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1151, file: !583, line: 653, baseType: !661, size: 64, offset: 640)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !987, file: !583, line: 756, baseType: !1158, size: 448)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !583, line: 663, size: 448, elements: !1159)
!1159 = !{!1160, !1161, !1162}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1158, file: !583, line: 665, baseType: !1052, size: 320)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1158, file: !583, line: 668, baseType: !661, size: 64, offset: 320)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1158, file: !583, line: 673, baseType: !661, size: 64, offset: 384)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !987, file: !583, line: 757, baseType: !1164, size: 384)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !583, line: 694, size: 384, elements: !1165)
!1165 = !{!1166, !1167}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1164, file: !583, line: 696, baseType: !1052, size: 320)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1164, file: !583, line: 699, baseType: !661, size: 64, offset: 320)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !987, file: !583, line: 758, baseType: !1169, size: 384)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !583, line: 681, size: 384, elements: !1170)
!1170 = !{!1171, !1172, !1173}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1169, file: !583, line: 683, baseType: !990, size: 256)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1169, file: !583, line: 686, baseType: !661, size: 64, offset: 256)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1169, file: !583, line: 689, baseType: !661, size: 64, offset: 320)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !987, file: !583, line: 759, baseType: !1175, size: 384)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !583, line: 707, size: 384, elements: !1176)
!1176 = !{!1177, !1178, !1179}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1175, file: !583, line: 709, baseType: !990, size: 256)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1175, file: !583, line: 712, baseType: !661, size: 64, offset: 256)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1175, file: !583, line: 712, baseType: !661, size: 64, offset: 320)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !987, file: !583, line: 760, baseType: !1181, size: 320)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !583, line: 718, size: 320, elements: !1182)
!1182 = !{!1183, !1184}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1181, file: !583, line: 720, baseType: !990, size: 256)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1181, file: !583, line: 723, baseType: !661, size: 64, offset: 256)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !982, file: !583, line: 138, baseType: !981, size: 64, offset: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !982, file: !583, line: 139, baseType: !981, size: 64, offset: 128)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !977, file: !583, line: 146, baseType: !980, size: 64, offset: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !977, file: !583, line: 152, baseType: !975, size: 64, offset: 128)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !972, file: !318, line: 130, baseType: !836, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !967, file: !318, line: 134, baseType: !654, size: 64, offset: 192)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !967, file: !318, line: 137, baseType: !661, size: 64, offset: 256)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !967, file: !318, line: 138, baseType: !786, size: 32, offset: 320)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !967, file: !318, line: 142, baseType: !7, size: 32, offset: 352)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !967, file: !318, line: 144, baseType: !650, size: 32, offset: 384)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !967, file: !318, line: 145, baseType: !650, size: 32, offset: 416)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !967, file: !318, line: 146, baseType: !1197, size: 64, offset: 448)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !318, line: 119, baseType: !717)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !950, file: !318, line: 220, baseType: !953, size: 64, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !950, file: !318, line: 223, baseType: !654, size: 64, offset: 128)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !950, file: !318, line: 226, baseType: !1201, size: 64, offset: 192)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !318, line: 185, flags: DIFlagFwdDecl)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !950, file: !318, line: 229, baseType: !1204, size: 128, offset: 256)
!1204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1205, size: 128, elements: !904)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !318, line: 229, flags: DIFlagFwdDecl)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !950, file: !318, line: 232, baseType: !949, size: 64, offset: 384)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !950, file: !318, line: 233, baseType: !949, size: 64, offset: 448)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !950, file: !318, line: 238, baseType: !1210, size: 64, offset: 512)
!1210 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !318, line: 235, size: 64, elements: !1211)
!1211 = !{!1212, !1218}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1210, file: !318, line: 236, baseType: !1213, size: 64)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !318, line: 273, size: 128, elements: !1215)
!1215 = !{!1216, !1217}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1214, file: !318, line: 275, baseType: !975, size: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1214, file: !318, line: 278, baseType: !975, size: 64, offset: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1210, file: !318, line: 237, baseType: !1219, size: 64)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !318, line: 259, size: 320, elements: !1221)
!1221 = !{!1222, !1223, !1224, !1225, !1226}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1220, file: !318, line: 261, baseType: !836, size: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1220, file: !318, line: 262, baseType: !836, size: 64, offset: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1220, file: !318, line: 266, baseType: !836, size: 64, offset: 128)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1220, file: !318, line: 267, baseType: !836, size: 64, offset: 192)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1220, file: !318, line: 270, baseType: !650, size: 32, offset: 256)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !950, file: !318, line: 241, baseType: !1197, size: 64, offset: 576)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !950, file: !318, line: 244, baseType: !650, size: 32, offset: 640)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !950, file: !318, line: 247, baseType: !650, size: 32, offset: 672)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !950, file: !318, line: 250, baseType: !650, size: 32, offset: 704)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !950, file: !318, line: 253, baseType: !650, size: 32, offset: 736)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !950, file: !318, line: 256, baseType: !650, size: 32, offset: 768)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !857, file: !839, line: 179, baseType: !1234, size: 64)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !839, line: 150, baseType: !1236)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !839, line: 142, size: 320, elements: !1237)
!1237 = !{!1238, !1239, !1240, !1241, !1244, !1245}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1236, file: !839, line: 144, baseType: !661, size: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1236, file: !839, line: 145, baseType: !836, size: 64, offset: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1236, file: !839, line: 146, baseType: !836, size: 64, offset: 128)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1236, file: !839, line: 147, baseType: !1242, size: 32, offset: 192)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1243, line: 31, baseType: !650)
!1243 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1236, file: !839, line: 148, baseType: !7, size: 32, offset: 224)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1236, file: !839, line: 149, baseType: !649, size: 8, offset: 256)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !857, file: !839, line: 180, baseType: !1247, size: 64)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !839, line: 162, baseType: !1249)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !839, line: 159, size: 128, elements: !1250)
!1250 = !{!1251, !1252}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1249, file: !839, line: 160, baseType: !661, size: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1249, file: !839, line: 161, baseType: !717, size: 64, offset: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !857, file: !839, line: 181, baseType: !1254, size: 64)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !839, line: 181, flags: DIFlagFwdDecl)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !852, file: !839, line: 317, baseType: !1257, size: 64)
!1257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !717, size: 64, elements: !760)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !852, file: !839, line: 318, baseType: !1259, size: 320)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !839, line: 188, size: 320, elements: !1260)
!1260 = !{!1261, !1263, !1320}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1259, file: !839, line: 190, baseType: !1262, size: 192)
!1262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !856, size: 192, elements: !735)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1259, file: !839, line: 193, baseType: !1264, size: 64, offset: 192)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !839, line: 206, size: 320, elements: !1266)
!1266 = !{!1267, !1305, !1306, !1307, !1319}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1265, file: !839, line: 208, baseType: !1268, size: 64)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !662, line: 62, baseType: !1270)
!1270 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1271, line: 538, size: 256, elements: !1272)
!1271 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1272 = !{!1273, !1277, !1283, !1296}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1270, file: !1271, line: 539, baseType: !1274, size: 32)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1271, line: 482, size: 32, elements: !1275)
!1275 = !{!1276}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1274, file: !1271, line: 484, baseType: !7, size: 32)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1270, file: !1271, line: 540, baseType: !1278, size: 192)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1271, line: 488, size: 192, elements: !1279)
!1279 = !{!1280, !1281, !1282}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1278, file: !1271, line: 489, baseType: !1274, size: 32)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1278, file: !1271, line: 492, baseType: !655, size: 64, offset: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1278, file: !1271, line: 496, baseType: !661, size: 64, offset: 128)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1270, file: !1271, line: 541, baseType: !1284, size: 256)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1271, line: 504, size: 256, elements: !1285)
!1285 = !{!1286, !1287, !1294, !1295}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1284, file: !1271, line: 505, baseType: !1274, size: 32)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1284, file: !1271, line: 509, baseType: !1288, size: 64, offset: 64)
!1288 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1271, line: 501, baseType: !1289)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{null, !1292}
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64)
!1293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1284, file: !1271, line: 510, baseType: !1292, size: 64, offset: 128)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1284, file: !1271, line: 513, baseType: !1268, size: 64, offset: 192)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1270, file: !1271, line: 542, baseType: !1297, size: 128)
!1297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1271, line: 530, size: 128, elements: !1298)
!1298 = !{!1299, !1300}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1297, file: !1271, line: 531, baseType: !1274, size: 32)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1297, file: !1271, line: 534, baseType: !1301, size: 64, offset: 64)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1271, line: 525, baseType: !1302)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64)
!1303 = !DISubroutineType(types: !1304)
!1304 = !{!649, !661, !655, !715, !715}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1265, file: !839, line: 211, baseType: !7, size: 32, offset: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1265, file: !839, line: 214, baseType: !717, size: 64, offset: 128)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1265, file: !839, line: 224, baseType: !1308, size: 64, offset: 192)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !839, line: 202, baseType: !1310)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !839, line: 202, size: 128, elements: !1311)
!1311 = !{!1312}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1310, file: !839, line: 202, baseType: !1313, size: 128)
!1313 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !839, line: 200, baseType: !1314)
!1314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !839, line: 200, size: 128, elements: !1315)
!1315 = !{!1316, !1317, !1318}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1314, file: !839, line: 200, baseType: !7, size: 32)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1314, file: !839, line: 200, baseType: !7, size: 32, offset: 32)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1314, file: !839, line: 200, baseType: !870, size: 64, offset: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1265, file: !839, line: 234, baseType: !1308, size: 64, offset: 256)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1259, file: !839, line: 197, baseType: !717, size: 64, offset: 256)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !852, file: !839, line: 319, baseType: !724, size: 256)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !852, file: !839, line: 320, baseType: !743, size: 192)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !664, file: !334, line: 3384, baseType: !1324, size: 1472)
!1324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !334, line: 3114, size: 1472, elements: !1325)
!1325 = !{!1326, !1347, !1348, !1349, !1350}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1324, file: !334, line: 3115, baseType: !1327, size: 1216)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !334, line: 2984, size: 1216, elements: !1328)
!1328 = !{!1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1327, file: !334, line: 2985, baseType: !832, size: 960)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1327, file: !334, line: 2986, baseType: !661, size: 64, offset: 960)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1327, file: !334, line: 2987, baseType: !661, size: 64, offset: 1024)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1327, file: !334, line: 2988, baseType: !661, size: 64, offset: 1088)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1327, file: !334, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1327, file: !334, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1327, file: !334, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1327, file: !334, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1327, file: !334, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1327, file: !334, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1327, file: !334, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1327, file: !334, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1327, file: !334, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1327, file: !334, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1327, file: !334, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1327, file: !334, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1327, file: !334, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1327, file: !334, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1324, file: !334, line: 3117, baseType: !661, size: 64, offset: 1216)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1324, file: !334, line: 3119, baseType: !661, size: 64, offset: 1280)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1324, file: !334, line: 3121, baseType: !661, size: 64, offset: 1344)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1324, file: !334, line: 3123, baseType: !661, size: 64, offset: 1408)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !664, file: !334, line: 3385, baseType: !1352, size: 1088)
!1352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !334, line: 2874, size: 1088, elements: !1353)
!1353 = !{!1354, !1355, !1356}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1352, file: !334, line: 2875, baseType: !832, size: 960)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1352, file: !334, line: 2876, baseType: !836, size: 64, offset: 960)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1352, file: !334, line: 2877, baseType: !1357, size: 64, offset: 1024)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64)
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1359, line: 172, size: 128, elements: !1360)
!1359 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1360 = !{!1361, !1362, !1363, !1364, !1365, !1366, !1367}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1358, file: !1359, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1358, file: !1359, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1358, file: !1359, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1358, file: !1359, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1358, file: !1359, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1358, file: !1359, line: 195, baseType: !7, size: 32, offset: 32)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1358, file: !1359, line: 199, baseType: !661, size: 64, offset: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !664, file: !334, line: 3386, baseType: !1327, size: 1216)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !664, file: !334, line: 3387, baseType: !1370, size: 1280)
!1370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !334, line: 3093, size: 1280, elements: !1371)
!1371 = !{!1372, !1373}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1370, file: !334, line: 3094, baseType: !1327, size: 1216)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1370, file: !334, line: 3095, baseType: !1357, size: 64, offset: 1216)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !664, file: !334, line: 3388, baseType: !1375, size: 1216)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !334, line: 2824, size: 1216, elements: !1376)
!1376 = !{!1377, !1378, !1379, !1380, !1381, !1382}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1375, file: !334, line: 2825, baseType: !794, size: 896)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1375, file: !334, line: 2827, baseType: !661, size: 64, offset: 896)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1375, file: !334, line: 2828, baseType: !661, size: 64, offset: 960)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1375, file: !334, line: 2829, baseType: !661, size: 64, offset: 1024)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1375, file: !334, line: 2830, baseType: !661, size: 64, offset: 1088)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1375, file: !334, line: 2831, baseType: !661, size: 64, offset: 1152)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !664, file: !334, line: 3389, baseType: !1384, size: 1024)
!1384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !334, line: 2850, size: 1024, elements: !1385)
!1385 = !{!1386, !1387, !1388}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1384, file: !334, line: 2851, baseType: !832, size: 960)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1384, file: !334, line: 2852, baseType: !650, size: 32, offset: 960)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1384, file: !334, line: 2853, baseType: !650, size: 32, offset: 992)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !664, file: !334, line: 3390, baseType: !1390, size: 1024)
!1390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !334, line: 2857, size: 1024, elements: !1391)
!1391 = !{!1392, !1393}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1390, file: !334, line: 2858, baseType: !832, size: 960)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1390, file: !334, line: 2859, baseType: !1357, size: 64, offset: 960)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !664, file: !334, line: 3391, baseType: !1395, size: 960)
!1395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !334, line: 2862, size: 960, elements: !1396)
!1396 = !{!1397}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1395, file: !334, line: 2863, baseType: !832, size: 960)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !664, file: !334, line: 3392, baseType: !1399, size: 1472)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !334, line: 3304, size: 1472, elements: !1400)
!1400 = !{!1401}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1399, file: !334, line: 3305, baseType: !1324, size: 1472)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !664, file: !334, line: 3393, baseType: !1403, size: 1792)
!1403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !334, line: 3248, size: 1792, elements: !1404)
!1404 = !{!1405, !1406, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1403, file: !334, line: 3249, baseType: !1324, size: 1472)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1403, file: !334, line: 3251, baseType: !1407, size: 64, offset: 1472)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64)
!1408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1409, line: 463, size: 1152, elements: !1410)
!1409 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1410 = !{!1411, !1414, !1445, !1446, !1559, !1562, !1563, !1564, !1565, !1566, !1567, !1591, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1408, file: !1409, line: 464, baseType: !1412, size: 64)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64)
!1413 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1409, line: 464, flags: DIFlagFwdDecl)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1408, file: !1409, line: 467, baseType: !1415, size: 64, offset: 64)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64)
!1416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !318, line: 374, size: 640, elements: !1417)
!1417 = !{!1418, !1420, !1421, !1434, !1435, !1436, !1437, !1438, !1439, !1441, !1443, !1444}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1416, file: !318, line: 377, baseType: !1419, size: 64)
!1419 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !662, line: 111, baseType: !949)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1416, file: !318, line: 378, baseType: !1419, size: 64, offset: 64)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1416, file: !318, line: 381, baseType: !1422, size: 64, offset: 128)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64)
!1423 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !318, line: 282, baseType: !1424)
!1424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !318, line: 282, size: 128, elements: !1425)
!1425 = !{!1426}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1424, file: !318, line: 282, baseType: !1427, size: 128)
!1427 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !318, line: 281, baseType: !1428)
!1428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !318, line: 281, size: 128, elements: !1429)
!1429 = !{!1430, !1431, !1432}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1428, file: !318, line: 281, baseType: !7, size: 32)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1428, file: !318, line: 281, baseType: !7, size: 32, offset: 32)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1428, file: !318, line: 281, baseType: !1433, size: 64, offset: 64)
!1433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1419, size: 64, elements: !760)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1416, file: !318, line: 384, baseType: !650, size: 32, offset: 192)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1416, file: !318, line: 387, baseType: !650, size: 32, offset: 224)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1416, file: !318, line: 390, baseType: !650, size: 32, offset: 256)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1416, file: !318, line: 394, baseType: !1422, size: 64, offset: 320)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1416, file: !318, line: 396, baseType: !317, size: 32, offset: 384)
