; ModuleID = 'tree-object-size.bc'
source_filename = "tree-object-size.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.bitmap_head_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, %struct.bitmap_obstack* }
%struct.bitmap_element_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, [2 x i64] }
%struct.bitmap_obstack = type { %struct.bitmap_element_def*, %struct.bitmap_head_def*, %struct.obstack }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, i64, i32, %struct._obstack_chunk* (i8*, i64)*, void (i8*, %struct._obstack_chunk*)*, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [4 x i8] }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque

!454 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!455 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!456 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!457 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!458 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!459 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!460 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!461 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!462 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!463 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!464 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!465 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!466 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!467 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!468 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!469 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!470 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!471 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !433, line: 80, baseType: !7, size: 32, elements: !472)
!472 = !{!473, !474, !475, !476}
!473 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!474 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!475 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!476 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!477 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !433, line: 727, baseType: !7, size: 32, elements: !478)
!478 = !{!479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502}
!479 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!480 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!481 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!482 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!483 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!484 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!485 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!486 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!487 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!488 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!489 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!490 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!491 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!492 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!493 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!494 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!495 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!496 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!497 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!498 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!499 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!500 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!501 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!502 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!503 = !{!504, !505, !506, !507, !510, !511, !5, !513, !514, !577, !578, !532, !686, !471, !871, !1689, !905, !508}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!506 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !509)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !515, line: 47, baseType: !516)
!515 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !518, line: 75, size: 256, elements: !519)
!518 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!519 = !{!520, !535, !536, !537}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !517, file: !518, line: 76, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !518, line: 68, baseType: !523)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !518, line: 63, size: 320, elements: !524)
!524 = !{!525, !527, !528, !529}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !523, file: !518, line: 64, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !523, file: !518, line: 65, baseType: !526, size: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !523, file: !518, line: 66, baseType: !7, size: 32, offset: 128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !523, file: !518, line: 67, baseType: !530, size: 128, offset: 192)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 128, elements: !533)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !518, line: 29, baseType: !532)
!532 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!533 = !{!534}
!534 = !DISubrange(count: 2)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !517, file: !518, line: 77, baseType: !521, size: 64, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !517, file: !518, line: 78, baseType: !7, size: 32, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !517, file: !518, line: 79, baseType: !538, size: 64, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !518, line: 49, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !518, line: 45, size: 832, elements: !541)
!541 = !{!542, !543, !544}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !540, file: !518, line: 46, baseType: !526, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !540, file: !518, line: 47, baseType: !516, size: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !540, file: !518, line: 48, baseType: !545, size: 704, offset: 128)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !546, line: 164, size: 704, elements: !547)
!546 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!547 = !{!548, !550, !560, !561, !562, !563, !564, !565, !569, !573, !574, !575, !576}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !545, file: !546, line: 166, baseType: !549, size: 64)
!549 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !545, file: !546, line: 167, baseType: !551, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !546, line: 157, size: 192, elements: !553)
!553 = !{!554, !555, !556}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !552, file: !546, line: 159, baseType: !508, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !552, file: !546, line: 160, baseType: !551, size: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !552, file: !546, line: 161, baseType: !557, size: 32, offset: 128)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 32, elements: !558)
!558 = !{!559}
!559 = !DISubrange(count: 4)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !545, file: !546, line: 168, baseType: !508, size: 64, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !545, file: !546, line: 169, baseType: !508, size: 64, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !545, file: !546, line: 170, baseType: !508, size: 64, offset: 256)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !545, file: !546, line: 171, baseType: !549, size: 64, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !545, file: !546, line: 172, baseType: !506, size: 32, offset: 384)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !545, file: !546, line: 176, baseType: !566, size: 64, offset: 448)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!551, !510, !549}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !545, file: !546, line: 177, baseType: !570, size: 64, offset: 512)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{null, !510, !551}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !545, file: !546, line: 178, baseType: !510, size: 64, offset: 576)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !545, file: !546, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !545, file: !546, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !545, file: !546, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !515, line: 56, baseType: !579)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !6, line: 3371, size: 1792, elements: !581)
!581 = !{!582, !615, !621, !632, !639, !646, !651, !660, !666, !679, !691, !729, !737, !765, !782, !783, !788, !797, !803, !808, !812, !816, !1338, !1387, !1393, !1399, !1406, !1419, !1433, !1450, !1462, !1484, !1499, !1671}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !580, file: !6, line: 3372, baseType: !583, size: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !6, line: 360, size: 64, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !583, file: !6, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !583, file: !6, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !583, file: !6, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !583, file: !6, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !583, file: !6, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !583, file: !6, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !583, file: !6, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !583, file: !6, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !583, file: !6, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !583, file: !6, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !583, file: !6, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !583, file: !6, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !583, file: !6, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !583, file: !6, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !583, file: !6, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !583, file: !6, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !583, file: !6, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !583, file: !6, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !583, file: !6, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !583, file: !6, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !583, file: !6, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !583, file: !6, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !583, file: !6, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !583, file: !6, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !583, file: !6, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !583, file: !6, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !583, file: !6, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !583, file: !6, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !583, file: !6, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !583, file: !6, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !580, file: !6, line: 3373, baseType: !616, size: 192)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !6, line: 402, size: 192, elements: !617)
!617 = !{!618, !619, !620}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !616, file: !6, line: 403, baseType: !583, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !616, file: !6, line: 404, baseType: !578, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !616, file: !6, line: 405, baseType: !578, size: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !580, file: !6, line: 3374, baseType: !622, size: 320)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !6, line: 1384, size: 320, elements: !623)
!623 = !{!624, !625}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !622, file: !6, line: 1385, baseType: !616, size: 192)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !622, file: !6, line: 1386, baseType: !626, size: 128, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !627, line: 58, baseType: !628)
!627 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !627, line: 54, size: 128, elements: !629)
!629 = !{!630, !631}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !628, file: !627, line: 56, baseType: !532, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !628, file: !627, line: 57, baseType: !549, size: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !580, file: !6, line: 3375, baseType: !633, size: 256)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !6, line: 1397, size: 256, elements: !634)
!634 = !{!635, !636}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !633, file: !6, line: 1398, baseType: !616, size: 192)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !633, file: !6, line: 1399, baseType: !637, size: 64, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !6, line: 1392, flags: DIFlagFwdDecl)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !580, file: !6, line: 3376, baseType: !640, size: 256)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !6, line: 1408, size: 256, elements: !641)
!641 = !{!642, !643}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !640, file: !6, line: 1409, baseType: !616, size: 192)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !640, file: !6, line: 1410, baseType: !644, size: 64, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !6, line: 1403, flags: DIFlagFwdDecl)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !580, file: !6, line: 3377, baseType: !647, size: 256)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !6, line: 1437, size: 256, elements: !648)
!648 = !{!649, !650}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !647, file: !6, line: 1438, baseType: !616, size: 192)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !647, file: !6, line: 1439, baseType: !578, size: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !580, file: !6, line: 3378, baseType: !652, size: 256)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !6, line: 1418, size: 256, elements: !653)
!653 = !{!654, !655, !656}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !652, file: !6, line: 1419, baseType: !616, size: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !652, file: !6, line: 1420, baseType: !506, size: 32, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !652, file: !6, line: 1421, baseType: !657, size: 8, offset: 224)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 8, elements: !658)
!658 = !{!659}
!659 = !DISubrange(count: 1)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !580, file: !6, line: 3379, baseType: !661, size: 320)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !6, line: 1428, size: 320, elements: !662)
!662 = !{!663, !664, !665}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !661, file: !6, line: 1429, baseType: !616, size: 192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !661, file: !6, line: 1430, baseType: !578, size: 64, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !661, file: !6, line: 1431, baseType: !578, size: 64, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !580, file: !6, line: 3380, baseType: !667, size: 320)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !6, line: 1460, size: 320, elements: !668)
!668 = !{!669, !670}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !667, file: !6, line: 1461, baseType: !616, size: 192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !667, file: !6, line: 1462, baseType: !671, size: 128, offset: 192)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !672, line: 31, size: 128, elements: !673)
!672 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!673 = !{!674, !677, !678}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !671, file: !672, line: 32, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !505)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !671, file: !672, line: 33, baseType: !7, size: 32, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !671, file: !672, line: 34, baseType: !7, size: 32, offset: 96)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !580, file: !6, line: 3381, baseType: !680, size: 384)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !6, line: 2507, size: 384, elements: !681)
!681 = !{!682, !683, !688, !689, !690}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !680, file: !6, line: 2508, baseType: !616, size: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !680, file: !6, line: 2509, baseType: !684, size: 32, offset: 192)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !685, line: 58, baseType: !686)
!685 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !687, line: 44, baseType: !7)
!687 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!688 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !680, file: !6, line: 2510, baseType: !7, size: 32, offset: 224)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !680, file: !6, line: 2511, baseType: !578, size: 64, offset: 256)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !680, file: !6, line: 2512, baseType: !578, size: 64, offset: 320)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !580, file: !6, line: 3382, baseType: !692, size: 896)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !6, line: 2652, size: 896, elements: !693)
!693 = !{!694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !692, file: !6, line: 2653, baseType: !680, size: 384)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !692, file: !6, line: 2654, baseType: !578, size: 64, offset: 384)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !692, file: !6, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !692, file: !6, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !692, file: !6, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !692, file: !6, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !692, file: !6, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !692, file: !6, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !692, file: !6, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !692, file: !6, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !692, file: !6, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !692, file: !6, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !692, file: !6, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !692, file: !6, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !692, file: !6, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !692, file: !6, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !692, file: !6, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !692, file: !6, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !692, file: !6, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !692, file: !6, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !692, file: !6, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !692, file: !6, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !692, file: !6, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !692, file: !6, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !692, file: !6, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !692, file: !6, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !692, file: !6, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !692, file: !6, line: 2703, baseType: !7, size: 32, offset: 512)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !692, file: !6, line: 2705, baseType: !578, size: 64, offset: 576)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !692, file: !6, line: 2706, baseType: !578, size: 64, offset: 640)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !692, file: !6, line: 2707, baseType: !578, size: 64, offset: 704)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !692, file: !6, line: 2708, baseType: !578, size: 64, offset: 768)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !692, file: !6, line: 2711, baseType: !727, size: 64, offset: 832)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !6, line: 2711, flags: DIFlagFwdDecl)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !580, file: !6, line: 3383, baseType: !730, size: 960)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !6, line: 2756, size: 960, elements: !731)
!731 = !{!732, !733}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !730, file: !6, line: 2757, baseType: !692, size: 896)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !730, file: !6, line: 2758, baseType: !734, size: 64, offset: 896)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !515, line: 50, baseType: !735)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !515, line: 49, flags: DIFlagFwdDecl)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !580, file: !6, line: 3384, baseType: !738, size: 1472)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !6, line: 3114, size: 1472, elements: !739)
!739 = !{!740, !761, !762, !763, !764}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !738, file: !6, line: 3115, baseType: !741, size: 1216)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !6, line: 2984, size: 1216, elements: !742)
!742 = !{!743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !741, file: !6, line: 2985, baseType: !730, size: 960)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !741, file: !6, line: 2986, baseType: !578, size: 64, offset: 960)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !741, file: !6, line: 2987, baseType: !578, size: 64, offset: 1024)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !741, file: !6, line: 2988, baseType: !578, size: 64, offset: 1088)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !741, file: !6, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !741, file: !6, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !741, file: !6, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !741, file: !6, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !741, file: !6, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !741, file: !6, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !741, file: !6, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !741, file: !6, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !741, file: !6, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !741, file: !6, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !741, file: !6, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !741, file: !6, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !741, file: !6, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !741, file: !6, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !738, file: !6, line: 3117, baseType: !578, size: 64, offset: 1216)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !738, file: !6, line: 3119, baseType: !578, size: 64, offset: 1280)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !738, file: !6, line: 3121, baseType: !578, size: 64, offset: 1344)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !738, file: !6, line: 3123, baseType: !578, size: 64, offset: 1408)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !580, file: !6, line: 3385, baseType: !766, size: 1088)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !6, line: 2874, size: 1088, elements: !767)
!767 = !{!768, !769, !770}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !766, file: !6, line: 2875, baseType: !730, size: 960)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !766, file: !6, line: 2876, baseType: !734, size: 64, offset: 960)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !766, file: !6, line: 2877, baseType: !771, size: 64, offset: 1024)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !773, line: 172, size: 128, elements: !774)
!773 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!774 = !{!775, !776, !777, !778, !779, !780, !781}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !772, file: !773, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !772, file: !773, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !772, file: !773, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !772, file: !773, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !772, file: !773, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !772, file: !773, line: 195, baseType: !7, size: 32, offset: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !772, file: !773, line: 199, baseType: !578, size: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !580, file: !6, line: 3386, baseType: !741, size: 1216)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !580, file: !6, line: 3387, baseType: !784, size: 1280)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !6, line: 3093, size: 1280, elements: !785)
!785 = !{!786, !787}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !784, file: !6, line: 3094, baseType: !741, size: 1216)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !784, file: !6, line: 3095, baseType: !771, size: 64, offset: 1216)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !580, file: !6, line: 3388, baseType: !789, size: 1216)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !6, line: 2824, size: 1216, elements: !790)
!790 = !{!791, !792, !793, !794, !795, !796}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !789, file: !6, line: 2825, baseType: !692, size: 896)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !789, file: !6, line: 2827, baseType: !578, size: 64, offset: 896)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !789, file: !6, line: 2828, baseType: !578, size: 64, offset: 960)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !789, file: !6, line: 2829, baseType: !578, size: 64, offset: 1024)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !789, file: !6, line: 2830, baseType: !578, size: 64, offset: 1088)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !789, file: !6, line: 2831, baseType: !578, size: 64, offset: 1152)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !580, file: !6, line: 3389, baseType: !798, size: 1024)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !6, line: 2850, size: 1024, elements: !799)
!799 = !{!800, !801, !802}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !798, file: !6, line: 2851, baseType: !730, size: 960)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !798, file: !6, line: 2852, baseType: !506, size: 32, offset: 960)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !798, file: !6, line: 2853, baseType: !506, size: 32, offset: 992)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !580, file: !6, line: 3390, baseType: !804, size: 1024)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !6, line: 2857, size: 1024, elements: !805)
!805 = !{!806, !807}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !804, file: !6, line: 2858, baseType: !730, size: 960)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !804, file: !6, line: 2859, baseType: !771, size: 64, offset: 960)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !580, file: !6, line: 3391, baseType: !809, size: 960)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !6, line: 2862, size: 960, elements: !810)
!810 = !{!811}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !809, file: !6, line: 2863, baseType: !730, size: 960)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !580, file: !6, line: 3392, baseType: !813, size: 1472)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !6, line: 3304, size: 1472, elements: !814)
!814 = !{!815}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !813, file: !6, line: 3305, baseType: !738, size: 1472)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !580, file: !6, line: 3393, baseType: !817, size: 1792)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !6, line: 3248, size: 1792, elements: !818)
!818 = !{!819, !820, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !817, file: !6, line: 3249, baseType: !738, size: 1472)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !817, file: !6, line: 3251, baseType: !821, size: 64, offset: 1472)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !823, line: 463, size: 1152, elements: !824)
!823 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!824 = !{!825, !828, !1143, !1144, !1258, !1261, !1262, !1263, !1264, !1265, !1266, !1290, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !822, file: !823, line: 464, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !823, line: 464, flags: DIFlagFwdDecl)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !822, file: !823, line: 467, baseType: !829, size: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !202, line: 374, size: 640, elements: !831)
!831 = !{!832, !1118, !1119, !1132, !1133, !1134, !1135, !1136, !1137, !1139, !1141, !1142}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !830, file: !202, line: 377, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !515, line: 111, baseType: !834)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !202, line: 217, size: 832, elements: !836)
!836 = !{!837, !1083, !1084, !1085, !1088, !1092, !1093, !1094, !1112, !1113, !1114, !1115, !1116, !1117}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !835, file: !202, line: 219, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !202, line: 151, baseType: !840)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !202, line: 151, size: 128, elements: !841)
!841 = !{!842}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !840, file: !202, line: 151, baseType: !843, size: 128)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !202, line: 150, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !202, line: 150, size: 128, elements: !845)
!845 = !{!846, !847, !848}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !844, file: !202, line: 150, baseType: !7, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !844, file: !202, line: 150, baseType: !7, size: 32, offset: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !844, file: !202, line: 150, baseType: !849, size: 64, offset: 64)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !850, size: 64, elements: !658)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !515, line: 108, baseType: !851)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !202, line: 122, size: 512, elements: !853)
!853 = !{!854, !855, !856, !1075, !1076, !1077, !1078, !1079, !1080, !1081}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !852, file: !202, line: 124, baseType: !834, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !852, file: !202, line: 125, baseType: !834, size: 64, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !852, file: !202, line: 131, baseType: !857, size: 64, offset: 128)
!857 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !202, line: 128, size: 64, elements: !858)
!858 = !{!859, !1074}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !857, file: !202, line: 129, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !515, line: 66, baseType: !861)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !433, line: 143, size: 192, elements: !863)
!863 = !{!864, !1072, !1073}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !862, file: !433, line: 145, baseType: !865, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !515, line: 69, baseType: !866)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !433, line: 136, size: 192, elements: !868)
!868 = !{!869, !1070, !1071}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !867, file: !433, line: 137, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !515, line: 58, baseType: !871)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !433, line: 737, size: 768, elements: !873)
!873 = !{!874, !891, !925, !931, !936, !941, !948, !954, !960, !965, !979, !984, !990, !995, !1005, !1010, !1028, !1035, !1042, !1048, !1053, !1059, !1065}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !872, file: !433, line: 738, baseType: !875, size: 256)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !433, line: 271, size: 256, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !875, file: !433, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !875, file: !433, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !875, file: !433, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !875, file: !433, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !875, file: !433, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !875, file: !433, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !875, file: !433, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !875, file: !433, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !875, file: !433, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !875, file: !433, line: 312, baseType: !7, size: 32, offset: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !875, file: !433, line: 316, baseType: !684, size: 32, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !875, file: !433, line: 319, baseType: !7, size: 32, offset: 96)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !875, file: !433, line: 323, baseType: !834, size: 64, offset: 128)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !875, file: !433, line: 327, baseType: !578, size: 64, offset: 192)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !872, file: !433, line: 739, baseType: !892, size: 448)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !433, line: 350, size: 448, elements: !893)
!893 = !{!894, !923}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !892, file: !433, line: 353, baseType: !895, size: 384)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !433, line: 333, size: 384, elements: !896)
!896 = !{!897, !898, !906}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !895, file: !433, line: 336, baseType: !875, size: 256)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !895, file: !433, line: 343, baseType: !899, size: 64, offset: 256)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !901, line: 37, size: 128, elements: !902)
!901 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!902 = !{!903, !904}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !900, file: !901, line: 39, baseType: !899, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !900, file: !901, line: 40, baseType: !905, size: 64, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !895, file: !433, line: 344, baseType: !907, size: 64, offset: 320)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !901, line: 45, size: 320, elements: !909)
!909 = !{!910, !911}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !908, file: !901, line: 47, baseType: !907, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !908, file: !901, line: 48, baseType: !912, size: 256, offset: 64)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !6, line: 1883, size: 256, elements: !913)
!913 = !{!914, !916, !917, !922}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !912, file: !6, line: 1884, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !912, file: !6, line: 1885, baseType: !915, size: 64, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !912, file: !6, line: 1891, baseType: !918, size: 64, offset: 128)
!918 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !912, file: !6, line: 1891, size: 64, elements: !919)
!919 = !{!920, !921}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !918, file: !6, line: 1891, baseType: !870, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !918, file: !6, line: 1891, baseType: !578, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !912, file: !6, line: 1892, baseType: !905, size: 64, offset: 192)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !892, file: !433, line: 359, baseType: !924, size: 64, offset: 384)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 64, elements: !658)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !872, file: !433, line: 740, baseType: !926, size: 512)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !433, line: 365, size: 512, elements: !927)
!927 = !{!928, !929, !930}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !926, file: !433, line: 368, baseType: !895, size: 384)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !926, file: !433, line: 373, baseType: !578, size: 64, offset: 384)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !926, file: !433, line: 374, baseType: !578, size: 64, offset: 448)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !872, file: !433, line: 741, baseType: !932, size: 576)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !433, line: 380, size: 576, elements: !933)
!933 = !{!934, !935}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !932, file: !433, line: 383, baseType: !926, size: 512)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !932, file: !433, line: 389, baseType: !924, size: 64, offset: 512)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !872, file: !433, line: 742, baseType: !937, size: 320)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !433, line: 395, size: 320, elements: !938)
!938 = !{!939, !940}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !937, file: !433, line: 397, baseType: !875, size: 256)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !937, file: !433, line: 400, baseType: !860, size: 64, offset: 256)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !872, file: !433, line: 743, baseType: !942, size: 448)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !433, line: 406, size: 448, elements: !943)
!943 = !{!944, !945, !946, !947}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !942, file: !433, line: 408, baseType: !875, size: 256)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !942, file: !433, line: 412, baseType: !578, size: 64, offset: 256)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !942, file: !433, line: 420, baseType: !578, size: 64, offset: 320)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !942, file: !433, line: 423, baseType: !860, size: 64, offset: 384)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !872, file: !433, line: 744, baseType: !949, size: 384)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !433, line: 429, size: 384, elements: !950)
!950 = !{!951, !952, !953}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !949, file: !433, line: 431, baseType: !875, size: 256)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !949, file: !433, line: 434, baseType: !578, size: 64, offset: 256)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !949, file: !433, line: 437, baseType: !860, size: 64, offset: 320)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !872, file: !433, line: 745, baseType: !955, size: 384)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !433, line: 443, size: 384, elements: !956)
!956 = !{!957, !958, !959}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !955, file: !433, line: 445, baseType: !875, size: 256)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !955, file: !433, line: 449, baseType: !578, size: 64, offset: 256)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !955, file: !433, line: 453, baseType: !860, size: 64, offset: 320)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !872, file: !433, line: 746, baseType: !961, size: 320)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !433, line: 459, size: 320, elements: !962)
!962 = !{!963, !964}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !961, file: !433, line: 461, baseType: !875, size: 256)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !961, file: !433, line: 464, baseType: !578, size: 64, offset: 256)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !872, file: !433, line: 747, baseType: !966, size: 768)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !433, line: 469, size: 768, elements: !967)
!967 = !{!968, !969, !970, !971, !972}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !966, file: !433, line: 471, baseType: !875, size: 256)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !966, file: !433, line: 474, baseType: !7, size: 32, offset: 256)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !966, file: !433, line: 475, baseType: !7, size: 32, offset: 288)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !966, file: !433, line: 478, baseType: !578, size: 64, offset: 320)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !966, file: !433, line: 481, baseType: !973, size: 384, offset: 384)
!973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !974, size: 384, elements: !658)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !6, line: 1917, size: 384, elements: !975)
!975 = !{!976, !977, !978}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !974, file: !6, line: 1920, baseType: !912, size: 256)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !974, file: !6, line: 1921, baseType: !578, size: 64, offset: 256)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !974, file: !6, line: 1922, baseType: !684, size: 32, offset: 320)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !872, file: !433, line: 748, baseType: !980, size: 320)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !433, line: 487, size: 320, elements: !981)
!981 = !{!982, !983}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !980, file: !433, line: 490, baseType: !875, size: 256)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !980, file: !433, line: 494, baseType: !506, size: 32, offset: 256)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !872, file: !433, line: 749, baseType: !985, size: 384)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !433, line: 500, size: 384, elements: !986)
!986 = !{!987, !988, !989}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !985, file: !433, line: 502, baseType: !875, size: 256)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !985, file: !433, line: 506, baseType: !860, size: 64, offset: 256)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !985, file: !433, line: 510, baseType: !860, size: 64, offset: 320)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !872, file: !433, line: 750, baseType: !991, size: 320)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !433, line: 529, size: 320, elements: !992)
!992 = !{!993, !994}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !991, file: !433, line: 531, baseType: !875, size: 256)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !991, file: !433, line: 540, baseType: !860, size: 64, offset: 256)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !872, file: !433, line: 751, baseType: !996, size: 704)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !433, line: 546, size: 704, elements: !997)
!997 = !{!998, !999, !1000, !1001, !1002, !1003, !1004}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !996, file: !433, line: 549, baseType: !926, size: 512)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !996, file: !433, line: 553, baseType: !511, size: 64, offset: 512)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !996, file: !433, line: 557, baseType: !505, size: 8, offset: 576)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !996, file: !433, line: 558, baseType: !505, size: 8, offset: 584)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !996, file: !433, line: 559, baseType: !505, size: 8, offset: 592)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !996, file: !433, line: 560, baseType: !505, size: 8, offset: 600)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !996, file: !433, line: 566, baseType: !924, size: 64, offset: 640)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !872, file: !433, line: 752, baseType: !1006, size: 384)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !433, line: 571, size: 384, elements: !1007)
!1007 = !{!1008, !1009}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1006, file: !433, line: 573, baseType: !937, size: 320)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1006, file: !433, line: 577, baseType: !578, size: 64, offset: 320)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !872, file: !433, line: 753, baseType: !1011, size: 576)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !433, line: 600, size: 576, elements: !1012)
!1012 = !{!1013, !1014, !1015, !1018, !1027}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1011, file: !433, line: 602, baseType: !937, size: 320)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1011, file: !433, line: 605, baseType: !578, size: 64, offset: 320)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1011, file: !433, line: 609, baseType: !1016, size: 64, offset: 384)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1017, line: 46, baseType: !532)
!1017 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1011, file: !433, line: 612, baseType: !1019, size: 64, offset: 448)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !433, line: 581, size: 320, elements: !1021)
!1021 = !{!1022, !1023, !1024, !1025, !1026}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1020, file: !433, line: 583, baseType: !5, size: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1020, file: !433, line: 586, baseType: !578, size: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1020, file: !433, line: 589, baseType: !578, size: 64, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1020, file: !433, line: 592, baseType: !578, size: 64, offset: 192)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1020, file: !433, line: 595, baseType: !578, size: 64, offset: 256)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1011, file: !433, line: 616, baseType: !860, size: 64, offset: 512)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !872, file: !433, line: 754, baseType: !1029, size: 512)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !433, line: 622, size: 512, elements: !1030)
!1030 = !{!1031, !1032, !1033, !1034}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1029, file: !433, line: 624, baseType: !937, size: 320)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1029, file: !433, line: 628, baseType: !578, size: 64, offset: 320)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1029, file: !433, line: 632, baseType: !578, size: 64, offset: 384)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1029, file: !433, line: 636, baseType: !578, size: 64, offset: 448)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !872, file: !433, line: 755, baseType: !1036, size: 704)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !433, line: 642, size: 704, elements: !1037)
!1037 = !{!1038, !1039, !1040, !1041}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1036, file: !433, line: 644, baseType: !1029, size: 512)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1036, file: !433, line: 648, baseType: !578, size: 64, offset: 512)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1036, file: !433, line: 652, baseType: !578, size: 64, offset: 576)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1036, file: !433, line: 653, baseType: !578, size: 64, offset: 640)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !872, file: !433, line: 756, baseType: !1043, size: 448)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !433, line: 663, size: 448, elements: !1044)
!1044 = !{!1045, !1046, !1047}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1043, file: !433, line: 665, baseType: !937, size: 320)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1043, file: !433, line: 668, baseType: !578, size: 64, offset: 320)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1043, file: !433, line: 673, baseType: !578, size: 64, offset: 384)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !872, file: !433, line: 757, baseType: !1049, size: 384)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !433, line: 694, size: 384, elements: !1050)
!1050 = !{!1051, !1052}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1049, file: !433, line: 696, baseType: !937, size: 320)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1049, file: !433, line: 699, baseType: !578, size: 64, offset: 320)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !872, file: !433, line: 758, baseType: !1054, size: 384)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !433, line: 681, size: 384, elements: !1055)
!1055 = !{!1056, !1057, !1058}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1054, file: !433, line: 683, baseType: !875, size: 256)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1054, file: !433, line: 686, baseType: !578, size: 64, offset: 256)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1054, file: !433, line: 689, baseType: !578, size: 64, offset: 320)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !872, file: !433, line: 759, baseType: !1060, size: 384)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !433, line: 707, size: 384, elements: !1061)
!1061 = !{!1062, !1063, !1064}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1060, file: !433, line: 709, baseType: !875, size: 256)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1060, file: !433, line: 712, baseType: !578, size: 64, offset: 256)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1060, file: !433, line: 712, baseType: !578, size: 64, offset: 320)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !872, file: !433, line: 760, baseType: !1066, size: 320)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !433, line: 718, size: 320, elements: !1067)
!1067 = !{!1068, !1069}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1066, file: !433, line: 720, baseType: !875, size: 256)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1066, file: !433, line: 723, baseType: !578, size: 64, offset: 256)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !867, file: !433, line: 138, baseType: !866, size: 64, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !867, file: !433, line: 139, baseType: !866, size: 64, offset: 128)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !862, file: !433, line: 146, baseType: !865, size: 64, offset: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !862, file: !433, line: 152, baseType: !860, size: 64, offset: 128)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !857, file: !202, line: 130, baseType: !734, size: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !852, file: !202, line: 134, baseType: !510, size: 64, offset: 192)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !852, file: !202, line: 137, baseType: !578, size: 64, offset: 256)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !852, file: !202, line: 138, baseType: !684, size: 32, offset: 320)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !852, file: !202, line: 142, baseType: !7, size: 32, offset: 352)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !852, file: !202, line: 144, baseType: !506, size: 32, offset: 384)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !852, file: !202, line: 145, baseType: !506, size: 32, offset: 416)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !852, file: !202, line: 146, baseType: !1082, size: 64, offset: 448)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !202, line: 119, baseType: !549)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !835, file: !202, line: 220, baseType: !838, size: 64, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !835, file: !202, line: 223, baseType: !510, size: 64, offset: 128)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !835, file: !202, line: 226, baseType: !1086, size: 64, offset: 192)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !202, line: 185, flags: DIFlagFwdDecl)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !835, file: !202, line: 229, baseType: !1089, size: 128, offset: 256)
!1089 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1090, size: 128, elements: !533)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !202, line: 229, flags: DIFlagFwdDecl)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !835, file: !202, line: 232, baseType: !834, size: 64, offset: 384)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !835, file: !202, line: 233, baseType: !834, size: 64, offset: 448)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !835, file: !202, line: 238, baseType: !1095, size: 64, offset: 512)
!1095 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !202, line: 235, size: 64, elements: !1096)
!1096 = !{!1097, !1103}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1095, file: !202, line: 236, baseType: !1098, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !202, line: 273, size: 128, elements: !1100)
!1100 = !{!1101, !1102}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1099, file: !202, line: 275, baseType: !860, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1099, file: !202, line: 278, baseType: !860, size: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1095, file: !202, line: 237, baseType: !1104, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !202, line: 259, size: 320, elements: !1106)
!1106 = !{!1107, !1108, !1109, !1110, !1111}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1105, file: !202, line: 261, baseType: !734, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1105, file: !202, line: 262, baseType: !734, size: 64, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1105, file: !202, line: 266, baseType: !734, size: 64, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1105, file: !202, line: 267, baseType: !734, size: 64, offset: 192)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1105, file: !202, line: 270, baseType: !506, size: 32, offset: 256)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !835, file: !202, line: 241, baseType: !1082, size: 64, offset: 576)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !835, file: !202, line: 244, baseType: !506, size: 32, offset: 640)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !835, file: !202, line: 247, baseType: !506, size: 32, offset: 672)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !835, file: !202, line: 250, baseType: !506, size: 32, offset: 704)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !835, file: !202, line: 253, baseType: !506, size: 32, offset: 736)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !835, file: !202, line: 256, baseType: !506, size: 32, offset: 768)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !830, file: !202, line: 378, baseType: !833, size: 64, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !830, file: !202, line: 381, baseType: !1120, size: 64, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !202, line: 282, baseType: !1122)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !202, line: 282, size: 128, elements: !1123)
!1123 = !{!1124}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1122, file: !202, line: 282, baseType: !1125, size: 128)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !202, line: 281, baseType: !1126)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !202, line: 281, size: 128, elements: !1127)
!1127 = !{!1128, !1129, !1130}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1126, file: !202, line: 281, baseType: !7, size: 32)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1126, file: !202, line: 281, baseType: !7, size: 32, offset: 32)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1126, file: !202, line: 281, baseType: !1131, size: 64, offset: 64)
!1131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !833, size: 64, elements: !658)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !830, file: !202, line: 384, baseType: !506, size: 32, offset: 192)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !830, file: !202, line: 387, baseType: !506, size: 32, offset: 224)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !830, file: !202, line: 390, baseType: !506, size: 32, offset: 256)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !830, file: !202, line: 394, baseType: !1120, size: 64, offset: 320)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !830, file: !202, line: 396, baseType: !201, size: 32, offset: 384)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !830, file: !202, line: 399, baseType: !1138, size: 64, offset: 416)
!1138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 64, elements: !533)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !830, file: !202, line: 402, baseType: !1140, size: 64, offset: 480)
!1140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !533)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !830, file: !202, line: 406, baseType: !506, size: 32, offset: 544)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !830, file: !202, line: 409, baseType: !506, size: 32, offset: 576)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !822, file: !823, line: 470, baseType: !861, size: 64, offset: 128)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !822, file: !823, line: 473, baseType: !1145, size: 64, offset: 192)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !773, line: 39, size: 1152, elements: !1147)
!1147 = !{!1148, !1198, !1211, !1223, !1224, !1235, !1236, !1240, !1241, !1242, !1243, !1244}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1146, file: !773, line: 41, baseType: !1149, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1150, line: 144, baseType: !1151)
!1150 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1150, line: 100, size: 896, elements: !1153)
!1153 = !{!1154, !1162, !1167, !1172, !1174, !1175, !1176, !1177, !1178, !1179, !1184, !1186, !1187, !1192, !1197}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1152, file: !1150, line: 102, baseType: !1155, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1150, line: 52, baseType: !1156)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!1159, !1160}
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1150, line: 47, baseType: !7)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1152, file: !1150, line: 105, baseType: !1163, size: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1150, line: 59, baseType: !1164)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!506, !1160, !1160}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1152, file: !1150, line: 108, baseType: !1168, size: 64, offset: 128)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1150, line: 63, baseType: !1169)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{null, !510}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1152, file: !1150, line: 111, baseType: !1173, size: 64, offset: 192)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1152, file: !1150, line: 114, baseType: !1016, size: 64, offset: 256)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1152, file: !1150, line: 117, baseType: !1016, size: 64, offset: 320)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1152, file: !1150, line: 120, baseType: !1016, size: 64, offset: 384)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1152, file: !1150, line: 124, baseType: !7, size: 32, offset: 448)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1152, file: !1150, line: 128, baseType: !7, size: 32, offset: 480)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1152, file: !1150, line: 131, baseType: !1180, size: 64, offset: 512)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1150, line: 75, baseType: !1181)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!510, !1016, !1016}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1152, file: !1150, line: 132, baseType: !1185, size: 64, offset: 576)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1150, line: 78, baseType: !1169)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1152, file: !1150, line: 135, baseType: !510, size: 64, offset: 640)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1152, file: !1150, line: 136, baseType: !1188, size: 64, offset: 704)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1150, line: 82, baseType: !1189)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DISubroutineType(types: !1191)
!1191 = !{!510, !510, !1016, !1016}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1152, file: !1150, line: 137, baseType: !1193, size: 64, offset: 768)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1150, line: 83, baseType: !1194)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = !DISubroutineType(types: !1196)
!1196 = !{null, !510, !510}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1152, file: !1150, line: 141, baseType: !7, size: 32, offset: 832)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1146, file: !773, line: 48, baseType: !1199, size: 64, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !433, line: 35, baseType: !1201)
!1201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !433, line: 35, size: 128, elements: !1202)
!1202 = !{!1203}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1201, file: !433, line: 35, baseType: !1204, size: 128)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !433, line: 33, baseType: !1205)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !433, line: 33, size: 128, elements: !1206)
!1206 = !{!1207, !1208, !1209}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1205, file: !433, line: 33, baseType: !7, size: 32)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1205, file: !433, line: 33, baseType: !7, size: 32, offset: 32)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1205, file: !433, line: 33, baseType: !1210, size: 64, offset: 64)
!1210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !870, size: 64, elements: !658)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1146, file: !773, line: 51, baseType: !1212, size: 64, offset: 128)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !6, line: 183, baseType: !1214)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !6, line: 183, size: 128, elements: !1215)
!1215 = !{!1216}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1214, file: !6, line: 183, baseType: !1217, size: 128)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !6, line: 182, baseType: !1218)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !6, line: 182, size: 128, elements: !1219)
!1219 = !{!1220, !1221, !1222}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1218, file: !6, line: 182, baseType: !7, size: 32)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1218, file: !6, line: 182, baseType: !7, size: 32, offset: 32)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1218, file: !6, line: 182, baseType: !924, size: 64, offset: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1146, file: !773, line: 54, baseType: !578, size: 64, offset: 192)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1146, file: !773, line: 57, baseType: !1225, size: 128, offset: 256)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1226, line: 31, size: 128, elements: !1227)
!1226 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1227 = !{!1228, !1229, !1230, !1231, !1232, !1233, !1234}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1225, file: !1226, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1225, file: !1226, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1225, file: !1226, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1225, file: !1226, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1225, file: !1226, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1225, file: !1226, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1225, file: !1226, line: 56, baseType: !514, size: 64, offset: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1146, file: !773, line: 60, baseType: !1225, size: 128, offset: 384)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1146, file: !773, line: 64, baseType: !1237, size: 64, offset: 512)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64)
!1238 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1239, line: 33, flags: DIFlagFwdDecl)
!1239 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1146, file: !773, line: 67, baseType: !578, size: 64, offset: 576)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1146, file: !773, line: 73, baseType: !1149, size: 64, offset: 640)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1146, file: !773, line: 77, baseType: !514, size: 64, offset: 704)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1146, file: !773, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1146, file: !773, line: 82, baseType: !1245, size: 320, offset: 832)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !901, line: 62, size: 320, elements: !1246)
!1246 = !{!1247, !1253, !1254, !1255, !1256, !1257}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1245, file: !901, line: 63, baseType: !1248, size: 64)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !901, line: 56, size: 128, elements: !1250)
!1250 = !{!1251, !1252}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1249, file: !901, line: 57, baseType: !1248, size: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1249, file: !901, line: 58, baseType: !657, size: 8, offset: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1245, file: !901, line: 64, baseType: !7, size: 32, offset: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1245, file: !901, line: 66, baseType: !7, size: 32, offset: 96)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1245, file: !901, line: 68, baseType: !505, size: 8, offset: 128)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1245, file: !901, line: 70, baseType: !899, size: 64, offset: 192)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1245, file: !901, line: 71, baseType: !907, size: 64, offset: 256)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !822, file: !823, line: 476, baseType: !1259, size: 64, offset: 256)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !823, line: 476, flags: DIFlagFwdDecl)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !822, file: !823, line: 479, baseType: !1149, size: 64, offset: 320)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !822, file: !823, line: 484, baseType: !578, size: 64, offset: 384)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !822, file: !823, line: 488, baseType: !578, size: 64, offset: 448)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !822, file: !823, line: 493, baseType: !578, size: 64, offset: 512)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !822, file: !823, line: 496, baseType: !578, size: 64, offset: 576)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !822, file: !823, line: 501, baseType: !1267, size: 64, offset: 640)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !213, line: 2355, size: 576, elements: !1269)
!1269 = !{!1270, !1273, !1274, !1275, !1276, !1278, !1279, !1284, !1285, !1286, !1287, !1288, !1289}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1268, file: !213, line: 2356, baseType: !1271, size: 64)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !213, line: 2356, flags: DIFlagFwdDecl)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1268, file: !213, line: 2357, baseType: !511, size: 64, offset: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1268, file: !213, line: 2358, baseType: !506, size: 32, offset: 128)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1268, file: !213, line: 2359, baseType: !506, size: 32, offset: 160)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1268, file: !213, line: 2360, baseType: !1277, size: 128, offset: 192)
!1277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 128, elements: !558)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1268, file: !213, line: 2364, baseType: !506, size: 32, offset: 320)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1268, file: !213, line: 2367, baseType: !1280, size: 128, offset: 384)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !213, line: 2349, size: 128, elements: !1281)
!1281 = !{!1282, !1283}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1280, file: !213, line: 2351, baseType: !734, size: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1280, file: !213, line: 2352, baseType: !549, size: 64, offset: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1268, file: !213, line: 2371, baseType: !212, size: 32, offset: 512)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1268, file: !213, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1268, file: !213, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1268, file: !213, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1268, file: !213, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1268, file: !213, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !822, file: !823, line: 504, baseType: !1291, size: 64, offset: 704)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64)
!1292 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !823, line: 504, flags: DIFlagFwdDecl)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !822, file: !823, line: 507, baseType: !1149, size: 64, offset: 768)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !822, file: !823, line: 510, baseType: !506, size: 32, offset: 832)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !822, file: !823, line: 513, baseType: !506, size: 32, offset: 864)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !822, file: !823, line: 516, baseType: !684, size: 32, offset: 896)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !822, file: !823, line: 519, baseType: !684, size: 32, offset: 928)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !822, file: !823, line: 522, baseType: !7, size: 32, offset: 960)
