; ModuleID = 'tree-profile.bc'
source_filename = "tree-profile.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.profile_hooks = type { void ()*, void (i32, %struct.edge_def*)*, void (%struct.histogram_value_t*, i32, i32)*, void (%struct.histogram_value_t*, i32, i32)*, void (%struct.histogram_value_t*, i32, i32)*, void (%struct.histogram_value_t*, i32, i32)*, void (%struct.histogram_value_t*, i32, i32)*, void (%struct.histogram_value_t*, i32, i32)*, void (%struct.histogram_value_t*, i32, i32)* }
%struct.edge_def = type { %struct.basic_block_def*, %struct.basic_block_def*, %union.edge_def_insns, i8*, %union.tree_node*, i32, i32, i32, i32, i64 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }

!546 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!547 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!548 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!549 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!550 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!551 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!552 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!553 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!554 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!555 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!556 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!557 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!558 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!559 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!560 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hist_type", file: !561, line: 24, baseType: !7, size: 32, elements: !562)
!561 = !DIFile(filename: "./value-prof.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!562 = !{!563, !564, !565, !566, !567, !568, !569}
!563 = !DIEnumerator(name: "HIST_TYPE_INTERVAL", value: 0, isUnsigned: true)
!564 = !DIEnumerator(name: "HIST_TYPE_POW2", value: 1, isUnsigned: true)
!565 = !DIEnumerator(name: "HIST_TYPE_SINGLE_VALUE", value: 2, isUnsigned: true)
!566 = !DIEnumerator(name: "HIST_TYPE_CONST_DELTA", value: 3, isUnsigned: true)
!567 = !DIEnumerator(name: "HIST_TYPE_INDIR_CALL", value: 4, isUnsigned: true)
!568 = !DIEnumerator(name: "HIST_TYPE_AVERAGE", value: 5, isUnsigned: true)
!569 = !DIEnumerator(name: "HIST_TYPE_IOR", value: 6, isUnsigned: true)
!570 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !571, line: 309, baseType: !7, size: 32, elements: !572)
!571 = !DIFile(filename: "./cgraph.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!572 = !{!573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592}
!573 = !DIEnumerator(name: "CIF_OK", value: 0, isUnsigned: true)
!574 = !DIEnumerator(name: "CIF_UNSPECIFIED", value: 1, isUnsigned: true)
!575 = !DIEnumerator(name: "CIF_FUNCTION_NOT_CONSIDERED", value: 2, isUnsigned: true)
!576 = !DIEnumerator(name: "CIF_BODY_NOT_AVAILABLE", value: 3, isUnsigned: true)
!577 = !DIEnumerator(name: "CIF_REDEFINED_EXTERN_INLINE", value: 4, isUnsigned: true)
!578 = !DIEnumerator(name: "CIF_FUNCTION_NOT_INLINABLE", value: 5, isUnsigned: true)
!579 = !DIEnumerator(name: "CIF_FUNCTION_NOT_INLINE_CANDIDATE", value: 6, isUnsigned: true)
!580 = !DIEnumerator(name: "CIF_LARGE_FUNCTION_GROWTH_LIMIT", value: 7, isUnsigned: true)
!581 = !DIEnumerator(name: "CIF_LARGE_STACK_FRAME_GROWTH_LIMIT", value: 8, isUnsigned: true)
!582 = !DIEnumerator(name: "CIF_MAX_INLINE_INSNS_SINGLE_LIMIT", value: 9, isUnsigned: true)
!583 = !DIEnumerator(name: "CIF_MAX_INLINE_INSNS_AUTO_LIMIT", value: 10, isUnsigned: true)
!584 = !DIEnumerator(name: "CIF_INLINE_UNIT_GROWTH_LIMIT", value: 11, isUnsigned: true)
!585 = !DIEnumerator(name: "CIF_RECURSIVE_INLINING", value: 12, isUnsigned: true)
!586 = !DIEnumerator(name: "CIF_UNLIKELY_CALL", value: 13, isUnsigned: true)
!587 = !DIEnumerator(name: "CIF_NOT_DECLARED_INLINED", value: 14, isUnsigned: true)
!588 = !DIEnumerator(name: "CIF_OPTIMIZING_FOR_SIZE", value: 15, isUnsigned: true)
!589 = !DIEnumerator(name: "CIF_TARGET_OPTION_MISMATCH", value: 16, isUnsigned: true)
!590 = !DIEnumerator(name: "CIF_MISMATCHED_ARGUMENTS", value: 17, isUnsigned: true)
!591 = !DIEnumerator(name: "CIF_ORIGINALLY_INDIRECT_CALL", value: 18, isUnsigned: true)
!592 = !DIEnumerator(name: "CIF_N_REASONS", value: 19, isUnsigned: true)
!593 = !{!594, !595, !596, !597, !600, !601, !603, !730, !366}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!596 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !599)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !604, line: 56, baseType: !605)
!604 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !334, line: 3371, size: 1792, elements: !607)
!607 = !{!608, !641, !647, !660, !679, !690, !695, !704, !710, !723, !735, !773, !1266, !1294, !1311, !1312, !1317, !1326, !1332, !1337, !1341, !1345, !1582, !1629, !1635, !1641, !1648, !1661, !1675, !1692, !1704, !1726, !1741, !1913}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !606, file: !334, line: 3372, baseType: !609, size: 64)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !334, line: 360, size: 64, elements: !610)
!610 = !{!611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !609, file: !334, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !609, file: !334, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !609, file: !334, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !609, file: !334, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !609, file: !334, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !609, file: !334, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !609, file: !334, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !609, file: !334, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !609, file: !334, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !609, file: !334, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !609, file: !334, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !609, file: !334, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !609, file: !334, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !609, file: !334, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !609, file: !334, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !609, file: !334, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !609, file: !334, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !609, file: !334, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !609, file: !334, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !609, file: !334, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !609, file: !334, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !609, file: !334, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !609, file: !334, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !609, file: !334, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !609, file: !334, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !609, file: !334, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !609, file: !334, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !609, file: !334, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !609, file: !334, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !609, file: !334, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !606, file: !334, line: 3373, baseType: !642, size: 192)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !334, line: 402, size: 192, elements: !643)
!643 = !{!644, !645, !646}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !642, file: !334, line: 403, baseType: !609, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !642, file: !334, line: 404, baseType: !603, size: 64, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !642, file: !334, line: 405, baseType: !603, size: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !606, file: !334, line: 3374, baseType: !648, size: 320)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !334, line: 1384, size: 320, elements: !649)
!649 = !{!650, !651}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !648, file: !334, line: 1385, baseType: !642, size: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !648, file: !334, line: 1386, baseType: !652, size: 128, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !653, line: 58, baseType: !654)
!653 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !653, line: 54, size: 128, elements: !655)
!655 = !{!656, !658}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !654, file: !653, line: 56, baseType: !657, size: 64)
!657 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !654, file: !653, line: 57, baseType: !659, size: 64, offset: 64)
!659 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !606, file: !334, line: 3375, baseType: !661, size: 256)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !334, line: 1397, size: 256, elements: !662)
!662 = !{!663, !664}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !661, file: !334, line: 1398, baseType: !642, size: 192)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !661, file: !334, line: 1399, baseType: !665, size: 64, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !667, line: 52, size: 256, elements: !668)
!667 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!668 = !{!669, !670, !671, !672, !673, !674, !675}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !666, file: !667, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !666, file: !667, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !666, file: !667, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !666, file: !667, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !666, file: !667, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !666, file: !667, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !666, file: !667, line: 62, baseType: !676, size: 192, offset: 64)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !657, size: 192, elements: !677)
!677 = !{!678}
!678 = !DISubrange(count: 3)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !606, file: !334, line: 3376, baseType: !680, size: 256)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !334, line: 1408, size: 256, elements: !681)
!681 = !{!682, !683}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !680, file: !334, line: 1409, baseType: !642, size: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !680, file: !334, line: 1410, baseType: !684, size: 64, offset: 192)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !686, line: 27, size: 192, elements: !687)
!686 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!687 = !{!688, !689}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !685, file: !686, line: 29, baseType: !652, size: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !685, file: !686, line: 30, baseType: !189, size: 32, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !606, file: !334, line: 3377, baseType: !691, size: 256)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !334, line: 1437, size: 256, elements: !692)
!692 = !{!693, !694}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !691, file: !334, line: 1438, baseType: !642, size: 192)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !691, file: !334, line: 1439, baseType: !603, size: 64, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !606, file: !334, line: 3378, baseType: !696, size: 256)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !334, line: 1418, size: 256, elements: !697)
!697 = !{!698, !699, !700}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !696, file: !334, line: 1419, baseType: !642, size: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !696, file: !334, line: 1420, baseType: !596, size: 32, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !696, file: !334, line: 1421, baseType: !701, size: 8, offset: 224)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !599, size: 8, elements: !702)
!702 = !{!703}
!703 = !DISubrange(count: 1)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !606, file: !334, line: 3379, baseType: !705, size: 320)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !334, line: 1428, size: 320, elements: !706)
!706 = !{!707, !708, !709}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !705, file: !334, line: 1429, baseType: !642, size: 192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !705, file: !334, line: 1430, baseType: !603, size: 64, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !705, file: !334, line: 1431, baseType: !603, size: 64, offset: 256)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !606, file: !334, line: 3380, baseType: !711, size: 320)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !334, line: 1460, size: 320, elements: !712)
!712 = !{!713, !714}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !711, file: !334, line: 1461, baseType: !642, size: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !711, file: !334, line: 1462, baseType: !715, size: 128, offset: 192)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !716, line: 31, size: 128, elements: !717)
!716 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!717 = !{!718, !721, !722}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !715, file: !716, line: 32, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !595)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !715, file: !716, line: 33, baseType: !7, size: 32, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !715, file: !716, line: 34, baseType: !7, size: 32, offset: 96)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !606, file: !334, line: 3381, baseType: !724, size: 384)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !334, line: 2507, size: 384, elements: !725)
!725 = !{!726, !727, !732, !733, !734}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !724, file: !334, line: 2508, baseType: !642, size: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !724, file: !334, line: 2509, baseType: !728, size: 32, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !729, line: 58, baseType: !730)
!729 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !731, line: 44, baseType: !7)
!731 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!732 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !724, file: !334, line: 2510, baseType: !7, size: 32, offset: 224)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !724, file: !334, line: 2511, baseType: !603, size: 64, offset: 256)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !724, file: !334, line: 2512, baseType: !603, size: 64, offset: 320)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !606, file: !334, line: 3382, baseType: !736, size: 896)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !334, line: 2652, size: 896, elements: !737)
!737 = !{!738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !736, file: !334, line: 2653, baseType: !724, size: 384)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !736, file: !334, line: 2654, baseType: !603, size: 64, offset: 384)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !736, file: !334, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !736, file: !334, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !736, file: !334, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !736, file: !334, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !736, file: !334, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !736, file: !334, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !736, file: !334, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !736, file: !334, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !736, file: !334, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !736, file: !334, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !736, file: !334, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !736, file: !334, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !736, file: !334, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !736, file: !334, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !736, file: !334, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !736, file: !334, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !736, file: !334, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !736, file: !334, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !736, file: !334, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !736, file: !334, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !736, file: !334, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !736, file: !334, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !736, file: !334, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !736, file: !334, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !736, file: !334, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !736, file: !334, line: 2703, baseType: !7, size: 32, offset: 512)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !736, file: !334, line: 2705, baseType: !603, size: 64, offset: 576)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !736, file: !334, line: 2706, baseType: !603, size: 64, offset: 640)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !736, file: !334, line: 2707, baseType: !603, size: 64, offset: 704)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !736, file: !334, line: 2708, baseType: !603, size: 64, offset: 768)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !736, file: !334, line: 2711, baseType: !771, size: 64, offset: 832)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !334, line: 2711, flags: DIFlagFwdDecl)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !606, file: !334, line: 3383, baseType: !774, size: 960)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !334, line: 2756, size: 960, elements: !775)
!775 = !{!776, !777}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !774, file: !334, line: 2757, baseType: !736, size: 896)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !774, file: !334, line: 2758, baseType: !778, size: 64, offset: 896)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !604, line: 50, baseType: !779)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !781, line: 240, size: 384, elements: !782)
!781 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!782 = !{!783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !780, file: !781, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !780, file: !781, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !780, file: !781, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !780, file: !781, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !780, file: !781, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !780, file: !781, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !780, file: !781, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !780, file: !781, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !780, file: !781, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !780, file: !781, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !780, file: !781, line: 321, baseType: !794, size: 320, offset: 64)
!794 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !781, line: 315, size: 320, elements: !795)
!795 = !{!796, !1199, !1201, !1264, !1265}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !794, file: !781, line: 316, baseType: !797, size: 64)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 64, elements: !702)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !781, line: 183, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !781, line: 166, size: 64, elements: !800)
!800 = !{!801, !802, !803, !804, !805, !813, !814, !826, !829, !889, !890, !1176, !1189, !1196}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !799, file: !781, line: 168, baseType: !596, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !799, file: !781, line: 169, baseType: !7, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !799, file: !781, line: 170, baseType: !601, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !799, file: !781, line: 171, baseType: !778, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !799, file: !781, line: 172, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !604, line: 53, baseType: !807)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !781, line: 359, size: 128, elements: !809)
!809 = !{!810, !811}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !808, file: !781, line: 360, baseType: !596, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !808, file: !781, line: 361, baseType: !812, size: 64, offset: 64)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !778, size: 64, elements: !702)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !799, file: !781, line: 173, baseType: !189, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !799, file: !781, line: 174, baseType: !815, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !781, line: 133, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !781, line: 115, size: 32, elements: !817)
!817 = !{!818, !819, !820, !821, !822, !823, !824, !825}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !816, file: !781, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !816, file: !781, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !816, file: !781, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !816, file: !781, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !816, file: !781, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !816, file: !781, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !816, file: !781, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !816, file: !781, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !799, file: !781, line: 175, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !781, line: 175, flags: DIFlagFwdDecl)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !799, file: !781, line: 176, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !832, line: 75, size: 256, elements: !833)
!832 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!833 = !{!834, !848, !849, !850}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !831, file: !832, line: 76, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !832, line: 68, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !832, line: 63, size: 320, elements: !838)
!838 = !{!839, !841, !842, !843}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !837, file: !832, line: 64, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !837, file: !832, line: 65, baseType: !840, size: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !837, file: !832, line: 66, baseType: !7, size: 32, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !837, file: !832, line: 67, baseType: !844, size: 128, offset: 192)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !845, size: 128, elements: !846)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !832, line: 29, baseType: !657)
!846 = !{!847}
!847 = !DISubrange(count: 2)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !831, file: !832, line: 77, baseType: !835, size: 64, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !831, file: !832, line: 78, baseType: !7, size: 32, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !831, file: !832, line: 79, baseType: !851, size: 64, offset: 192)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !832, line: 49, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !832, line: 45, size: 832, elements: !854)
!854 = !{!855, !856, !857}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !853, file: !832, line: 46, baseType: !840, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !853, file: !832, line: 47, baseType: !830, size: 64, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !853, file: !832, line: 48, baseType: !858, size: 704, offset: 128)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !859, line: 164, size: 704, elements: !860)
!859 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!860 = !{!861, !862, !872, !873, !874, !875, !876, !877, !881, !885, !886, !887, !888}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !858, file: !859, line: 166, baseType: !659, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !858, file: !859, line: 167, baseType: !863, size: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !859, line: 157, size: 192, elements: !865)
!865 = !{!866, !867, !868}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !864, file: !859, line: 159, baseType: !598, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !864, file: !859, line: 160, baseType: !863, size: 64, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !864, file: !859, line: 161, baseType: !869, size: 32, offset: 128)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !599, size: 32, elements: !870)
!870 = !{!871}
!871 = !DISubrange(count: 4)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !858, file: !859, line: 168, baseType: !598, size: 64, offset: 128)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !858, file: !859, line: 169, baseType: !598, size: 64, offset: 192)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !858, file: !859, line: 170, baseType: !598, size: 64, offset: 256)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !858, file: !859, line: 171, baseType: !659, size: 64, offset: 320)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !858, file: !859, line: 172, baseType: !596, size: 32, offset: 384)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !858, file: !859, line: 176, baseType: !878, size: 64, offset: 448)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DISubroutineType(types: !880)
!880 = !{!863, !600, !659}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !858, file: !859, line: 177, baseType: !882, size: 64, offset: 512)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{null, !600, !863}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !858, file: !859, line: 178, baseType: !600, size: 64, offset: 576)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !858, file: !859, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !858, file: !859, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !858, file: !859, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !799, file: !781, line: 177, baseType: !603, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !799, file: !781, line: 178, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !318, line: 217, size: 832, elements: !893)
!893 = !{!894, !1141, !1142, !1143, !1146, !1150, !1151, !1152, !1170, !1171, !1172, !1173, !1174, !1175}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !892, file: !318, line: 219, baseType: !895, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !318, line: 151, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !318, line: 151, size: 128, elements: !898)
!898 = !{!899}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !897, file: !318, line: 151, baseType: !900, size: 128)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !318, line: 150, baseType: !901)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !318, line: 150, size: 128, elements: !902)
!902 = !{!903, !904, !905}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !901, file: !318, line: 150, baseType: !7, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !901, file: !318, line: 150, baseType: !7, size: 32, offset: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !901, file: !318, line: 150, baseType: !906, size: 64, offset: 64)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !907, size: 64, elements: !702)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !604, line: 108, baseType: !908)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !318, line: 122, size: 512, elements: !910)
!910 = !{!911, !912, !913, !1133, !1134, !1135, !1136, !1137, !1138, !1139}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !909, file: !318, line: 124, baseType: !891, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !909, file: !318, line: 125, baseType: !891, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !909, file: !318, line: 131, baseType: !914, size: 64, offset: 128)
!914 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !318, line: 128, size: 64, elements: !915)
!915 = !{!916, !1132}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !914, file: !318, line: 129, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !604, line: 66, baseType: !918)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !920, line: 143, size: 192, elements: !921)
!920 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!921 = !{!922, !1130, !1131}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !919, file: !920, line: 145, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !604, line: 69, baseType: !924)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !920, line: 136, size: 192, elements: !926)
!926 = !{!927, !1128, !1129}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !925, file: !920, line: 137, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !604, line: 58, baseType: !929)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !920, line: 737, size: 768, elements: !931)
!931 = !{!932, !949, !983, !989, !994, !999, !1006, !1012, !1018, !1023, !1037, !1042, !1048, !1053, !1063, !1068, !1086, !1093, !1100, !1106, !1111, !1117, !1123}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !930, file: !920, line: 738, baseType: !933, size: 256)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !920, line: 271, size: 256, elements: !934)
!934 = !{!935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !933, file: !920, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !933, file: !920, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !933, file: !920, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !933, file: !920, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !933, file: !920, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !933, file: !920, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !933, file: !920, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !933, file: !920, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !933, file: !920, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !933, file: !920, line: 312, baseType: !7, size: 32, offset: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !933, file: !920, line: 316, baseType: !728, size: 32, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !933, file: !920, line: 319, baseType: !7, size: 32, offset: 96)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !933, file: !920, line: 323, baseType: !891, size: 64, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !933, file: !920, line: 327, baseType: !603, size: 64, offset: 192)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !930, file: !920, line: 739, baseType: !950, size: 448)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !920, line: 350, size: 448, elements: !951)
!951 = !{!952, !981}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !950, file: !920, line: 353, baseType: !953, size: 384)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !920, line: 333, size: 384, elements: !954)
!954 = !{!955, !956, !964}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !953, file: !920, line: 336, baseType: !933, size: 256)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !953, file: !920, line: 343, baseType: !957, size: 64, offset: 256)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !959, line: 37, size: 128, elements: !960)
!959 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!960 = !{!961, !962}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !958, file: !959, line: 39, baseType: !957, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !958, file: !959, line: 40, baseType: !963, size: 64, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !953, file: !920, line: 344, baseType: !965, size: 64, offset: 320)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !959, line: 45, size: 320, elements: !967)
!967 = !{!968, !969}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !966, file: !959, line: 47, baseType: !965, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !966, file: !959, line: 48, baseType: !970, size: 256, offset: 64)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !334, line: 1883, size: 256, elements: !971)
!971 = !{!972, !974, !975, !980}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !970, file: !334, line: 1884, baseType: !973, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !970, file: !334, line: 1885, baseType: !973, size: 64, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !970, file: !334, line: 1891, baseType: !976, size: 64, offset: 128)
!976 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !970, file: !334, line: 1891, size: 64, elements: !977)
!977 = !{!978, !979}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !976, file: !334, line: 1891, baseType: !928, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !976, file: !334, line: 1891, baseType: !603, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !970, file: !334, line: 1892, baseType: !963, size: 64, offset: 192)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !950, file: !920, line: 359, baseType: !982, size: 64, offset: 384)
!982 = !DICompositeType(tag: DW_TAG_array_type, baseType: !603, size: 64, elements: !702)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !930, file: !920, line: 740, baseType: !984, size: 512)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !920, line: 365, size: 512, elements: !985)
!985 = !{!986, !987, !988}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !984, file: !920, line: 368, baseType: !953, size: 384)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !984, file: !920, line: 373, baseType: !603, size: 64, offset: 384)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !984, file: !920, line: 374, baseType: !603, size: 64, offset: 448)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !930, file: !920, line: 741, baseType: !990, size: 576)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !920, line: 380, size: 576, elements: !991)
!991 = !{!992, !993}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !990, file: !920, line: 383, baseType: !984, size: 512)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !990, file: !920, line: 389, baseType: !982, size: 64, offset: 512)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !930, file: !920, line: 742, baseType: !995, size: 320)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !920, line: 395, size: 320, elements: !996)
!996 = !{!997, !998}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !995, file: !920, line: 397, baseType: !933, size: 256)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !995, file: !920, line: 400, baseType: !917, size: 64, offset: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !930, file: !920, line: 743, baseType: !1000, size: 448)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !920, line: 406, size: 448, elements: !1001)
!1001 = !{!1002, !1003, !1004, !1005}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1000, file: !920, line: 408, baseType: !933, size: 256)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1000, file: !920, line: 412, baseType: !603, size: 64, offset: 256)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1000, file: !920, line: 420, baseType: !603, size: 64, offset: 320)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1000, file: !920, line: 423, baseType: !917, size: 64, offset: 384)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !930, file: !920, line: 744, baseType: !1007, size: 384)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !920, line: 429, size: 384, elements: !1008)
!1008 = !{!1009, !1010, !1011}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1007, file: !920, line: 431, baseType: !933, size: 256)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1007, file: !920, line: 434, baseType: !603, size: 64, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1007, file: !920, line: 437, baseType: !917, size: 64, offset: 320)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !930, file: !920, line: 745, baseType: !1013, size: 384)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !920, line: 443, size: 384, elements: !1014)
!1014 = !{!1015, !1016, !1017}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1013, file: !920, line: 445, baseType: !933, size: 256)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1013, file: !920, line: 449, baseType: !603, size: 64, offset: 256)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1013, file: !920, line: 453, baseType: !917, size: 64, offset: 320)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !930, file: !920, line: 746, baseType: !1019, size: 320)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !920, line: 459, size: 320, elements: !1020)
!1020 = !{!1021, !1022}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1019, file: !920, line: 461, baseType: !933, size: 256)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1019, file: !920, line: 464, baseType: !603, size: 64, offset: 256)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !930, file: !920, line: 747, baseType: !1024, size: 768)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !920, line: 469, size: 768, elements: !1025)
!1025 = !{!1026, !1027, !1028, !1029, !1030}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1024, file: !920, line: 471, baseType: !933, size: 256)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1024, file: !920, line: 474, baseType: !7, size: 32, offset: 256)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1024, file: !920, line: 475, baseType: !7, size: 32, offset: 288)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1024, file: !920, line: 478, baseType: !603, size: 64, offset: 320)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1024, file: !920, line: 481, baseType: !1031, size: 384, offset: 384)
!1031 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1032, size: 384, elements: !702)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !334, line: 1917, size: 384, elements: !1033)
!1033 = !{!1034, !1035, !1036}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1032, file: !334, line: 1920, baseType: !970, size: 256)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1032, file: !334, line: 1921, baseType: !603, size: 64, offset: 256)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1032, file: !334, line: 1922, baseType: !728, size: 32, offset: 320)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !930, file: !920, line: 748, baseType: !1038, size: 320)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !920, line: 487, size: 320, elements: !1039)
!1039 = !{!1040, !1041}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1038, file: !920, line: 490, baseType: !933, size: 256)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1038, file: !920, line: 494, baseType: !596, size: 32, offset: 256)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !930, file: !920, line: 749, baseType: !1043, size: 384)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !920, line: 500, size: 384, elements: !1044)
!1044 = !{!1045, !1046, !1047}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1043, file: !920, line: 502, baseType: !933, size: 256)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1043, file: !920, line: 506, baseType: !917, size: 64, offset: 256)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1043, file: !920, line: 510, baseType: !917, size: 64, offset: 320)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !930, file: !920, line: 750, baseType: !1049, size: 320)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !920, line: 529, size: 320, elements: !1050)
!1050 = !{!1051, !1052}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1049, file: !920, line: 531, baseType: !933, size: 256)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1049, file: !920, line: 540, baseType: !917, size: 64, offset: 256)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !930, file: !920, line: 751, baseType: !1054, size: 704)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !920, line: 546, size: 704, elements: !1055)
!1055 = !{!1056, !1057, !1058, !1059, !1060, !1061, !1062}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1054, file: !920, line: 549, baseType: !984, size: 512)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1054, file: !920, line: 553, baseType: !601, size: 64, offset: 512)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1054, file: !920, line: 557, baseType: !595, size: 8, offset: 576)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1054, file: !920, line: 558, baseType: !595, size: 8, offset: 584)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1054, file: !920, line: 559, baseType: !595, size: 8, offset: 592)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1054, file: !920, line: 560, baseType: !595, size: 8, offset: 600)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1054, file: !920, line: 566, baseType: !982, size: 64, offset: 640)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !930, file: !920, line: 752, baseType: !1064, size: 384)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !920, line: 571, size: 384, elements: !1065)
!1065 = !{!1066, !1067}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1064, file: !920, line: 573, baseType: !995, size: 320)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1064, file: !920, line: 577, baseType: !603, size: 64, offset: 320)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !930, file: !920, line: 753, baseType: !1069, size: 576)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !920, line: 600, size: 576, elements: !1070)
!1070 = !{!1071, !1072, !1073, !1076, !1085}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1069, file: !920, line: 602, baseType: !995, size: 320)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1069, file: !920, line: 605, baseType: !603, size: 64, offset: 320)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1069, file: !920, line: 609, baseType: !1074, size: 64, offset: 384)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1075, line: 46, baseType: !657)
!1075 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1069, file: !920, line: 612, baseType: !1077, size: 64, offset: 448)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !920, line: 581, size: 320, elements: !1079)
!1079 = !{!1080, !1081, !1082, !1083, !1084}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1078, file: !920, line: 583, baseType: !366, size: 32)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1078, file: !920, line: 586, baseType: !603, size: 64, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1078, file: !920, line: 589, baseType: !603, size: 64, offset: 128)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1078, file: !920, line: 592, baseType: !603, size: 64, offset: 192)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1078, file: !920, line: 595, baseType: !603, size: 64, offset: 256)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1069, file: !920, line: 616, baseType: !917, size: 64, offset: 512)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !930, file: !920, line: 754, baseType: !1087, size: 512)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !920, line: 622, size: 512, elements: !1088)
!1088 = !{!1089, !1090, !1091, !1092}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1087, file: !920, line: 624, baseType: !995, size: 320)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1087, file: !920, line: 628, baseType: !603, size: 64, offset: 320)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1087, file: !920, line: 632, baseType: !603, size: 64, offset: 384)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1087, file: !920, line: 636, baseType: !603, size: 64, offset: 448)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !930, file: !920, line: 755, baseType: !1094, size: 704)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !920, line: 642, size: 704, elements: !1095)
!1095 = !{!1096, !1097, !1098, !1099}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1094, file: !920, line: 644, baseType: !1087, size: 512)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1094, file: !920, line: 648, baseType: !603, size: 64, offset: 512)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1094, file: !920, line: 652, baseType: !603, size: 64, offset: 576)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1094, file: !920, line: 653, baseType: !603, size: 64, offset: 640)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !930, file: !920, line: 756, baseType: !1101, size: 448)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !920, line: 663, size: 448, elements: !1102)
!1102 = !{!1103, !1104, !1105}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1101, file: !920, line: 665, baseType: !995, size: 320)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1101, file: !920, line: 668, baseType: !603, size: 64, offset: 320)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1101, file: !920, line: 673, baseType: !603, size: 64, offset: 384)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !930, file: !920, line: 757, baseType: !1107, size: 384)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !920, line: 694, size: 384, elements: !1108)
!1108 = !{!1109, !1110}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1107, file: !920, line: 696, baseType: !995, size: 320)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1107, file: !920, line: 699, baseType: !603, size: 64, offset: 320)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !930, file: !920, line: 758, baseType: !1112, size: 384)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !920, line: 681, size: 384, elements: !1113)
!1113 = !{!1114, !1115, !1116}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1112, file: !920, line: 683, baseType: !933, size: 256)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1112, file: !920, line: 686, baseType: !603, size: 64, offset: 256)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1112, file: !920, line: 689, baseType: !603, size: 64, offset: 320)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !930, file: !920, line: 759, baseType: !1118, size: 384)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !920, line: 707, size: 384, elements: !1119)
!1119 = !{!1120, !1121, !1122}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1118, file: !920, line: 709, baseType: !933, size: 256)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1118, file: !920, line: 712, baseType: !603, size: 64, offset: 256)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1118, file: !920, line: 712, baseType: !603, size: 64, offset: 320)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !930, file: !920, line: 760, baseType: !1124, size: 320)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !920, line: 718, size: 320, elements: !1125)
!1125 = !{!1126, !1127}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1124, file: !920, line: 720, baseType: !933, size: 256)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1124, file: !920, line: 723, baseType: !603, size: 64, offset: 256)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !925, file: !920, line: 138, baseType: !924, size: 64, offset: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !925, file: !920, line: 139, baseType: !924, size: 64, offset: 128)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !919, file: !920, line: 146, baseType: !923, size: 64, offset: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !919, file: !920, line: 152, baseType: !917, size: 64, offset: 128)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !914, file: !318, line: 130, baseType: !778, size: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !909, file: !318, line: 134, baseType: !600, size: 64, offset: 192)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !909, file: !318, line: 137, baseType: !603, size: 64, offset: 256)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !909, file: !318, line: 138, baseType: !728, size: 32, offset: 320)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !909, file: !318, line: 142, baseType: !7, size: 32, offset: 352)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !909, file: !318, line: 144, baseType: !596, size: 32, offset: 384)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !909, file: !318, line: 145, baseType: !596, size: 32, offset: 416)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !909, file: !318, line: 146, baseType: !1140, size: 64, offset: 448)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !318, line: 119, baseType: !659)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !892, file: !318, line: 220, baseType: !895, size: 64, offset: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !892, file: !318, line: 223, baseType: !600, size: 64, offset: 128)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !892, file: !318, line: 226, baseType: !1144, size: 64, offset: 192)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !318, line: 185, flags: DIFlagFwdDecl)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !892, file: !318, line: 229, baseType: !1147, size: 128, offset: 256)
!1147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1148, size: 128, elements: !846)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !318, line: 229, flags: DIFlagFwdDecl)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !892, file: !318, line: 232, baseType: !891, size: 64, offset: 384)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !892, file: !318, line: 233, baseType: !891, size: 64, offset: 448)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !892, file: !318, line: 238, baseType: !1153, size: 64, offset: 512)
!1153 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !318, line: 235, size: 64, elements: !1154)
!1154 = !{!1155, !1161}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1153, file: !318, line: 236, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !318, line: 273, size: 128, elements: !1158)
!1158 = !{!1159, !1160}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1157, file: !318, line: 275, baseType: !917, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1157, file: !318, line: 278, baseType: !917, size: 64, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1153, file: !318, line: 237, baseType: !1162, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !318, line: 259, size: 320, elements: !1164)
!1164 = !{!1165, !1166, !1167, !1168, !1169}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1163, file: !318, line: 261, baseType: !778, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1163, file: !318, line: 262, baseType: !778, size: 64, offset: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1163, file: !318, line: 266, baseType: !778, size: 64, offset: 128)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1163, file: !318, line: 267, baseType: !778, size: 64, offset: 192)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1163, file: !318, line: 270, baseType: !596, size: 32, offset: 256)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !892, file: !318, line: 241, baseType: !1140, size: 64, offset: 576)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !892, file: !318, line: 244, baseType: !596, size: 32, offset: 640)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !892, file: !318, line: 247, baseType: !596, size: 32, offset: 672)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !892, file: !318, line: 250, baseType: !596, size: 32, offset: 704)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !892, file: !318, line: 253, baseType: !596, size: 32, offset: 736)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !892, file: !318, line: 256, baseType: !596, size: 32, offset: 768)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !799, file: !781, line: 179, baseType: !1177, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !781, line: 150, baseType: !1179)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !781, line: 142, size: 320, elements: !1180)
!1180 = !{!1181, !1182, !1183, !1184, !1187, !1188}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1179, file: !781, line: 144, baseType: !603, size: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1179, file: !781, line: 145, baseType: !778, size: 64, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1179, file: !781, line: 146, baseType: !778, size: 64, offset: 128)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1179, file: !781, line: 147, baseType: !1185, size: 32, offset: 192)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1186, line: 31, baseType: !596)
!1186 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1179, file: !781, line: 148, baseType: !7, size: 32, offset: 224)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1179, file: !781, line: 149, baseType: !595, size: 8, offset: 256)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !799, file: !781, line: 180, baseType: !1190, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !781, line: 162, baseType: !1192)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !781, line: 159, size: 128, elements: !1193)
!1193 = !{!1194, !1195}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1192, file: !781, line: 160, baseType: !603, size: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1192, file: !781, line: 161, baseType: !659, size: 64, offset: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !799, file: !781, line: 181, baseType: !1197, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !781, line: 181, flags: DIFlagFwdDecl)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !794, file: !781, line: 317, baseType: !1200, size: 64)
!1200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !659, size: 64, elements: !702)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !794, file: !781, line: 318, baseType: !1202, size: 320)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !781, line: 188, size: 320, elements: !1203)
!1203 = !{!1204, !1206, !1263}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1202, file: !781, line: 190, baseType: !1205, size: 192)
!1205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 192, elements: !677)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1202, file: !781, line: 193, baseType: !1207, size: 64, offset: 192)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !781, line: 206, size: 320, elements: !1209)
!1209 = !{!1210, !1248, !1249, !1250, !1262}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1208, file: !781, line: 208, baseType: !1211, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !604, line: 62, baseType: !1213)
!1213 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1214, line: 538, size: 256, elements: !1215)
!1214 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1215 = !{!1216, !1220, !1226, !1239}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1213, file: !1214, line: 539, baseType: !1217, size: 32)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1214, line: 482, size: 32, elements: !1218)
!1218 = !{!1219}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1217, file: !1214, line: 484, baseType: !7, size: 32)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1213, file: !1214, line: 540, baseType: !1221, size: 192)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1214, line: 488, size: 192, elements: !1222)
!1222 = !{!1223, !1224, !1225}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1221, file: !1214, line: 489, baseType: !1217, size: 32)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1221, file: !1214, line: 492, baseType: !601, size: 64, offset: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1221, file: !1214, line: 496, baseType: !603, size: 64, offset: 128)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1213, file: !1214, line: 541, baseType: !1227, size: 256)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1214, line: 504, size: 256, elements: !1228)
!1228 = !{!1229, !1230, !1237, !1238}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1227, file: !1214, line: 505, baseType: !1217, size: 32)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1227, file: !1214, line: 509, baseType: !1231, size: 64, offset: 64)
!1231 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1214, line: 501, baseType: !1232)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{null, !1235}
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1227, file: !1214, line: 510, baseType: !1235, size: 64, offset: 128)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1227, file: !1214, line: 513, baseType: !1211, size: 64, offset: 192)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1213, file: !1214, line: 542, baseType: !1240, size: 128)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1214, line: 530, size: 128, elements: !1241)
!1241 = !{!1242, !1243}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1240, file: !1214, line: 531, baseType: !1217, size: 32)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1240, file: !1214, line: 534, baseType: !1244, size: 64, offset: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1214, line: 525, baseType: !1245)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!595, !603, !601, !657, !657}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1208, file: !781, line: 211, baseType: !7, size: 32, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1208, file: !781, line: 214, baseType: !659, size: 64, offset: 128)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1208, file: !781, line: 224, baseType: !1251, size: 64, offset: 192)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !781, line: 202, baseType: !1253)
!1253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !781, line: 202, size: 128, elements: !1254)
!1254 = !{!1255}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1253, file: !781, line: 202, baseType: !1256, size: 128)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !781, line: 200, baseType: !1257)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !781, line: 200, size: 128, elements: !1258)
!1258 = !{!1259, !1260, !1261}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1257, file: !781, line: 200, baseType: !7, size: 32)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1257, file: !781, line: 200, baseType: !7, size: 32, offset: 32)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1257, file: !781, line: 200, baseType: !812, size: 64, offset: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1208, file: !781, line: 234, baseType: !1251, size: 64, offset: 256)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1202, file: !781, line: 197, baseType: !659, size: 64, offset: 256)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !794, file: !781, line: 319, baseType: !666, size: 256)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !794, file: !781, line: 320, baseType: !685, size: 192)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !606, file: !334, line: 3384, baseType: !1267, size: 1472)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !334, line: 3114, size: 1472, elements: !1268)
!1268 = !{!1269, !1290, !1291, !1292, !1293}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1267, file: !334, line: 3115, baseType: !1270, size: 1216)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !334, line: 2984, size: 1216, elements: !1271)
!1271 = !{!1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1270, file: !334, line: 2985, baseType: !774, size: 960)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1270, file: !334, line: 2986, baseType: !603, size: 64, offset: 960)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1270, file: !334, line: 2987, baseType: !603, size: 64, offset: 1024)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1270, file: !334, line: 2988, baseType: !603, size: 64, offset: 1088)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1270, file: !334, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1270, file: !334, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1270, file: !334, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1270, file: !334, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1270, file: !334, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1270, file: !334, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1270, file: !334, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1270, file: !334, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1270, file: !334, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1270, file: !334, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1270, file: !334, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1270, file: !334, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1270, file: !334, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1270, file: !334, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1267, file: !334, line: 3117, baseType: !603, size: 64, offset: 1216)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1267, file: !334, line: 3119, baseType: !603, size: 64, offset: 1280)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1267, file: !334, line: 3121, baseType: !603, size: 64, offset: 1344)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1267, file: !334, line: 3123, baseType: !603, size: 64, offset: 1408)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !606, file: !334, line: 3385, baseType: !1295, size: 1088)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !334, line: 2874, size: 1088, elements: !1296)
!1296 = !{!1297, !1298, !1299}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1295, file: !334, line: 2875, baseType: !774, size: 960)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1295, file: !334, line: 2876, baseType: !778, size: 64, offset: 960)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1295, file: !334, line: 2877, baseType: !1300, size: 64, offset: 1024)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1302, line: 172, size: 128, elements: !1303)
!1302 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1303 = !{!1304, !1305, !1306, !1307, !1308, !1309, !1310}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1301, file: !1302, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1301, file: !1302, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1301, file: !1302, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1301, file: !1302, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1301, file: !1302, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1301, file: !1302, line: 195, baseType: !7, size: 32, offset: 32)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1301, file: !1302, line: 199, baseType: !603, size: 64, offset: 64)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !606, file: !334, line: 3386, baseType: !1270, size: 1216)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !606, file: !334, line: 3387, baseType: !1313, size: 1280)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !334, line: 3093, size: 1280, elements: !1314)
!1314 = !{!1315, !1316}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1313, file: !334, line: 3094, baseType: !1270, size: 1216)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1313, file: !334, line: 3095, baseType: !1300, size: 64, offset: 1216)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !606, file: !334, line: 3388, baseType: !1318, size: 1216)
!1318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !334, line: 2824, size: 1216, elements: !1319)
!1319 = !{!1320, !1321, !1322, !1323, !1324, !1325}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1318, file: !334, line: 2825, baseType: !736, size: 896)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1318, file: !334, line: 2827, baseType: !603, size: 64, offset: 896)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1318, file: !334, line: 2828, baseType: !603, size: 64, offset: 960)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1318, file: !334, line: 2829, baseType: !603, size: 64, offset: 1024)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1318, file: !334, line: 2830, baseType: !603, size: 64, offset: 1088)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1318, file: !334, line: 2831, baseType: !603, size: 64, offset: 1152)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !606, file: !334, line: 3389, baseType: !1327, size: 1024)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !334, line: 2850, size: 1024, elements: !1328)
!1328 = !{!1329, !1330, !1331}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1327, file: !334, line: 2851, baseType: !774, size: 960)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1327, file: !334, line: 2852, baseType: !596, size: 32, offset: 960)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1327, file: !334, line: 2853, baseType: !596, size: 32, offset: 992)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !606, file: !334, line: 3390, baseType: !1333, size: 1024)
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !334, line: 2857, size: 1024, elements: !1334)
!1334 = !{!1335, !1336}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1333, file: !334, line: 2858, baseType: !774, size: 960)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1333, file: !334, line: 2859, baseType: !1300, size: 64, offset: 960)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !606, file: !334, line: 3391, baseType: !1338, size: 960)
!1338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !334, line: 2862, size: 960, elements: !1339)
!1339 = !{!1340}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1338, file: !334, line: 2863, baseType: !774, size: 960)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !606, file: !334, line: 3392, baseType: !1342, size: 1472)
!1342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !334, line: 3304, size: 1472, elements: !1343)
!1343 = !{!1344}
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1342, file: !334, line: 3305, baseType: !1267, size: 1472)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !606, file: !334, line: 3393, baseType: !1346, size: 1792)
!1346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !334, line: 3248, size: 1792, elements: !1347)
!1347 = !{!1348, !1349, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1346, file: !334, line: 3249, baseType: !1267, size: 1472)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1346, file: !334, line: 3251, baseType: !1350, size: 64, offset: 1472)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64)
!1351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1352, line: 463, size: 1152, elements: !1353)
!1352 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1353 = !{!1354, !1357, !1388, !1389, !1502, !1505, !1506, !1507, !1508, !1509, !1510, !1534, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1351, file: !1352, line: 464, baseType: !1355, size: 64)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64)
!1356 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1352, line: 464, flags: DIFlagFwdDecl)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1351, file: !1352, line: 467, baseType: !1358, size: 64, offset: 64)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64)
!1359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !318, line: 374, size: 640, elements: !1360)
!1360 = !{!1361, !1363, !1364, !1377, !1378, !1379, !1380, !1381, !1382, !1384, !1386, !1387}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1359, file: !318, line: 377, baseType: !1362, size: 64)
!1362 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !604, line: 111, baseType: !891)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1359, file: !318, line: 378, baseType: !1362, size: 64, offset: 64)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1359, file: !318, line: 381, baseType: !1365, size: 64, offset: 128)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64)
!1366 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !318, line: 282, baseType: !1367)
!1367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !318, line: 282, size: 128, elements: !1368)
!1368 = !{!1369}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1367, file: !318, line: 282, baseType: !1370, size: 128)
!1370 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !318, line: 281, baseType: !1371)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !318, line: 281, size: 128, elements: !1372)
!1372 = !{!1373, !1374, !1375}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1371, file: !318, line: 281, baseType: !7, size: 32)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1371, file: !318, line: 281, baseType: !7, size: 32, offset: 32)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1371, file: !318, line: 281, baseType: !1376, size: 64, offset: 64)
!1376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1362, size: 64, elements: !702)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1359, file: !318, line: 384, baseType: !596, size: 32, offset: 192)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1359, file: !318, line: 387, baseType: !596, size: 32, offset: 224)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1359, file: !318, line: 390, baseType: !596, size: 32, offset: 256)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1359, file: !318, line: 394, baseType: !1365, size: 64, offset: 320)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1359, file: !318, line: 396, baseType: !317, size: 32, offset: 384)
