; ModuleID = 'tree-if-conv.bc'
source_filename = "tree-if-conv.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }

!583 = !DIEnumerator(name: "GIMPLE_ASM", value: 7, isUnsigned: true)
!584 = !DIEnumerator(name: "GIMPLE_CALL", value: 8, isUnsigned: true)
!585 = !DIEnumerator(name: "GIMPLE_RETURN", value: 9, isUnsigned: true)
!586 = !DIEnumerator(name: "GIMPLE_BIND", value: 10, isUnsigned: true)
!587 = !DIEnumerator(name: "GIMPLE_CATCH", value: 11, isUnsigned: true)
!588 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!589 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!590 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!591 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!592 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!593 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!594 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!595 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!596 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!597 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!598 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!599 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!600 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!601 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!602 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!603 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!604 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!605 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!606 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!607 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!608 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!609 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!610 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!611 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!612 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !574, line: 727, baseType: !7, size: 32, elements: !613)
!613 = !{!614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637}
!614 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!615 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!616 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!617 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!618 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!619 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!620 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!621 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!622 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!623 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!624 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!625 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!626 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!627 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!628 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!629 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!630 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!631 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!632 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!633 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!634 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!635 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!636 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!637 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!638 = !{!639, !640, !641, !642, !645, !646, !648, !663, !732, !2014, !1286, !366, !708, !2015, !1315, !643, !2017, !727}
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!641 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !644)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_int_heap", file: !650, line: 32, baseType: !651)
!650 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_int_heap", file: !650, line: 32, size: 96, elements: !652)
!652 = !{!653}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !651, file: !650, line: 32, baseType: !654, size: 96)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_int_base", file: !650, line: 31, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_int_base", file: !650, line: 31, size: 96, elements: !656)
!656 = !{!657, !658, !659}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !655, file: !650, line: 31, baseType: !7, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !655, file: !650, line: 31, baseType: !7, size: 32, offset: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !655, file: !650, line: 31, baseType: !660, size: 32, offset: 64)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !641, size: 32, elements: !661)
!661 = !{!662}
!662 = !DISubrange(count: 1)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !561, line: 84, baseType: !664)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !561, line: 100, size: 1216, elements: !666)
!666 = !{!667, !668, !669, !1978, !1979, !1984, !1985, !1986, !1987, !1988, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !1996, !2004, !2012, !2013}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !665, file: !561, line: 102, baseType: !641, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !665, file: !561, line: 105, baseType: !7, size: 32, offset: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !665, file: !561, line: 108, baseType: !670, size: 64, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !318, line: 217, size: 832, elements: !672)
!672 = !{!673, !1945, !1946, !1947, !1948, !1952, !1953, !1954, !1972, !1973, !1974, !1975, !1976, !1977}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !671, file: !318, line: 219, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !318, line: 151, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !318, line: 151, size: 128, elements: !677)
!677 = !{!678}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !676, file: !318, line: 151, baseType: !679, size: 128)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !318, line: 150, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !318, line: 150, size: 128, elements: !681)
!681 = !{!682, !683, !684}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !680, file: !318, line: 150, baseType: !7, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !680, file: !318, line: 150, baseType: !7, size: 32, offset: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !680, file: !318, line: 150, baseType: !685, size: 64, offset: 64)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 64, elements: !661)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !687, line: 108, baseType: !688)
!687 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !318, line: 122, size: 512, elements: !690)
!690 = !{!691, !692, !693, !1937, !1938, !1939, !1940, !1941, !1942, !1943}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !689, file: !318, line: 124, baseType: !670, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !689, file: !318, line: 125, baseType: !670, size: 64, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !689, file: !318, line: 131, baseType: !694, size: 64, offset: 128)
!694 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !318, line: 128, size: 64, elements: !695)
!695 = !{!696, !1936}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !694, file: !318, line: 129, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !687, line: 66, baseType: !698)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !574, line: 143, size: 192, elements: !700)
!700 = !{!701, !1934, !1935}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !699, file: !574, line: 145, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !687, line: 69, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !574, line: 136, size: 192, elements: !705)
!705 = !{!706, !1932, !1933}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !704, file: !574, line: 137, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !687, line: 58, baseType: !708)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !574, line: 737, size: 768, elements: !710)
!710 = !{!711, !1779, !1789, !1795, !1800, !1805, !1812, !1818, !1824, !1829, !1843, !1848, !1854, !1859, !1869, !1874, !1890, !1897, !1904, !1910, !1915, !1921, !1927}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !709, file: !574, line: 738, baseType: !712, size: 256)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !574, line: 271, size: 256, elements: !713)
!713 = !{!714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !729, !730, !731}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !712, file: !574, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !712, file: !574, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !712, file: !574, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !712, file: !574, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !712, file: !574, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !712, file: !574, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !712, file: !574, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !712, file: !574, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !712, file: !574, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !712, file: !574, line: 312, baseType: !7, size: 32, offset: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !712, file: !574, line: 316, baseType: !725, size: 32, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !726, line: 58, baseType: !727)
!726 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !728, line: 44, baseType: !7)
!728 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!729 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !712, file: !574, line: 319, baseType: !7, size: 32, offset: 96)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !712, file: !574, line: 323, baseType: !670, size: 64, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !712, file: !574, line: 327, baseType: !732, size: 64, offset: 192)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !687, line: 56, baseType: !733)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !334, line: 3371, size: 1792, elements: !735)
!735 = !{!736, !769, !775, !788, !807, !818, !823, !830, !836, !849, !857, !895, !1069, !1097, !1114, !1115, !1120, !1129, !1135, !1140, !1144, !1148, !1430, !1477, !1483, !1489, !1496, !1509, !1523, !1540, !1552, !1574, !1589, !1761}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !734, file: !334, line: 3372, baseType: !737, size: 64)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !334, line: 360, size: 64, elements: !738)
!738 = !{!739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !737, file: !334, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !737, file: !334, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !737, file: !334, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !737, file: !334, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !737, file: !334, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !737, file: !334, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !737, file: !334, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !737, file: !334, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !737, file: !334, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !737, file: !334, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !737, file: !334, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !737, file: !334, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !737, file: !334, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !737, file: !334, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !737, file: !334, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !737, file: !334, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !737, file: !334, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !737, file: !334, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !737, file: !334, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !737, file: !334, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !737, file: !334, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !737, file: !334, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !737, file: !334, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !737, file: !334, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !737, file: !334, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !737, file: !334, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !737, file: !334, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !737, file: !334, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !737, file: !334, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !737, file: !334, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !734, file: !334, line: 3373, baseType: !770, size: 192)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !334, line: 402, size: 192, elements: !771)
!771 = !{!772, !773, !774}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !770, file: !334, line: 403, baseType: !737, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !770, file: !334, line: 404, baseType: !732, size: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !770, file: !334, line: 405, baseType: !732, size: 64, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !734, file: !334, line: 3374, baseType: !776, size: 320)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !334, line: 1384, size: 320, elements: !777)
!777 = !{!778, !779}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !776, file: !334, line: 1385, baseType: !770, size: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !776, file: !334, line: 1386, baseType: !780, size: 128, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !781, line: 58, baseType: !782)
!781 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !781, line: 54, size: 128, elements: !783)
!783 = !{!784, !786}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !782, file: !781, line: 56, baseType: !785, size: 64)
!785 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !782, file: !781, line: 57, baseType: !787, size: 64, offset: 64)
!787 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !734, file: !334, line: 3375, baseType: !789, size: 256)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !334, line: 1397, size: 256, elements: !790)
!790 = !{!791, !792}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !789, file: !334, line: 1398, baseType: !770, size: 192)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !789, file: !334, line: 1399, baseType: !793, size: 64, offset: 192)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !795, line: 52, size: 256, elements: !796)
!795 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!796 = !{!797, !798, !799, !800, !801, !802, !803}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !794, file: !795, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !794, file: !795, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !794, file: !795, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !794, file: !795, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !794, file: !795, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !794, file: !795, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !794, file: !795, line: 62, baseType: !804, size: 192, offset: 64)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !785, size: 192, elements: !805)
!805 = !{!806}
!806 = !DISubrange(count: 3)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !734, file: !334, line: 3376, baseType: !808, size: 256)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !334, line: 1408, size: 256, elements: !809)
!809 = !{!810, !811}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !808, file: !334, line: 1409, baseType: !770, size: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !808, file: !334, line: 1410, baseType: !812, size: 64, offset: 192)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !814, line: 27, size: 192, elements: !815)
!814 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!815 = !{!816, !817}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !813, file: !814, line: 29, baseType: !780, size: 128)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !813, file: !814, line: 30, baseType: !189, size: 32, offset: 128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !734, file: !334, line: 3377, baseType: !819, size: 256)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !334, line: 1437, size: 256, elements: !820)
!820 = !{!821, !822}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !819, file: !334, line: 1438, baseType: !770, size: 192)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !819, file: !334, line: 1439, baseType: !732, size: 64, offset: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !734, file: !334, line: 3378, baseType: !824, size: 256)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !334, line: 1418, size: 256, elements: !825)
!825 = !{!826, !827, !828}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !824, file: !334, line: 1419, baseType: !770, size: 192)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !824, file: !334, line: 1420, baseType: !641, size: 32, offset: 192)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !824, file: !334, line: 1421, baseType: !829, size: 8, offset: 224)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !644, size: 8, elements: !661)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !734, file: !334, line: 3379, baseType: !831, size: 320)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !334, line: 1428, size: 320, elements: !832)
!832 = !{!833, !834, !835}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !831, file: !334, line: 1429, baseType: !770, size: 192)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !831, file: !334, line: 1430, baseType: !732, size: 64, offset: 192)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !831, file: !334, line: 1431, baseType: !732, size: 64, offset: 256)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !734, file: !334, line: 3380, baseType: !837, size: 320)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !334, line: 1460, size: 320, elements: !838)
!838 = !{!839, !840}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !837, file: !334, line: 1461, baseType: !770, size: 192)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !837, file: !334, line: 1462, baseType: !841, size: 128, offset: 192)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !842, line: 31, size: 128, elements: !843)
!842 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!843 = !{!844, !847, !848}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !841, file: !842, line: 32, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !640)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !841, file: !842, line: 33, baseType: !7, size: 32, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !841, file: !842, line: 34, baseType: !7, size: 32, offset: 96)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !734, file: !334, line: 3381, baseType: !850, size: 384)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !334, line: 2507, size: 384, elements: !851)
!851 = !{!852, !853, !854, !855, !856}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !850, file: !334, line: 2508, baseType: !770, size: 192)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !850, file: !334, line: 2509, baseType: !725, size: 32, offset: 192)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !850, file: !334, line: 2510, baseType: !7, size: 32, offset: 224)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !850, file: !334, line: 2511, baseType: !732, size: 64, offset: 256)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !850, file: !334, line: 2512, baseType: !732, size: 64, offset: 320)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !734, file: !334, line: 3382, baseType: !858, size: 896)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !334, line: 2652, size: 896, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !858, file: !334, line: 2653, baseType: !850, size: 384)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !858, file: !334, line: 2654, baseType: !732, size: 64, offset: 384)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !858, file: !334, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !858, file: !334, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !858, file: !334, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !858, file: !334, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !858, file: !334, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !858, file: !334, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !858, file: !334, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !858, file: !334, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !858, file: !334, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !858, file: !334, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !858, file: !334, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !858, file: !334, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !858, file: !334, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !858, file: !334, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !858, file: !334, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !858, file: !334, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !858, file: !334, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !858, file: !334, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !858, file: !334, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !858, file: !334, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !858, file: !334, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !858, file: !334, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !858, file: !334, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !858, file: !334, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !858, file: !334, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !858, file: !334, line: 2703, baseType: !7, size: 32, offset: 512)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !858, file: !334, line: 2705, baseType: !732, size: 64, offset: 576)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !858, file: !334, line: 2706, baseType: !732, size: 64, offset: 640)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !858, file: !334, line: 2707, baseType: !732, size: 64, offset: 704)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !858, file: !334, line: 2708, baseType: !732, size: 64, offset: 768)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !858, file: !334, line: 2711, baseType: !893, size: 64, offset: 832)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !334, line: 2711, flags: DIFlagFwdDecl)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !734, file: !334, line: 3383, baseType: !896, size: 960)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !334, line: 2756, size: 960, elements: !897)
!897 = !{!898, !899}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !896, file: !334, line: 2757, baseType: !858, size: 896)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !896, file: !334, line: 2758, baseType: !900, size: 64, offset: 896)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !687, line: 50, baseType: !901)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !903, line: 240, size: 384, elements: !904)
!903 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!904 = !{!905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !902, file: !903, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !902, file: !903, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !902, file: !903, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !902, file: !903, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !902, file: !903, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !902, file: !903, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !902, file: !903, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !902, file: !903, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !902, file: !903, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !902, file: !903, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !902, file: !903, line: 321, baseType: !916, size: 320, offset: 64)
!916 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !903, line: 315, size: 320, elements: !917)
!917 = !{!918, !1036, !1038, !1067, !1068}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !916, file: !903, line: 316, baseType: !919, size: 64)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !920, size: 64, elements: !661)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !903, line: 183, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !903, line: 166, size: 64, elements: !922)
!922 = !{!923, !924, !925, !926, !927, !935, !936, !948, !951, !1011, !1012, !1013, !1026, !1033}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !921, file: !903, line: 168, baseType: !641, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !921, file: !903, line: 169, baseType: !7, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !921, file: !903, line: 170, baseType: !646, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !921, file: !903, line: 171, baseType: !900, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !921, file: !903, line: 172, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !687, line: 53, baseType: !929)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !903, line: 359, size: 128, elements: !931)
!931 = !{!932, !933}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !930, file: !903, line: 360, baseType: !641, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !930, file: !903, line: 361, baseType: !934, size: 64, offset: 64)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !900, size: 64, elements: !661)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !921, file: !903, line: 173, baseType: !189, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !921, file: !903, line: 174, baseType: !937, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !903, line: 133, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !903, line: 115, size: 32, elements: !939)
!939 = !{!940, !941, !942, !943, !944, !945, !946, !947}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !938, file: !903, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !938, file: !903, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !938, file: !903, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !938, file: !903, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !938, file: !903, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !938, file: !903, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !938, file: !903, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !938, file: !903, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !921, file: !903, line: 175, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !903, line: 175, flags: DIFlagFwdDecl)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !921, file: !903, line: 176, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !954, line: 75, size: 256, elements: !955)
!954 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!955 = !{!956, !970, !971, !972}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !953, file: !954, line: 76, baseType: !957, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !954, line: 68, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !954, line: 63, size: 320, elements: !960)
!960 = !{!961, !963, !964, !965}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !959, file: !954, line: 64, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !959, file: !954, line: 65, baseType: !962, size: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !959, file: !954, line: 66, baseType: !7, size: 32, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !959, file: !954, line: 67, baseType: !966, size: 128, offset: 192)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !967, size: 128, elements: !968)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !954, line: 29, baseType: !785)
!968 = !{!969}
!969 = !DISubrange(count: 2)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !953, file: !954, line: 77, baseType: !957, size: 64, offset: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !953, file: !954, line: 78, baseType: !7, size: 32, offset: 128)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !953, file: !954, line: 79, baseType: !973, size: 64, offset: 192)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !954, line: 49, baseType: !975)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !954, line: 45, size: 832, elements: !976)
!976 = !{!977, !978, !979}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !975, file: !954, line: 46, baseType: !962, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !975, file: !954, line: 47, baseType: !952, size: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !975, file: !954, line: 48, baseType: !980, size: 704, offset: 128)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !981, line: 164, size: 704, elements: !982)
!981 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!982 = !{!983, !984, !994, !995, !996, !997, !998, !999, !1003, !1007, !1008, !1009, !1010}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !980, file: !981, line: 166, baseType: !787, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !980, file: !981, line: 167, baseType: !985, size: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !981, line: 157, size: 192, elements: !987)
!987 = !{!988, !989, !990}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !986, file: !981, line: 159, baseType: !643, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !986, file: !981, line: 160, baseType: !985, size: 64, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !986, file: !981, line: 161, baseType: !991, size: 32, offset: 128)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !644, size: 32, elements: !992)
!992 = !{!993}
!993 = !DISubrange(count: 4)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !980, file: !981, line: 168, baseType: !643, size: 64, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !980, file: !981, line: 169, baseType: !643, size: 64, offset: 192)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !980, file: !981, line: 170, baseType: !643, size: 64, offset: 256)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !980, file: !981, line: 171, baseType: !787, size: 64, offset: 320)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !980, file: !981, line: 172, baseType: !641, size: 32, offset: 384)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !980, file: !981, line: 176, baseType: !1000, size: 64, offset: 448)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!985, !645, !787}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !980, file: !981, line: 177, baseType: !1004, size: 64, offset: 512)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{null, !645, !985}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !980, file: !981, line: 178, baseType: !645, size: 64, offset: 576)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !980, file: !981, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !980, file: !981, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !980, file: !981, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !921, file: !903, line: 177, baseType: !732, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !921, file: !903, line: 178, baseType: !670, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !921, file: !903, line: 179, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !903, line: 150, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !903, line: 142, size: 320, elements: !1017)
!1017 = !{!1018, !1019, !1020, !1021, !1024, !1025}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1016, file: !903, line: 144, baseType: !732, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1016, file: !903, line: 145, baseType: !900, size: 64, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1016, file: !903, line: 146, baseType: !900, size: 64, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1016, file: !903, line: 147, baseType: !1022, size: 32, offset: 192)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1023, line: 31, baseType: !641)
!1023 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1016, file: !903, line: 148, baseType: !7, size: 32, offset: 224)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1016, file: !903, line: 149, baseType: !640, size: 8, offset: 256)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !921, file: !903, line: 180, baseType: !1027, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !903, line: 162, baseType: !1029)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !903, line: 159, size: 128, elements: !1030)
!1030 = !{!1031, !1032}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1029, file: !903, line: 160, baseType: !732, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1029, file: !903, line: 161, baseType: !787, size: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !921, file: !903, line: 181, baseType: !1034, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !903, line: 181, flags: DIFlagFwdDecl)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !916, file: !903, line: 317, baseType: !1037, size: 64)
!1037 = !DICompositeType(tag: DW_TAG_array_type, baseType: !787, size: 64, elements: !661)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !916, file: !903, line: 318, baseType: !1039, size: 320)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !903, line: 188, size: 320, elements: !1040)
!1040 = !{!1041, !1043, !1066}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1039, file: !903, line: 190, baseType: !1042, size: 192)
!1042 = !DICompositeType(tag: DW_TAG_array_type, baseType: !920, size: 192, elements: !805)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1039, file: !903, line: 193, baseType: !1044, size: 64, offset: 192)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !903, line: 206, size: 320, elements: !1046)
!1046 = !{!1047, !1051, !1052, !1053, !1065}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1045, file: !903, line: 208, baseType: !1048, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !687, line: 62, baseType: !1050)
!1050 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !687, line: 61, flags: DIFlagFwdDecl)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1045, file: !903, line: 211, baseType: !7, size: 32, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1045, file: !903, line: 214, baseType: !787, size: 64, offset: 128)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1045, file: !903, line: 224, baseType: !1054, size: 64, offset: 192)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !903, line: 202, baseType: !1056)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !903, line: 202, size: 128, elements: !1057)
!1057 = !{!1058}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1056, file: !903, line: 202, baseType: !1059, size: 128)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !903, line: 200, baseType: !1060)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !903, line: 200, size: 128, elements: !1061)
!1061 = !{!1062, !1063, !1064}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1060, file: !903, line: 200, baseType: !7, size: 32)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1060, file: !903, line: 200, baseType: !7, size: 32, offset: 32)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1060, file: !903, line: 200, baseType: !934, size: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1045, file: !903, line: 234, baseType: !1054, size: 64, offset: 256)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1039, file: !903, line: 197, baseType: !787, size: 64, offset: 256)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !916, file: !903, line: 319, baseType: !794, size: 256)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !916, file: !903, line: 320, baseType: !813, size: 192)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !734, file: !334, line: 3384, baseType: !1070, size: 1472)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !334, line: 3114, size: 1472, elements: !1071)
!1071 = !{!1072, !1093, !1094, !1095, !1096}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1070, file: !334, line: 3115, baseType: !1073, size: 1216)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !334, line: 2984, size: 1216, elements: !1074)
!1074 = !{!1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1073, file: !334, line: 2985, baseType: !896, size: 960)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1073, file: !334, line: 2986, baseType: !732, size: 64, offset: 960)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1073, file: !334, line: 2987, baseType: !732, size: 64, offset: 1024)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1073, file: !334, line: 2988, baseType: !732, size: 64, offset: 1088)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1073, file: !334, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1073, file: !334, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1073, file: !334, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1073, file: !334, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1073, file: !334, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1073, file: !334, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1073, file: !334, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1073, file: !334, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1073, file: !334, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1073, file: !334, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1073, file: !334, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1073, file: !334, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1073, file: !334, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1073, file: !334, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1070, file: !334, line: 3117, baseType: !732, size: 64, offset: 1216)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1070, file: !334, line: 3119, baseType: !732, size: 64, offset: 1280)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1070, file: !334, line: 3121, baseType: !732, size: 64, offset: 1344)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1070, file: !334, line: 3123, baseType: !732, size: 64, offset: 1408)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !734, file: !334, line: 3385, baseType: !1098, size: 1088)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !334, line: 2874, size: 1088, elements: !1099)
!1099 = !{!1100, !1101, !1102}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1098, file: !334, line: 2875, baseType: !896, size: 960)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1098, file: !334, line: 2876, baseType: !900, size: 64, offset: 960)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1098, file: !334, line: 2877, baseType: !1103, size: 64, offset: 1024)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1105, line: 172, size: 128, elements: !1106)
!1105 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1106 = !{!1107, !1108, !1109, !1110, !1111, !1112, !1113}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1104, file: !1105, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1104, file: !1105, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1104, file: !1105, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1104, file: !1105, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1104, file: !1105, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1104, file: !1105, line: 195, baseType: !7, size: 32, offset: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1104, file: !1105, line: 199, baseType: !732, size: 64, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !734, file: !334, line: 3386, baseType: !1073, size: 1216)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !734, file: !334, line: 3387, baseType: !1116, size: 1280)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !334, line: 3093, size: 1280, elements: !1117)
!1117 = !{!1118, !1119}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1116, file: !334, line: 3094, baseType: !1073, size: 1216)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1116, file: !334, line: 3095, baseType: !1103, size: 64, offset: 1216)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !734, file: !334, line: 3388, baseType: !1121, size: 1216)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !334, line: 2824, size: 1216, elements: !1122)
!1122 = !{!1123, !1124, !1125, !1126, !1127, !1128}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1121, file: !334, line: 2825, baseType: !858, size: 896)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1121, file: !334, line: 2827, baseType: !732, size: 64, offset: 896)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1121, file: !334, line: 2828, baseType: !732, size: 64, offset: 960)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1121, file: !334, line: 2829, baseType: !732, size: 64, offset: 1024)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1121, file: !334, line: 2830, baseType: !732, size: 64, offset: 1088)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1121, file: !334, line: 2831, baseType: !732, size: 64, offset: 1152)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !734, file: !334, line: 3389, baseType: !1130, size: 1024)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !334, line: 2850, size: 1024, elements: !1131)
!1131 = !{!1132, !1133, !1134}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1130, file: !334, line: 2851, baseType: !896, size: 960)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1130, file: !334, line: 2852, baseType: !641, size: 32, offset: 960)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1130, file: !334, line: 2853, baseType: !641, size: 32, offset: 992)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !734, file: !334, line: 3390, baseType: !1136, size: 1024)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !334, line: 2857, size: 1024, elements: !1137)
!1137 = !{!1138, !1139}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1136, file: !334, line: 2858, baseType: !896, size: 960)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1136, file: !334, line: 2859, baseType: !1103, size: 64, offset: 960)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !734, file: !334, line: 3391, baseType: !1141, size: 960)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !334, line: 2862, size: 960, elements: !1142)
!1142 = !{!1143}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1141, file: !334, line: 2863, baseType: !896, size: 960)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !734, file: !334, line: 3392, baseType: !1145, size: 1472)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !334, line: 3304, size: 1472, elements: !1146)
!1146 = !{!1147}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1145, file: !334, line: 3305, baseType: !1070, size: 1472)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !734, file: !334, line: 3393, baseType: !1149, size: 1792)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !334, line: 3248, size: 1792, elements: !1150)
!1150 = !{!1151, !1152, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1149, file: !334, line: 3249, baseType: !1070, size: 1472)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1149, file: !334, line: 3251, baseType: !1153, size: 64, offset: 1472)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1155, line: 463, size: 1152, elements: !1156)
!1155 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1156 = !{!1157, !1160, !1191, !1192, !1333, !1353, !1354, !1355, !1356, !1357, !1358, !1382, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1154, file: !1155, line: 464, baseType: !1158, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1155, line: 464, flags: DIFlagFwdDecl)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1154, file: !1155, line: 467, baseType: !1161, size: 64, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !318, line: 374, size: 640, elements: !1163)
!1163 = !{!1164, !1166, !1167, !1180, !1181, !1182, !1183, !1184, !1185, !1187, !1189, !1190}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1162, file: !318, line: 377, baseType: !1165, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !687, line: 111, baseType: !670)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1162, file: !318, line: 378, baseType: !1165, size: 64, offset: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1162, file: !318, line: 381, baseType: !1168, size: 64, offset: 128)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !318, line: 282, baseType: !1170)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !318, line: 282, size: 128, elements: !1171)
!1171 = !{!1172}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1170, file: !318, line: 282, baseType: !1173, size: 128)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !318, line: 281, baseType: !1174)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !318, line: 281, size: 128, elements: !1175)
!1175 = !{!1176, !1177, !1178}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1174, file: !318, line: 281, baseType: !7, size: 32)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1174, file: !318, line: 281, baseType: !7, size: 32, offset: 32)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1174, file: !318, line: 281, baseType: !1179, size: 64, offset: 64)
!1179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1165, size: 64, elements: !661)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1162, file: !318, line: 384, baseType: !641, size: 32, offset: 192)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1162, file: !318, line: 387, baseType: !641, size: 32, offset: 224)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1162, file: !318, line: 390, baseType: !641, size: 32, offset: 256)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1162, file: !318, line: 394, baseType: !1168, size: 64, offset: 320)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1162, file: !318, line: 396, baseType: !317, size: 32, offset: 384)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1162, file: !318, line: 399, baseType: !1186, size: 64, offset: 416)
!1186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 64, elements: !968)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1162, file: !318, line: 402, baseType: !1188, size: 64, offset: 480)
!1188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !968)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1162, file: !318, line: 406, baseType: !641, size: 32, offset: 544)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1162, file: !318, line: 409, baseType: !641, size: 32, offset: 576)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1154, file: !1155, line: 470, baseType: !698, size: 64, offset: 128)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1154, file: !1155, line: 473, baseType: !1193, size: 64, offset: 192)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1105, line: 39, size: 1152, elements: !1195)
!1195 = !{!1196, !1248, !1261, !1274, !1275, !1287, !1288, !1292, !1293, !1294, !1295, !1296}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1194, file: !1105, line: 41, baseType: !1197, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1198, line: 144, baseType: !1199)
!1198 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1198, line: 100, size: 896, elements: !1201)
!1201 = !{!1202, !1210, !1215, !1220, !1222, !1225, !1226, !1227, !1228, !1229, !1234, !1236, !1237, !1242, !1247}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1200, file: !1198, line: 102, baseType: !1203, size: 64)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1198, line: 52, baseType: !1204)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!1207, !1208}
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1198, line: 47, baseType: !7)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1200, file: !1198, line: 105, baseType: !1211, size: 64, offset: 64)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1198, line: 59, baseType: !1212)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{!641, !1208, !1208}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1200, file: !1198, line: 108, baseType: !1216, size: 64, offset: 128)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1198, line: 63, baseType: !1217)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64)
!1218 = !DISubroutineType(types: !1219)
!1219 = !{null, !645}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1200, file: !1198, line: 111, baseType: !1221, size: 64, offset: 192)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1200, file: !1198, line: 114, baseType: !1223, size: 64, offset: 256)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1224, line: 46, baseType: !785)
!1224 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1200, file: !1198, line: 117, baseType: !1223, size: 64, offset: 320)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1200, file: !1198, line: 120, baseType: !1223, size: 64, offset: 384)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1200, file: !1198, line: 124, baseType: !7, size: 32, offset: 448)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1200, file: !1198, line: 128, baseType: !7, size: 32, offset: 480)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1200, file: !1198, line: 131, baseType: !1230, size: 64, offset: 512)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1198, line: 75, baseType: !1231)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!645, !1223, !1223}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1200, file: !1198, line: 132, baseType: !1235, size: 64, offset: 576)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1198, line: 78, baseType: !1217)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1200, file: !1198, line: 135, baseType: !645, size: 64, offset: 640)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1200, file: !1198, line: 136, baseType: !1238, size: 64, offset: 704)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1198, line: 82, baseType: !1239)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!645, !645, !1223, !1223}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1200, file: !1198, line: 137, baseType: !1243, size: 64, offset: 768)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1198, line: 83, baseType: !1244)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{null, !645, !645}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1200, file: !1198, line: 141, baseType: !7, size: 32, offset: 832)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1194, file: !1105, line: 48, baseType: !1249, size: 64, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !574, line: 35, baseType: !1251)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !574, line: 35, size: 128, elements: !1252)
!1252 = !{!1253}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1251, file: !574, line: 35, baseType: !1254, size: 128)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !574, line: 33, baseType: !1255)
!1255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !574, line: 33, size: 128, elements: !1256)
!1256 = !{!1257, !1258, !1259}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1255, file: !574, line: 33, baseType: !7, size: 32)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1255, file: !574, line: 33, baseType: !7, size: 32, offset: 32)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1255, file: !574, line: 33, baseType: !1260, size: 64, offset: 64)
!1260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 64, elements: !661)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1194, file: !1105, line: 51, baseType: !1262, size: 64, offset: 128)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !334, line: 183, baseType: !1264)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !334, line: 183, size: 128, elements: !1265)
!1265 = !{!1266}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1264, file: !334, line: 183, baseType: !1267, size: 128)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !334, line: 182, baseType: !1268)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !334, line: 182, size: 128, elements: !1269)
!1269 = !{!1270, !1271, !1272}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1268, file: !334, line: 182, baseType: !7, size: 32)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1268, file: !334, line: 182, baseType: !7, size: 32, offset: 32)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1268, file: !334, line: 182, baseType: !1273, size: 64, offset: 64)
!1273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !732, size: 64, elements: !661)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1194, file: !1105, line: 54, baseType: !732, size: 64, offset: 192)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1194, file: !1105, line: 57, baseType: !1276, size: 128, offset: 256)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1277, line: 31, size: 128, elements: !1278)
!1277 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1278 = !{!1279, !1280, !1281, !1282, !1283, !1284, !1285}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1276, file: !1277, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1276, file: !1277, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1276, file: !1277, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1276, file: !1277, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1276, file: !1277, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1276, file: !1277, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1276, file: !1277, line: 56, baseType: !1286, size: 64, offset: 64)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !687, line: 47, baseType: !952)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1194, file: !1105, line: 60, baseType: !1276, size: 128, offset: 384)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1194, file: !1105, line: 64, baseType: !1289, size: 64, offset: 512)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1290 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1291, line: 33, flags: DIFlagFwdDecl)
!1291 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1194, file: !1105, line: 67, baseType: !732, size: 64, offset: 576)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1194, file: !1105, line: 73, baseType: !1197, size: 64, offset: 640)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1194, file: !1105, line: 77, baseType: !1286, size: 64, offset: 704)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1194, file: !1105, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1194, file: !1105, line: 82, baseType: !1297, size: 320, offset: 832)
!1297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !1298, line: 62, size: 320, elements: !1299)
!1298 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1299 = !{!1300, !1306, !1307, !1308, !1309, !1316}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1297, file: !1298, line: 63, baseType: !1301, size: 64)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !1298, line: 56, size: 128, elements: !1303)
!1303 = !{!1304, !1305}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1302, file: !1298, line: 57, baseType: !1301, size: 64)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1302, file: !1298, line: 58, baseType: !829, size: 8, offset: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1297, file: !1298, line: 64, baseType: !7, size: 32, offset: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1297, file: !1298, line: 66, baseType: !7, size: 32, offset: 96)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1297, file: !1298, line: 68, baseType: !640, size: 8, offset: 128)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1297, file: !1298, line: 70, baseType: !1310, size: 64, offset: 192)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64)
!1311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1298, line: 37, size: 128, elements: !1312)
!1312 = !{!1313, !1314}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1311, file: !1298, line: 39, baseType: !1310, size: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1311, file: !1298, line: 40, baseType: !1315, size: 64, offset: 64)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1297, file: !1298, line: 71, baseType: !1317, size: 64, offset: 256)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64)
!1318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1298, line: 45, size: 320, elements: !1319)
!1319 = !{!1320, !1321}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1318, file: !1298, line: 47, baseType: !1317, size: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1318, file: !1298, line: 48, baseType: !1322, size: 256, offset: 64)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !334, line: 1883, size: 256, elements: !1323)
!1323 = !{!1324, !1326, !1327, !1332}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1322, file: !334, line: 1884, baseType: !1325, size: 64)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1322, file: !334, line: 1885, baseType: !1325, size: 64, offset: 64)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1322, file: !334, line: 1891, baseType: !1328, size: 64, offset: 128)
!1328 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1322, file: !334, line: 1891, size: 64, elements: !1329)
!1329 = !{!1330, !1331}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1328, file: !334, line: 1891, baseType: !707, size: 64)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1328, file: !334, line: 1891, baseType: !732, size: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1322, file: !334, line: 1892, baseType: !1315, size: 64, offset: 192)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1154, file: !1155, line: 476, baseType: !1334, size: 64, offset: 256)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64)
!1335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !561, line: 187, size: 256, elements: !1336)
!1336 = !{!1337, !1338, !1351, !1352}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1335, file: !561, line: 189, baseType: !641, size: 32)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1335, file: !561, line: 192, baseType: !1339, size: 64, offset: 64)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64)
!1340 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !561, line: 87, baseType: !1341)
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !561, line: 87, size: 128, elements: !1342)
!1342 = !{!1343}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1341, file: !561, line: 87, baseType: !1344, size: 128)
!1344 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !561, line: 85, baseType: !1345)
!1345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !561, line: 85, size: 128, elements: !1346)
!1346 = !{!1347, !1348, !1349}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1345, file: !561, line: 85, baseType: !7, size: 32)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1345, file: !561, line: 85, baseType: !7, size: 32, offset: 32)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1345, file: !561, line: 85, baseType: !1350, size: 64, offset: 64)
!1350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 64, elements: !661)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1335, file: !561, line: 197, baseType: !1197, size: 64, offset: 128)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1335, file: !561, line: 200, baseType: !664, size: 64, offset: 192)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1154, file: !1155, line: 479, baseType: !1197, size: 64, offset: 320)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1154, file: !1155, line: 484, baseType: !732, size: 64, offset: 384)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1154, file: !1155, line: 488, baseType: !732, size: 64, offset: 448)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1154, file: !1155, line: 493, baseType: !732, size: 64, offset: 512)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1154, file: !1155, line: 496, baseType: !732, size: 64, offset: 576)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1154, file: !1155, line: 501, baseType: !1359, size: 64, offset: 640)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64)
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !329, line: 2355, size: 576, elements: !1361)
!1361 = !{!1362, !1365, !1366, !1367, !1368, !1370, !1371, !1376, !1377, !1378, !1379, !1380, !1381}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1360, file: !329, line: 2356, baseType: !1363, size: 64)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64)
!1364 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !329, line: 2356, flags: DIFlagFwdDecl)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1360, file: !329, line: 2357, baseType: !646, size: 64, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1360, file: !329, line: 2358, baseType: !641, size: 32, offset: 128)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1360, file: !329, line: 2359, baseType: !641, size: 32, offset: 160)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1360, file: !329, line: 2360, baseType: !1369, size: 128, offset: 192)
!1369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !641, size: 128, elements: !992)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1360, file: !329, line: 2364, baseType: !641, size: 32, offset: 320)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1360, file: !329, line: 2367, baseType: !1372, size: 128, offset: 384)
!1372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !329, line: 2349, size: 128, elements: !1373)
!1373 = !{!1374, !1375}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1372, file: !329, line: 2351, baseType: !900, size: 64)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1372, file: !329, line: 2352, baseType: !787, size: 64, offset: 64)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1360, file: !329, line: 2371, baseType: !328, size: 32, offset: 512)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1360, file: !329, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1360, file: !329, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1360, file: !329, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1360, file: !329, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1360, file: !329, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1154, file: !1155, line: 504, baseType: !1383, size: 64, offset: 704)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64)
!1384 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1155, line: 504, flags: DIFlagFwdDecl)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1154, file: !1155, line: 507, baseType: !1197, size: 64, offset: 768)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1154, file: !1155, line: 510, baseType: !641, size: 32, offset: 832)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1154, file: !1155, line: 513, baseType: !641, size: 32, offset: 864)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1154, file: !1155, line: 516, baseType: !725, size: 32, offset: 896)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1154, file: !1155, line: 519, baseType: !725, size: 32, offset: 928)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1154, file: !1155, line: 522, baseType: !7, size: 32, offset: 960)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1154, file: !1155, line: 523, baseType: !7, size: 32, offset: 992)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1154, file: !1155, line: 528, baseType: !646, size: 64, offset: 1024)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1154, file: !1155, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1154, file: !1155, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1154, file: !1155, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1154, file: !1155, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1154, file: !1155, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1154, file: !1155, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1154, file: !1155, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1154, file: !1155, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1154, file: !1155, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1154, file: !1155, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1154, file: !1155, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1154, file: !1155, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1154, file: !1155, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1154, file: !1155, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1154, file: !1155, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1154, file: !1155, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1149, file: !334, line: 3254, baseType: !732, size: 64, offset: 1536)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1149, file: !334, line: 3257, baseType: !732, size: 64, offset: 1600)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1149, file: !334, line: 3258, baseType: !732, size: 64, offset: 1664)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1149, file: !334, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
