; ModuleID = 'tree-into-ssa.bc'
source_filename = "tree-into-ssa.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!614 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!615 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!616 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!617 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!618 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!619 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!620 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!621 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!622 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!623 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!624 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!625 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!626 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!627 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!628 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!629 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rewrite_mode", file: !3, line: 209, baseType: !7, size: 32, elements: !630)
!630 = !{!631, !632}
!631 = !DIEnumerator(name: "REWRITE_ALL", value: 0, isUnsigned: true)
!632 = !DIEnumerator(name: "REWRITE_UPDATE", value: 1, isUnsigned: true)
!633 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !581, line: 727, baseType: !7, size: 32, elements: !634)
!634 = !{!635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658}
!635 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!636 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!637 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!638 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!639 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!640 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!641 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!642 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!643 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!644 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!645 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!646 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!647 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!648 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!649 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!650 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!651 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!652 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!653 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!654 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!655 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!656 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!657 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!658 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!659 = !{!660, !661, !662, !663, !666, !667, !134, !669, !733, !1319, !2053, !2054, !2055, !2061, !7, !788, !2074, !2125, !2132, !2136, !728, !2139, !2144, !2146, !2159, !2172, !2177, !1075, !2182, !2184, !786, !2186, !2187, !2188, !1347, !664, !708}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!662 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !665)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !671, line: 111, baseType: !672)
!671 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !343, line: 217, size: 832, elements: !674)
!674 = !{!675, !2020, !2021, !2022, !2023, !2027, !2028, !2029, !2047, !2048, !2049, !2050, !2051, !2052}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !673, file: !343, line: 219, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !343, line: 151, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !343, line: 151, size: 128, elements: !679)
!679 = !{!680}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !678, file: !343, line: 151, baseType: !681, size: 128)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !343, line: 150, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !343, line: 150, size: 128, elements: !683)
!683 = !{!684, !685, !686}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !682, file: !343, line: 150, baseType: !7, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !682, file: !343, line: 150, baseType: !7, size: 32, offset: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !682, file: !343, line: 150, baseType: !687, size: 64, offset: 64)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 64, elements: !831)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !671, line: 108, baseType: !689)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !343, line: 122, size: 512, elements: !691)
!691 = !{!692, !693, !694, !2012, !2013, !2014, !2015, !2016, !2017, !2018}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !690, file: !343, line: 124, baseType: !672, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !690, file: !343, line: 125, baseType: !672, size: 64, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !690, file: !343, line: 131, baseType: !695, size: 64, offset: 128)
!695 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !343, line: 128, size: 64, elements: !696)
!696 = !{!697, !2011}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !695, file: !343, line: 129, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !671, line: 66, baseType: !699)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !581, line: 143, size: 192, elements: !701)
!701 = !{!702, !2009, !2010}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !700, file: !581, line: 145, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !671, line: 69, baseType: !704)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !581, line: 136, size: 192, elements: !706)
!706 = !{!707, !2007, !2008}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !705, file: !581, line: 137, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !671, line: 58, baseType: !709)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !581, line: 737, size: 768, elements: !711)
!711 = !{!712, !1854, !1864, !1870, !1875, !1880, !1887, !1893, !1899, !1904, !1918, !1923, !1929, !1934, !1944, !1949, !1965, !1972, !1979, !1985, !1990, !1996, !2002}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !710, file: !581, line: 738, baseType: !713, size: 256)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !581, line: 271, size: 256, elements: !714)
!714 = !{!715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !730, !731, !732}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !713, file: !581, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !713, file: !581, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !713, file: !581, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !713, file: !581, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !713, file: !581, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !713, file: !581, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !713, file: !581, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !713, file: !581, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !713, file: !581, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !713, file: !581, line: 312, baseType: !7, size: 32, offset: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !713, file: !581, line: 316, baseType: !726, size: 32, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !727, line: 58, baseType: !728)
!727 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !729, line: 44, baseType: !7)
!729 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!730 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !713, file: !581, line: 319, baseType: !7, size: 32, offset: 96)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !713, file: !581, line: 323, baseType: !672, size: 64, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !713, file: !581, line: 327, baseType: !733, size: 64, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !671, line: 56, baseType: !734)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !736)
!736 = !{!737, !770, !776, !789, !808, !819, !824, !833, !839, !852, !860, !898, !1106, !1134, !1150, !1151, !1156, !1165, !1171, !1176, !1180, !1184, !1505, !1552, !1558, !1564, !1571, !1584, !1598, !1615, !1627, !1649, !1664, !1836}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !735, file: !135, line: 3372, baseType: !738, size: 64)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !739)
!739 = !{!740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !738, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !738, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !738, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !738, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !738, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !738, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !738, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !738, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !738, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !738, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !738, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !738, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !738, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !738, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !738, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !738, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !738, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !738, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !738, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !738, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !738, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !738, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !738, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !738, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !738, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !738, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !738, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !738, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !738, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !738, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !735, file: !135, line: 3373, baseType: !771, size: 192)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !772)
!772 = !{!773, !774, !775}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !771, file: !135, line: 403, baseType: !738, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !771, file: !135, line: 404, baseType: !733, size: 64, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !771, file: !135, line: 405, baseType: !733, size: 64, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !735, file: !135, line: 3374, baseType: !777, size: 320)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !778)
!778 = !{!779, !780}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !777, file: !135, line: 1385, baseType: !771, size: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !777, file: !135, line: 1386, baseType: !781, size: 128, offset: 192)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !782, line: 58, baseType: !783)
!782 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !782, line: 54, size: 128, elements: !784)
!784 = !{!785, !787}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !783, file: !782, line: 56, baseType: !786, size: 64)
!786 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !783, file: !782, line: 57, baseType: !788, size: 64, offset: 64)
!788 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !735, file: !135, line: 3375, baseType: !790, size: 256)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !791)
!791 = !{!792, !793}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !790, file: !135, line: 1398, baseType: !771, size: 192)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !790, file: !135, line: 1399, baseType: !794, size: 64, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !796, line: 52, size: 256, elements: !797)
!796 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!797 = !{!798, !799, !800, !801, !802, !803, !804}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !795, file: !796, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !795, file: !796, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !795, file: !796, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !795, file: !796, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !795, file: !796, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !795, file: !796, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !795, file: !796, line: 62, baseType: !805, size: 192, offset: 64)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !786, size: 192, elements: !806)
!806 = !{!807}
!807 = !DISubrange(count: 3)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !735, file: !135, line: 3376, baseType: !809, size: 256)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !810)
!810 = !{!811, !812}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !809, file: !135, line: 1409, baseType: !771, size: 192)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !809, file: !135, line: 1410, baseType: !813, size: 64, offset: 192)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !815, line: 27, size: 192, elements: !816)
!815 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!816 = !{!817, !818}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !814, file: !815, line: 29, baseType: !781, size: 128)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !814, file: !815, line: 30, baseType: !5, size: 32, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !735, file: !135, line: 3377, baseType: !820, size: 256)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !821)
!821 = !{!822, !823}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !820, file: !135, line: 1438, baseType: !771, size: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !820, file: !135, line: 1439, baseType: !733, size: 64, offset: 192)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !735, file: !135, line: 3378, baseType: !825, size: 256)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !826)
!826 = !{!827, !828, !829}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !825, file: !135, line: 1419, baseType: !771, size: 192)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !825, file: !135, line: 1420, baseType: !662, size: 32, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !825, file: !135, line: 1421, baseType: !830, size: 8, offset: 224)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 8, elements: !831)
!831 = !{!832}
!832 = !DISubrange(count: 1)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !735, file: !135, line: 3379, baseType: !834, size: 320)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !835)
!835 = !{!836, !837, !838}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !834, file: !135, line: 1429, baseType: !771, size: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !834, file: !135, line: 1430, baseType: !733, size: 64, offset: 192)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !834, file: !135, line: 1431, baseType: !733, size: 64, offset: 256)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !735, file: !135, line: 3380, baseType: !840, size: 320)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !841)
!841 = !{!842, !843}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !840, file: !135, line: 1461, baseType: !771, size: 192)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !840, file: !135, line: 1462, baseType: !844, size: 128, offset: 192)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !845, line: 31, size: 128, elements: !846)
!845 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!846 = !{!847, !850, !851}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !844, file: !845, line: 32, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !661)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !844, file: !845, line: 33, baseType: !7, size: 32, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !844, file: !845, line: 34, baseType: !7, size: 32, offset: 96)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !735, file: !135, line: 3381, baseType: !853, size: 384)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !854)
!854 = !{!855, !856, !857, !858, !859}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !853, file: !135, line: 2508, baseType: !771, size: 192)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !853, file: !135, line: 2509, baseType: !726, size: 32, offset: 192)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !853, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !853, file: !135, line: 2511, baseType: !733, size: 64, offset: 256)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !853, file: !135, line: 2512, baseType: !733, size: 64, offset: 320)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !735, file: !135, line: 3382, baseType: !861, size: 896)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !862)
!862 = !{!863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !861, file: !135, line: 2653, baseType: !853, size: 384)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !861, file: !135, line: 2654, baseType: !733, size: 64, offset: 384)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !861, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !861, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !861, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !861, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !861, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !861, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !861, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !861, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !861, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !861, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !861, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !861, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !861, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !861, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !861, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !861, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !861, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !861, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !861, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !861, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !861, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !861, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !861, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !861, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !861, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !861, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !861, file: !135, line: 2705, baseType: !733, size: 64, offset: 576)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !861, file: !135, line: 2706, baseType: !733, size: 64, offset: 640)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !861, file: !135, line: 2707, baseType: !733, size: 64, offset: 704)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !861, file: !135, line: 2708, baseType: !733, size: 64, offset: 768)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !861, file: !135, line: 2711, baseType: !896, size: 64, offset: 832)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !735, file: !135, line: 3383, baseType: !899, size: 960)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !900)
!900 = !{!901, !902}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !899, file: !135, line: 2757, baseType: !861, size: 896)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !899, file: !135, line: 2758, baseType: !903, size: 64, offset: 896)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !671, line: 50, baseType: !904)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !906, line: 240, size: 384, elements: !907)
!906 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!907 = !{!908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !905, file: !906, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !905, file: !906, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !905, file: !906, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !905, file: !906, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !905, file: !906, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !905, file: !906, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !905, file: !906, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !905, file: !906, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !905, file: !906, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !905, file: !906, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !905, file: !906, line: 321, baseType: !919, size: 320, offset: 64)
!919 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !906, line: 315, size: 320, elements: !920)
!920 = !{!921, !1039, !1041, !1104, !1105}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !919, file: !906, line: 316, baseType: !922, size: 64)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 64, elements: !831)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !906, line: 183, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !906, line: 166, size: 64, elements: !925)
!925 = !{!926, !927, !928, !929, !930, !938, !939, !951, !954, !1014, !1015, !1016, !1029, !1036}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !924, file: !906, line: 168, baseType: !662, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !924, file: !906, line: 169, baseType: !7, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !924, file: !906, line: 170, baseType: !667, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !924, file: !906, line: 171, baseType: !903, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !924, file: !906, line: 172, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !671, line: 53, baseType: !932)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !906, line: 359, size: 128, elements: !934)
!934 = !{!935, !936}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !933, file: !906, line: 360, baseType: !662, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !933, file: !906, line: 361, baseType: !937, size: 64, offset: 64)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 64, elements: !831)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !924, file: !906, line: 173, baseType: !5, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !924, file: !906, line: 174, baseType: !940, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !906, line: 133, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !906, line: 115, size: 32, elements: !942)
!942 = !{!943, !944, !945, !946, !947, !948, !949, !950}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !941, file: !906, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !941, file: !906, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !941, file: !906, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !941, file: !906, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !941, file: !906, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !941, file: !906, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !941, file: !906, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !941, file: !906, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !924, file: !906, line: 175, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !906, line: 175, flags: DIFlagFwdDecl)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !924, file: !906, line: 176, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !957, line: 75, size: 256, elements: !958)
!957 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!958 = !{!959, !973, !974, !975}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !956, file: !957, line: 76, baseType: !960, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !957, line: 68, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !957, line: 63, size: 320, elements: !963)
!963 = !{!964, !966, !967, !968}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !962, file: !957, line: 64, baseType: !965, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !962, file: !957, line: 65, baseType: !965, size: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !962, file: !957, line: 66, baseType: !7, size: 32, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !962, file: !957, line: 67, baseType: !969, size: 128, offset: 192)
!969 = !DICompositeType(tag: DW_TAG_array_type, baseType: !970, size: 128, elements: !971)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !957, line: 29, baseType: !786)
!971 = !{!972}
!972 = !DISubrange(count: 2)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !956, file: !957, line: 77, baseType: !960, size: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !956, file: !957, line: 78, baseType: !7, size: 32, offset: 128)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !956, file: !957, line: 79, baseType: !976, size: 64, offset: 192)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !957, line: 49, baseType: !978)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !957, line: 45, size: 832, elements: !979)
!979 = !{!980, !981, !982}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !978, file: !957, line: 46, baseType: !965, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !978, file: !957, line: 47, baseType: !955, size: 64, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !978, file: !957, line: 48, baseType: !983, size: 704, offset: 128)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !984, line: 164, size: 704, elements: !985)
!984 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!985 = !{!986, !987, !997, !998, !999, !1000, !1001, !1002, !1006, !1010, !1011, !1012, !1013}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !983, file: !984, line: 166, baseType: !788, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !983, file: !984, line: 167, baseType: !988, size: 64, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !984, line: 157, size: 192, elements: !990)
!990 = !{!991, !992, !993}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !989, file: !984, line: 159, baseType: !664, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !989, file: !984, line: 160, baseType: !988, size: 64, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !989, file: !984, line: 161, baseType: !994, size: 32, offset: 128)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 32, elements: !995)
!995 = !{!996}
!996 = !DISubrange(count: 4)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !983, file: !984, line: 168, baseType: !664, size: 64, offset: 128)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !983, file: !984, line: 169, baseType: !664, size: 64, offset: 192)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !983, file: !984, line: 170, baseType: !664, size: 64, offset: 256)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !983, file: !984, line: 171, baseType: !788, size: 64, offset: 320)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !983, file: !984, line: 172, baseType: !662, size: 32, offset: 384)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !983, file: !984, line: 176, baseType: !1003, size: 64, offset: 448)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!988, !666, !788}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !983, file: !984, line: 177, baseType: !1007, size: 64, offset: 512)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{null, !666, !988}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !983, file: !984, line: 178, baseType: !666, size: 64, offset: 576)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !983, file: !984, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !983, file: !984, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !983, file: !984, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !924, file: !906, line: 177, baseType: !733, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !924, file: !906, line: 178, baseType: !672, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !924, file: !906, line: 179, baseType: !1017, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !906, line: 150, baseType: !1019)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !906, line: 142, size: 320, elements: !1020)
!1020 = !{!1021, !1022, !1023, !1024, !1027, !1028}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1019, file: !906, line: 144, baseType: !733, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1019, file: !906, line: 145, baseType: !903, size: 64, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1019, file: !906, line: 146, baseType: !903, size: 64, offset: 128)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1019, file: !906, line: 147, baseType: !1025, size: 32, offset: 192)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1026, line: 31, baseType: !662)
!1026 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1019, file: !906, line: 148, baseType: !7, size: 32, offset: 224)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1019, file: !906, line: 149, baseType: !661, size: 8, offset: 256)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !924, file: !906, line: 180, baseType: !1030, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !906, line: 162, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !906, line: 159, size: 128, elements: !1033)
!1033 = !{!1034, !1035}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1032, file: !906, line: 160, baseType: !733, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1032, file: !906, line: 161, baseType: !788, size: 64, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !924, file: !906, line: 181, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !906, line: 181, flags: DIFlagFwdDecl)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !919, file: !906, line: 317, baseType: !1040, size: 64)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !788, size: 64, elements: !831)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !919, file: !906, line: 318, baseType: !1042, size: 320)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !906, line: 188, size: 320, elements: !1043)
!1043 = !{!1044, !1046, !1103}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1042, file: !906, line: 190, baseType: !1045, size: 192)
!1045 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 192, elements: !806)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1042, file: !906, line: 193, baseType: !1047, size: 64, offset: 192)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !906, line: 206, size: 320, elements: !1049)
!1049 = !{!1050, !1088, !1089, !1090, !1102}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1048, file: !906, line: 208, baseType: !1051, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !671, line: 62, baseType: !1053)
!1053 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1054, line: 538, size: 256, elements: !1055)
!1054 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1055 = !{!1056, !1060, !1066, !1079}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1053, file: !1054, line: 539, baseType: !1057, size: 32)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1054, line: 482, size: 32, elements: !1058)
!1058 = !{!1059}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1057, file: !1054, line: 484, baseType: !7, size: 32)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1053, file: !1054, line: 540, baseType: !1061, size: 192)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1054, line: 488, size: 192, elements: !1062)
!1062 = !{!1063, !1064, !1065}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1061, file: !1054, line: 489, baseType: !1057, size: 32)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1061, file: !1054, line: 492, baseType: !667, size: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1061, file: !1054, line: 496, baseType: !733, size: 64, offset: 128)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1053, file: !1054, line: 541, baseType: !1067, size: 256)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1054, line: 504, size: 256, elements: !1068)
!1068 = !{!1069, !1070, !1077, !1078}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1067, file: !1054, line: 505, baseType: !1057, size: 32)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1067, file: !1054, line: 509, baseType: !1071, size: 64, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1054, line: 501, baseType: !1072)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{null, !1075}
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1067, file: !1054, line: 510, baseType: !1075, size: 64, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1067, file: !1054, line: 513, baseType: !1051, size: 64, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1053, file: !1054, line: 542, baseType: !1080, size: 128)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1054, line: 530, size: 128, elements: !1081)
!1081 = !{!1082, !1083}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1080, file: !1054, line: 531, baseType: !1057, size: 32)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1080, file: !1054, line: 534, baseType: !1084, size: 64, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1054, line: 525, baseType: !1085)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!661, !733, !667, !786, !786}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1048, file: !906, line: 211, baseType: !7, size: 32, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1048, file: !906, line: 214, baseType: !788, size: 64, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1048, file: !906, line: 224, baseType: !1091, size: 64, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !906, line: 202, baseType: !1093)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !906, line: 202, size: 128, elements: !1094)
!1094 = !{!1095}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1093, file: !906, line: 202, baseType: !1096, size: 128)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !906, line: 200, baseType: !1097)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !906, line: 200, size: 128, elements: !1098)
!1098 = !{!1099, !1100, !1101}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1097, file: !906, line: 200, baseType: !7, size: 32)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1097, file: !906, line: 200, baseType: !7, size: 32, offset: 32)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1097, file: !906, line: 200, baseType: !937, size: 64, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1048, file: !906, line: 234, baseType: !1091, size: 64, offset: 256)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1042, file: !906, line: 197, baseType: !788, size: 64, offset: 256)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !919, file: !906, line: 319, baseType: !795, size: 256)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !919, file: !906, line: 320, baseType: !814, size: 192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !735, file: !135, line: 3384, baseType: !1107, size: 1472)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1108)
!1108 = !{!1109, !1130, !1131, !1132, !1133}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1107, file: !135, line: 3115, baseType: !1110, size: 1216)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1111)
!1111 = !{!1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1110, file: !135, line: 2985, baseType: !899, size: 960)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1110, file: !135, line: 2986, baseType: !733, size: 64, offset: 960)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1110, file: !135, line: 2987, baseType: !733, size: 64, offset: 1024)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1110, file: !135, line: 2988, baseType: !733, size: 64, offset: 1088)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1110, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1110, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1110, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1110, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1110, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1110, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1110, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1110, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1110, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1110, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1110, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1110, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1110, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1110, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1107, file: !135, line: 3117, baseType: !733, size: 64, offset: 1216)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1107, file: !135, line: 3119, baseType: !733, size: 64, offset: 1280)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1107, file: !135, line: 3121, baseType: !733, size: 64, offset: 1344)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1107, file: !135, line: 3123, baseType: !733, size: 64, offset: 1408)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !735, file: !135, line: 3385, baseType: !1135, size: 1088)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1136)
!1136 = !{!1137, !1138, !1139}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1135, file: !135, line: 2875, baseType: !899, size: 960)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1135, file: !135, line: 2876, baseType: !903, size: 64, offset: 960)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1135, file: !135, line: 2877, baseType: !1140, size: 64, offset: 1024)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !586, line: 172, size: 128, elements: !1142)
!1142 = !{!1143, !1144, !1145, !1146, !1147, !1148, !1149}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1141, file: !586, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1141, file: !586, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1141, file: !586, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1141, file: !586, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1141, file: !586, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1141, file: !586, line: 195, baseType: !7, size: 32, offset: 32)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1141, file: !586, line: 199, baseType: !733, size: 64, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !735, file: !135, line: 3386, baseType: !1110, size: 1216)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !735, file: !135, line: 3387, baseType: !1152, size: 1280)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1153)
!1153 = !{!1154, !1155}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1152, file: !135, line: 3094, baseType: !1110, size: 1216)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1152, file: !135, line: 3095, baseType: !1140, size: 64, offset: 1216)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !735, file: !135, line: 3388, baseType: !1157, size: 1216)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1158)
!1158 = !{!1159, !1160, !1161, !1162, !1163, !1164}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1157, file: !135, line: 2825, baseType: !861, size: 896)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1157, file: !135, line: 2827, baseType: !733, size: 64, offset: 896)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1157, file: !135, line: 2828, baseType: !733, size: 64, offset: 960)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1157, file: !135, line: 2829, baseType: !733, size: 64, offset: 1024)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1157, file: !135, line: 2830, baseType: !733, size: 64, offset: 1088)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1157, file: !135, line: 2831, baseType: !733, size: 64, offset: 1152)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !735, file: !135, line: 3389, baseType: !1166, size: 1024)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1167)
!1167 = !{!1168, !1169, !1170}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1166, file: !135, line: 2851, baseType: !899, size: 960)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1166, file: !135, line: 2852, baseType: !662, size: 32, offset: 960)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1166, file: !135, line: 2853, baseType: !662, size: 32, offset: 992)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !735, file: !135, line: 3390, baseType: !1172, size: 1024)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !1173)
!1173 = !{!1174, !1175}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1172, file: !135, line: 2858, baseType: !899, size: 960)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1172, file: !135, line: 2859, baseType: !1140, size: 64, offset: 960)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !735, file: !135, line: 3391, baseType: !1177, size: 960)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !1178)
!1178 = !{!1179}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1177, file: !135, line: 2863, baseType: !899, size: 960)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !735, file: !135, line: 3392, baseType: !1181, size: 1472)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !1182)
!1182 = !{!1183}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1181, file: !135, line: 3305, baseType: !1107, size: 1472)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !735, file: !135, line: 3393, baseType: !1185, size: 1792)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !1186)
!1186 = !{!1187, !1188, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1185, file: !135, line: 3249, baseType: !1107, size: 1472)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1185, file: !135, line: 3251, baseType: !1189, size: 64, offset: 1472)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1191, line: 463, size: 1152, elements: !1192)
!1191 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1192 = !{!1193, !1196, !1226, !1227, !1365, !1428, !1429, !1430, !1431, !1432, !1433, !1457, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1190, file: !1191, line: 464, baseType: !1194, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1191, line: 464, flags: DIFlagFwdDecl)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1190, file: !1191, line: 467, baseType: !1197, size: 64, offset: 64)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !343, line: 374, size: 640, elements: !1199)
!1199 = !{!1200, !1201, !1202, !1215, !1216, !1217, !1218, !1219, !1220, !1222, !1224, !1225}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1198, file: !343, line: 377, baseType: !670, size: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1198, file: !343, line: 378, baseType: !670, size: 64, offset: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1198, file: !343, line: 381, baseType: !1203, size: 64, offset: 128)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !343, line: 282, baseType: !1205)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !343, line: 282, size: 128, elements: !1206)
!1206 = !{!1207}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1205, file: !343, line: 282, baseType: !1208, size: 128)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !343, line: 281, baseType: !1209)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !343, line: 281, size: 128, elements: !1210)
!1210 = !{!1211, !1212, !1213}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1209, file: !343, line: 281, baseType: !7, size: 32)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1209, file: !343, line: 281, baseType: !7, size: 32, offset: 32)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1209, file: !343, line: 281, baseType: !1214, size: 64, offset: 64)
!1214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 64, elements: !831)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1198, file: !343, line: 384, baseType: !662, size: 32, offset: 192)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1198, file: !343, line: 387, baseType: !662, size: 32, offset: 224)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1198, file: !343, line: 390, baseType: !662, size: 32, offset: 256)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1198, file: !343, line: 394, baseType: !1203, size: 64, offset: 320)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1198, file: !343, line: 396, baseType: !342, size: 32, offset: 384)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1198, file: !343, line: 399, baseType: !1221, size: 64, offset: 416)
!1221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 64, elements: !971)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1198, file: !343, line: 402, baseType: !1223, size: 64, offset: 480)
!1223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !971)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1198, file: !343, line: 406, baseType: !662, size: 32, offset: 544)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1198, file: !343, line: 409, baseType: !662, size: 32, offset: 576)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1190, file: !1191, line: 470, baseType: !699, size: 64, offset: 128)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1190, file: !1191, line: 473, baseType: !1228, size: 64, offset: 192)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !586, line: 39, size: 1152, elements: !1230)
!1230 = !{!1231, !1281, !1294, !1307, !1308, !1320, !1321, !1325, !1326, !1327, !1328, !1329}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1229, file: !586, line: 41, baseType: !1232, size: 64)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1233, line: 144, baseType: !1234)
!1233 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1233, line: 100, size: 896, elements: !1236)
!1236 = !{!1237, !1243, !1248, !1253, !1255, !1258, !1259, !1260, !1261, !1262, !1267, !1269, !1270, !1275, !1280}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1235, file: !1233, line: 102, baseType: !1238, size: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1233, line: 52, baseType: !1239)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!1242, !1075}
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1233, line: 47, baseType: !7)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1235, file: !1233, line: 105, baseType: !1244, size: 64, offset: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1233, line: 59, baseType: !1245)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!662, !1075, !1075}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1235, file: !1233, line: 108, baseType: !1249, size: 64, offset: 128)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1233, line: 63, baseType: !1250)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{null, !666}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1235, file: !1233, line: 111, baseType: !1254, size: 64, offset: 192)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1235, file: !1233, line: 114, baseType: !1256, size: 64, offset: 256)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1257, line: 46, baseType: !786)
!1257 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1235, file: !1233, line: 117, baseType: !1256, size: 64, offset: 320)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1235, file: !1233, line: 120, baseType: !1256, size: 64, offset: 384)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1235, file: !1233, line: 124, baseType: !7, size: 32, offset: 448)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1235, file: !1233, line: 128, baseType: !7, size: 32, offset: 480)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1235, file: !1233, line: 131, baseType: !1263, size: 64, offset: 512)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1233, line: 75, baseType: !1264)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!666, !1256, !1256}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1235, file: !1233, line: 132, baseType: !1268, size: 64, offset: 576)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1233, line: 78, baseType: !1250)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1235, file: !1233, line: 135, baseType: !666, size: 64, offset: 640)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1235, file: !1233, line: 136, baseType: !1271, size: 64, offset: 704)
!1271 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1233, line: 82, baseType: !1272)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64)
!1273 = !DISubroutineType(types: !1274)
!1274 = !{!666, !666, !1256, !1256}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1235, file: !1233, line: 137, baseType: !1276, size: 64, offset: 768)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1233, line: 83, baseType: !1277)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64)
!1278 = !DISubroutineType(types: !1279)
!1279 = !{null, !666, !666}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1235, file: !1233, line: 141, baseType: !7, size: 32, offset: 832)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1229, file: !586, line: 48, baseType: !1282, size: 64, offset: 64)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !581, line: 35, baseType: !1284)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !581, line: 35, size: 128, elements: !1285)
!1285 = !{!1286}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1284, file: !581, line: 35, baseType: !1287, size: 128)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !581, line: 33, baseType: !1288)
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !581, line: 33, size: 128, elements: !1289)
!1289 = !{!1290, !1291, !1292}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1288, file: !581, line: 33, baseType: !7, size: 32)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1288, file: !581, line: 33, baseType: !7, size: 32, offset: 32)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1288, file: !581, line: 33, baseType: !1293, size: 64, offset: 64)
!1293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !708, size: 64, elements: !831)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1229, file: !586, line: 51, baseType: !1295, size: 64, offset: 128)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !135, line: 183, baseType: !1297)
!1297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !135, line: 183, size: 128, elements: !1298)
!1298 = !{!1299}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1297, file: !135, line: 183, baseType: !1300, size: 128)
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !135, line: 182, baseType: !1301)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !135, line: 182, size: 128, elements: !1302)
!1302 = !{!1303, !1304, !1305}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1301, file: !135, line: 182, baseType: !7, size: 32)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1301, file: !135, line: 182, baseType: !7, size: 32, offset: 32)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1301, file: !135, line: 182, baseType: !1306, size: 64, offset: 64)
!1306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !733, size: 64, elements: !831)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1229, file: !586, line: 54, baseType: !733, size: 64, offset: 192)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1229, file: !586, line: 57, baseType: !1309, size: 128, offset: 256)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1310, line: 31, size: 128, elements: !1311)
!1310 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1311 = !{!1312, !1313, !1314, !1315, !1316, !1317, !1318}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1309, file: !1310, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1309, file: !1310, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1309, file: !1310, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1309, file: !1310, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1309, file: !1310, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1309, file: !1310, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1309, file: !1310, line: 56, baseType: !1319, size: 64, offset: 64)
!1319 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !671, line: 47, baseType: !955)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1229, file: !586, line: 60, baseType: !1309, size: 128, offset: 384)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1229, file: !586, line: 64, baseType: !1322, size: 64, offset: 512)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64)
!1323 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1324, line: 33, flags: DIFlagFwdDecl)
!1324 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1229, file: !586, line: 67, baseType: !733, size: 64, offset: 576)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1229, file: !586, line: 73, baseType: !1232, size: 64, offset: 640)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1229, file: !586, line: 77, baseType: !1319, size: 64, offset: 704)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1229, file: !586, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1229, file: !586, line: 82, baseType: !1330, size: 320, offset: 832)
!1330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !574, line: 62, size: 320, elements: !1331)
!1331 = !{!1332, !1338, !1339, !1340, !1341, !1348}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1330, file: !574, line: 63, baseType: !1333, size: 64)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64)
!1334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !574, line: 56, size: 128, elements: !1335)
!1335 = !{!1336, !1337}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1334, file: !574, line: 57, baseType: !1333, size: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1334, file: !574, line: 58, baseType: !830, size: 8, offset: 64)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1330, file: !574, line: 64, baseType: !7, size: 32, offset: 64)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1330, file: !574, line: 66, baseType: !7, size: 32, offset: 96)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1330, file: !574, line: 68, baseType: !661, size: 8, offset: 128)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1330, file: !574, line: 70, baseType: !1342, size: 64, offset: 192)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64)
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !574, line: 37, size: 128, elements: !1344)
!1344 = !{!1345, !1346}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1343, file: !574, line: 39, baseType: !1342, size: 64)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1343, file: !574, line: 40, baseType: !1347, size: 64, offset: 64)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1330, file: !574, line: 71, baseType: !1349, size: 64, offset: 256)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64)
!1350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !574, line: 45, size: 320, elements: !1351)
!1351 = !{!1352, !1353}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1350, file: !574, line: 47, baseType: !1349, size: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1350, file: !574, line: 48, baseType: !1354, size: 256, offset: 64)
!1354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !1355)
!1355 = !{!1356, !1358, !1359, !1364}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1354, file: !135, line: 1884, baseType: !1357, size: 64)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1354, file: !135, line: 1885, baseType: !1357, size: 64, offset: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1354, file: !135, line: 1891, baseType: !1360, size: 64, offset: 128)
!1360 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1354, file: !135, line: 1891, size: 64, elements: !1361)
!1361 = !{!1362, !1363}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1360, file: !135, line: 1891, baseType: !708, size: 64)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1360, file: !135, line: 1891, baseType: !733, size: 64)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1354, file: !135, line: 1892, baseType: !1347, size: 64, offset: 192)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1190, file: !1191, line: 476, baseType: !1366, size: 64, offset: 256)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64)
!1367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !330, line: 187, size: 256, elements: !1368)
!1368 = !{!1369, !1370, !1426, !1427}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1367, file: !330, line: 189, baseType: !662, size: 32)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1367, file: !330, line: 192, baseType: !1371, size: 64, offset: 64)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64)
!1372 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !330, line: 87, baseType: !1373)
!1373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !330, line: 87, size: 128, elements: !1374)
!1374 = !{!1375}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1373, file: !330, line: 87, baseType: !1376, size: 128)
!1376 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !330, line: 85, baseType: !1377)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !330, line: 85, size: 128, elements: !1378)
!1378 = !{!1379, !1380, !1381}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1377, file: !330, line: 85, baseType: !7, size: 32)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1377, file: !330, line: 85, baseType: !7, size: 32, offset: 32)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1377, file: !330, line: 85, baseType: !1382, size: 64, offset: 64)
!1382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1383, size: 64, elements: !831)
!1383 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !330, line: 84, baseType: !1384)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64)
!1385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 100, size: 1216, elements: !1386)
!1386 = !{!1387, !1388, !1389, !1390, !1391, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1416, !1424, !1425}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1385, file: !330, line: 102, baseType: !662, size: 32)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1385, file: !330, line: 105, baseType: !7, size: 32, offset: 32)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1385, file: !330, line: 108, baseType: !672, size: 64, offset: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1385, file: !330, line: 111, baseType: !672, size: 64, offset: 128)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1385, file: !330, line: 114, baseType: !1392, size: 64, offset: 192)
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !330, line: 41, size: 64, elements: !1393)
!1393 = !{!1394, !1395}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1392, file: !330, line: 42, baseType: !329, size: 32)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1392, file: !330, line: 43, baseType: !7, size: 32, offset: 32)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1385, file: !330, line: 117, baseType: !7, size: 32, offset: 256)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1385, file: !330, line: 120, baseType: !7, size: 32, offset: 288)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1385, file: !330, line: 123, baseType: !1371, size: 64, offset: 320)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1385, file: !330, line: 126, baseType: !1384, size: 64, offset: 384)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1385, file: !330, line: 129, baseType: !1384, size: 64, offset: 448)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1385, file: !330, line: 132, baseType: !666, size: 64, offset: 512)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1385, file: !330, line: 139, baseType: !733, size: 64, offset: 576)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1385, file: !330, line: 143, baseType: !781, size: 128, offset: 640)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1385, file: !330, line: 146, baseType: !781, size: 128, offset: 768)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1385, file: !330, line: 148, baseType: !661, size: 8, offset: 896)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1385, file: !330, line: 149, baseType: !661, size: 8, offset: 904)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1385, file: !330, line: 153, baseType: !338, size: 32, offset: 928)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1385, file: !330, line: 156, baseType: !1409, size: 64, offset: 960)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64)
!1410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !330, line: 48, size: 320, elements: !1411)
!1411 = !{!1412, !1413, !1414, !1415}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1410, file: !330, line: 50, baseType: !708, size: 64)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1410, file: !330, line: 59, baseType: !781, size: 128, offset: 64)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1410, file: !330, line: 64, baseType: !661, size: 8, offset: 192)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1410, file: !330, line: 67, baseType: !1409, size: 64, offset: 256)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1385, file: !330, line: 159, baseType: !1417, size: 64, offset: 1024)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64)
!1418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !330, line: 72, size: 256, elements: !1419)
!1419 = !{!1420, !1421, !1422, !1423}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1418, file: !330, line: 74, baseType: !689, size: 64)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1418, file: !330, line: 77, baseType: !1417, size: 64, offset: 64)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1418, file: !330, line: 78, baseType: !1417, size: 64, offset: 128)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1418, file: !330, line: 81, baseType: !1417, size: 64, offset: 192)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1385, file: !330, line: 162, baseType: !661, size: 8, offset: 1088)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1385, file: !330, line: 166, baseType: !733, size: 64, offset: 1152)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1367, file: !330, line: 197, baseType: !1232, size: 64, offset: 128)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1367, file: !330, line: 200, baseType: !1384, size: 64, offset: 192)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1190, file: !1191, line: 479, baseType: !1232, size: 64, offset: 320)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1190, file: !1191, line: 484, baseType: !733, size: 64, offset: 384)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1190, file: !1191, line: 488, baseType: !733, size: 64, offset: 448)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1190, file: !1191, line: 493, baseType: !733, size: 64, offset: 512)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1190, file: !1191, line: 496, baseType: !733, size: 64, offset: 576)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1190, file: !1191, line: 501, baseType: !1434, size: 64, offset: 640)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64)
!1435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !354, line: 2355, size: 576, elements: !1436)
!1436 = !{!1437, !1440, !1441, !1442, !1443, !1445, !1446, !1451, !1452, !1453, !1454, !1455, !1456}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1435, file: !354, line: 2356, baseType: !1438, size: 64)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64)
!1439 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !354, line: 2356, flags: DIFlagFwdDecl)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1435, file: !354, line: 2357, baseType: !667, size: 64, offset: 64)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1435, file: !354, line: 2358, baseType: !662, size: 32, offset: 128)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1435, file: !354, line: 2359, baseType: !662, size: 32, offset: 160)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1435, file: !354, line: 2360, baseType: !1444, size: 128, offset: 192)
!1444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !662, size: 128, elements: !995)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1435, file: !354, line: 2364, baseType: !662, size: 32, offset: 320)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1435, file: !354, line: 2367, baseType: !1447, size: 128, offset: 384)
!1447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !354, line: 2349, size: 128, elements: !1448)
!1448 = !{!1449, !1450}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1447, file: !354, line: 2351, baseType: !903, size: 64)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1447, file: !354, line: 2352, baseType: !788, size: 64, offset: 64)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1435, file: !354, line: 2371, baseType: !353, size: 32, offset: 512)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1435, file: !354, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1435, file: !354, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
