; ModuleID = 'tree-nested.bc'
source_filename = "tree-nested.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }

!599 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!600 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!601 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!602 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!603 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!604 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!605 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!606 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!607 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!608 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!609 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!610 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!611 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!612 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!613 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!614 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!615 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!616 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!617 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!618 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!619 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!620 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!621 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!622 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !584, line: 727, baseType: !7, size: 32, elements: !623)
!623 = !{!624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647}
!624 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!625 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!626 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!627 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!628 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!629 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!630 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!631 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!632 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!633 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!634 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!635 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!636 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!637 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!638 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!639 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!640 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!641 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!642 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!643 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!644 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!645 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!646 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!647 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!648 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "insert_option", file: !649, line: 147, baseType: !7, size: 32, elements: !650)
!649 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!650 = !{!651, !652}
!651 = !DIEnumerator(name: "NO_INSERT", value: 0, isUnsigned: true)
!652 = !DIEnumerator(name: "INSERT", value: 1, isUnsigned: true)
!653 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "copy_body_cge_which", file: !654, line: 33, baseType: !7, size: 32, elements: !655)
!654 = !DIFile(filename: "./tree-inline.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!655 = !{!656, !657, !658}
!656 = !DIEnumerator(name: "CB_CGE_DUPLICATE", value: 0, isUnsigned: true)
!657 = !DIEnumerator(name: "CB_CGE_MOVE", value: 1, isUnsigned: true)
!658 = !DIEnumerator(name: "CB_CGE_MOVE_CLONES", value: 2, isUnsigned: true)
!659 = !{!660, !661, !662, !663, !666, !667, !134, !669, !745, !1008, !1983, !1042, !664, !1985, !869, !2004, !2005}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!662 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !665)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nesting_info", file: !3, line: 81, size: 960, elements: !671)
!671 = !{!672, !673, !674, !675, !679, !680, !744, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !670, file: !3, line: 83, baseType: !669, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !670, file: !3, line: 84, baseType: !669, size: 64, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !670, file: !3, line: 85, baseType: !669, size: 64, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "field_map", scope: !670, file: !3, line: 87, baseType: !676, size: 64, offset: 192)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !678, line: 33, flags: DIFlagFwdDecl)
!678 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!679 = !DIDerivedType(tag: DW_TAG_member, name: "var_map", scope: !670, file: !3, line: 88, baseType: !676, size: 64, offset: 256)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "suppress_expansion", scope: !670, file: !3, line: 89, baseType: !681, size: 64, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !682, line: 47, baseType: !683)
!682 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !685, line: 75, size: 256, elements: !686)
!685 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!686 = !{!687, !702, !703, !704}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !684, file: !685, line: 76, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !685, line: 68, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !685, line: 63, size: 320, elements: !691)
!691 = !{!692, !694, !695, !696}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !690, file: !685, line: 64, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !690, file: !685, line: 65, baseType: !693, size: 64, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !690, file: !685, line: 66, baseType: !7, size: 32, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !690, file: !685, line: 67, baseType: !697, size: 128, offset: 192)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 128, elements: !700)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !685, line: 29, baseType: !699)
!699 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!700 = !{!701}
!701 = !DISubrange(count: 2)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !684, file: !685, line: 77, baseType: !688, size: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !684, file: !685, line: 78, baseType: !7, size: 32, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !684, file: !685, line: 79, baseType: !705, size: 64, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !685, line: 49, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !685, line: 45, size: 832, elements: !708)
!708 = !{!709, !710, !711}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !707, file: !685, line: 46, baseType: !693, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !707, file: !685, line: 47, baseType: !683, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !707, file: !685, line: 48, baseType: !712, size: 704, offset: 128)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !713, line: 164, size: 704, elements: !714)
!713 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!714 = !{!715, !717, !727, !728, !729, !730, !731, !732, !736, !740, !741, !742, !743}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !712, file: !713, line: 166, baseType: !716, size: 64)
!716 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !712, file: !713, line: 167, baseType: !718, size: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !713, line: 157, size: 192, elements: !720)
!720 = !{!721, !722, !723}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !719, file: !713, line: 159, baseType: !664, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !719, file: !713, line: 160, baseType: !718, size: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !719, file: !713, line: 161, baseType: !724, size: 32, offset: 128)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 32, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 4)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !712, file: !713, line: 168, baseType: !664, size: 64, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !712, file: !713, line: 169, baseType: !664, size: 64, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !712, file: !713, line: 170, baseType: !664, size: 64, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !712, file: !713, line: 171, baseType: !716, size: 64, offset: 320)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !712, file: !713, line: 172, baseType: !662, size: 32, offset: 384)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !712, file: !713, line: 176, baseType: !733, size: 64, offset: 448)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!718, !666, !716}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !712, file: !713, line: 177, baseType: !737, size: 64, offset: 512)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{null, !666, !718}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !712, file: !713, line: 178, baseType: !666, size: 64, offset: 576)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !712, file: !713, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !712, file: !713, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !712, file: !713, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !670, file: !3, line: 91, baseType: !745, size: 64, offset: 384)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !682, line: 56, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !748)
!748 = !{!749, !782, !788, !799, !818, !829, !834, !843, !849, !862, !874, !912, !1311, !1339, !1356, !1357, !1362, !1371, !1377, !1382, !1386, !1390, !1624, !1671, !1677, !1683, !1690, !1703, !1717, !1734, !1746, !1768, !1783, !1955}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !747, file: !135, line: 3372, baseType: !750, size: 64)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !751)
!751 = !{!752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !750, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !750, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !750, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !750, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !750, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !750, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !750, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !750, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !750, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !750, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !750, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !750, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !750, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !750, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !750, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !750, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !750, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !750, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !750, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !750, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !750, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !750, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !750, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !750, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !750, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !750, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !750, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !750, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !750, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !750, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !747, file: !135, line: 3373, baseType: !783, size: 192)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !784)
!784 = !{!785, !786, !787}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !783, file: !135, line: 403, baseType: !750, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !783, file: !135, line: 404, baseType: !745, size: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !783, file: !135, line: 405, baseType: !745, size: 64, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !747, file: !135, line: 3374, baseType: !789, size: 320)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !790)
!790 = !{!791, !792}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !789, file: !135, line: 1385, baseType: !783, size: 192)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !789, file: !135, line: 1386, baseType: !793, size: 128, offset: 192)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !794, line: 58, baseType: !795)
!794 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !794, line: 54, size: 128, elements: !796)
!796 = !{!797, !798}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !795, file: !794, line: 56, baseType: !699, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !795, file: !794, line: 57, baseType: !716, size: 64, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !747, file: !135, line: 3375, baseType: !800, size: 256)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !801)
!801 = !{!802, !803}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !800, file: !135, line: 1398, baseType: !783, size: 192)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !800, file: !135, line: 1399, baseType: !804, size: 64, offset: 192)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !806, line: 52, size: 256, elements: !807)
!806 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!807 = !{!808, !809, !810, !811, !812, !813, !814}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !805, file: !806, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !805, file: !806, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !805, file: !806, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !805, file: !806, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !805, file: !806, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !805, file: !806, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !805, file: !806, line: 62, baseType: !815, size: 192, offset: 64)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !699, size: 192, elements: !816)
!816 = !{!817}
!817 = !DISubrange(count: 3)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !747, file: !135, line: 3376, baseType: !819, size: 256)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !820)
!820 = !{!821, !822}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !819, file: !135, line: 1409, baseType: !783, size: 192)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !819, file: !135, line: 1410, baseType: !823, size: 64, offset: 192)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !825, line: 27, size: 192, elements: !826)
!825 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!826 = !{!827, !828}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !824, file: !825, line: 29, baseType: !793, size: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !824, file: !825, line: 30, baseType: !5, size: 32, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !747, file: !135, line: 3377, baseType: !830, size: 256)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !831)
!831 = !{!832, !833}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !830, file: !135, line: 1438, baseType: !783, size: 192)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !830, file: !135, line: 1439, baseType: !745, size: 64, offset: 192)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !747, file: !135, line: 3378, baseType: !835, size: 256)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !836)
!836 = !{!837, !838, !839}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !835, file: !135, line: 1419, baseType: !783, size: 192)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !835, file: !135, line: 1420, baseType: !662, size: 32, offset: 192)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !835, file: !135, line: 1421, baseType: !840, size: 8, offset: 224)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 8, elements: !841)
!841 = !{!842}
!842 = !DISubrange(count: 1)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !747, file: !135, line: 3379, baseType: !844, size: 320)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !845)
!845 = !{!846, !847, !848}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !844, file: !135, line: 1429, baseType: !783, size: 192)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !844, file: !135, line: 1430, baseType: !745, size: 64, offset: 192)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !844, file: !135, line: 1431, baseType: !745, size: 64, offset: 256)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !747, file: !135, line: 3380, baseType: !850, size: 320)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !851)
!851 = !{!852, !853}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !850, file: !135, line: 1461, baseType: !783, size: 192)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !850, file: !135, line: 1462, baseType: !854, size: 128, offset: 192)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !855, line: 31, size: 128, elements: !856)
!855 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!856 = !{!857, !860, !861}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !854, file: !855, line: 32, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !661)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !854, file: !855, line: 33, baseType: !7, size: 32, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !854, file: !855, line: 34, baseType: !7, size: 32, offset: 96)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !747, file: !135, line: 3381, baseType: !863, size: 384)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !864)
!864 = !{!865, !866, !871, !872, !873}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !863, file: !135, line: 2508, baseType: !783, size: 192)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !863, file: !135, line: 2509, baseType: !867, size: 32, offset: 192)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !868, line: 58, baseType: !869)
!868 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !870, line: 44, baseType: !7)
!870 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!871 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !863, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !863, file: !135, line: 2511, baseType: !745, size: 64, offset: 256)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !863, file: !135, line: 2512, baseType: !745, size: 64, offset: 320)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !747, file: !135, line: 3382, baseType: !875, size: 896)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !875, file: !135, line: 2653, baseType: !863, size: 384)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !875, file: !135, line: 2654, baseType: !745, size: 64, offset: 384)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !875, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !875, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !875, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !875, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !875, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !875, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !875, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !875, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !875, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !875, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !875, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !875, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !875, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !875, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !875, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !875, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !875, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !875, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !875, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !875, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !875, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !875, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !875, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !875, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !875, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !875, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !875, file: !135, line: 2705, baseType: !745, size: 64, offset: 576)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !875, file: !135, line: 2706, baseType: !745, size: 64, offset: 640)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !875, file: !135, line: 2707, baseType: !745, size: 64, offset: 704)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !875, file: !135, line: 2708, baseType: !745, size: 64, offset: 768)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !875, file: !135, line: 2711, baseType: !910, size: 64, offset: 832)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !747, file: !135, line: 3383, baseType: !913, size: 960)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !914)
!914 = !{!915, !916}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !913, file: !135, line: 2757, baseType: !875, size: 896)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !913, file: !135, line: 2758, baseType: !917, size: 64, offset: 896)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !682, line: 50, baseType: !918)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !920, line: 240, size: 384, elements: !921)
!920 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!921 = !{!922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !919, file: !920, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !919, file: !920, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !919, file: !920, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !919, file: !920, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !919, file: !920, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !919, file: !920, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !919, file: !920, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !919, file: !920, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !919, file: !920, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !919, file: !920, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !919, file: !920, line: 321, baseType: !933, size: 320, offset: 64)
!933 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !920, line: 315, size: 320, elements: !934)
!934 = !{!935, !1278, !1280, !1309, !1310}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !933, file: !920, line: 316, baseType: !936, size: 64)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 64, elements: !841)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !920, line: 183, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !920, line: 166, size: 64, elements: !939)
!939 = !{!940, !941, !942, !943, !944, !952, !953, !965, !968, !969, !970, !1255, !1268, !1275}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !938, file: !920, line: 168, baseType: !662, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !938, file: !920, line: 169, baseType: !7, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !938, file: !920, line: 170, baseType: !667, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !938, file: !920, line: 171, baseType: !917, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !938, file: !920, line: 172, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !682, line: 53, baseType: !946)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !920, line: 359, size: 128, elements: !948)
!948 = !{!949, !950}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !947, file: !920, line: 360, baseType: !662, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !947, file: !920, line: 361, baseType: !951, size: 64, offset: 64)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 64, elements: !841)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !938, file: !920, line: 173, baseType: !5, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !938, file: !920, line: 174, baseType: !954, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !920, line: 133, baseType: !955)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !920, line: 115, size: 32, elements: !956)
!956 = !{!957, !958, !959, !960, !961, !962, !963, !964}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !955, file: !920, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !955, file: !920, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !955, file: !920, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !955, file: !920, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !955, file: !920, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !955, file: !920, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !955, file: !920, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !955, file: !920, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !938, file: !920, line: 175, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !920, line: 175, flags: DIFlagFwdDecl)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !938, file: !920, line: 176, baseType: !683, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !938, file: !920, line: 177, baseType: !745, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !938, file: !920, line: 178, baseType: !971, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !330, line: 217, size: 832, elements: !973)
!973 = !{!974, !1220, !1221, !1222, !1225, !1229, !1230, !1231, !1249, !1250, !1251, !1252, !1253, !1254}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !972, file: !330, line: 219, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !330, line: 151, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !330, line: 151, size: 128, elements: !978)
!978 = !{!979}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !977, file: !330, line: 151, baseType: !980, size: 128)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !330, line: 150, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !330, line: 150, size: 128, elements: !982)
!982 = !{!983, !984, !985}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !981, file: !330, line: 150, baseType: !7, size: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !981, file: !330, line: 150, baseType: !7, size: 32, offset: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !981, file: !330, line: 150, baseType: !986, size: 64, offset: 64)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !987, size: 64, elements: !841)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !682, line: 108, baseType: !988)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !330, line: 122, size: 512, elements: !990)
!990 = !{!991, !992, !993, !1212, !1213, !1214, !1215, !1216, !1217, !1218}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !989, file: !330, line: 124, baseType: !971, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !989, file: !330, line: 125, baseType: !971, size: 64, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !989, file: !330, line: 131, baseType: !994, size: 64, offset: 128)
!994 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !330, line: 128, size: 64, elements: !995)
!995 = !{!996, !1211}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !994, file: !330, line: 129, baseType: !997, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !682, line: 66, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !584, line: 143, size: 192, elements: !1000)
!1000 = !{!1001, !1209, !1210}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !999, file: !584, line: 145, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !682, line: 69, baseType: !1003)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !584, line: 136, size: 192, elements: !1005)
!1005 = !{!1006, !1207, !1208}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1004, file: !584, line: 137, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !682, line: 58, baseType: !1008)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !584, line: 737, size: 768, elements: !1010)
!1010 = !{!1011, !1028, !1062, !1068, !1073, !1078, !1085, !1091, !1097, !1102, !1116, !1121, !1127, !1132, !1142, !1147, !1165, !1172, !1179, !1185, !1190, !1196, !1202}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1009, file: !584, line: 738, baseType: !1012, size: 256)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !584, line: 271, size: 256, elements: !1013)
!1013 = !{!1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1012, file: !584, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1012, file: !584, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1012, file: !584, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1012, file: !584, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1012, file: !584, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1012, file: !584, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1012, file: !584, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1012, file: !584, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1012, file: !584, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1012, file: !584, line: 312, baseType: !7, size: 32, offset: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1012, file: !584, line: 316, baseType: !867, size: 32, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1012, file: !584, line: 319, baseType: !7, size: 32, offset: 96)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1012, file: !584, line: 323, baseType: !971, size: 64, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1012, file: !584, line: 327, baseType: !745, size: 64, offset: 192)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1009, file: !584, line: 739, baseType: !1029, size: 448)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !584, line: 350, size: 448, elements: !1030)
!1030 = !{!1031, !1060}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1029, file: !584, line: 353, baseType: !1032, size: 384)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !584, line: 333, size: 384, elements: !1033)
!1033 = !{!1034, !1035, !1043}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1032, file: !584, line: 336, baseType: !1012, size: 256)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1032, file: !584, line: 343, baseType: !1036, size: 64, offset: 256)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1038, line: 37, size: 128, elements: !1039)
!1038 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1039 = !{!1040, !1041}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1037, file: !1038, line: 39, baseType: !1036, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1037, file: !1038, line: 40, baseType: !1042, size: 64, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1032, file: !584, line: 344, baseType: !1044, size: 64, offset: 320)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1038, line: 45, size: 320, elements: !1046)
!1046 = !{!1047, !1048}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1045, file: !1038, line: 47, baseType: !1044, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1045, file: !1038, line: 48, baseType: !1049, size: 256, offset: 64)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !1050)
!1050 = !{!1051, !1053, !1054, !1059}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1049, file: !135, line: 1884, baseType: !1052, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1049, file: !135, line: 1885, baseType: !1052, size: 64, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1049, file: !135, line: 1891, baseType: !1055, size: 64, offset: 128)
!1055 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1049, file: !135, line: 1891, size: 64, elements: !1056)
!1056 = !{!1057, !1058}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1055, file: !135, line: 1891, baseType: !1007, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1055, file: !135, line: 1891, baseType: !745, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1049, file: !135, line: 1892, baseType: !1042, size: 64, offset: 192)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1029, file: !584, line: 359, baseType: !1061, size: 64, offset: 384)
!1061 = !DICompositeType(tag: DW_TAG_array_type, baseType: !745, size: 64, elements: !841)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1009, file: !584, line: 740, baseType: !1063, size: 512)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !584, line: 365, size: 512, elements: !1064)
!1064 = !{!1065, !1066, !1067}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1063, file: !584, line: 368, baseType: !1032, size: 384)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1063, file: !584, line: 373, baseType: !745, size: 64, offset: 384)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1063, file: !584, line: 374, baseType: !745, size: 64, offset: 448)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1009, file: !584, line: 741, baseType: !1069, size: 576)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !584, line: 380, size: 576, elements: !1070)
!1070 = !{!1071, !1072}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1069, file: !584, line: 383, baseType: !1063, size: 512)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1069, file: !584, line: 389, baseType: !1061, size: 64, offset: 512)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1009, file: !584, line: 742, baseType: !1074, size: 320)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !584, line: 395, size: 320, elements: !1075)
!1075 = !{!1076, !1077}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1074, file: !584, line: 397, baseType: !1012, size: 256)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1074, file: !584, line: 400, baseType: !997, size: 64, offset: 256)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1009, file: !584, line: 743, baseType: !1079, size: 448)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !584, line: 406, size: 448, elements: !1080)
!1080 = !{!1081, !1082, !1083, !1084}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1079, file: !584, line: 408, baseType: !1012, size: 256)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1079, file: !584, line: 412, baseType: !745, size: 64, offset: 256)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1079, file: !584, line: 420, baseType: !745, size: 64, offset: 320)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1079, file: !584, line: 423, baseType: !997, size: 64, offset: 384)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1009, file: !584, line: 744, baseType: !1086, size: 384)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !584, line: 429, size: 384, elements: !1087)
!1087 = !{!1088, !1089, !1090}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1086, file: !584, line: 431, baseType: !1012, size: 256)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1086, file: !584, line: 434, baseType: !745, size: 64, offset: 256)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1086, file: !584, line: 437, baseType: !997, size: 64, offset: 320)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1009, file: !584, line: 745, baseType: !1092, size: 384)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !584, line: 443, size: 384, elements: !1093)
!1093 = !{!1094, !1095, !1096}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1092, file: !584, line: 445, baseType: !1012, size: 256)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1092, file: !584, line: 449, baseType: !745, size: 64, offset: 256)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1092, file: !584, line: 453, baseType: !997, size: 64, offset: 320)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1009, file: !584, line: 746, baseType: !1098, size: 320)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !584, line: 459, size: 320, elements: !1099)
!1099 = !{!1100, !1101}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1098, file: !584, line: 461, baseType: !1012, size: 256)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1098, file: !584, line: 464, baseType: !745, size: 64, offset: 256)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1009, file: !584, line: 747, baseType: !1103, size: 768)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !584, line: 469, size: 768, elements: !1104)
!1104 = !{!1105, !1106, !1107, !1108, !1109}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1103, file: !584, line: 471, baseType: !1012, size: 256)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1103, file: !584, line: 474, baseType: !7, size: 32, offset: 256)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1103, file: !584, line: 475, baseType: !7, size: 32, offset: 288)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1103, file: !584, line: 478, baseType: !745, size: 64, offset: 320)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1103, file: !584, line: 481, baseType: !1110, size: 384, offset: 384)
!1110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1111, size: 384, elements: !841)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !1112)
!1112 = !{!1113, !1114, !1115}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1111, file: !135, line: 1920, baseType: !1049, size: 256)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1111, file: !135, line: 1921, baseType: !745, size: 64, offset: 256)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1111, file: !135, line: 1922, baseType: !867, size: 32, offset: 320)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1009, file: !584, line: 748, baseType: !1117, size: 320)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !584, line: 487, size: 320, elements: !1118)
!1118 = !{!1119, !1120}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1117, file: !584, line: 490, baseType: !1012, size: 256)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1117, file: !584, line: 494, baseType: !662, size: 32, offset: 256)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1009, file: !584, line: 749, baseType: !1122, size: 384)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !584, line: 500, size: 384, elements: !1123)
!1123 = !{!1124, !1125, !1126}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1122, file: !584, line: 502, baseType: !1012, size: 256)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1122, file: !584, line: 506, baseType: !997, size: 64, offset: 256)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1122, file: !584, line: 510, baseType: !997, size: 64, offset: 320)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1009, file: !584, line: 750, baseType: !1128, size: 320)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !584, line: 529, size: 320, elements: !1129)
!1129 = !{!1130, !1131}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1128, file: !584, line: 531, baseType: !1012, size: 256)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1128, file: !584, line: 540, baseType: !997, size: 64, offset: 256)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1009, file: !584, line: 751, baseType: !1133, size: 704)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !584, line: 546, size: 704, elements: !1134)
!1134 = !{!1135, !1136, !1137, !1138, !1139, !1140, !1141}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1133, file: !584, line: 549, baseType: !1063, size: 512)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1133, file: !584, line: 553, baseType: !667, size: 64, offset: 512)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1133, file: !584, line: 557, baseType: !661, size: 8, offset: 576)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1133, file: !584, line: 558, baseType: !661, size: 8, offset: 584)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1133, file: !584, line: 559, baseType: !661, size: 8, offset: 592)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1133, file: !584, line: 560, baseType: !661, size: 8, offset: 600)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1133, file: !584, line: 566, baseType: !1061, size: 64, offset: 640)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1009, file: !584, line: 752, baseType: !1143, size: 384)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !584, line: 571, size: 384, elements: !1144)
!1144 = !{!1145, !1146}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1143, file: !584, line: 573, baseType: !1074, size: 320)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1143, file: !584, line: 577, baseType: !745, size: 64, offset: 320)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1009, file: !584, line: 753, baseType: !1148, size: 576)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !584, line: 600, size: 576, elements: !1149)
!1149 = !{!1150, !1151, !1152, !1155, !1164}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1148, file: !584, line: 602, baseType: !1074, size: 320)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1148, file: !584, line: 605, baseType: !745, size: 64, offset: 320)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1148, file: !584, line: 609, baseType: !1153, size: 64, offset: 384)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1154, line: 46, baseType: !699)
!1154 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1148, file: !584, line: 612, baseType: !1156, size: 64, offset: 448)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !584, line: 581, size: 320, elements: !1158)
!1158 = !{!1159, !1160, !1161, !1162, !1163}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1157, file: !584, line: 583, baseType: !134, size: 32)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1157, file: !584, line: 586, baseType: !745, size: 64, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1157, file: !584, line: 589, baseType: !745, size: 64, offset: 128)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1157, file: !584, line: 592, baseType: !745, size: 64, offset: 192)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1157, file: !584, line: 595, baseType: !745, size: 64, offset: 256)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1148, file: !584, line: 616, baseType: !997, size: 64, offset: 512)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1009, file: !584, line: 754, baseType: !1166, size: 512)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !584, line: 622, size: 512, elements: !1167)
!1167 = !{!1168, !1169, !1170, !1171}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1166, file: !584, line: 624, baseType: !1074, size: 320)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1166, file: !584, line: 628, baseType: !745, size: 64, offset: 320)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1166, file: !584, line: 632, baseType: !745, size: 64, offset: 384)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1166, file: !584, line: 636, baseType: !745, size: 64, offset: 448)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1009, file: !584, line: 755, baseType: !1173, size: 704)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !584, line: 642, size: 704, elements: !1174)
!1174 = !{!1175, !1176, !1177, !1178}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1173, file: !584, line: 644, baseType: !1166, size: 512)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1173, file: !584, line: 648, baseType: !745, size: 64, offset: 512)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1173, file: !584, line: 652, baseType: !745, size: 64, offset: 576)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1173, file: !584, line: 653, baseType: !745, size: 64, offset: 640)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1009, file: !584, line: 756, baseType: !1180, size: 448)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !584, line: 663, size: 448, elements: !1181)
!1181 = !{!1182, !1183, !1184}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1180, file: !584, line: 665, baseType: !1074, size: 320)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1180, file: !584, line: 668, baseType: !745, size: 64, offset: 320)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1180, file: !584, line: 673, baseType: !745, size: 64, offset: 384)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1009, file: !584, line: 757, baseType: !1186, size: 384)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !584, line: 694, size: 384, elements: !1187)
!1187 = !{!1188, !1189}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1186, file: !584, line: 696, baseType: !1074, size: 320)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1186, file: !584, line: 699, baseType: !745, size: 64, offset: 320)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1009, file: !584, line: 758, baseType: !1191, size: 384)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !584, line: 681, size: 384, elements: !1192)
!1192 = !{!1193, !1194, !1195}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1191, file: !584, line: 683, baseType: !1012, size: 256)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1191, file: !584, line: 686, baseType: !745, size: 64, offset: 256)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1191, file: !584, line: 689, baseType: !745, size: 64, offset: 320)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1009, file: !584, line: 759, baseType: !1197, size: 384)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !584, line: 707, size: 384, elements: !1198)
!1198 = !{!1199, !1200, !1201}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1197, file: !584, line: 709, baseType: !1012, size: 256)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1197, file: !584, line: 712, baseType: !745, size: 64, offset: 256)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1197, file: !584, line: 712, baseType: !745, size: 64, offset: 320)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1009, file: !584, line: 760, baseType: !1203, size: 320)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !584, line: 718, size: 320, elements: !1204)
!1204 = !{!1205, !1206}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1203, file: !584, line: 720, baseType: !1012, size: 256)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1203, file: !584, line: 723, baseType: !745, size: 64, offset: 256)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1004, file: !584, line: 138, baseType: !1003, size: 64, offset: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1004, file: !584, line: 139, baseType: !1003, size: 64, offset: 128)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !999, file: !584, line: 146, baseType: !1002, size: 64, offset: 64)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !999, file: !584, line: 152, baseType: !997, size: 64, offset: 128)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !994, file: !330, line: 130, baseType: !917, size: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !989, file: !330, line: 134, baseType: !666, size: 64, offset: 192)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !989, file: !330, line: 137, baseType: !745, size: 64, offset: 256)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !989, file: !330, line: 138, baseType: !867, size: 32, offset: 320)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !989, file: !330, line: 142, baseType: !7, size: 32, offset: 352)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !989, file: !330, line: 144, baseType: !662, size: 32, offset: 384)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !989, file: !330, line: 145, baseType: !662, size: 32, offset: 416)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !989, file: !330, line: 146, baseType: !1219, size: 64, offset: 448)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !330, line: 119, baseType: !716)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !972, file: !330, line: 220, baseType: !975, size: 64, offset: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !972, file: !330, line: 223, baseType: !666, size: 64, offset: 128)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !972, file: !330, line: 226, baseType: !1223, size: 64, offset: 192)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 185, flags: DIFlagFwdDecl)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !972, file: !330, line: 229, baseType: !1226, size: 128, offset: 256)
!1226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1227, size: 128, elements: !700)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !330, line: 229, flags: DIFlagFwdDecl)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !972, file: !330, line: 232, baseType: !971, size: 64, offset: 384)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !972, file: !330, line: 233, baseType: !971, size: 64, offset: 448)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !972, file: !330, line: 238, baseType: !1232, size: 64, offset: 512)
!1232 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !330, line: 235, size: 64, elements: !1233)
!1233 = !{!1234, !1240}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1232, file: !330, line: 236, baseType: !1235, size: 64)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !330, line: 273, size: 128, elements: !1237)
!1237 = !{!1238, !1239}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1236, file: !330, line: 275, baseType: !997, size: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1236, file: !330, line: 278, baseType: !997, size: 64, offset: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1232, file: !330, line: 237, baseType: !1241, size: 64)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !330, line: 259, size: 320, elements: !1243)
!1243 = !{!1244, !1245, !1246, !1247, !1248}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1242, file: !330, line: 261, baseType: !917, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1242, file: !330, line: 262, baseType: !917, size: 64, offset: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1242, file: !330, line: 266, baseType: !917, size: 64, offset: 128)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1242, file: !330, line: 267, baseType: !917, size: 64, offset: 192)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1242, file: !330, line: 270, baseType: !662, size: 32, offset: 256)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !972, file: !330, line: 241, baseType: !1219, size: 64, offset: 576)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !972, file: !330, line: 244, baseType: !662, size: 32, offset: 640)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !972, file: !330, line: 247, baseType: !662, size: 32, offset: 672)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !972, file: !330, line: 250, baseType: !662, size: 32, offset: 704)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !972, file: !330, line: 253, baseType: !662, size: 32, offset: 736)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !972, file: !330, line: 256, baseType: !662, size: 32, offset: 768)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !938, file: !920, line: 179, baseType: !1256, size: 64)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !920, line: 150, baseType: !1258)
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !920, line: 142, size: 320, elements: !1259)
!1259 = !{!1260, !1261, !1262, !1263, !1266, !1267}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1258, file: !920, line: 144, baseType: !745, size: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1258, file: !920, line: 145, baseType: !917, size: 64, offset: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1258, file: !920, line: 146, baseType: !917, size: 64, offset: 128)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1258, file: !920, line: 147, baseType: !1264, size: 32, offset: 192)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1265, line: 31, baseType: !662)
!1265 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1258, file: !920, line: 148, baseType: !7, size: 32, offset: 224)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1258, file: !920, line: 149, baseType: !661, size: 8, offset: 256)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !938, file: !920, line: 180, baseType: !1269, size: 64)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !920, line: 162, baseType: !1271)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !920, line: 159, size: 128, elements: !1272)
!1272 = !{!1273, !1274}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1271, file: !920, line: 160, baseType: !745, size: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1271, file: !920, line: 161, baseType: !716, size: 64, offset: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !938, file: !920, line: 181, baseType: !1276, size: 64)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64)
!1277 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !920, line: 181, flags: DIFlagFwdDecl)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !933, file: !920, line: 317, baseType: !1279, size: 64)
!1279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 64, elements: !841)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !933, file: !920, line: 318, baseType: !1281, size: 320)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !920, line: 188, size: 320, elements: !1282)
!1282 = !{!1283, !1285, !1308}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1281, file: !920, line: 190, baseType: !1284, size: 192)
!1284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 192, elements: !816)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1281, file: !920, line: 193, baseType: !1286, size: 64, offset: 192)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !920, line: 206, size: 320, elements: !1288)
!1288 = !{!1289, !1293, !1294, !1295, !1307}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1287, file: !920, line: 208, baseType: !1290, size: 64)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !682, line: 62, baseType: !1292)
!1292 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !682, line: 61, flags: DIFlagFwdDecl)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1287, file: !920, line: 211, baseType: !7, size: 32, offset: 64)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1287, file: !920, line: 214, baseType: !716, size: 64, offset: 128)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1287, file: !920, line: 224, baseType: !1296, size: 64, offset: 192)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !920, line: 202, baseType: !1298)
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !920, line: 202, size: 128, elements: !1299)
!1299 = !{!1300}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1298, file: !920, line: 202, baseType: !1301, size: 128)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !920, line: 200, baseType: !1302)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !920, line: 200, size: 128, elements: !1303)
!1303 = !{!1304, !1305, !1306}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1302, file: !920, line: 200, baseType: !7, size: 32)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1302, file: !920, line: 200, baseType: !7, size: 32, offset: 32)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1302, file: !920, line: 200, baseType: !951, size: 64, offset: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1287, file: !920, line: 234, baseType: !1296, size: 64, offset: 256)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1281, file: !920, line: 197, baseType: !716, size: 64, offset: 256)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !933, file: !920, line: 319, baseType: !805, size: 256)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !933, file: !920, line: 320, baseType: !824, size: 192)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !747, file: !135, line: 3384, baseType: !1312, size: 1472)
!1312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1313)
!1313 = !{!1314, !1335, !1336, !1337, !1338}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1312, file: !135, line: 3115, baseType: !1315, size: 1216)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1316)
!1316 = !{!1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1315, file: !135, line: 2985, baseType: !913, size: 960)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1315, file: !135, line: 2986, baseType: !745, size: 64, offset: 960)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1315, file: !135, line: 2987, baseType: !745, size: 64, offset: 1024)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1315, file: !135, line: 2988, baseType: !745, size: 64, offset: 1088)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1315, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1315, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1315, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1315, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1315, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1315, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1315, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1315, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1315, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1315, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1315, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1315, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1315, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1315, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1312, file: !135, line: 3117, baseType: !745, size: 64, offset: 1216)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1312, file: !135, line: 3119, baseType: !745, size: 64, offset: 1280)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1312, file: !135, line: 3121, baseType: !745, size: 64, offset: 1344)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1312, file: !135, line: 3123, baseType: !745, size: 64, offset: 1408)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !747, file: !135, line: 3385, baseType: !1340, size: 1088)
!1340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1341)
!1341 = !{!1342, !1343, !1344}
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1340, file: !135, line: 2875, baseType: !913, size: 960)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1340, file: !135, line: 2876, baseType: !917, size: 64, offset: 960)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1340, file: !135, line: 2877, baseType: !1345, size: 64, offset: 1024)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64)
!1346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1347, line: 172, size: 128, elements: !1348)
!1347 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1348 = !{!1349, !1350, !1351, !1352, !1353, !1354, !1355}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1346, file: !1347, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1346, file: !1347, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1346, file: !1347, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1346, file: !1347, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1346, file: !1347, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1346, file: !1347, line: 195, baseType: !7, size: 32, offset: 32)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1346, file: !1347, line: 199, baseType: !745, size: 64, offset: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !747, file: !135, line: 3386, baseType: !1315, size: 1216)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !747, file: !135, line: 3387, baseType: !1358, size: 1280)
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1359)
!1359 = !{!1360, !1361}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1358, file: !135, line: 3094, baseType: !1315, size: 1216)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1358, file: !135, line: 3095, baseType: !1345, size: 64, offset: 1216)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !747, file: !135, line: 3388, baseType: !1363, size: 1216)
!1363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1364)
!1364 = !{!1365, !1366, !1367, !1368, !1369, !1370}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1363, file: !135, line: 2825, baseType: !875, size: 896)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1363, file: !135, line: 2827, baseType: !745, size: 64, offset: 896)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1363, file: !135, line: 2828, baseType: !745, size: 64, offset: 960)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1363, file: !135, line: 2829, baseType: !745, size: 64, offset: 1024)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1363, file: !135, line: 2830, baseType: !745, size: 64, offset: 1088)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1363, file: !135, line: 2831, baseType: !745, size: 64, offset: 1152)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !747, file: !135, line: 3389, baseType: !1372, size: 1024)
!1372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1373)
!1373 = !{!1374, !1375, !1376}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1372, file: !135, line: 2851, baseType: !913, size: 960)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1372, file: !135, line: 2852, baseType: !662, size: 32, offset: 960)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1372, file: !135, line: 2853, baseType: !662, size: 32, offset: 992)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !747, file: !135, line: 3390, baseType: !1378, size: 1024)
!1378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !1379)
!1379 = !{!1380, !1381}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1378, file: !135, line: 2858, baseType: !913, size: 960)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1378, file: !135, line: 2859, baseType: !1345, size: 64, offset: 960)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !747, file: !135, line: 3391, baseType: !1383, size: 960)
!1383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !1384)
!1384 = !{!1385}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1383, file: !135, line: 2863, baseType: !913, size: 960)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !747, file: !135, line: 3392, baseType: !1387, size: 1472)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !1388)
!1388 = !{!1389}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1387, file: !135, line: 3305, baseType: !1312, size: 1472)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !747, file: !135, line: 3393, baseType: !1391, size: 1792)
!1391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !1392)
!1392 = !{!1393, !1394, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1391, file: !135, line: 3249, baseType: !1312, size: 1472)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1391, file: !135, line: 3251, baseType: !1395, size: 64, offset: 1472)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64)
!1396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1397, line: 463, size: 1152, elements: !1398)
!1397 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1398 = !{!1399, !1402, !1433, !1434, !1544, !1547, !1548, !1549, !1550, !1551, !1552, !1576, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1396, file: !1397, line: 464, baseType: !1400, size: 64)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64)
!1401 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1397, line: 464, flags: DIFlagFwdDecl)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1396, file: !1397, line: 467, baseType: !1403, size: 64, offset: 64)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64)
!1404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !330, line: 374, size: 640, elements: !1405)
!1405 = !{!1406, !1408, !1409, !1422, !1423, !1424, !1425, !1426, !1427, !1429, !1431, !1432}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1404, file: !330, line: 377, baseType: !1407, size: 64)
!1407 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !682, line: 111, baseType: !971)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1404, file: !330, line: 378, baseType: !1407, size: 64, offset: 64)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1404, file: !330, line: 381, baseType: !1410, size: 64, offset: 128)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64)
!1411 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !330, line: 282, baseType: !1412)
!1412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !330, line: 282, size: 128, elements: !1413)
!1413 = !{!1414}
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1412, file: !330, line: 282, baseType: !1415, size: 128)
!1415 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !330, line: 281, baseType: !1416)
!1416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !330, line: 281, size: 128, elements: !1417)
!1417 = !{!1418, !1419, !1420}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1416, file: !330, line: 281, baseType: !7, size: 32)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1416, file: !330, line: 281, baseType: !7, size: 32, offset: 32)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1416, file: !330, line: 281, baseType: !1421, size: 64, offset: 64)
!1421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1407, size: 64, elements: !841)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1404, file: !330, line: 384, baseType: !662, size: 32, offset: 192)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1404, file: !330, line: 387, baseType: !662, size: 32, offset: 224)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1404, file: !330, line: 390, baseType: !662, size: 32, offset: 256)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1404, file: !330, line: 394, baseType: !1410, size: 64, offset: 320)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1404, file: !330, line: 396, baseType: !329, size: 32, offset: 384)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1404, file: !330, line: 399, baseType: !1428, size: 64, offset: 416)
!1428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 64, elements: !700)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1404, file: !330, line: 402, baseType: !1430, size: 64, offset: 480)
!1430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !700)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1404, file: !330, line: 406, baseType: !662, size: 32, offset: 544)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1404, file: !330, line: 409, baseType: !662, size: 32, offset: 576)
