; ModuleID = 'tree-ssa-copyrename.bc'
source_filename = "tree-ssa-copyrename.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }

!440 = !DIEnumerator(name: "GIMPLE_SWITCH", value: 5, isUnsigned: true)
!441 = !DIEnumerator(name: "GIMPLE_ASSIGN", value: 6, isUnsigned: true)
!442 = !DIEnumerator(name: "GIMPLE_ASM", value: 7, isUnsigned: true)
!443 = !DIEnumerator(name: "GIMPLE_CALL", value: 8, isUnsigned: true)
!444 = !DIEnumerator(name: "GIMPLE_RETURN", value: 9, isUnsigned: true)
!445 = !DIEnumerator(name: "GIMPLE_BIND", value: 10, isUnsigned: true)
!446 = !DIEnumerator(name: "GIMPLE_CATCH", value: 11, isUnsigned: true)
!447 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!448 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!449 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!450 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!451 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!452 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!453 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!454 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!455 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!456 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!457 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!458 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!459 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!460 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!461 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!462 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!463 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!464 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!465 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!466 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!467 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!468 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!469 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!470 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!471 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !433, line: 727, baseType: !7, size: 32, elements: !472)
!472 = !{!473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496}
!473 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!474 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!475 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!476 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!477 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!478 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!479 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!480 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!481 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!482 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!483 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!484 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!485 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!486 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!487 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!488 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!489 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!490 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!491 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!492 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!493 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!494 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!495 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!496 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!497 = !{!498, !499, !500, !501, !504, !505, !189, !507, !1681, !578, !1037, !502}
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!500 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !503)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !433, line: 737, size: 768, elements: !509)
!509 = !{!510, !1528, !1538, !1544, !1549, !1554, !1561, !1567, !1573, !1578, !1592, !1597, !1603, !1608, !1618, !1623, !1639, !1646, !1653, !1659, !1664, !1670, !1676}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !508, file: !433, line: 738, baseType: !511, size: 256)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !433, line: 271, size: 256, elements: !512)
!512 = !{!513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !528, !529, !1527}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !511, file: !433, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !511, file: !433, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !511, file: !433, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !511, file: !433, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !511, file: !433, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !511, file: !433, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !511, file: !433, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !511, file: !433, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !511, file: !433, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !511, file: !433, line: 312, baseType: !7, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !511, file: !433, line: 316, baseType: !524, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !525, line: 58, baseType: !526)
!525 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !527, line: 44, baseType: !7)
!527 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!528 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !511, file: !433, line: 319, baseType: !7, size: 32, offset: 96)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !511, file: !433, line: 323, baseType: !530, size: 64, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !385, line: 217, size: 832, elements: !532)
!532 = !{!533, !1492, !1493, !1494, !1497, !1501, !1502, !1503, !1521, !1522, !1523, !1524, !1525, !1526}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !531, file: !385, line: 219, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !385, line: 151, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !385, line: 151, size: 128, elements: !537)
!537 = !{!538}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !536, file: !385, line: 151, baseType: !539, size: 128)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !385, line: 150, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !385, line: 150, size: 128, elements: !541)
!541 = !{!542, !543, !544}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !540, file: !385, line: 150, baseType: !7, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !540, file: !385, line: 150, baseType: !7, size: 32, offset: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !540, file: !385, line: 150, baseType: !545, size: 64, offset: 64)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 64, elements: !660)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !547, line: 108, baseType: !548)
!547 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !385, line: 122, size: 512, elements: !550)
!550 = !{!551, !552, !553, !576, !577, !1486, !1487, !1488, !1489, !1490}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !549, file: !385, line: 124, baseType: !530, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !549, file: !385, line: 125, baseType: !530, size: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !549, file: !385, line: 131, baseType: !554, size: 64, offset: 128)
!554 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !385, line: 128, size: 64, elements: !555)
!555 = !{!556, !572}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !554, file: !385, line: 129, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !547, line: 66, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !433, line: 143, size: 192, elements: !560)
!560 = !{!561, !570, !571}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !559, file: !433, line: 145, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !547, line: 69, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !433, line: 136, size: 192, elements: !565)
!565 = !{!566, !568, !569}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !564, file: !433, line: 137, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !547, line: 58, baseType: !507)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !564, file: !433, line: 138, baseType: !563, size: 64, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !564, file: !433, line: 139, baseType: !563, size: 64, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !559, file: !433, line: 146, baseType: !562, size: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !559, file: !433, line: 152, baseType: !557, size: 64, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !554, file: !385, line: 130, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !547, line: 50, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !547, line: 49, flags: DIFlagFwdDecl)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !549, file: !385, line: 134, baseType: !504, size: 64, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !549, file: !385, line: 137, baseType: !578, size: 64, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !547, line: 56, baseType: !579)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !190, line: 3371, size: 1792, elements: !581)
!581 = !{!582, !615, !621, !634, !641, !648, !653, !662, !668, !681, !689, !727, !732, !760, !777, !778, !783, !792, !798, !803, !807, !811, !1135, !1184, !1190, !1196, !1203, !1216, !1230, !1247, !1259, !1281, !1296, !1468}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !580, file: !190, line: 3372, baseType: !583, size: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !190, line: 360, size: 64, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !583, file: !190, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !583, file: !190, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !583, file: !190, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !583, file: !190, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !583, file: !190, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !583, file: !190, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !583, file: !190, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !583, file: !190, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !583, file: !190, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !583, file: !190, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !583, file: !190, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !583, file: !190, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !583, file: !190, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !583, file: !190, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !583, file: !190, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !583, file: !190, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !583, file: !190, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !583, file: !190, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !583, file: !190, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !583, file: !190, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !583, file: !190, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !583, file: !190, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !583, file: !190, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !583, file: !190, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !583, file: !190, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !583, file: !190, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !583, file: !190, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !583, file: !190, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !583, file: !190, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !583, file: !190, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !580, file: !190, line: 3373, baseType: !616, size: 192)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !190, line: 402, size: 192, elements: !617)
!617 = !{!618, !619, !620}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !616, file: !190, line: 403, baseType: !583, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !616, file: !190, line: 404, baseType: !578, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !616, file: !190, line: 405, baseType: !578, size: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !580, file: !190, line: 3374, baseType: !622, size: 320)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !190, line: 1384, size: 320, elements: !623)
!623 = !{!624, !625}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !622, file: !190, line: 1385, baseType: !616, size: 192)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !622, file: !190, line: 1386, baseType: !626, size: 128, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !627, line: 58, baseType: !628)
!627 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !627, line: 54, size: 128, elements: !629)
!629 = !{!630, !632}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !628, file: !627, line: 56, baseType: !631, size: 64)
!631 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !628, file: !627, line: 57, baseType: !633, size: 64, offset: 64)
!633 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !580, file: !190, line: 3375, baseType: !635, size: 256)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !190, line: 1397, size: 256, elements: !636)
!636 = !{!637, !638}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !635, file: !190, line: 1398, baseType: !616, size: 192)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !635, file: !190, line: 1399, baseType: !639, size: 64, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !190, line: 1392, flags: DIFlagFwdDecl)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !580, file: !190, line: 3376, baseType: !642, size: 256)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !190, line: 1408, size: 256, elements: !643)
!643 = !{!644, !645}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !642, file: !190, line: 1409, baseType: !616, size: 192)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !642, file: !190, line: 1410, baseType: !646, size: 64, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !190, line: 1403, flags: DIFlagFwdDecl)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !580, file: !190, line: 3377, baseType: !649, size: 256)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !190, line: 1437, size: 256, elements: !650)
!650 = !{!651, !652}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !649, file: !190, line: 1438, baseType: !616, size: 192)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !649, file: !190, line: 1439, baseType: !578, size: 64, offset: 192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !580, file: !190, line: 3378, baseType: !654, size: 256)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !190, line: 1418, size: 256, elements: !655)
!655 = !{!656, !657, !658}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !654, file: !190, line: 1419, baseType: !616, size: 192)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !654, file: !190, line: 1420, baseType: !500, size: 32, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !654, file: !190, line: 1421, baseType: !659, size: 8, offset: 224)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !503, size: 8, elements: !660)
!660 = !{!661}
!661 = !DISubrange(count: 1)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !580, file: !190, line: 3379, baseType: !663, size: 320)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !190, line: 1428, size: 320, elements: !664)
!664 = !{!665, !666, !667}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !663, file: !190, line: 1429, baseType: !616, size: 192)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !663, file: !190, line: 1430, baseType: !578, size: 64, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !663, file: !190, line: 1431, baseType: !578, size: 64, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !580, file: !190, line: 3380, baseType: !669, size: 320)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !190, line: 1460, size: 320, elements: !670)
!670 = !{!671, !672}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !669, file: !190, line: 1461, baseType: !616, size: 192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !669, file: !190, line: 1462, baseType: !673, size: 128, offset: 192)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !674, line: 31, size: 128, elements: !675)
!674 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!675 = !{!676, !679, !680}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !673, file: !674, line: 32, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !499)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !673, file: !674, line: 33, baseType: !7, size: 32, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !673, file: !674, line: 34, baseType: !7, size: 32, offset: 96)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !580, file: !190, line: 3381, baseType: !682, size: 384)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !190, line: 2507, size: 384, elements: !683)
!683 = !{!684, !685, !686, !687, !688}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !682, file: !190, line: 2508, baseType: !616, size: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !682, file: !190, line: 2509, baseType: !524, size: 32, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !682, file: !190, line: 2510, baseType: !7, size: 32, offset: 224)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !682, file: !190, line: 2511, baseType: !578, size: 64, offset: 256)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !682, file: !190, line: 2512, baseType: !578, size: 64, offset: 320)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !580, file: !190, line: 3382, baseType: !690, size: 896)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !190, line: 2652, size: 896, elements: !691)
!691 = !{!692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !690, file: !190, line: 2653, baseType: !682, size: 384)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !690, file: !190, line: 2654, baseType: !578, size: 64, offset: 384)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !690, file: !190, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !690, file: !190, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !690, file: !190, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !690, file: !190, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !690, file: !190, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !690, file: !190, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !690, file: !190, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !690, file: !190, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !690, file: !190, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !690, file: !190, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !690, file: !190, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !690, file: !190, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !690, file: !190, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !690, file: !190, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !690, file: !190, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !690, file: !190, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !690, file: !190, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !690, file: !190, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !690, file: !190, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !690, file: !190, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !690, file: !190, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !690, file: !190, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !690, file: !190, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !690, file: !190, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !690, file: !190, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !690, file: !190, line: 2703, baseType: !7, size: 32, offset: 512)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !690, file: !190, line: 2705, baseType: !578, size: 64, offset: 576)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !690, file: !190, line: 2706, baseType: !578, size: 64, offset: 640)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !690, file: !190, line: 2707, baseType: !578, size: 64, offset: 704)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !690, file: !190, line: 2708, baseType: !578, size: 64, offset: 768)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !690, file: !190, line: 2711, baseType: !725, size: 64, offset: 832)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !190, line: 2711, flags: DIFlagFwdDecl)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !580, file: !190, line: 3383, baseType: !728, size: 960)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !190, line: 2756, size: 960, elements: !729)
!729 = !{!730, !731}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !728, file: !190, line: 2757, baseType: !690, size: 896)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !728, file: !190, line: 2758, baseType: !573, size: 64, offset: 896)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !580, file: !190, line: 3384, baseType: !733, size: 1472)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !190, line: 3114, size: 1472, elements: !734)
!734 = !{!735, !756, !757, !758, !759}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !733, file: !190, line: 3115, baseType: !736, size: 1216)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !190, line: 2984, size: 1216, elements: !737)
!737 = !{!738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !736, file: !190, line: 2985, baseType: !728, size: 960)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !736, file: !190, line: 2986, baseType: !578, size: 64, offset: 960)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !736, file: !190, line: 2987, baseType: !578, size: 64, offset: 1024)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !736, file: !190, line: 2988, baseType: !578, size: 64, offset: 1088)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !736, file: !190, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !736, file: !190, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !736, file: !190, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !736, file: !190, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !736, file: !190, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !736, file: !190, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !736, file: !190, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !736, file: !190, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !736, file: !190, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !736, file: !190, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !736, file: !190, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !736, file: !190, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !736, file: !190, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !736, file: !190, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !733, file: !190, line: 3117, baseType: !578, size: 64, offset: 1216)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !733, file: !190, line: 3119, baseType: !578, size: 64, offset: 1280)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !733, file: !190, line: 3121, baseType: !578, size: 64, offset: 1344)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !733, file: !190, line: 3123, baseType: !578, size: 64, offset: 1408)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !580, file: !190, line: 3385, baseType: !761, size: 1088)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !190, line: 2874, size: 1088, elements: !762)
!762 = !{!763, !764, !765}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !761, file: !190, line: 2875, baseType: !728, size: 960)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !761, file: !190, line: 2876, baseType: !573, size: 64, offset: 960)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !761, file: !190, line: 2877, baseType: !766, size: 64, offset: 1024)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !768, line: 172, size: 128, elements: !769)
!768 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!769 = !{!770, !771, !772, !773, !774, !775, !776}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !767, file: !768, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !767, file: !768, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !767, file: !768, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !767, file: !768, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !767, file: !768, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !767, file: !768, line: 195, baseType: !7, size: 32, offset: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !767, file: !768, line: 199, baseType: !578, size: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !580, file: !190, line: 3386, baseType: !736, size: 1216)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !580, file: !190, line: 3387, baseType: !779, size: 1280)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !190, line: 3093, size: 1280, elements: !780)
!780 = !{!781, !782}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !779, file: !190, line: 3094, baseType: !736, size: 1216)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !779, file: !190, line: 3095, baseType: !766, size: 64, offset: 1216)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !580, file: !190, line: 3388, baseType: !784, size: 1216)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !190, line: 2824, size: 1216, elements: !785)
!785 = !{!786, !787, !788, !789, !790, !791}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !784, file: !190, line: 2825, baseType: !690, size: 896)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !784, file: !190, line: 2827, baseType: !578, size: 64, offset: 896)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !784, file: !190, line: 2828, baseType: !578, size: 64, offset: 960)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !784, file: !190, line: 2829, baseType: !578, size: 64, offset: 1024)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !784, file: !190, line: 2830, baseType: !578, size: 64, offset: 1088)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !784, file: !190, line: 2831, baseType: !578, size: 64, offset: 1152)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !580, file: !190, line: 3389, baseType: !793, size: 1024)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !190, line: 2850, size: 1024, elements: !794)
!794 = !{!795, !796, !797}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !793, file: !190, line: 2851, baseType: !728, size: 960)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !793, file: !190, line: 2852, baseType: !500, size: 32, offset: 960)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !793, file: !190, line: 2853, baseType: !500, size: 32, offset: 992)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !580, file: !190, line: 3390, baseType: !799, size: 1024)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !190, line: 2857, size: 1024, elements: !800)
!800 = !{!801, !802}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !799, file: !190, line: 2858, baseType: !728, size: 960)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !799, file: !190, line: 2859, baseType: !766, size: 64, offset: 960)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !580, file: !190, line: 3391, baseType: !804, size: 960)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !190, line: 2862, size: 960, elements: !805)
!805 = !{!806}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !804, file: !190, line: 2863, baseType: !728, size: 960)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !580, file: !190, line: 3392, baseType: !808, size: 1472)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !190, line: 3304, size: 1472, elements: !809)
!809 = !{!810}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !808, file: !190, line: 3305, baseType: !733, size: 1472)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !580, file: !190, line: 3393, baseType: !812, size: 1792)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !190, line: 3248, size: 1792, elements: !813)
!813 = !{!814, !815, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !812, file: !190, line: 3249, baseType: !733, size: 1472)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !812, file: !190, line: 3251, baseType: !816, size: 64, offset: 1472)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !818, line: 463, size: 1152, elements: !819)
!818 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!819 = !{!820, !823, !856, !857, !1055, !1058, !1059, !1060, !1061, !1062, !1063, !1087, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !817, file: !818, line: 464, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !818, line: 464, flags: DIFlagFwdDecl)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !817, file: !818, line: 467, baseType: !824, size: 64, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !385, line: 374, size: 640, elements: !826)
!826 = !{!827, !829, !830, !843, !844, !845, !846, !847, !848, !852, !854, !855}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !825, file: !385, line: 377, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !547, line: 111, baseType: !530)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !825, file: !385, line: 378, baseType: !828, size: 64, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !825, file: !385, line: 381, baseType: !831, size: 64, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !385, line: 282, baseType: !833)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !385, line: 282, size: 128, elements: !834)
!834 = !{!835}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !833, file: !385, line: 282, baseType: !836, size: 128)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !385, line: 281, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !385, line: 281, size: 128, elements: !838)
!838 = !{!839, !840, !841}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !837, file: !385, line: 281, baseType: !7, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !837, file: !385, line: 281, baseType: !7, size: 32, offset: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !837, file: !385, line: 281, baseType: !842, size: 64, offset: 64)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !828, size: 64, elements: !660)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !825, file: !385, line: 384, baseType: !500, size: 32, offset: 192)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !825, file: !385, line: 387, baseType: !500, size: 32, offset: 224)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !825, file: !385, line: 390, baseType: !500, size: 32, offset: 256)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !825, file: !385, line: 394, baseType: !831, size: 64, offset: 320)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !825, file: !385, line: 396, baseType: !384, size: 32, offset: 384)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !825, file: !385, line: 399, baseType: !849, size: 64, offset: 416)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 64, elements: !850)
!850 = !{!851}
!851 = !DISubrange(count: 2)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !825, file: !385, line: 402, baseType: !853, size: 64, offset: 480)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !850)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !825, file: !385, line: 406, baseType: !500, size: 32, offset: 544)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !825, file: !385, line: 409, baseType: !500, size: 32, offset: 576)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !817, file: !818, line: 470, baseType: !558, size: 64, offset: 128)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !817, file: !818, line: 473, baseType: !858, size: 64, offset: 192)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !768, line: 39, size: 1152, elements: !860)
!860 = !{!861, !913, !926, !939, !940, !1009, !1010, !1014, !1015, !1016, !1017, !1018}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !859, file: !768, line: 41, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !863, line: 144, baseType: !864)
!863 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !863, line: 100, size: 896, elements: !866)
!866 = !{!867, !875, !880, !885, !887, !890, !891, !892, !893, !894, !899, !901, !902, !907, !912}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !865, file: !863, line: 102, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !863, line: 52, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!872, !873}
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !863, line: 47, baseType: !7)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !865, file: !863, line: 105, baseType: !876, size: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !863, line: 59, baseType: !877)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{!500, !873, !873}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !865, file: !863, line: 108, baseType: !881, size: 64, offset: 128)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !863, line: 63, baseType: !882)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{null, !504}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !865, file: !863, line: 111, baseType: !886, size: 64, offset: 192)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !865, file: !863, line: 114, baseType: !888, size: 64, offset: 256)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !889, line: 46, baseType: !631)
!889 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!890 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !865, file: !863, line: 117, baseType: !888, size: 64, offset: 320)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !865, file: !863, line: 120, baseType: !888, size: 64, offset: 384)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !865, file: !863, line: 124, baseType: !7, size: 32, offset: 448)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !865, file: !863, line: 128, baseType: !7, size: 32, offset: 480)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !865, file: !863, line: 131, baseType: !895, size: 64, offset: 512)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !863, line: 75, baseType: !896)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DISubroutineType(types: !898)
!898 = !{!504, !888, !888}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !865, file: !863, line: 132, baseType: !900, size: 64, offset: 576)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !863, line: 78, baseType: !882)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !865, file: !863, line: 135, baseType: !504, size: 64, offset: 640)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !865, file: !863, line: 136, baseType: !903, size: 64, offset: 704)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !863, line: 82, baseType: !904)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!504, !504, !888, !888}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !865, file: !863, line: 137, baseType: !908, size: 64, offset: 768)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !863, line: 83, baseType: !909)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{null, !504, !504}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !865, file: !863, line: 141, baseType: !7, size: 32, offset: 832)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !859, file: !768, line: 48, baseType: !914, size: 64, offset: 64)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !433, line: 35, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !433, line: 35, size: 128, elements: !917)
!917 = !{!918}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !916, file: !433, line: 35, baseType: !919, size: 128)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !433, line: 33, baseType: !920)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !433, line: 33, size: 128, elements: !921)
!921 = !{!922, !923, !924}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !920, file: !433, line: 33, baseType: !7, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !920, file: !433, line: 33, baseType: !7, size: 32, offset: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !920, file: !433, line: 33, baseType: !925, size: 64, offset: 64)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 64, elements: !660)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !859, file: !768, line: 51, baseType: !927, size: 64, offset: 128)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !190, line: 183, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !190, line: 183, size: 128, elements: !930)
!930 = !{!931}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !929, file: !190, line: 183, baseType: !932, size: 128)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !190, line: 182, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !190, line: 182, size: 128, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !933, file: !190, line: 182, baseType: !7, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !933, file: !190, line: 182, baseType: !7, size: 32, offset: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !933, file: !190, line: 182, baseType: !938, size: 64, offset: 64)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 64, elements: !660)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !859, file: !768, line: 54, baseType: !578, size: 64, offset: 192)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !859, file: !768, line: 57, baseType: !941, size: 128, offset: 256)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !942, line: 31, size: 128, elements: !943)
!942 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!943 = !{!944, !945, !946, !947, !948, !949, !950}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !941, file: !942, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !941, file: !942, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !941, file: !942, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !941, file: !942, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !941, file: !942, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !941, file: !942, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !941, file: !942, line: 56, baseType: !951, size: 64, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !547, line: 47, baseType: !952)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !954, line: 75, size: 256, elements: !955)
!954 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!955 = !{!956, !968, !969, !970}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !953, file: !954, line: 76, baseType: !957, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !954, line: 68, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !954, line: 63, size: 320, elements: !960)
!960 = !{!961, !963, !964, !965}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !959, file: !954, line: 64, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !959, file: !954, line: 65, baseType: !962, size: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !959, file: !954, line: 66, baseType: !7, size: 32, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !959, file: !954, line: 67, baseType: !966, size: 128, offset: 192)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !967, size: 128, elements: !850)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !954, line: 29, baseType: !631)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !953, file: !954, line: 77, baseType: !957, size: 64, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !953, file: !954, line: 78, baseType: !7, size: 32, offset: 128)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !953, file: !954, line: 79, baseType: !971, size: 64, offset: 192)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !954, line: 49, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !954, line: 45, size: 832, elements: !974)
!974 = !{!975, !976, !977}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !973, file: !954, line: 46, baseType: !962, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !973, file: !954, line: 47, baseType: !952, size: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !973, file: !954, line: 48, baseType: !978, size: 704, offset: 128)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !979, line: 164, size: 704, elements: !980)
!979 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!980 = !{!981, !982, !992, !993, !994, !995, !996, !997, !1001, !1005, !1006, !1007, !1008}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !978, file: !979, line: 166, baseType: !633, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !978, file: !979, line: 167, baseType: !983, size: 64, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !979, line: 157, size: 192, elements: !985)
!985 = !{!986, !987, !988}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !984, file: !979, line: 159, baseType: !502, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !984, file: !979, line: 160, baseType: !983, size: 64, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !984, file: !979, line: 161, baseType: !989, size: 32, offset: 128)
!989 = !DICompositeType(tag: DW_TAG_array_type, baseType: !503, size: 32, elements: !990)
!990 = !{!991}
!991 = !DISubrange(count: 4)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !978, file: !979, line: 168, baseType: !502, size: 64, offset: 128)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !978, file: !979, line: 169, baseType: !502, size: 64, offset: 192)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !978, file: !979, line: 170, baseType: !502, size: 64, offset: 256)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !978, file: !979, line: 171, baseType: !633, size: 64, offset: 320)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !978, file: !979, line: 172, baseType: !500, size: 32, offset: 384)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !978, file: !979, line: 176, baseType: !998, size: 64, offset: 448)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!983, !504, !633}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !978, file: !979, line: 177, baseType: !1002, size: 64, offset: 512)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{null, !504, !983}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !978, file: !979, line: 178, baseType: !504, size: 64, offset: 576)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !978, file: !979, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !978, file: !979, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !978, file: !979, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !859, file: !768, line: 60, baseType: !941, size: 128, offset: 384)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !859, file: !768, line: 64, baseType: !1011, size: 64, offset: 512)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1013, line: 33, flags: DIFlagFwdDecl)
!1013 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !859, file: !768, line: 67, baseType: !578, size: 64, offset: 576)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !859, file: !768, line: 73, baseType: !862, size: 64, offset: 640)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !859, file: !768, line: 77, baseType: !951, size: 64, offset: 704)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !859, file: !768, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !859, file: !768, line: 82, baseType: !1019, size: 320, offset: 832)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !1020, line: 62, size: 320, elements: !1021)
!1020 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1021 = !{!1022, !1028, !1029, !1030, !1031, !1038}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1019, file: !1020, line: 63, baseType: !1023, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !1020, line: 56, size: 128, elements: !1025)
!1025 = !{!1026, !1027}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1024, file: !1020, line: 57, baseType: !1023, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1024, file: !1020, line: 58, baseType: !659, size: 8, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1019, file: !1020, line: 64, baseType: !7, size: 32, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1019, file: !1020, line: 66, baseType: !7, size: 32, offset: 96)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1019, file: !1020, line: 68, baseType: !499, size: 8, offset: 128)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1019, file: !1020, line: 70, baseType: !1032, size: 64, offset: 192)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1020, line: 37, size: 128, elements: !1034)
!1034 = !{!1035, !1036}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1033, file: !1020, line: 39, baseType: !1032, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1033, file: !1020, line: 40, baseType: !1037, size: 64, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1019, file: !1020, line: 71, baseType: !1039, size: 64, offset: 256)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1020, line: 45, size: 320, elements: !1041)
!1041 = !{!1042, !1043}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1040, file: !1020, line: 47, baseType: !1039, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1040, file: !1020, line: 48, baseType: !1044, size: 256, offset: 64)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !190, line: 1883, size: 256, elements: !1045)
!1045 = !{!1046, !1048, !1049, !1054}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1044, file: !190, line: 1884, baseType: !1047, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1044, file: !190, line: 1885, baseType: !1047, size: 64, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1044, file: !190, line: 1891, baseType: !1050, size: 64, offset: 128)
!1050 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1044, file: !190, line: 1891, size: 64, elements: !1051)
!1051 = !{!1052, !1053}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1050, file: !190, line: 1891, baseType: !567, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1050, file: !190, line: 1891, baseType: !578, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1044, file: !190, line: 1892, baseType: !1037, size: 64, offset: 192)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !817, file: !818, line: 476, baseType: !1056, size: 64, offset: 256)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !818, line: 476, flags: DIFlagFwdDecl)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !817, file: !818, line: 479, baseType: !862, size: 64, offset: 320)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !817, file: !818, line: 484, baseType: !578, size: 64, offset: 384)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !817, file: !818, line: 488, baseType: !578, size: 64, offset: 448)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !817, file: !818, line: 493, baseType: !578, size: 64, offset: 512)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !817, file: !818, line: 496, baseType: !578, size: 64, offset: 576)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !817, file: !818, line: 501, baseType: !1064, size: 64, offset: 640)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !396, line: 2355, size: 576, elements: !1066)
!1066 = !{!1067, !1070, !1071, !1072, !1073, !1075, !1076, !1081, !1082, !1083, !1084, !1085, !1086}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1065, file: !396, line: 2356, baseType: !1068, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !396, line: 2356, flags: DIFlagFwdDecl)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1065, file: !396, line: 2357, baseType: !505, size: 64, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1065, file: !396, line: 2358, baseType: !500, size: 32, offset: 128)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1065, file: !396, line: 2359, baseType: !500, size: 32, offset: 160)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1065, file: !396, line: 2360, baseType: !1074, size: 128, offset: 192)
!1074 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 128, elements: !990)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1065, file: !396, line: 2364, baseType: !500, size: 32, offset: 320)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1065, file: !396, line: 2367, baseType: !1077, size: 128, offset: 384)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !396, line: 2349, size: 128, elements: !1078)
!1078 = !{!1079, !1080}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1077, file: !396, line: 2351, baseType: !573, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1077, file: !396, line: 2352, baseType: !633, size: 64, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1065, file: !396, line: 2371, baseType: !395, size: 32, offset: 512)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1065, file: !396, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1065, file: !396, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1065, file: !396, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1065, file: !396, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1065, file: !396, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !817, file: !818, line: 504, baseType: !1088, size: 64, offset: 704)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !818, line: 504, flags: DIFlagFwdDecl)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !817, file: !818, line: 507, baseType: !862, size: 64, offset: 768)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !817, file: !818, line: 510, baseType: !500, size: 32, offset: 832)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !817, file: !818, line: 513, baseType: !500, size: 32, offset: 864)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !817, file: !818, line: 516, baseType: !524, size: 32, offset: 896)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !817, file: !818, line: 519, baseType: !524, size: 32, offset: 928)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !817, file: !818, line: 522, baseType: !7, size: 32, offset: 960)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !817, file: !818, line: 523, baseType: !7, size: 32, offset: 992)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !817, file: !818, line: 528, baseType: !505, size: 64, offset: 1024)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !817, file: !818, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !817, file: !818, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !817, file: !818, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !817, file: !818, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !817, file: !818, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !817, file: !818, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !817, file: !818, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !817, file: !818, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !817, file: !818, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !817, file: !818, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !817, file: !818, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !817, file: !818, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !817, file: !818, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !817, file: !818, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !817, file: !818, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !817, file: !818, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !812, file: !190, line: 3254, baseType: !578, size: 64, offset: 1536)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !812, file: !190, line: 3257, baseType: !578, size: 64, offset: 1600)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !812, file: !190, line: 3258, baseType: !578, size: 64, offset: 1664)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !812, file: !190, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !812, file: !190, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !812, file: !190, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !812, file: !190, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !812, file: !190, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !812, file: !190, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !812, file: !190, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !812, file: !190, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !812, file: !190, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !812, file: !190, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !812, file: !190, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !812, file: !190, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !812, file: !190, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !812, file: !190, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !812, file: !190, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !812, file: !190, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !812, file: !190, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !812, file: !190, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !580, file: !190, line: 3394, baseType: !1136, size: 1344)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !190, line: 2279, size: 1344, elements: !1137)
!1137 = !{!1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1163, !1164, !1165, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1136, file: !190, line: 2280, baseType: !616, size: 192)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1136, file: !190, line: 2281, baseType: !578, size: 64, offset: 192)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1136, file: !190, line: 2282, baseType: !578, size: 64, offset: 256)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1136, file: !190, line: 2283, baseType: !578, size: 64, offset: 320)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1136, file: !190, line: 2284, baseType: !578, size: 64, offset: 384)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1136, file: !190, line: 2285, baseType: !7, size: 32, offset: 448)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1136, file: !190, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1136, file: !190, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1136, file: !190, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1136, file: !190, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1136, file: !190, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1136, file: !190, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1136, file: !190, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1136, file: !190, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1136, file: !190, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1136, file: !190, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1136, file: !190, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1136, file: !190, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1136, file: !190, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1136, file: !190, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1136, file: !190, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1136, file: !190, line: 2305, baseType: !7, size: 32, offset: 512)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1136, file: !190, line: 2306, baseType: !1161, size: 32, offset: 544)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1162, line: 31, baseType: !500)
!1162 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1136, file: !190, line: 2307, baseType: !578, size: 64, offset: 576)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1136, file: !190, line: 2308, baseType: !578, size: 64, offset: 640)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1136, file: !190, line: 2314, baseType: !1166, size: 64, offset: 704)
!1166 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !190, line: 2309, size: 64, elements: !1167)
!1167 = !{!1168, !1169, !1170}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1166, file: !190, line: 2310, baseType: !500, size: 32)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1166, file: !190, line: 2311, baseType: !505, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1166, file: !190, line: 2312, baseType: !1171, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !190, line: 2277, flags: DIFlagFwdDecl)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1136, file: !190, line: 2315, baseType: !578, size: 64, offset: 768)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1136, file: !190, line: 2316, baseType: !578, size: 64, offset: 832)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1136, file: !190, line: 2317, baseType: !578, size: 64, offset: 896)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1136, file: !190, line: 2318, baseType: !578, size: 64, offset: 960)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1136, file: !190, line: 2319, baseType: !578, size: 64, offset: 1024)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1136, file: !190, line: 2320, baseType: !578, size: 64, offset: 1088)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1136, file: !190, line: 2321, baseType: !578, size: 64, offset: 1152)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1136, file: !190, line: 2322, baseType: !578, size: 64, offset: 1216)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1136, file: !190, line: 2324, baseType: !1182, size: 64, offset: 1280)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !190, line: 2324, flags: DIFlagFwdDecl)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !580, file: !190, line: 3395, baseType: !1185, size: 320)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !190, line: 1469, size: 320, elements: !1186)
!1186 = !{!1187, !1188, !1189}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1185, file: !190, line: 1470, baseType: !616, size: 192)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1185, file: !190, line: 1471, baseType: !578, size: 64, offset: 192)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1185, file: !190, line: 1472, baseType: !578, size: 64, offset: 256)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !580, file: !190, line: 3396, baseType: !1191, size: 320)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !190, line: 1482, size: 320, elements: !1192)
!1192 = !{!1193, !1194, !1195}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1191, file: !190, line: 1483, baseType: !616, size: 192)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1191, file: !190, line: 1484, baseType: !500, size: 32, offset: 192)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1191, file: !190, line: 1485, baseType: !938, size: 64, offset: 256)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !580, file: !190, line: 3397, baseType: !1197, size: 384)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !190, line: 1829, size: 384, elements: !1198)
!1198 = !{!1199, !1200, !1201, !1202}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1197, file: !190, line: 1830, baseType: !616, size: 192)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1197, file: !190, line: 1831, baseType: !524, size: 32, offset: 192)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1197, file: !190, line: 1832, baseType: !578, size: 64, offset: 256)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1197, file: !190, line: 1835, baseType: !938, size: 64, offset: 320)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !580, file: !190, line: 3398, baseType: !1204, size: 704)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !190, line: 1898, size: 704, elements: !1205)
!1205 = !{!1206, !1207, !1208, !1209, !1210, !1215}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1204, file: !190, line: 1899, baseType: !616, size: 192)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1204, file: !190, line: 1902, baseType: !578, size: 64, offset: 192)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1204, file: !190, line: 1905, baseType: !567, size: 64, offset: 256)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1204, file: !190, line: 1908, baseType: !7, size: 32, offset: 320)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1204, file: !190, line: 1911, baseType: !1211, size: 64, offset: 384)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !768, line: 117, size: 128, elements: !1213)
!1213 = !{!1214}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "pt", scope: !1212, file: !768, line: 120, baseType: !941, size: 128)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1204, file: !190, line: 1914, baseType: !1044, size: 256, offset: 448)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !580, file: !190, line: 3399, baseType: !1217, size: 704)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !190, line: 2008, size: 704, elements: !1218)
!1218 = !{!1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1217, file: !190, line: 2009, baseType: !616, size: 192)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1217, file: !190, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1217, file: !190, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1217, file: !190, line: 2014, baseType: !524, size: 32, offset: 224)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1217, file: !190, line: 2016, baseType: !578, size: 64, offset: 256)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1217, file: !190, line: 2017, baseType: !927, size: 64, offset: 320)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1217, file: !190, line: 2019, baseType: !578, size: 64, offset: 384)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1217, file: !190, line: 2020, baseType: !578, size: 64, offset: 448)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1217, file: !190, line: 2021, baseType: !578, size: 64, offset: 512)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1217, file: !190, line: 2022, baseType: !578, size: 64, offset: 576)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1217, file: !190, line: 2023, baseType: !578, size: 64, offset: 640)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !580, file: !190, line: 3400, baseType: !1231, size: 832)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !190, line: 2430, size: 832, elements: !1232)
!1232 = !{!1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1231, file: !190, line: 2431, baseType: !616, size: 192)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1231, file: !190, line: 2433, baseType: !578, size: 64, offset: 192)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1231, file: !190, line: 2434, baseType: !578, size: 64, offset: 256)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1231, file: !190, line: 2435, baseType: !578, size: 64, offset: 320)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1231, file: !190, line: 2436, baseType: !578, size: 64, offset: 384)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1231, file: !190, line: 2437, baseType: !927, size: 64, offset: 448)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1231, file: !190, line: 2438, baseType: !578, size: 64, offset: 512)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1231, file: !190, line: 2440, baseType: !578, size: 64, offset: 576)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1231, file: !190, line: 2441, baseType: !578, size: 64, offset: 640)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !1231, file: !190, line: 2443, baseType: !1243, size: 128, offset: 704)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !190, line: 182, baseType: !1244)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !190, line: 182, size: 128, elements: !1245)
!1245 = !{!1246}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1244, file: !190, line: 182, baseType: !932, size: 128)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !580, file: !190, line: 3401, baseType: !1248, size: 320)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !190, line: 3327, size: 320, elements: !1249)
!1249 = !{!1250, !1251, !1258}
