; ModuleID = 'tree-affine.bc'
source_filename = "tree-affine.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }

!396 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!397 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!398 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!399 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!400 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!401 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!402 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!403 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!404 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!405 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!406 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!407 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!408 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!409 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!410 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!411 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!412 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!413 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!414 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !376, line: 727, baseType: !5, size: 32, elements: !415)
!415 = !{!416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439}
!416 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!417 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!418 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!419 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!420 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!421 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!422 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!423 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!424 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!425 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!426 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!427 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!428 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!429 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!430 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!431 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!432 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!433 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!434 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!435 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!436 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!437 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!438 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!439 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!440 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !376, line: 80, baseType: !5, size: 32, elements: !441)
!441 = !{!442, !443, !444, !445}
!442 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!443 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!444 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!445 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!446 = !{!447, !448, !449, !450, !453, !454, !132, !456, !583, !458, !1720, !1722, !510, !781, !1743, !815, !451, !440}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!449 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !457, line: 56, baseType: !458)
!457 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !133, line: 3371, size: 1792, elements: !460)
!460 = !{!461, !494, !500, !513, !532, !543, !548, !557, !563, !576, !588, !626, !1118, !1146, !1154, !1155, !1160, !1169, !1175, !1180, !1184, !1188, !1362, !1409, !1415, !1421, !1428, !1439, !1464, !1481, !1493, !1515, !1530, !1702}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !459, file: !133, line: 3372, baseType: !462, size: 64)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !133, line: 360, size: 64, elements: !463)
!463 = !{!464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !462, file: !133, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !462, file: !133, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !462, file: !133, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !462, file: !133, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !462, file: !133, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !462, file: !133, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !462, file: !133, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !462, file: !133, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !462, file: !133, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !462, file: !133, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !462, file: !133, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !462, file: !133, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !462, file: !133, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !462, file: !133, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !462, file: !133, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !462, file: !133, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !462, file: !133, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !462, file: !133, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !462, file: !133, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !462, file: !133, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !462, file: !133, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !462, file: !133, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !462, file: !133, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !462, file: !133, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !462, file: !133, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !462, file: !133, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !462, file: !133, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !462, file: !133, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !462, file: !133, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !462, file: !133, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !459, file: !133, line: 3373, baseType: !495, size: 192)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !133, line: 402, size: 192, elements: !496)
!496 = !{!497, !498, !499}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !495, file: !133, line: 403, baseType: !462, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !495, file: !133, line: 404, baseType: !456, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !495, file: !133, line: 405, baseType: !456, size: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !459, file: !133, line: 3374, baseType: !501, size: 320)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !133, line: 1384, size: 320, elements: !502)
!502 = !{!503, !504}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !501, file: !133, line: 1385, baseType: !495, size: 192)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !501, file: !133, line: 1386, baseType: !505, size: 128, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !506, line: 58, baseType: !507)
!506 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !506, line: 54, size: 128, elements: !508)
!508 = !{!509, !511}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !507, file: !506, line: 56, baseType: !510, size: 64)
!510 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !507, file: !506, line: 57, baseType: !512, size: 64, offset: 64)
!512 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !459, file: !133, line: 3375, baseType: !514, size: 256)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !133, line: 1397, size: 256, elements: !515)
!515 = !{!516, !517}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !514, file: !133, line: 1398, baseType: !495, size: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !514, file: !133, line: 1399, baseType: !518, size: 64, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !520, line: 52, size: 256, elements: !521)
!520 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!521 = !{!522, !523, !524, !525, !526, !527, !528}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !519, file: !520, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !519, file: !520, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !519, file: !520, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !519, file: !520, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !519, file: !520, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !519, file: !520, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !519, file: !520, line: 62, baseType: !529, size: 192, offset: 64)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !510, size: 192, elements: !530)
!530 = !{!531}
!531 = !DISubrange(count: 3)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !459, file: !133, line: 3376, baseType: !533, size: 256)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !133, line: 1408, size: 256, elements: !534)
!534 = !{!535, !536}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !533, file: !133, line: 1409, baseType: !495, size: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !533, file: !133, line: 1410, baseType: !537, size: 64, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !539, line: 27, size: 192, elements: !540)
!539 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!540 = !{!541, !542}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !538, file: !539, line: 29, baseType: !505, size: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !538, file: !539, line: 30, baseType: !3, size: 32, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !459, file: !133, line: 3377, baseType: !544, size: 256)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !133, line: 1437, size: 256, elements: !545)
!545 = !{!546, !547}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !544, file: !133, line: 1438, baseType: !495, size: 192)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !544, file: !133, line: 1439, baseType: !456, size: 64, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !459, file: !133, line: 3378, baseType: !549, size: 256)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !133, line: 1418, size: 256, elements: !550)
!550 = !{!551, !552, !553}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !549, file: !133, line: 1419, baseType: !495, size: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !549, file: !133, line: 1420, baseType: !449, size: 32, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !549, file: !133, line: 1421, baseType: !554, size: 8, offset: 224)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 8, elements: !555)
!555 = !{!556}
!556 = !DISubrange(count: 1)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !459, file: !133, line: 3379, baseType: !558, size: 320)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !133, line: 1428, size: 320, elements: !559)
!559 = !{!560, !561, !562}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !558, file: !133, line: 1429, baseType: !495, size: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !558, file: !133, line: 1430, baseType: !456, size: 64, offset: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !558, file: !133, line: 1431, baseType: !456, size: 64, offset: 256)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !459, file: !133, line: 3380, baseType: !564, size: 320)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !133, line: 1460, size: 320, elements: !565)
!565 = !{!566, !567}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !564, file: !133, line: 1461, baseType: !495, size: 192)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !564, file: !133, line: 1462, baseType: !568, size: 128, offset: 192)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !569, line: 31, size: 128, elements: !570)
!569 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!570 = !{!571, !574, !575}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !568, file: !569, line: 32, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !448)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !568, file: !569, line: 33, baseType: !5, size: 32, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !568, file: !569, line: 34, baseType: !5, size: 32, offset: 96)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !459, file: !133, line: 3381, baseType: !577, size: 384)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !133, line: 2507, size: 384, elements: !578)
!578 = !{!579, !580, !585, !586, !587}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !577, file: !133, line: 2508, baseType: !495, size: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !577, file: !133, line: 2509, baseType: !581, size: 32, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !582, line: 58, baseType: !583)
!582 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !584, line: 44, baseType: !5)
!584 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!585 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !577, file: !133, line: 2510, baseType: !5, size: 32, offset: 224)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !577, file: !133, line: 2511, baseType: !456, size: 64, offset: 256)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !577, file: !133, line: 2512, baseType: !456, size: 64, offset: 320)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !459, file: !133, line: 3382, baseType: !589, size: 896)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !133, line: 2652, size: 896, elements: !590)
!590 = !{!591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !589, file: !133, line: 2653, baseType: !577, size: 384)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !589, file: !133, line: 2654, baseType: !456, size: 64, offset: 384)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !589, file: !133, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !589, file: !133, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !589, file: !133, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !589, file: !133, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !589, file: !133, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !589, file: !133, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !589, file: !133, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !589, file: !133, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !589, file: !133, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !589, file: !133, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !589, file: !133, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !589, file: !133, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !589, file: !133, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !589, file: !133, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !589, file: !133, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !589, file: !133, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !589, file: !133, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !589, file: !133, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !589, file: !133, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !589, file: !133, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !589, file: !133, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !589, file: !133, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !589, file: !133, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !589, file: !133, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !589, file: !133, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !589, file: !133, line: 2703, baseType: !5, size: 32, offset: 512)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !589, file: !133, line: 2705, baseType: !456, size: 64, offset: 576)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !589, file: !133, line: 2706, baseType: !456, size: 64, offset: 640)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !589, file: !133, line: 2707, baseType: !456, size: 64, offset: 704)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !589, file: !133, line: 2708, baseType: !456, size: 64, offset: 768)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !589, file: !133, line: 2711, baseType: !624, size: 64, offset: 832)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !133, line: 2711, flags: DIFlagFwdDecl)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !459, file: !133, line: 3383, baseType: !627, size: 960)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !133, line: 2756, size: 960, elements: !628)
!628 = !{!629, !630}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !627, file: !133, line: 2757, baseType: !589, size: 896)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !627, file: !133, line: 2758, baseType: !631, size: 64, offset: 896)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !457, line: 50, baseType: !632)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !634, line: 240, size: 384, elements: !635)
!634 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!635 = !{!636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !633, file: !634, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !633, file: !634, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !633, file: !634, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !633, file: !634, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !633, file: !634, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !633, file: !634, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !633, file: !634, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !633, file: !634, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !633, file: !634, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !633, file: !634, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !633, file: !634, line: 321, baseType: !647, size: 320, offset: 64)
!647 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !634, line: 315, size: 320, elements: !648)
!648 = !{!649, !1051, !1053, !1116, !1117}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !647, file: !634, line: 316, baseType: !650, size: 64)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 64, elements: !555)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !634, line: 183, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !634, line: 166, size: 64, elements: !653)
!653 = !{!654, !655, !656, !657, !658, !666, !667, !679, !682, !742, !743, !1028, !1041, !1048}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !652, file: !634, line: 168, baseType: !449, size: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !652, file: !634, line: 169, baseType: !5, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !652, file: !634, line: 170, baseType: !454, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !652, file: !634, line: 171, baseType: !631, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !652, file: !634, line: 172, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !457, line: 53, baseType: !660)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !634, line: 359, size: 128, elements: !662)
!662 = !{!663, !664}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !661, file: !634, line: 360, baseType: !449, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !661, file: !634, line: 361, baseType: !665, size: 64, offset: 64)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !631, size: 64, elements: !555)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !652, file: !634, line: 173, baseType: !3, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !652, file: !634, line: 174, baseType: !668, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !634, line: 133, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !634, line: 115, size: 32, elements: !670)
!670 = !{!671, !672, !673, !674, !675, !676, !677, !678}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !669, file: !634, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !669, file: !634, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !669, file: !634, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !669, file: !634, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !669, file: !634, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !669, file: !634, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !669, file: !634, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !669, file: !634, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !652, file: !634, line: 175, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !634, line: 175, flags: DIFlagFwdDecl)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !652, file: !634, line: 176, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !685, line: 75, size: 256, elements: !686)
!685 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!686 = !{!687, !701, !702, !703}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !684, file: !685, line: 76, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !685, line: 68, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !685, line: 63, size: 320, elements: !691)
!691 = !{!692, !694, !695, !696}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !690, file: !685, line: 64, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !690, file: !685, line: 65, baseType: !693, size: 64, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !690, file: !685, line: 66, baseType: !5, size: 32, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !690, file: !685, line: 67, baseType: !697, size: 128, offset: 192)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 128, elements: !699)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !685, line: 29, baseType: !510)
!699 = !{!700}
!700 = !DISubrange(count: 2)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !684, file: !685, line: 77, baseType: !688, size: 64, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !684, file: !685, line: 78, baseType: !5, size: 32, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !684, file: !685, line: 79, baseType: !704, size: 64, offset: 192)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !685, line: 49, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !685, line: 45, size: 832, elements: !707)
!707 = !{!708, !709, !710}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !706, file: !685, line: 46, baseType: !693, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !706, file: !685, line: 47, baseType: !683, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !706, file: !685, line: 48, baseType: !711, size: 704, offset: 128)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !712, line: 164, size: 704, elements: !713)
!712 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!713 = !{!714, !715, !725, !726, !727, !728, !729, !730, !734, !738, !739, !740, !741}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !711, file: !712, line: 166, baseType: !512, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !711, file: !712, line: 167, baseType: !716, size: 64, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !712, line: 157, size: 192, elements: !718)
!718 = !{!719, !720, !721}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !717, file: !712, line: 159, baseType: !451, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !717, file: !712, line: 160, baseType: !716, size: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !717, file: !712, line: 161, baseType: !722, size: 32, offset: 128)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 32, elements: !723)
!723 = !{!724}
!724 = !DISubrange(count: 4)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !711, file: !712, line: 168, baseType: !451, size: 64, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !711, file: !712, line: 169, baseType: !451, size: 64, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !711, file: !712, line: 170, baseType: !451, size: 64, offset: 256)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !711, file: !712, line: 171, baseType: !512, size: 64, offset: 320)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !711, file: !712, line: 172, baseType: !449, size: 32, offset: 384)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !711, file: !712, line: 176, baseType: !731, size: 64, offset: 448)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{!716, !453, !512}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !711, file: !712, line: 177, baseType: !735, size: 64, offset: 512)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{null, !453, !716}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !711, file: !712, line: 178, baseType: !453, size: 64, offset: 576)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !711, file: !712, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !711, file: !712, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !711, file: !712, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !652, file: !634, line: 177, baseType: !456, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !652, file: !634, line: 178, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !328, line: 217, size: 832, elements: !746)
!746 = !{!747, !993, !994, !995, !998, !1002, !1003, !1004, !1022, !1023, !1024, !1025, !1026, !1027}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !745, file: !328, line: 219, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !328, line: 151, baseType: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !328, line: 151, size: 128, elements: !751)
!751 = !{!752}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !750, file: !328, line: 151, baseType: !753, size: 128)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !328, line: 150, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !328, line: 150, size: 128, elements: !755)
!755 = !{!756, !757, !758}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !754, file: !328, line: 150, baseType: !5, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !754, file: !328, line: 150, baseType: !5, size: 32, offset: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !754, file: !328, line: 150, baseType: !759, size: 64, offset: 64)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !760, size: 64, elements: !555)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !457, line: 108, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !328, line: 122, size: 512, elements: !763)
!763 = !{!764, !765, !766, !985, !986, !987, !988, !989, !990, !991}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !762, file: !328, line: 124, baseType: !744, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !762, file: !328, line: 125, baseType: !744, size: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !762, file: !328, line: 131, baseType: !767, size: 64, offset: 128)
!767 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !328, line: 128, size: 64, elements: !768)
!768 = !{!769, !984}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !767, file: !328, line: 129, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !457, line: 66, baseType: !771)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !376, line: 143, size: 192, elements: !773)
!773 = !{!774, !982, !983}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !772, file: !376, line: 145, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !457, line: 69, baseType: !776)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !376, line: 136, size: 192, elements: !778)
!778 = !{!779, !980, !981}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !777, file: !376, line: 137, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !457, line: 58, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !376, line: 737, size: 768, elements: !783)
!783 = !{!784, !801, !835, !841, !846, !851, !858, !864, !870, !875, !889, !894, !900, !905, !915, !920, !938, !945, !952, !958, !963, !969, !975}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !782, file: !376, line: 738, baseType: !785, size: 256)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !376, line: 271, size: 256, elements: !786)
!786 = !{!787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !785, file: !376, line: 274, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !785, file: !376, line: 277, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !785, file: !376, line: 281, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !785, file: !376, line: 284, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !785, file: !376, line: 291, baseType: !5, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !785, file: !376, line: 295, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !785, file: !376, line: 298, baseType: !5, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !785, file: !376, line: 301, baseType: !5, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !785, file: !376, line: 307, baseType: !5, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !785, file: !376, line: 312, baseType: !5, size: 32, offset: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !785, file: !376, line: 316, baseType: !581, size: 32, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !785, file: !376, line: 319, baseType: !5, size: 32, offset: 96)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !785, file: !376, line: 323, baseType: !744, size: 64, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !785, file: !376, line: 327, baseType: !456, size: 64, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !782, file: !376, line: 739, baseType: !802, size: 448)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !376, line: 350, size: 448, elements: !803)
!803 = !{!804, !833}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !802, file: !376, line: 353, baseType: !805, size: 384)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !376, line: 333, size: 384, elements: !806)
!806 = !{!807, !808, !816}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !805, file: !376, line: 336, baseType: !785, size: 256)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !805, file: !376, line: 343, baseType: !809, size: 64, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !811, line: 37, size: 128, elements: !812)
!811 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!812 = !{!813, !814}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !810, file: !811, line: 39, baseType: !809, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !810, file: !811, line: 40, baseType: !815, size: 64, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !805, file: !376, line: 344, baseType: !817, size: 64, offset: 320)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !811, line: 45, size: 320, elements: !819)
!819 = !{!820, !821}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !818, file: !811, line: 47, baseType: !817, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !818, file: !811, line: 48, baseType: !822, size: 256, offset: 64)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !133, line: 1883, size: 256, elements: !823)
!823 = !{!824, !826, !827, !832}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !822, file: !133, line: 1884, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !822, file: !133, line: 1885, baseType: !825, size: 64, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !822, file: !133, line: 1891, baseType: !828, size: 64, offset: 128)
!828 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !822, file: !133, line: 1891, size: 64, elements: !829)
!829 = !{!830, !831}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !828, file: !133, line: 1891, baseType: !780, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !828, file: !133, line: 1891, baseType: !456, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !822, file: !133, line: 1892, baseType: !815, size: 64, offset: 192)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !802, file: !376, line: 359, baseType: !834, size: 64, offset: 384)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 64, elements: !555)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !782, file: !376, line: 740, baseType: !836, size: 512)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !376, line: 365, size: 512, elements: !837)
!837 = !{!838, !839, !840}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !836, file: !376, line: 368, baseType: !805, size: 384)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !836, file: !376, line: 373, baseType: !456, size: 64, offset: 384)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !836, file: !376, line: 374, baseType: !456, size: 64, offset: 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !782, file: !376, line: 741, baseType: !842, size: 576)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !376, line: 380, size: 576, elements: !843)
!843 = !{!844, !845}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !842, file: !376, line: 383, baseType: !836, size: 512)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !842, file: !376, line: 389, baseType: !834, size: 64, offset: 512)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !782, file: !376, line: 742, baseType: !847, size: 320)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !376, line: 395, size: 320, elements: !848)
!848 = !{!849, !850}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !847, file: !376, line: 397, baseType: !785, size: 256)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !847, file: !376, line: 400, baseType: !770, size: 64, offset: 256)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !782, file: !376, line: 743, baseType: !852, size: 448)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !376, line: 406, size: 448, elements: !853)
!853 = !{!854, !855, !856, !857}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !852, file: !376, line: 408, baseType: !785, size: 256)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !852, file: !376, line: 412, baseType: !456, size: 64, offset: 256)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !852, file: !376, line: 420, baseType: !456, size: 64, offset: 320)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !852, file: !376, line: 423, baseType: !770, size: 64, offset: 384)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !782, file: !376, line: 744, baseType: !859, size: 384)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !376, line: 429, size: 384, elements: !860)
!860 = !{!861, !862, !863}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !859, file: !376, line: 431, baseType: !785, size: 256)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !859, file: !376, line: 434, baseType: !456, size: 64, offset: 256)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !859, file: !376, line: 437, baseType: !770, size: 64, offset: 320)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !782, file: !376, line: 745, baseType: !865, size: 384)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !376, line: 443, size: 384, elements: !866)
!866 = !{!867, !868, !869}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !865, file: !376, line: 445, baseType: !785, size: 256)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !865, file: !376, line: 449, baseType: !456, size: 64, offset: 256)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !865, file: !376, line: 453, baseType: !770, size: 64, offset: 320)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !782, file: !376, line: 746, baseType: !871, size: 320)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !376, line: 459, size: 320, elements: !872)
!872 = !{!873, !874}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !871, file: !376, line: 461, baseType: !785, size: 256)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !871, file: !376, line: 464, baseType: !456, size: 64, offset: 256)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !782, file: !376, line: 747, baseType: !876, size: 768)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !376, line: 469, size: 768, elements: !877)
!877 = !{!878, !879, !880, !881, !882}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !876, file: !376, line: 471, baseType: !785, size: 256)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !876, file: !376, line: 474, baseType: !5, size: 32, offset: 256)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !876, file: !376, line: 475, baseType: !5, size: 32, offset: 288)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !876, file: !376, line: 478, baseType: !456, size: 64, offset: 320)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !876, file: !376, line: 481, baseType: !883, size: 384, offset: 384)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !884, size: 384, elements: !555)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !133, line: 1917, size: 384, elements: !885)
!885 = !{!886, !887, !888}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !884, file: !133, line: 1920, baseType: !822, size: 256)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !884, file: !133, line: 1921, baseType: !456, size: 64, offset: 256)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !884, file: !133, line: 1922, baseType: !581, size: 32, offset: 320)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !782, file: !376, line: 748, baseType: !890, size: 320)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !376, line: 487, size: 320, elements: !891)
!891 = !{!892, !893}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !890, file: !376, line: 490, baseType: !785, size: 256)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !890, file: !376, line: 494, baseType: !449, size: 32, offset: 256)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !782, file: !376, line: 749, baseType: !895, size: 384)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !376, line: 500, size: 384, elements: !896)
!896 = !{!897, !898, !899}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !895, file: !376, line: 502, baseType: !785, size: 256)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !895, file: !376, line: 506, baseType: !770, size: 64, offset: 256)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !895, file: !376, line: 510, baseType: !770, size: 64, offset: 320)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !782, file: !376, line: 750, baseType: !901, size: 320)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !376, line: 529, size: 320, elements: !902)
!902 = !{!903, !904}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !901, file: !376, line: 531, baseType: !785, size: 256)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !901, file: !376, line: 540, baseType: !770, size: 64, offset: 256)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !782, file: !376, line: 751, baseType: !906, size: 704)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !376, line: 546, size: 704, elements: !907)
!907 = !{!908, !909, !910, !911, !912, !913, !914}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !906, file: !376, line: 549, baseType: !836, size: 512)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !906, file: !376, line: 553, baseType: !454, size: 64, offset: 512)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !906, file: !376, line: 557, baseType: !448, size: 8, offset: 576)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !906, file: !376, line: 558, baseType: !448, size: 8, offset: 584)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !906, file: !376, line: 559, baseType: !448, size: 8, offset: 592)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !906, file: !376, line: 560, baseType: !448, size: 8, offset: 600)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !906, file: !376, line: 566, baseType: !834, size: 64, offset: 640)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !782, file: !376, line: 752, baseType: !916, size: 384)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !376, line: 571, size: 384, elements: !917)
!917 = !{!918, !919}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !916, file: !376, line: 573, baseType: !847, size: 320)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !916, file: !376, line: 577, baseType: !456, size: 64, offset: 320)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !782, file: !376, line: 753, baseType: !921, size: 576)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !376, line: 600, size: 576, elements: !922)
!922 = !{!923, !924, !925, !928, !937}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !921, file: !376, line: 602, baseType: !847, size: 320)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !921, file: !376, line: 605, baseType: !456, size: 64, offset: 320)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !921, file: !376, line: 609, baseType: !926, size: 64, offset: 384)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !927, line: 46, baseType: !510)
!927 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!928 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !921, file: !376, line: 612, baseType: !929, size: 64, offset: 448)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !376, line: 581, size: 320, elements: !931)
!931 = !{!932, !933, !934, !935, !936}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !930, file: !376, line: 583, baseType: !132, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !930, file: !376, line: 586, baseType: !456, size: 64, offset: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !930, file: !376, line: 589, baseType: !456, size: 64, offset: 128)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !930, file: !376, line: 592, baseType: !456, size: 64, offset: 192)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !930, file: !376, line: 595, baseType: !456, size: 64, offset: 256)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !921, file: !376, line: 616, baseType: !770, size: 64, offset: 512)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !782, file: !376, line: 754, baseType: !939, size: 512)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !376, line: 622, size: 512, elements: !940)
!940 = !{!941, !942, !943, !944}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !939, file: !376, line: 624, baseType: !847, size: 320)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !939, file: !376, line: 628, baseType: !456, size: 64, offset: 320)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !939, file: !376, line: 632, baseType: !456, size: 64, offset: 384)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !939, file: !376, line: 636, baseType: !456, size: 64, offset: 448)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !782, file: !376, line: 755, baseType: !946, size: 704)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !376, line: 642, size: 704, elements: !947)
!947 = !{!948, !949, !950, !951}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !946, file: !376, line: 644, baseType: !939, size: 512)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !946, file: !376, line: 648, baseType: !456, size: 64, offset: 512)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !946, file: !376, line: 652, baseType: !456, size: 64, offset: 576)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !946, file: !376, line: 653, baseType: !456, size: 64, offset: 640)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !782, file: !376, line: 756, baseType: !953, size: 448)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !376, line: 663, size: 448, elements: !954)
!954 = !{!955, !956, !957}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !953, file: !376, line: 665, baseType: !847, size: 320)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !953, file: !376, line: 668, baseType: !456, size: 64, offset: 320)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !953, file: !376, line: 673, baseType: !456, size: 64, offset: 384)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !782, file: !376, line: 757, baseType: !959, size: 384)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !376, line: 694, size: 384, elements: !960)
!960 = !{!961, !962}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !959, file: !376, line: 696, baseType: !847, size: 320)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !959, file: !376, line: 699, baseType: !456, size: 64, offset: 320)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !782, file: !376, line: 758, baseType: !964, size: 384)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !376, line: 681, size: 384, elements: !965)
!965 = !{!966, !967, !968}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !964, file: !376, line: 683, baseType: !785, size: 256)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !964, file: !376, line: 686, baseType: !456, size: 64, offset: 256)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !964, file: !376, line: 689, baseType: !456, size: 64, offset: 320)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !782, file: !376, line: 759, baseType: !970, size: 384)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !376, line: 707, size: 384, elements: !971)
!971 = !{!972, !973, !974}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !970, file: !376, line: 709, baseType: !785, size: 256)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !970, file: !376, line: 712, baseType: !456, size: 64, offset: 256)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !970, file: !376, line: 712, baseType: !456, size: 64, offset: 320)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !782, file: !376, line: 760, baseType: !976, size: 320)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !376, line: 718, size: 320, elements: !977)
!977 = !{!978, !979}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !976, file: !376, line: 720, baseType: !785, size: 256)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !976, file: !376, line: 723, baseType: !456, size: 64, offset: 256)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !777, file: !376, line: 138, baseType: !776, size: 64, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !777, file: !376, line: 139, baseType: !776, size: 64, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !772, file: !376, line: 146, baseType: !775, size: 64, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !772, file: !376, line: 152, baseType: !770, size: 64, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !767, file: !328, line: 130, baseType: !631, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !762, file: !328, line: 134, baseType: !453, size: 64, offset: 192)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !762, file: !328, line: 137, baseType: !456, size: 64, offset: 256)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !762, file: !328, line: 138, baseType: !581, size: 32, offset: 320)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !762, file: !328, line: 142, baseType: !5, size: 32, offset: 352)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !762, file: !328, line: 144, baseType: !449, size: 32, offset: 384)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !762, file: !328, line: 145, baseType: !449, size: 32, offset: 416)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !762, file: !328, line: 146, baseType: !992, size: 64, offset: 448)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !328, line: 119, baseType: !512)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !745, file: !328, line: 220, baseType: !748, size: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !745, file: !328, line: 223, baseType: !453, size: 64, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !745, file: !328, line: 226, baseType: !996, size: 64, offset: 192)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !328, line: 185, flags: DIFlagFwdDecl)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !745, file: !328, line: 229, baseType: !999, size: 128, offset: 256)
!999 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1000, size: 128, elements: !699)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !328, line: 229, flags: DIFlagFwdDecl)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !745, file: !328, line: 232, baseType: !744, size: 64, offset: 384)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !745, file: !328, line: 233, baseType: !744, size: 64, offset: 448)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !745, file: !328, line: 238, baseType: !1005, size: 64, offset: 512)
!1005 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !328, line: 235, size: 64, elements: !1006)
!1006 = !{!1007, !1013}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1005, file: !328, line: 236, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !328, line: 273, size: 128, elements: !1010)
!1010 = !{!1011, !1012}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1009, file: !328, line: 275, baseType: !770, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1009, file: !328, line: 278, baseType: !770, size: 64, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1005, file: !328, line: 237, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !328, line: 259, size: 320, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1020, !1021}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1015, file: !328, line: 261, baseType: !631, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1015, file: !328, line: 262, baseType: !631, size: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1015, file: !328, line: 266, baseType: !631, size: 64, offset: 128)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1015, file: !328, line: 267, baseType: !631, size: 64, offset: 192)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1015, file: !328, line: 270, baseType: !449, size: 32, offset: 256)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !745, file: !328, line: 241, baseType: !992, size: 64, offset: 576)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !745, file: !328, line: 244, baseType: !449, size: 32, offset: 640)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !745, file: !328, line: 247, baseType: !449, size: 32, offset: 672)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !745, file: !328, line: 250, baseType: !449, size: 32, offset: 704)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !745, file: !328, line: 253, baseType: !449, size: 32, offset: 736)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !745, file: !328, line: 256, baseType: !449, size: 32, offset: 768)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !652, file: !634, line: 179, baseType: !1029, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !634, line: 150, baseType: !1031)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !634, line: 142, size: 320, elements: !1032)
!1032 = !{!1033, !1034, !1035, !1036, !1039, !1040}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1031, file: !634, line: 144, baseType: !456, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1031, file: !634, line: 145, baseType: !631, size: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1031, file: !634, line: 146, baseType: !631, size: 64, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1031, file: !634, line: 147, baseType: !1037, size: 32, offset: 192)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1038, line: 31, baseType: !449)
!1038 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1031, file: !634, line: 148, baseType: !5, size: 32, offset: 224)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1031, file: !634, line: 149, baseType: !448, size: 8, offset: 256)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !652, file: !634, line: 180, baseType: !1042, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !634, line: 162, baseType: !1044)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !634, line: 159, size: 128, elements: !1045)
!1045 = !{!1046, !1047}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1044, file: !634, line: 160, baseType: !456, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1044, file: !634, line: 161, baseType: !512, size: 64, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !652, file: !634, line: 181, baseType: !1049, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !634, line: 181, flags: DIFlagFwdDecl)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !647, file: !634, line: 317, baseType: !1052, size: 64)
!1052 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 64, elements: !555)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !647, file: !634, line: 318, baseType: !1054, size: 320)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !634, line: 188, size: 320, elements: !1055)
!1055 = !{!1056, !1058, !1115}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1054, file: !634, line: 190, baseType: !1057, size: 192)
!1057 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 192, elements: !530)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1054, file: !634, line: 193, baseType: !1059, size: 64, offset: 192)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !634, line: 206, size: 320, elements: !1061)
!1061 = !{!1062, !1100, !1101, !1102, !1114}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1060, file: !634, line: 208, baseType: !1063, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !457, line: 62, baseType: !1065)
!1065 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1066, line: 538, size: 256, elements: !1067)
!1066 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1067 = !{!1068, !1072, !1078, !1091}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1065, file: !1066, line: 539, baseType: !1069, size: 32)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1066, line: 482, size: 32, elements: !1070)
!1070 = !{!1071}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1069, file: !1066, line: 484, baseType: !5, size: 32)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1065, file: !1066, line: 540, baseType: !1073, size: 192)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1066, line: 488, size: 192, elements: !1074)
!1074 = !{!1075, !1076, !1077}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1073, file: !1066, line: 489, baseType: !1069, size: 32)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1073, file: !1066, line: 492, baseType: !454, size: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1073, file: !1066, line: 496, baseType: !456, size: 64, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1065, file: !1066, line: 541, baseType: !1079, size: 256)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1066, line: 504, size: 256, elements: !1080)
!1080 = !{!1081, !1082, !1089, !1090}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1079, file: !1066, line: 505, baseType: !1069, size: 32)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1079, file: !1066, line: 509, baseType: !1083, size: 64, offset: 64)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1066, line: 501, baseType: !1084)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{null, !1087}
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1079, file: !1066, line: 510, baseType: !1087, size: 64, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1079, file: !1066, line: 513, baseType: !1063, size: 64, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1065, file: !1066, line: 542, baseType: !1092, size: 128)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1066, line: 530, size: 128, elements: !1093)
!1093 = !{!1094, !1095}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1092, file: !1066, line: 531, baseType: !1069, size: 32)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1092, file: !1066, line: 534, baseType: !1096, size: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1066, line: 525, baseType: !1097)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!448, !456, !454, !510, !510}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1060, file: !634, line: 211, baseType: !5, size: 32, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1060, file: !634, line: 214, baseType: !512, size: 64, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1060, file: !634, line: 224, baseType: !1103, size: 64, offset: 192)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !634, line: 202, baseType: !1105)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !634, line: 202, size: 128, elements: !1106)
!1106 = !{!1107}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1105, file: !634, line: 202, baseType: !1108, size: 128)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !634, line: 200, baseType: !1109)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !634, line: 200, size: 128, elements: !1110)
!1110 = !{!1111, !1112, !1113}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1109, file: !634, line: 200, baseType: !5, size: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1109, file: !634, line: 200, baseType: !5, size: 32, offset: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1109, file: !634, line: 200, baseType: !665, size: 64, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1060, file: !634, line: 234, baseType: !1103, size: 64, offset: 256)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1054, file: !634, line: 197, baseType: !512, size: 64, offset: 256)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !647, file: !634, line: 319, baseType: !519, size: 256)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !647, file: !634, line: 320, baseType: !538, size: 192)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !459, file: !133, line: 3384, baseType: !1119, size: 1472)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !133, line: 3114, size: 1472, elements: !1120)
!1120 = !{!1121, !1142, !1143, !1144, !1145}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1119, file: !133, line: 3115, baseType: !1122, size: 1216)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !133, line: 2984, size: 1216, elements: !1123)
!1123 = !{!1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1122, file: !133, line: 2985, baseType: !627, size: 960)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1122, file: !133, line: 2986, baseType: !456, size: 64, offset: 960)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1122, file: !133, line: 2987, baseType: !456, size: 64, offset: 1024)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1122, file: !133, line: 2988, baseType: !456, size: 64, offset: 1088)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1122, file: !133, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1122, file: !133, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1122, file: !133, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1122, file: !133, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1122, file: !133, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1122, file: !133, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1122, file: !133, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1122, file: !133, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1122, file: !133, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1122, file: !133, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1122, file: !133, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1122, file: !133, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1122, file: !133, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1122, file: !133, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1119, file: !133, line: 3117, baseType: !456, size: 64, offset: 1216)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1119, file: !133, line: 3119, baseType: !456, size: 64, offset: 1280)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1119, file: !133, line: 3121, baseType: !456, size: 64, offset: 1344)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1119, file: !133, line: 3123, baseType: !456, size: 64, offset: 1408)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !459, file: !133, line: 3385, baseType: !1147, size: 1088)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !133, line: 2874, size: 1088, elements: !1148)
!1148 = !{!1149, !1150, !1151}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1147, file: !133, line: 2875, baseType: !627, size: 960)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1147, file: !133, line: 2876, baseType: !631, size: 64, offset: 960)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1147, file: !133, line: 2877, baseType: !1152, size: 64, offset: 1024)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !133, line: 2856, flags: DIFlagFwdDecl)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !459, file: !133, line: 3386, baseType: !1122, size: 1216)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !459, file: !133, line: 3387, baseType: !1156, size: 1280)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !133, line: 3093, size: 1280, elements: !1157)
!1157 = !{!1158, !1159}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1156, file: !133, line: 3094, baseType: !1122, size: 1216)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1156, file: !133, line: 3095, baseType: !1152, size: 64, offset: 1216)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !459, file: !133, line: 3388, baseType: !1161, size: 1216)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !133, line: 2824, size: 1216, elements: !1162)
!1162 = !{!1163, !1164, !1165, !1166, !1167, !1168}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1161, file: !133, line: 2825, baseType: !589, size: 896)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1161, file: !133, line: 2827, baseType: !456, size: 64, offset: 896)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1161, file: !133, line: 2828, baseType: !456, size: 64, offset: 960)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1161, file: !133, line: 2829, baseType: !456, size: 64, offset: 1024)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1161, file: !133, line: 2830, baseType: !456, size: 64, offset: 1088)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1161, file: !133, line: 2831, baseType: !456, size: 64, offset: 1152)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !459, file: !133, line: 3389, baseType: !1170, size: 1024)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !133, line: 2850, size: 1024, elements: !1171)
!1171 = !{!1172, !1173, !1174}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1170, file: !133, line: 2851, baseType: !627, size: 960)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1170, file: !133, line: 2852, baseType: !449, size: 32, offset: 960)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1170, file: !133, line: 2853, baseType: !449, size: 32, offset: 992)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !459, file: !133, line: 3390, baseType: !1176, size: 1024)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !133, line: 2857, size: 1024, elements: !1177)
!1177 = !{!1178, !1179}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1176, file: !133, line: 2858, baseType: !627, size: 960)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1176, file: !133, line: 2859, baseType: !1152, size: 64, offset: 960)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !459, file: !133, line: 3391, baseType: !1181, size: 960)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !133, line: 2862, size: 960, elements: !1182)
!1182 = !{!1183}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1181, file: !133, line: 2863, baseType: !627, size: 960)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !459, file: !133, line: 3392, baseType: !1185, size: 1472)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !133, line: 3304, size: 1472, elements: !1186)
!1186 = !{!1187}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1185, file: !133, line: 3305, baseType: !1119, size: 1472)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !459, file: !133, line: 3393, baseType: !1189, size: 1792)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !133, line: 3248, size: 1792, elements: !1190)
!1190 = !{!1191, !1192, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1189, file: !133, line: 3249, baseType: !1119, size: 1472)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1189, file: !133, line: 3251, baseType: !1193, size: 64, offset: 1472)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1195, line: 463, size: 1152, elements: !1196)
!1195 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1196 = !{!1197, !1200, !1231, !1232, !1235, !1238, !1286, !1287, !1288, !1289, !1290, !1314, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1194, file: !1195, line: 464, baseType: !1198, size: 64)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1195, line: 464, flags: DIFlagFwdDecl)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1194, file: !1195, line: 467, baseType: !1201, size: 64, offset: 64)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !328, line: 374, size: 640, elements: !1203)
!1203 = !{!1204, !1206, !1207, !1220, !1221, !1222, !1223, !1224, !1225, !1227, !1229, !1230}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1202, file: !328, line: 377, baseType: !1205, size: 64)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !457, line: 111, baseType: !744)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1202, file: !328, line: 378, baseType: !1205, size: 64, offset: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1202, file: !328, line: 381, baseType: !1208, size: 64, offset: 128)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !328, line: 282, baseType: !1210)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !328, line: 282, size: 128, elements: !1211)
!1211 = !{!1212}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1210, file: !328, line: 282, baseType: !1213, size: 128)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !328, line: 281, baseType: !1214)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !328, line: 281, size: 128, elements: !1215)
!1215 = !{!1216, !1217, !1218}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1214, file: !328, line: 281, baseType: !5, size: 32)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1214, file: !328, line: 281, baseType: !5, size: 32, offset: 32)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1214, file: !328, line: 281, baseType: !1219, size: 64, offset: 64)
!1219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1205, size: 64, elements: !555)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1202, file: !328, line: 384, baseType: !449, size: 32, offset: 192)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1202, file: !328, line: 387, baseType: !449, size: 32, offset: 224)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1202, file: !328, line: 390, baseType: !449, size: 32, offset: 256)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1202, file: !328, line: 394, baseType: !1208, size: 64, offset: 320)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1202, file: !328, line: 396, baseType: !327, size: 32, offset: 384)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1202, file: !328, line: 399, baseType: !1226, size: 64, offset: 416)
!1226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 64, elements: !699)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1202, file: !328, line: 402, baseType: !1228, size: 64, offset: 480)
!1228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !699)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1202, file: !328, line: 406, baseType: !449, size: 32, offset: 544)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1202, file: !328, line: 409, baseType: !449, size: 32, offset: 576)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1194, file: !1195, line: 470, baseType: !771, size: 64, offset: 128)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1194, file: !1195, line: 473, baseType: !1233, size: 64, offset: 192)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1195, line: 166, flags: DIFlagFwdDecl)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1194, file: !1195, line: 476, baseType: !1236, size: 64, offset: 256)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1195, line: 476, flags: DIFlagFwdDecl)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1194, file: !1195, line: 479, baseType: !1239, size: 64, offset: 320)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1240, line: 144, baseType: !1241)
!1240 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
