; ModuleID = 'tree-ssa-loop-ivcanon.bc'
source_filename = "tree-ssa-loop-ivcanon.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.param_info = type { i8*, i32, i8, i32, i32, i8* }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }

!409 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!410 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!411 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!412 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!413 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!414 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!415 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!416 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!417 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!418 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!419 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!420 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!421 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!422 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!423 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!424 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!425 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!426 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!427 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!428 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!429 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!430 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!431 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!432 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !394, line: 727, baseType: !5, size: 32, elements: !433)
!433 = !{!434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457}
!434 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!435 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!436 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!437 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!438 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!439 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!440 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!441 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!442 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!443 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!444 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!445 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!446 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!447 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!448 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!449 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!450 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!451 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!452 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!453 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!454 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!455 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!456 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!457 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!458 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !394, line: 80, baseType: !5, size: 32, elements: !459)
!459 = !{!460, !461, !462, !463}
!460 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!461 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!462 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!463 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!464 = !{!465, !466, !467, !468, !471, !472, !474, !489, !181, !5, !534, !1872, !558, !1173, !469, !458, !613, !611, !512, !553}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!467 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !470)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_int_heap", file: !476, line: 32, baseType: !477)
!476 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_int_heap", file: !476, line: 32, size: 96, elements: !478)
!478 = !{!479}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !477, file: !476, line: 32, baseType: !480, size: 96)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_int_base", file: !476, line: 31, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_int_base", file: !476, line: 31, size: 96, elements: !482)
!482 = !{!483, !484, !485}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !481, file: !476, line: 31, baseType: !5, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !481, file: !476, line: 31, baseType: !5, size: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !481, file: !476, line: 31, baseType: !486, size: 32, offset: 64)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 32, elements: !487)
!487 = !{!488}
!488 = !DISubrange(count: 1)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !376, line: 84, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !376, line: 100, size: 1216, elements: !492)
!492 = !{!493, !494, !495, !1836, !1837, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1862, !1870, !1871}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !491, file: !376, line: 102, baseType: !467, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !491, file: !376, line: 105, baseType: !5, size: 32, offset: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !491, file: !376, line: 108, baseType: !496, size: 64, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !133, line: 217, size: 832, elements: !498)
!498 = !{!499, !1803, !1804, !1805, !1806, !1810, !1811, !1812, !1830, !1831, !1832, !1833, !1834, !1835}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !497, file: !133, line: 219, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !133, line: 151, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !133, line: 151, size: 128, elements: !503)
!503 = !{!504}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !502, file: !133, line: 151, baseType: !505, size: 128)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !133, line: 150, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !133, line: 150, size: 128, elements: !507)
!507 = !{!508, !509, !510}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !506, file: !133, line: 150, baseType: !5, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !506, file: !133, line: 150, baseType: !5, size: 32, offset: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !506, file: !133, line: 150, baseType: !511, size: 64, offset: 64)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 64, elements: !487)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !513, line: 108, baseType: !514)
!513 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !133, line: 122, size: 512, elements: !516)
!516 = !{!517, !518, !519, !1795, !1796, !1797, !1798, !1799, !1800, !1801}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !515, file: !133, line: 124, baseType: !496, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !515, file: !133, line: 125, baseType: !496, size: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !515, file: !133, line: 131, baseType: !520, size: 64, offset: 128)
!520 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !133, line: 128, size: 64, elements: !521)
!521 = !{!522, !1794}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !520, file: !133, line: 129, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !513, line: 66, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !394, line: 143, size: 192, elements: !526)
!526 = !{!527, !1792, !1793}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !525, file: !394, line: 145, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !513, line: 69, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !394, line: 136, size: 192, elements: !531)
!531 = !{!532, !1790, !1791}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !530, file: !394, line: 137, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !513, line: 58, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !394, line: 737, size: 768, elements: !536)
!536 = !{!537, !1637, !1647, !1653, !1658, !1663, !1670, !1676, !1682, !1687, !1701, !1706, !1712, !1717, !1727, !1732, !1748, !1755, !1762, !1768, !1773, !1779, !1785}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !535, file: !394, line: 738, baseType: !538, size: 256)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !394, line: 271, size: 256, elements: !539)
!539 = !{!540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !555, !556, !557}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !538, file: !394, line: 274, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !538, file: !394, line: 277, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !538, file: !394, line: 281, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !538, file: !394, line: 284, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !538, file: !394, line: 291, baseType: !5, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !538, file: !394, line: 295, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !538, file: !394, line: 298, baseType: !5, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !538, file: !394, line: 301, baseType: !5, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !538, file: !394, line: 307, baseType: !5, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !538, file: !394, line: 312, baseType: !5, size: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !538, file: !394, line: 316, baseType: !551, size: 32, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !552, line: 58, baseType: !553)
!552 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !554, line: 44, baseType: !5)
!554 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!555 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !538, file: !394, line: 319, baseType: !5, size: 32, offset: 96)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !538, file: !394, line: 323, baseType: !496, size: 64, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !538, file: !394, line: 327, baseType: !558, size: 64, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !513, line: 56, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !149, line: 3371, size: 1792, elements: !561)
!561 = !{!562, !595, !601, !614, !633, !644, !649, !656, !662, !675, !683, !721, !929, !957, !974, !975, !980, !989, !995, !1000, !1004, !1008, !1288, !1335, !1341, !1347, !1354, !1367, !1381, !1398, !1410, !1432, !1447, !1619}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !560, file: !149, line: 3372, baseType: !563, size: 64)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !149, line: 360, size: 64, elements: !564)
!564 = !{!565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !563, file: !149, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !563, file: !149, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !563, file: !149, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !563, file: !149, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !563, file: !149, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !563, file: !149, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !563, file: !149, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !563, file: !149, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !563, file: !149, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !563, file: !149, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !563, file: !149, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !563, file: !149, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !563, file: !149, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !563, file: !149, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !563, file: !149, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !563, file: !149, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !563, file: !149, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !563, file: !149, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !563, file: !149, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !563, file: !149, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !563, file: !149, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !563, file: !149, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !563, file: !149, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !563, file: !149, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !563, file: !149, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !563, file: !149, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !563, file: !149, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !563, file: !149, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !563, file: !149, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !563, file: !149, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !560, file: !149, line: 3373, baseType: !596, size: 192)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !149, line: 402, size: 192, elements: !597)
!597 = !{!598, !599, !600}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !596, file: !149, line: 403, baseType: !563, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !596, file: !149, line: 404, baseType: !558, size: 64, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !596, file: !149, line: 405, baseType: !558, size: 64, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !560, file: !149, line: 3374, baseType: !602, size: 320)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !149, line: 1384, size: 320, elements: !603)
!603 = !{!604, !605}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !602, file: !149, line: 1385, baseType: !596, size: 192)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !602, file: !149, line: 1386, baseType: !606, size: 128, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !607, line: 58, baseType: !608)
!607 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !607, line: 54, size: 128, elements: !609)
!609 = !{!610, !612}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !608, file: !607, line: 56, baseType: !611, size: 64)
!611 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !608, file: !607, line: 57, baseType: !613, size: 64, offset: 64)
!613 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !560, file: !149, line: 3375, baseType: !615, size: 256)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !149, line: 1397, size: 256, elements: !616)
!616 = !{!617, !618}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !615, file: !149, line: 1398, baseType: !596, size: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !615, file: !149, line: 1399, baseType: !619, size: 64, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !621, line: 52, size: 256, elements: !622)
!621 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!622 = !{!623, !624, !625, !626, !627, !628, !629}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !620, file: !621, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !620, file: !621, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !620, file: !621, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !620, file: !621, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !620, file: !621, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !620, file: !621, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !620, file: !621, line: 62, baseType: !630, size: 192, offset: 64)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 192, elements: !631)
!631 = !{!632}
!632 = !DISubrange(count: 3)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !560, file: !149, line: 3376, baseType: !634, size: 256)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !149, line: 1408, size: 256, elements: !635)
!635 = !{!636, !637}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !634, file: !149, line: 1409, baseType: !596, size: 192)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !634, file: !149, line: 1410, baseType: !638, size: 64, offset: 192)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !640, line: 27, size: 192, elements: !641)
!640 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!641 = !{!642, !643}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !639, file: !640, line: 29, baseType: !606, size: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !639, file: !640, line: 30, baseType: !3, size: 32, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !560, file: !149, line: 3377, baseType: !645, size: 256)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !149, line: 1437, size: 256, elements: !646)
!646 = !{!647, !648}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !645, file: !149, line: 1438, baseType: !596, size: 192)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !645, file: !149, line: 1439, baseType: !558, size: 64, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !560, file: !149, line: 3378, baseType: !650, size: 256)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !149, line: 1418, size: 256, elements: !651)
!651 = !{!652, !653, !654}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !650, file: !149, line: 1419, baseType: !596, size: 192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !650, file: !149, line: 1420, baseType: !467, size: 32, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !650, file: !149, line: 1421, baseType: !655, size: 8, offset: 224)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 8, elements: !487)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !560, file: !149, line: 3379, baseType: !657, size: 320)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !149, line: 1428, size: 320, elements: !658)
!658 = !{!659, !660, !661}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !657, file: !149, line: 1429, baseType: !596, size: 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !657, file: !149, line: 1430, baseType: !558, size: 64, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !657, file: !149, line: 1431, baseType: !558, size: 64, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !560, file: !149, line: 3380, baseType: !663, size: 320)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !149, line: 1460, size: 320, elements: !664)
!664 = !{!665, !666}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !663, file: !149, line: 1461, baseType: !596, size: 192)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !663, file: !149, line: 1462, baseType: !667, size: 128, offset: 192)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !668, line: 31, size: 128, elements: !669)
!668 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!669 = !{!670, !673, !674}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !667, file: !668, line: 32, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !667, file: !668, line: 33, baseType: !5, size: 32, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !667, file: !668, line: 34, baseType: !5, size: 32, offset: 96)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !560, file: !149, line: 3381, baseType: !676, size: 384)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !149, line: 2507, size: 384, elements: !677)
!677 = !{!678, !679, !680, !681, !682}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !676, file: !149, line: 2508, baseType: !596, size: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !676, file: !149, line: 2509, baseType: !551, size: 32, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !676, file: !149, line: 2510, baseType: !5, size: 32, offset: 224)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !676, file: !149, line: 2511, baseType: !558, size: 64, offset: 256)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !676, file: !149, line: 2512, baseType: !558, size: 64, offset: 320)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !560, file: !149, line: 3382, baseType: !684, size: 896)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !149, line: 2652, size: 896, elements: !685)
!685 = !{!686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !684, file: !149, line: 2653, baseType: !676, size: 384)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !684, file: !149, line: 2654, baseType: !558, size: 64, offset: 384)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !684, file: !149, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !684, file: !149, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !684, file: !149, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !684, file: !149, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !684, file: !149, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !684, file: !149, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !684, file: !149, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !684, file: !149, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !684, file: !149, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !684, file: !149, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !684, file: !149, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !684, file: !149, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !684, file: !149, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !684, file: !149, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !684, file: !149, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !684, file: !149, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !684, file: !149, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !684, file: !149, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !684, file: !149, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !684, file: !149, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !684, file: !149, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !684, file: !149, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !684, file: !149, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !684, file: !149, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !684, file: !149, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !684, file: !149, line: 2703, baseType: !5, size: 32, offset: 512)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !684, file: !149, line: 2705, baseType: !558, size: 64, offset: 576)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !684, file: !149, line: 2706, baseType: !558, size: 64, offset: 640)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !684, file: !149, line: 2707, baseType: !558, size: 64, offset: 704)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !684, file: !149, line: 2708, baseType: !558, size: 64, offset: 768)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !684, file: !149, line: 2711, baseType: !719, size: 64, offset: 832)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !149, line: 2711, flags: DIFlagFwdDecl)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !560, file: !149, line: 3383, baseType: !722, size: 960)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !149, line: 2756, size: 960, elements: !723)
!723 = !{!724, !725}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !722, file: !149, line: 2757, baseType: !684, size: 896)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !722, file: !149, line: 2758, baseType: !726, size: 64, offset: 896)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !513, line: 50, baseType: !727)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !729, line: 240, size: 384, elements: !730)
!729 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!730 = !{!731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !728, file: !729, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !728, file: !729, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !728, file: !729, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !728, file: !729, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !728, file: !729, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !728, file: !729, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !728, file: !729, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !728, file: !729, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !728, file: !729, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !728, file: !729, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !728, file: !729, line: 321, baseType: !742, size: 320, offset: 64)
!742 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !729, line: 315, size: 320, elements: !743)
!743 = !{!744, !862, !864, !927, !928}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !742, file: !729, line: 316, baseType: !745, size: 64)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !746, size: 64, elements: !487)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !729, line: 183, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !729, line: 166, size: 64, elements: !748)
!748 = !{!749, !750, !751, !752, !753, !761, !762, !774, !777, !837, !838, !839, !852, !859}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !747, file: !729, line: 168, baseType: !467, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !747, file: !729, line: 169, baseType: !5, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !747, file: !729, line: 170, baseType: !472, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !747, file: !729, line: 171, baseType: !726, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !747, file: !729, line: 172, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !513, line: 53, baseType: !755)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !729, line: 359, size: 128, elements: !757)
!757 = !{!758, !759}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !756, file: !729, line: 360, baseType: !467, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !756, file: !729, line: 361, baseType: !760, size: 64, offset: 64)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !726, size: 64, elements: !487)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !747, file: !729, line: 173, baseType: !3, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !747, file: !729, line: 174, baseType: !763, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !729, line: 133, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !729, line: 115, size: 32, elements: !765)
!765 = !{!766, !767, !768, !769, !770, !771, !772, !773}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !764, file: !729, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !764, file: !729, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !764, file: !729, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !764, file: !729, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !764, file: !729, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !764, file: !729, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !764, file: !729, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !764, file: !729, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !747, file: !729, line: 175, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !729, line: 175, flags: DIFlagFwdDecl)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !747, file: !729, line: 176, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !780, line: 75, size: 256, elements: !781)
!780 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!781 = !{!782, !796, !797, !798}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !779, file: !780, line: 76, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !780, line: 68, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !780, line: 63, size: 320, elements: !786)
!786 = !{!787, !789, !790, !791}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !785, file: !780, line: 64, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !785, file: !780, line: 65, baseType: !788, size: 64, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !785, file: !780, line: 66, baseType: !5, size: 32, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !785, file: !780, line: 67, baseType: !792, size: 128, offset: 192)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !793, size: 128, elements: !794)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !780, line: 29, baseType: !611)
!794 = !{!795}
!795 = !DISubrange(count: 2)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !779, file: !780, line: 77, baseType: !783, size: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !779, file: !780, line: 78, baseType: !5, size: 32, offset: 128)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !779, file: !780, line: 79, baseType: !799, size: 64, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !780, line: 49, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !780, line: 45, size: 832, elements: !802)
!802 = !{!803, !804, !805}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !801, file: !780, line: 46, baseType: !788, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !801, file: !780, line: 47, baseType: !778, size: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !801, file: !780, line: 48, baseType: !806, size: 704, offset: 128)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !807, line: 164, size: 704, elements: !808)
!807 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!808 = !{!809, !810, !820, !821, !822, !823, !824, !825, !829, !833, !834, !835, !836}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !806, file: !807, line: 166, baseType: !613, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !806, file: !807, line: 167, baseType: !811, size: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !807, line: 157, size: 192, elements: !813)
!813 = !{!814, !815, !816}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !812, file: !807, line: 159, baseType: !469, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !812, file: !807, line: 160, baseType: !811, size: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !812, file: !807, line: 161, baseType: !817, size: 32, offset: 128)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 32, elements: !818)
!818 = !{!819}
!819 = !DISubrange(count: 4)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !806, file: !807, line: 168, baseType: !469, size: 64, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !806, file: !807, line: 169, baseType: !469, size: 64, offset: 192)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !806, file: !807, line: 170, baseType: !469, size: 64, offset: 256)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !806, file: !807, line: 171, baseType: !613, size: 64, offset: 320)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !806, file: !807, line: 172, baseType: !467, size: 32, offset: 384)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !806, file: !807, line: 176, baseType: !826, size: 64, offset: 448)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{!811, !471, !613}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !806, file: !807, line: 177, baseType: !830, size: 64, offset: 512)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{null, !471, !811}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !806, file: !807, line: 178, baseType: !471, size: 64, offset: 576)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !806, file: !807, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !806, file: !807, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !806, file: !807, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !747, file: !729, line: 177, baseType: !558, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !747, file: !729, line: 178, baseType: !496, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !747, file: !729, line: 179, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !729, line: 150, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !729, line: 142, size: 320, elements: !843)
!843 = !{!844, !845, !846, !847, !850, !851}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !842, file: !729, line: 144, baseType: !558, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !842, file: !729, line: 145, baseType: !726, size: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !842, file: !729, line: 146, baseType: !726, size: 64, offset: 128)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !842, file: !729, line: 147, baseType: !848, size: 32, offset: 192)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !849, line: 31, baseType: !467)
!849 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!850 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !842, file: !729, line: 148, baseType: !5, size: 32, offset: 224)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !842, file: !729, line: 149, baseType: !466, size: 8, offset: 256)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !747, file: !729, line: 180, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !729, line: 162, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !729, line: 159, size: 128, elements: !856)
!856 = !{!857, !858}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !855, file: !729, line: 160, baseType: !558, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !855, file: !729, line: 161, baseType: !613, size: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !747, file: !729, line: 181, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !729, line: 181, flags: DIFlagFwdDecl)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !742, file: !729, line: 317, baseType: !863, size: 64)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 64, elements: !487)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !742, file: !729, line: 318, baseType: !865, size: 320)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !729, line: 188, size: 320, elements: !866)
!866 = !{!867, !869, !926}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !865, file: !729, line: 190, baseType: !868, size: 192)
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !746, size: 192, elements: !631)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !865, file: !729, line: 193, baseType: !870, size: 64, offset: 192)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !729, line: 206, size: 320, elements: !872)
!872 = !{!873, !911, !912, !913, !925}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !871, file: !729, line: 208, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !513, line: 62, baseType: !876)
!876 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !877, line: 538, size: 256, elements: !878)
!877 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!878 = !{!879, !883, !889, !902}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !876, file: !877, line: 539, baseType: !880, size: 32)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !877, line: 482, size: 32, elements: !881)
!881 = !{!882}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !880, file: !877, line: 484, baseType: !5, size: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !876, file: !877, line: 540, baseType: !884, size: 192)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !877, line: 488, size: 192, elements: !885)
!885 = !{!886, !887, !888}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !884, file: !877, line: 489, baseType: !880, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !884, file: !877, line: 492, baseType: !472, size: 64, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !884, file: !877, line: 496, baseType: !558, size: 64, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !876, file: !877, line: 541, baseType: !890, size: 256)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !877, line: 504, size: 256, elements: !891)
!891 = !{!892, !893, !900, !901}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !890, file: !877, line: 505, baseType: !880, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !890, file: !877, line: 509, baseType: !894, size: 64, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !877, line: 501, baseType: !895)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{null, !898}
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !890, file: !877, line: 510, baseType: !898, size: 64, offset: 128)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !890, file: !877, line: 513, baseType: !874, size: 64, offset: 192)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !876, file: !877, line: 542, baseType: !903, size: 128)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !877, line: 530, size: 128, elements: !904)
!904 = !{!905, !906}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !903, file: !877, line: 531, baseType: !880, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !903, file: !877, line: 534, baseType: !907, size: 64, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !877, line: 525, baseType: !908)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!466, !558, !472, !611, !611}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !871, file: !729, line: 211, baseType: !5, size: 32, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !871, file: !729, line: 214, baseType: !613, size: 64, offset: 128)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !871, file: !729, line: 224, baseType: !914, size: 64, offset: 192)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !729, line: 202, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !729, line: 202, size: 128, elements: !917)
!917 = !{!918}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !916, file: !729, line: 202, baseType: !919, size: 128)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !729, line: 200, baseType: !920)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !729, line: 200, size: 128, elements: !921)
!921 = !{!922, !923, !924}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !920, file: !729, line: 200, baseType: !5, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !920, file: !729, line: 200, baseType: !5, size: 32, offset: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !920, file: !729, line: 200, baseType: !760, size: 64, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !871, file: !729, line: 234, baseType: !914, size: 64, offset: 256)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !865, file: !729, line: 197, baseType: !613, size: 64, offset: 256)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !742, file: !729, line: 319, baseType: !620, size: 256)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !742, file: !729, line: 320, baseType: !639, size: 192)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !560, file: !149, line: 3384, baseType: !930, size: 1472)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !149, line: 3114, size: 1472, elements: !931)
!931 = !{!932, !953, !954, !955, !956}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !930, file: !149, line: 3115, baseType: !933, size: 1216)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !149, line: 2984, size: 1216, elements: !934)
!934 = !{!935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !933, file: !149, line: 2985, baseType: !722, size: 960)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !933, file: !149, line: 2986, baseType: !558, size: 64, offset: 960)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !933, file: !149, line: 2987, baseType: !558, size: 64, offset: 1024)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !933, file: !149, line: 2988, baseType: !558, size: 64, offset: 1088)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !933, file: !149, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !933, file: !149, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !933, file: !149, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !933, file: !149, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !933, file: !149, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !933, file: !149, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !933, file: !149, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !933, file: !149, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !933, file: !149, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !933, file: !149, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !933, file: !149, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !933, file: !149, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !933, file: !149, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !933, file: !149, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !930, file: !149, line: 3117, baseType: !558, size: 64, offset: 1216)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !930, file: !149, line: 3119, baseType: !558, size: 64, offset: 1280)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !930, file: !149, line: 3121, baseType: !558, size: 64, offset: 1344)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !930, file: !149, line: 3123, baseType: !558, size: 64, offset: 1408)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !560, file: !149, line: 3385, baseType: !958, size: 1088)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !149, line: 2874, size: 1088, elements: !959)
!959 = !{!960, !961, !962}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !958, file: !149, line: 2875, baseType: !722, size: 960)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !958, file: !149, line: 2876, baseType: !726, size: 64, offset: 960)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !958, file: !149, line: 2877, baseType: !963, size: 64, offset: 1024)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !965, line: 172, size: 128, elements: !966)
!965 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!966 = !{!967, !968, !969, !970, !971, !972, !973}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !964, file: !965, line: 174, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !964, file: !965, line: 178, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !964, file: !965, line: 183, baseType: !5, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !964, file: !965, line: 187, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !964, file: !965, line: 192, baseType: !5, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !964, file: !965, line: 195, baseType: !5, size: 32, offset: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !964, file: !965, line: 199, baseType: !558, size: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !560, file: !149, line: 3386, baseType: !933, size: 1216)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !560, file: !149, line: 3387, baseType: !976, size: 1280)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !149, line: 3093, size: 1280, elements: !977)
!977 = !{!978, !979}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !976, file: !149, line: 3094, baseType: !933, size: 1216)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !976, file: !149, line: 3095, baseType: !963, size: 64, offset: 1216)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !560, file: !149, line: 3388, baseType: !981, size: 1216)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !149, line: 2824, size: 1216, elements: !982)
!982 = !{!983, !984, !985, !986, !987, !988}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !981, file: !149, line: 2825, baseType: !684, size: 896)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !981, file: !149, line: 2827, baseType: !558, size: 64, offset: 896)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !981, file: !149, line: 2828, baseType: !558, size: 64, offset: 960)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !981, file: !149, line: 2829, baseType: !558, size: 64, offset: 1024)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !981, file: !149, line: 2830, baseType: !558, size: 64, offset: 1088)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !981, file: !149, line: 2831, baseType: !558, size: 64, offset: 1152)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !560, file: !149, line: 3389, baseType: !990, size: 1024)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !149, line: 2850, size: 1024, elements: !991)
!991 = !{!992, !993, !994}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !990, file: !149, line: 2851, baseType: !722, size: 960)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !990, file: !149, line: 2852, baseType: !467, size: 32, offset: 960)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !990, file: !149, line: 2853, baseType: !467, size: 32, offset: 992)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !560, file: !149, line: 3390, baseType: !996, size: 1024)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !149, line: 2857, size: 1024, elements: !997)
!997 = !{!998, !999}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !996, file: !149, line: 2858, baseType: !722, size: 960)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !996, file: !149, line: 2859, baseType: !963, size: 64, offset: 960)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !560, file: !149, line: 3391, baseType: !1001, size: 960)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !149, line: 2862, size: 960, elements: !1002)
!1002 = !{!1003}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1001, file: !149, line: 2863, baseType: !722, size: 960)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !560, file: !149, line: 3392, baseType: !1005, size: 1472)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !149, line: 3304, size: 1472, elements: !1006)
!1006 = !{!1007}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1005, file: !149, line: 3305, baseType: !930, size: 1472)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !560, file: !149, line: 3393, baseType: !1009, size: 1792)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !149, line: 3248, size: 1792, elements: !1010)
!1010 = !{!1011, !1012, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1009, file: !149, line: 3249, baseType: !930, size: 1472)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1009, file: !149, line: 3251, baseType: !1013, size: 64, offset: 1472)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1015, line: 463, size: 1152, elements: !1016)
!1015 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1016 = !{!1017, !1020, !1051, !1052, !1191, !1211, !1212, !1213, !1214, !1215, !1216, !1240, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1014, file: !1015, line: 464, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1015, line: 464, flags: DIFlagFwdDecl)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1014, file: !1015, line: 467, baseType: !1021, size: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !133, line: 374, size: 640, elements: !1023)
!1023 = !{!1024, !1026, !1027, !1040, !1041, !1042, !1043, !1044, !1045, !1047, !1049, !1050}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1022, file: !133, line: 377, baseType: !1025, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !513, line: 111, baseType: !496)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1022, file: !133, line: 378, baseType: !1025, size: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1022, file: !133, line: 381, baseType: !1028, size: 64, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !133, line: 282, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !133, line: 282, size: 128, elements: !1031)
!1031 = !{!1032}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1030, file: !133, line: 282, baseType: !1033, size: 128)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !133, line: 281, baseType: !1034)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !133, line: 281, size: 128, elements: !1035)
!1035 = !{!1036, !1037, !1038}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1034, file: !133, line: 281, baseType: !5, size: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1034, file: !133, line: 281, baseType: !5, size: 32, offset: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1034, file: !133, line: 281, baseType: !1039, size: 64, offset: 64)
!1039 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1025, size: 64, elements: !487)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1022, file: !133, line: 384, baseType: !467, size: 32, offset: 192)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1022, file: !133, line: 387, baseType: !467, size: 32, offset: 224)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1022, file: !133, line: 390, baseType: !467, size: 32, offset: 256)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1022, file: !133, line: 394, baseType: !1028, size: 64, offset: 320)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1022, file: !133, line: 396, baseType: !132, size: 32, offset: 384)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1022, file: !133, line: 399, baseType: !1046, size: 64, offset: 416)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 64, elements: !794)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1022, file: !133, line: 402, baseType: !1048, size: 64, offset: 480)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !794)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1022, file: !133, line: 406, baseType: !467, size: 32, offset: 544)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1022, file: !133, line: 409, baseType: !467, size: 32, offset: 576)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1014, file: !1015, line: 470, baseType: !524, size: 64, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1014, file: !1015, line: 473, baseType: !1053, size: 64, offset: 192)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !965, line: 39, size: 1152, elements: !1055)
!1055 = !{!1056, !1106, !1119, !1132, !1133, !1145, !1146, !1150, !1151, !1152, !1153, !1154}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1054, file: !965, line: 41, baseType: !1057, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1058, line: 144, baseType: !1059)
!1058 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1058, line: 100, size: 896, elements: !1061)
!1061 = !{!1062, !1068, !1073, !1078, !1080, !1083, !1084, !1085, !1086, !1087, !1092, !1094, !1095, !1100, !1105}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1060, file: !1058, line: 102, baseType: !1063, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1058, line: 52, baseType: !1064)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!1067, !898}
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1058, line: 47, baseType: !5)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1060, file: !1058, line: 105, baseType: !1069, size: 64, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1058, line: 59, baseType: !1070)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!467, !898, !898}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1060, file: !1058, line: 108, baseType: !1074, size: 64, offset: 128)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1058, line: 63, baseType: !1075)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{null, !471}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1060, file: !1058, line: 111, baseType: !1079, size: 64, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1060, file: !1058, line: 114, baseType: !1081, size: 64, offset: 256)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1082, line: 46, baseType: !611)
!1082 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1060, file: !1058, line: 117, baseType: !1081, size: 64, offset: 320)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1060, file: !1058, line: 120, baseType: !1081, size: 64, offset: 384)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1060, file: !1058, line: 124, baseType: !5, size: 32, offset: 448)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1060, file: !1058, line: 128, baseType: !5, size: 32, offset: 480)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1060, file: !1058, line: 131, baseType: !1088, size: 64, offset: 512)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1058, line: 75, baseType: !1089)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!471, !1081, !1081}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1060, file: !1058, line: 132, baseType: !1093, size: 64, offset: 576)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1058, line: 78, baseType: !1075)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1060, file: !1058, line: 135, baseType: !471, size: 64, offset: 640)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1060, file: !1058, line: 136, baseType: !1096, size: 64, offset: 704)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1058, line: 82, baseType: !1097)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!471, !471, !1081, !1081}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1060, file: !1058, line: 137, baseType: !1101, size: 64, offset: 768)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1058, line: 83, baseType: !1102)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{null, !471, !471}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1060, file: !1058, line: 141, baseType: !5, size: 32, offset: 832)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1054, file: !965, line: 48, baseType: !1107, size: 64, offset: 64)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !394, line: 35, baseType: !1109)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !394, line: 35, size: 128, elements: !1110)
!1110 = !{!1111}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1109, file: !394, line: 35, baseType: !1112, size: 128)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !394, line: 33, baseType: !1113)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !394, line: 33, size: 128, elements: !1114)
!1114 = !{!1115, !1116, !1117}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1113, file: !394, line: 33, baseType: !5, size: 32)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1113, file: !394, line: 33, baseType: !5, size: 32, offset: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1113, file: !394, line: 33, baseType: !1118, size: 64, offset: 64)
!1118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, size: 64, elements: !487)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1054, file: !965, line: 51, baseType: !1120, size: 64, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !149, line: 183, baseType: !1122)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !149, line: 183, size: 128, elements: !1123)
!1123 = !{!1124}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1122, file: !149, line: 183, baseType: !1125, size: 128)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !149, line: 182, baseType: !1126)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !149, line: 182, size: 128, elements: !1127)
!1127 = !{!1128, !1129, !1130}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1126, file: !149, line: 182, baseType: !5, size: 32)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1126, file: !149, line: 182, baseType: !5, size: 32, offset: 32)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1126, file: !149, line: 182, baseType: !1131, size: 64, offset: 64)
!1131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 64, elements: !487)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1054, file: !965, line: 54, baseType: !558, size: 64, offset: 192)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1054, file: !965, line: 57, baseType: !1134, size: 128, offset: 256)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1135, line: 31, size: 128, elements: !1136)
!1135 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1136 = !{!1137, !1138, !1139, !1140, !1141, !1142, !1143}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1134, file: !1135, line: 35, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1134, file: !1135, line: 39, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1134, file: !1135, line: 42, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1134, file: !1135, line: 46, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1134, file: !1135, line: 50, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1134, file: !1135, line: 53, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1134, file: !1135, line: 56, baseType: !1144, size: 64, offset: 64)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !513, line: 47, baseType: !778)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1054, file: !965, line: 60, baseType: !1134, size: 128, offset: 384)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1054, file: !965, line: 64, baseType: !1147, size: 64, offset: 512)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1149, line: 33, flags: DIFlagFwdDecl)
!1149 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1054, file: !965, line: 67, baseType: !558, size: 64, offset: 576)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1054, file: !965, line: 73, baseType: !1057, size: 64, offset: 640)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1054, file: !965, line: 77, baseType: !1144, size: 64, offset: 704)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1054, file: !965, line: 80, baseType: !5, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1054, file: !965, line: 82, baseType: !1155, size: 320, offset: 832)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !1156, line: 62, size: 320, elements: !1157)
!1156 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1157 = !{!1158, !1164, !1165, !1166, !1167, !1174}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1155, file: !1156, line: 63, baseType: !1159, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !1156, line: 56, size: 128, elements: !1161)
!1161 = !{!1162, !1163}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1160, file: !1156, line: 57, baseType: !1159, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1160, file: !1156, line: 58, baseType: !655, size: 8, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1155, file: !1156, line: 64, baseType: !5, size: 32, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1155, file: !1156, line: 66, baseType: !5, size: 32, offset: 96)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1155, file: !1156, line: 68, baseType: !466, size: 8, offset: 128)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1155, file: !1156, line: 70, baseType: !1168, size: 64, offset: 192)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1156, line: 37, size: 128, elements: !1170)
!1170 = !{!1171, !1172}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1169, file: !1156, line: 39, baseType: !1168, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1169, file: !1156, line: 40, baseType: !1173, size: 64, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1155, file: !1156, line: 71, baseType: !1175, size: 64, offset: 256)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1156, line: 45, size: 320, elements: !1177)
!1177 = !{!1178, !1179}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1176, file: !1156, line: 47, baseType: !1175, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1176, file: !1156, line: 48, baseType: !1180, size: 256, offset: 64)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !149, line: 1883, size: 256, elements: !1181)
!1181 = !{!1182, !1184, !1185, !1190}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1180, file: !149, line: 1884, baseType: !1183, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1180, file: !149, line: 1885, baseType: !1183, size: 64, offset: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1180, file: !149, line: 1891, baseType: !1186, size: 64, offset: 128)
!1186 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1180, file: !149, line: 1891, size: 64, elements: !1187)
!1187 = !{!1188, !1189}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1186, file: !149, line: 1891, baseType: !533, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1186, file: !149, line: 1891, baseType: !558, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1180, file: !149, line: 1892, baseType: !1173, size: 64, offset: 192)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1014, file: !1015, line: 476, baseType: !1192, size: 64, offset: 256)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !376, line: 187, size: 256, elements: !1194)
!1194 = !{!1195, !1196, !1209, !1210}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1193, file: !376, line: 189, baseType: !467, size: 32)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1193, file: !376, line: 192, baseType: !1197, size: 64, offset: 64)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !376, line: 87, baseType: !1199)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !376, line: 87, size: 128, elements: !1200)
!1200 = !{!1201}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1199, file: !376, line: 87, baseType: !1202, size: 128)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !376, line: 85, baseType: !1203)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !376, line: 85, size: 128, elements: !1204)
!1204 = !{!1205, !1206, !1207}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1203, file: !376, line: 85, baseType: !5, size: 32)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1203, file: !376, line: 85, baseType: !5, size: 32, offset: 32)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1203, file: !376, line: 85, baseType: !1208, size: 64, offset: 64)
!1208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 64, elements: !487)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1193, file: !376, line: 197, baseType: !1057, size: 64, offset: 128)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1193, file: !376, line: 200, baseType: !490, size: 64, offset: 192)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1014, file: !1015, line: 479, baseType: !1057, size: 64, offset: 320)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1014, file: !1015, line: 484, baseType: !558, size: 64, offset: 384)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1014, file: !1015, line: 488, baseType: !558, size: 64, offset: 448)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1014, file: !1015, line: 493, baseType: !558, size: 64, offset: 512)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1014, file: !1015, line: 496, baseType: !558, size: 64, offset: 576)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1014, file: !1015, line: 501, baseType: !1217, size: 64, offset: 640)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !144, line: 2355, size: 576, elements: !1219)
!1219 = !{!1220, !1223, !1224, !1225, !1226, !1228, !1229, !1234, !1235, !1236, !1237, !1238, !1239}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1218, file: !144, line: 2356, baseType: !1221, size: 64)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !144, line: 2356, flags: DIFlagFwdDecl)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1218, file: !144, line: 2357, baseType: !472, size: 64, offset: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1218, file: !144, line: 2358, baseType: !467, size: 32, offset: 128)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1218, file: !144, line: 2359, baseType: !467, size: 32, offset: 160)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1218, file: !144, line: 2360, baseType: !1227, size: 128, offset: 192)
!1227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 128, elements: !818)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1218, file: !144, line: 2364, baseType: !467, size: 32, offset: 320)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1218, file: !144, line: 2367, baseType: !1230, size: 128, offset: 384)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !144, line: 2349, size: 128, elements: !1231)
!1231 = !{!1232, !1233}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1230, file: !144, line: 2351, baseType: !726, size: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1230, file: !144, line: 2352, baseType: !613, size: 64, offset: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1218, file: !144, line: 2371, baseType: !143, size: 32, offset: 512)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1218, file: !144, line: 2374, baseType: !5, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1218, file: !144, line: 2377, baseType: !5, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1218, file: !144, line: 2381, baseType: !5, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1218, file: !144, line: 2392, baseType: !5, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1218, file: !144, line: 2396, baseType: !5, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1014, file: !1015, line: 504, baseType: !1241, size: 64, offset: 704)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1015, line: 504, flags: DIFlagFwdDecl)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1014, file: !1015, line: 507, baseType: !1057, size: 64, offset: 768)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1014, file: !1015, line: 510, baseType: !467, size: 32, offset: 832)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1014, file: !1015, line: 513, baseType: !467, size: 32, offset: 864)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1014, file: !1015, line: 516, baseType: !551, size: 32, offset: 896)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1014, file: !1015, line: 519, baseType: !551, size: 32, offset: 928)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1014, file: !1015, line: 522, baseType: !5, size: 32, offset: 960)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1014, file: !1015, line: 523, baseType: !5, size: 32, offset: 992)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1014, file: !1015, line: 528, baseType: !472, size: 64, offset: 1024)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1014, file: !1015, line: 535, baseType: !5, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1014, file: !1015, line: 539, baseType: !5, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1014, file: !1015, line: 543, baseType: !5, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1014, file: !1015, line: 546, baseType: !5, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
