; ModuleID = 'tree-ssa-dce.bc'
source_filename = "tree-ssa-dce.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }

!590 = !DIEnumerator(name: "GIMPLE_ASM", value: 7, isUnsigned: true)
!591 = !DIEnumerator(name: "GIMPLE_CALL", value: 8, isUnsigned: true)
!592 = !DIEnumerator(name: "GIMPLE_RETURN", value: 9, isUnsigned: true)
!593 = !DIEnumerator(name: "GIMPLE_BIND", value: 10, isUnsigned: true)
!594 = !DIEnumerator(name: "GIMPLE_CATCH", value: 11, isUnsigned: true)
!595 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!596 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!597 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!598 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!599 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!600 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!601 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!602 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!603 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!604 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!605 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!606 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!607 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!608 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!609 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!610 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!611 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!612 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!613 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!614 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!615 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!616 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!617 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!618 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!619 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "plf_mask", file: !581, line: 130, baseType: !7, size: 32, elements: !620)
!620 = !{!621, !622}
!621 = !DIEnumerator(name: "GF_PLF_1", value: 1, isUnsigned: true)
!622 = !DIEnumerator(name: "GF_PLF_2", value: 2, isUnsigned: true)
!623 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !581, line: 727, baseType: !7, size: 32, elements: !624)
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648}
!625 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!626 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!627 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!628 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!629 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!630 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!631 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!632 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!633 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!634 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!635 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!636 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!637 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!638 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!639 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!640 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!641 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!642 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!643 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!644 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!645 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!646 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!647 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!648 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!649 = !{!650, !651, !652, !653, !656, !657, !659, !853, !196, !1236, !2014, !2015, !7, !807, !673, !2020, !1264, !654, !2022, !1289, !1115, !2035}
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!652 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !655)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "use_operand_p", file: !574, line: 30, baseType: !660)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssa_use_operand_t", file: !164, line: 1893, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !164, line: 1883, size: 256, elements: !663)
!663 = !{!664, !666, !667, !2013}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !662, file: !164, line: 1884, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !662, file: !164, line: 1885, baseType: !665, size: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !662, file: !164, line: 1891, baseType: !668, size: 64, offset: 128)
!668 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !662, file: !164, line: 1891, size: 64, elements: !669)
!669 = !{!670, !2012}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !668, file: !164, line: 1891, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !672, line: 58, baseType: !673)
!672 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !581, line: 737, size: 768, elements: !675)
!675 = !{!676, !1859, !1869, !1875, !1880, !1885, !1892, !1898, !1904, !1909, !1923, !1928, !1934, !1939, !1949, !1954, !1970, !1977, !1984, !1990, !1995, !2001, !2007}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !674, file: !581, line: 738, baseType: !677, size: 256)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !581, line: 271, size: 256, elements: !678)
!678 = !{!679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !694, !695, !1858}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !677, file: !581, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !677, file: !581, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !677, file: !581, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !677, file: !581, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !677, file: !581, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !677, file: !581, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !677, file: !581, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !677, file: !581, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !677, file: !581, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !677, file: !581, line: 312, baseType: !7, size: 32, offset: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !677, file: !581, line: 316, baseType: !690, size: 32, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !691, line: 58, baseType: !692)
!691 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !693, line: 44, baseType: !7)
!693 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!694 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !677, file: !581, line: 319, baseType: !7, size: 32, offset: 96)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !677, file: !581, line: 323, baseType: !696, size: 64, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !698)
!698 = !{!699, !1825, !1826, !1827, !1828, !1832, !1833, !1834, !1852, !1853, !1854, !1855, !1856, !1857}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !697, file: !135, line: 219, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !703)
!703 = !{!704}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !702, file: !135, line: 151, baseType: !705, size: 128)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !707)
!707 = !{!708, !709, !710}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !706, file: !135, line: 150, baseType: !7, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !706, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !706, file: !135, line: 150, baseType: !711, size: 64, offset: 64)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !712, size: 64, elements: !772)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !672, line: 108, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !715)
!715 = !{!716, !717, !718, !1817, !1818, !1819, !1820, !1821, !1822, !1823}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !714, file: !135, line: 124, baseType: !696, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !714, file: !135, line: 125, baseType: !696, size: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !714, file: !135, line: 131, baseType: !719, size: 64, offset: 128)
!719 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !720)
!720 = !{!721, !736}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !719, file: !135, line: 129, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !672, line: 66, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !581, line: 143, size: 192, elements: !725)
!725 = !{!726, !734, !735}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !724, file: !581, line: 145, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !672, line: 69, baseType: !728)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !581, line: 136, size: 192, elements: !730)
!730 = !{!731, !732, !733}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !729, file: !581, line: 137, baseType: !671, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !729, file: !581, line: 138, baseType: !728, size: 64, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !729, file: !581, line: 139, baseType: !728, size: 64, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !724, file: !581, line: 146, baseType: !727, size: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !724, file: !581, line: 152, baseType: !722, size: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !719, file: !135, line: 130, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !672, line: 50, baseType: !738)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !740, line: 240, size: 384, elements: !741)
!740 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!741 = !{!742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !739, file: !740, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !739, file: !740, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !739, file: !740, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !739, file: !740, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !739, file: !740, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !739, file: !740, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !739, file: !740, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !739, file: !740, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !739, file: !740, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !739, file: !740, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !739, file: !740, line: 321, baseType: !753, size: 320, offset: 64)
!753 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !740, line: 315, size: 320, elements: !754)
!754 = !{!755, !1784, !1786, !1815, !1816}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !753, file: !740, line: 316, baseType: !756, size: 64)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !757, size: 64, elements: !772)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !740, line: 183, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !740, line: 166, size: 64, elements: !759)
!759 = !{!760, !761, !762, !763, !764, !774, !775, !787, !790, !852, !1762, !1763, !1774, !1781}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !758, file: !740, line: 168, baseType: !652, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !758, file: !740, line: 169, baseType: !7, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !758, file: !740, line: 170, baseType: !657, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !758, file: !740, line: 171, baseType: !737, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !758, file: !740, line: 172, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !672, line: 53, baseType: !766)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !740, line: 359, size: 128, elements: !768)
!768 = !{!769, !770}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !767, file: !740, line: 360, baseType: !652, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !767, file: !740, line: 361, baseType: !771, size: 64, offset: 64)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !737, size: 64, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 1)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !758, file: !740, line: 173, baseType: !5, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !758, file: !740, line: 174, baseType: !776, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !740, line: 133, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !740, line: 115, size: 32, elements: !778)
!778 = !{!779, !780, !781, !782, !783, !784, !785, !786}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !777, file: !740, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !777, file: !740, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !777, file: !740, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !777, file: !740, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !777, file: !740, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !777, file: !740, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !777, file: !740, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !777, file: !740, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !758, file: !740, line: 175, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !740, line: 175, flags: DIFlagFwdDecl)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !758, file: !740, line: 176, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !793, line: 75, size: 256, elements: !794)
!793 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!794 = !{!795, !810, !811, !812}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !792, file: !793, line: 76, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !793, line: 68, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !793, line: 63, size: 320, elements: !799)
!799 = !{!800, !802, !803, !804}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !798, file: !793, line: 64, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !798, file: !793, line: 65, baseType: !801, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !798, file: !793, line: 66, baseType: !7, size: 32, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !798, file: !793, line: 67, baseType: !805, size: 128, offset: 192)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !806, size: 128, elements: !808)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !793, line: 29, baseType: !807)
!807 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!808 = !{!809}
!809 = !DISubrange(count: 2)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !792, file: !793, line: 77, baseType: !796, size: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !792, file: !793, line: 78, baseType: !7, size: 32, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !792, file: !793, line: 79, baseType: !813, size: 64, offset: 192)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !793, line: 49, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !793, line: 45, size: 832, elements: !816)
!816 = !{!817, !818, !819}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !815, file: !793, line: 46, baseType: !801, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !815, file: !793, line: 47, baseType: !791, size: 64, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !815, file: !793, line: 48, baseType: !820, size: 704, offset: 128)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !821, line: 164, size: 704, elements: !822)
!821 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!822 = !{!823, !825, !835, !836, !837, !838, !839, !840, !844, !848, !849, !850, !851}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !820, file: !821, line: 166, baseType: !824, size: 64)
!824 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !820, file: !821, line: 167, baseType: !826, size: 64, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !821, line: 157, size: 192, elements: !828)
!828 = !{!829, !830, !831}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !827, file: !821, line: 159, baseType: !654, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !827, file: !821, line: 160, baseType: !826, size: 64, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !827, file: !821, line: 161, baseType: !832, size: 32, offset: 128)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !655, size: 32, elements: !833)
!833 = !{!834}
!834 = !DISubrange(count: 4)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !820, file: !821, line: 168, baseType: !654, size: 64, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !820, file: !821, line: 169, baseType: !654, size: 64, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !820, file: !821, line: 170, baseType: !654, size: 64, offset: 256)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !820, file: !821, line: 171, baseType: !824, size: 64, offset: 320)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !820, file: !821, line: 172, baseType: !652, size: 32, offset: 384)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !820, file: !821, line: 176, baseType: !841, size: 64, offset: 448)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DISubroutineType(types: !843)
!843 = !{!826, !656, !824}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !820, file: !821, line: 177, baseType: !845, size: 64, offset: 512)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{null, !656, !826}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !820, file: !821, line: 178, baseType: !656, size: 64, offset: 576)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !820, file: !821, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !820, file: !821, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !820, file: !821, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !758, file: !740, line: 177, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !672, line: 56, baseType: !854)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !164, line: 3371, size: 1792, elements: !856)
!856 = !{!857, !890, !896, !907, !926, !937, !942, !949, !955, !968, !976, !1014, !1019, !1047, !1064, !1065, !1070, !1079, !1085, !1090, !1094, !1098, !1411, !1460, !1466, !1472, !1479, !1492, !1506, !1523, !1535, !1557, !1572, !1744}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !855, file: !164, line: 3372, baseType: !858, size: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !164, line: 360, size: 64, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !858, file: !164, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !858, file: !164, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !858, file: !164, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !858, file: !164, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !858, file: !164, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !858, file: !164, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !858, file: !164, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !858, file: !164, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !858, file: !164, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !858, file: !164, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !858, file: !164, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !858, file: !164, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !858, file: !164, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !858, file: !164, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !858, file: !164, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !858, file: !164, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !858, file: !164, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !858, file: !164, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !858, file: !164, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !858, file: !164, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !858, file: !164, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !858, file: !164, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !858, file: !164, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !858, file: !164, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !858, file: !164, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !858, file: !164, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !858, file: !164, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !858, file: !164, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !858, file: !164, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !858, file: !164, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !855, file: !164, line: 3373, baseType: !891, size: 192)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !164, line: 402, size: 192, elements: !892)
!892 = !{!893, !894, !895}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !891, file: !164, line: 403, baseType: !858, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !891, file: !164, line: 404, baseType: !853, size: 64, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !891, file: !164, line: 405, baseType: !853, size: 64, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !855, file: !164, line: 3374, baseType: !897, size: 320)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !164, line: 1384, size: 320, elements: !898)
!898 = !{!899, !900}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !897, file: !164, line: 1385, baseType: !891, size: 192)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !897, file: !164, line: 1386, baseType: !901, size: 128, offset: 192)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !902, line: 58, baseType: !903)
!902 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !902, line: 54, size: 128, elements: !904)
!904 = !{!905, !906}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !903, file: !902, line: 56, baseType: !807, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !903, file: !902, line: 57, baseType: !824, size: 64, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !855, file: !164, line: 3375, baseType: !908, size: 256)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !164, line: 1397, size: 256, elements: !909)
!909 = !{!910, !911}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !908, file: !164, line: 1398, baseType: !891, size: 192)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !908, file: !164, line: 1399, baseType: !912, size: 64, offset: 192)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !914, line: 52, size: 256, elements: !915)
!914 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!915 = !{!916, !917, !918, !919, !920, !921, !922}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !913, file: !914, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !913, file: !914, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !913, file: !914, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !913, file: !914, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !913, file: !914, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !913, file: !914, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !913, file: !914, line: 62, baseType: !923, size: 192, offset: 64)
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !807, size: 192, elements: !924)
!924 = !{!925}
!925 = !DISubrange(count: 3)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !855, file: !164, line: 3376, baseType: !927, size: 256)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !164, line: 1408, size: 256, elements: !928)
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !927, file: !164, line: 1409, baseType: !891, size: 192)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !927, file: !164, line: 1410, baseType: !931, size: 64, offset: 192)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !933, line: 27, size: 192, elements: !934)
!933 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!934 = !{!935, !936}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !932, file: !933, line: 29, baseType: !901, size: 128)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !932, file: !933, line: 30, baseType: !5, size: 32, offset: 128)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !855, file: !164, line: 3377, baseType: !938, size: 256)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !164, line: 1437, size: 256, elements: !939)
!939 = !{!940, !941}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !938, file: !164, line: 1438, baseType: !891, size: 192)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !938, file: !164, line: 1439, baseType: !853, size: 64, offset: 192)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !855, file: !164, line: 3378, baseType: !943, size: 256)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !164, line: 1418, size: 256, elements: !944)
!944 = !{!945, !946, !947}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !943, file: !164, line: 1419, baseType: !891, size: 192)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !943, file: !164, line: 1420, baseType: !652, size: 32, offset: 192)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !943, file: !164, line: 1421, baseType: !948, size: 8, offset: 224)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !655, size: 8, elements: !772)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !855, file: !164, line: 3379, baseType: !950, size: 320)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !164, line: 1428, size: 320, elements: !951)
!951 = !{!952, !953, !954}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !950, file: !164, line: 1429, baseType: !891, size: 192)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !950, file: !164, line: 1430, baseType: !853, size: 64, offset: 192)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !950, file: !164, line: 1431, baseType: !853, size: 64, offset: 256)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !855, file: !164, line: 3380, baseType: !956, size: 320)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !164, line: 1460, size: 320, elements: !957)
!957 = !{!958, !959}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !956, file: !164, line: 1461, baseType: !891, size: 192)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !956, file: !164, line: 1462, baseType: !960, size: 128, offset: 192)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !961, line: 31, size: 128, elements: !962)
!961 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!962 = !{!963, !966, !967}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !960, file: !961, line: 32, baseType: !964, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !651)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !960, file: !961, line: 33, baseType: !7, size: 32, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !960, file: !961, line: 34, baseType: !7, size: 32, offset: 96)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !855, file: !164, line: 3381, baseType: !969, size: 384)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !164, line: 2507, size: 384, elements: !970)
!970 = !{!971, !972, !973, !974, !975}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !969, file: !164, line: 2508, baseType: !891, size: 192)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !969, file: !164, line: 2509, baseType: !690, size: 32, offset: 192)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !969, file: !164, line: 2510, baseType: !7, size: 32, offset: 224)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !969, file: !164, line: 2511, baseType: !853, size: 64, offset: 256)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !969, file: !164, line: 2512, baseType: !853, size: 64, offset: 320)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !855, file: !164, line: 3382, baseType: !977, size: 896)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !164, line: 2652, size: 896, elements: !978)
!978 = !{!979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !977, file: !164, line: 2653, baseType: !969, size: 384)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !977, file: !164, line: 2654, baseType: !853, size: 64, offset: 384)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !977, file: !164, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !977, file: !164, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !977, file: !164, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !977, file: !164, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !977, file: !164, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !977, file: !164, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !977, file: !164, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !977, file: !164, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !977, file: !164, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !977, file: !164, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !977, file: !164, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !977, file: !164, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !977, file: !164, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !977, file: !164, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !977, file: !164, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !977, file: !164, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !977, file: !164, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !977, file: !164, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !977, file: !164, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !977, file: !164, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !977, file: !164, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !977, file: !164, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !977, file: !164, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !977, file: !164, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !977, file: !164, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !977, file: !164, line: 2703, baseType: !7, size: 32, offset: 512)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !977, file: !164, line: 2705, baseType: !853, size: 64, offset: 576)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !977, file: !164, line: 2706, baseType: !853, size: 64, offset: 640)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !977, file: !164, line: 2707, baseType: !853, size: 64, offset: 704)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !977, file: !164, line: 2708, baseType: !853, size: 64, offset: 768)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !977, file: !164, line: 2711, baseType: !1012, size: 64, offset: 832)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !164, line: 2711, flags: DIFlagFwdDecl)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !855, file: !164, line: 3383, baseType: !1015, size: 960)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !164, line: 2756, size: 960, elements: !1016)
!1016 = !{!1017, !1018}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1015, file: !164, line: 2757, baseType: !977, size: 896)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1015, file: !164, line: 2758, baseType: !737, size: 64, offset: 896)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !855, file: !164, line: 3384, baseType: !1020, size: 1472)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !164, line: 3114, size: 1472, elements: !1021)
!1021 = !{!1022, !1043, !1044, !1045, !1046}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1020, file: !164, line: 3115, baseType: !1023, size: 1216)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !164, line: 2984, size: 1216, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1023, file: !164, line: 2985, baseType: !1015, size: 960)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1023, file: !164, line: 2986, baseType: !853, size: 64, offset: 960)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1023, file: !164, line: 2987, baseType: !853, size: 64, offset: 1024)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1023, file: !164, line: 2988, baseType: !853, size: 64, offset: 1088)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1023, file: !164, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1023, file: !164, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1023, file: !164, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1023, file: !164, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1023, file: !164, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1023, file: !164, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1023, file: !164, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1023, file: !164, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1023, file: !164, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1023, file: !164, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1023, file: !164, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1023, file: !164, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1023, file: !164, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1023, file: !164, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1020, file: !164, line: 3117, baseType: !853, size: 64, offset: 1216)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1020, file: !164, line: 3119, baseType: !853, size: 64, offset: 1280)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1020, file: !164, line: 3121, baseType: !853, size: 64, offset: 1344)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1020, file: !164, line: 3123, baseType: !853, size: 64, offset: 1408)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !855, file: !164, line: 3385, baseType: !1048, size: 1088)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !164, line: 2874, size: 1088, elements: !1049)
!1049 = !{!1050, !1051, !1052}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1048, file: !164, line: 2875, baseType: !1015, size: 960)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1048, file: !164, line: 2876, baseType: !737, size: 64, offset: 960)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1048, file: !164, line: 2877, baseType: !1053, size: 64, offset: 1024)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1055, line: 172, size: 128, elements: !1056)
!1055 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1056 = !{!1057, !1058, !1059, !1060, !1061, !1062, !1063}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1054, file: !1055, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1054, file: !1055, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1054, file: !1055, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1054, file: !1055, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1054, file: !1055, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1054, file: !1055, line: 195, baseType: !7, size: 32, offset: 32)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1054, file: !1055, line: 199, baseType: !853, size: 64, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !855, file: !164, line: 3386, baseType: !1023, size: 1216)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !855, file: !164, line: 3387, baseType: !1066, size: 1280)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !164, line: 3093, size: 1280, elements: !1067)
!1067 = !{!1068, !1069}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1066, file: !164, line: 3094, baseType: !1023, size: 1216)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1066, file: !164, line: 3095, baseType: !1053, size: 64, offset: 1216)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !855, file: !164, line: 3388, baseType: !1071, size: 1216)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !164, line: 2824, size: 1216, elements: !1072)
!1072 = !{!1073, !1074, !1075, !1076, !1077, !1078}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1071, file: !164, line: 2825, baseType: !977, size: 896)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1071, file: !164, line: 2827, baseType: !853, size: 64, offset: 896)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1071, file: !164, line: 2828, baseType: !853, size: 64, offset: 960)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1071, file: !164, line: 2829, baseType: !853, size: 64, offset: 1024)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1071, file: !164, line: 2830, baseType: !853, size: 64, offset: 1088)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1071, file: !164, line: 2831, baseType: !853, size: 64, offset: 1152)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !855, file: !164, line: 3389, baseType: !1080, size: 1024)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !164, line: 2850, size: 1024, elements: !1081)
!1081 = !{!1082, !1083, !1084}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1080, file: !164, line: 2851, baseType: !1015, size: 960)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1080, file: !164, line: 2852, baseType: !652, size: 32, offset: 960)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1080, file: !164, line: 2853, baseType: !652, size: 32, offset: 992)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !855, file: !164, line: 3390, baseType: !1086, size: 1024)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !164, line: 2857, size: 1024, elements: !1087)
!1087 = !{!1088, !1089}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1086, file: !164, line: 2858, baseType: !1015, size: 960)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1086, file: !164, line: 2859, baseType: !1053, size: 64, offset: 960)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !855, file: !164, line: 3391, baseType: !1091, size: 960)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !164, line: 2862, size: 960, elements: !1092)
!1092 = !{!1093}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1091, file: !164, line: 2863, baseType: !1015, size: 960)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !855, file: !164, line: 3392, baseType: !1095, size: 1472)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !164, line: 3304, size: 1472, elements: !1096)
!1096 = !{!1097}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1095, file: !164, line: 3305, baseType: !1020, size: 1472)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !855, file: !164, line: 3393, baseType: !1099, size: 1792)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !164, line: 3248, size: 1792, elements: !1100)
!1100 = !{!1101, !1102, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1099, file: !164, line: 3249, baseType: !1020, size: 1472)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1099, file: !164, line: 3251, baseType: !1103, size: 64, offset: 1472)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1105, line: 463, size: 1152, elements: !1106)
!1105 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1106 = !{!1107, !1110, !1141, !1142, !1271, !1334, !1335, !1336, !1337, !1338, !1339, !1363, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1104, file: !1105, line: 464, baseType: !1108, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1105, line: 464, flags: DIFlagFwdDecl)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1104, file: !1105, line: 467, baseType: !1111, size: 64, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !1113)
!1113 = !{!1114, !1116, !1117, !1130, !1131, !1132, !1133, !1134, !1135, !1137, !1139, !1140}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1112, file: !135, line: 377, baseType: !1115, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !672, line: 111, baseType: !696)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1112, file: !135, line: 378, baseType: !1115, size: 64, offset: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1112, file: !135, line: 381, baseType: !1118, size: 64, offset: 128)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !1120)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !1121)
!1121 = !{!1122}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1120, file: !135, line: 282, baseType: !1123, size: 128)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !1124)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !1125)
!1125 = !{!1126, !1127, !1128}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1124, file: !135, line: 281, baseType: !7, size: 32)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1124, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1124, file: !135, line: 281, baseType: !1129, size: 64, offset: 64)
!1129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1115, size: 64, elements: !772)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1112, file: !135, line: 384, baseType: !652, size: 32, offset: 192)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1112, file: !135, line: 387, baseType: !652, size: 32, offset: 224)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1112, file: !135, line: 390, baseType: !652, size: 32, offset: 256)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1112, file: !135, line: 394, baseType: !1118, size: 64, offset: 320)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1112, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1112, file: !135, line: 399, baseType: !1136, size: 64, offset: 416)
!1136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !808)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1112, file: !135, line: 402, baseType: !1138, size: 64, offset: 480)
!1138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !808)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1112, file: !135, line: 406, baseType: !652, size: 32, offset: 544)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1112, file: !135, line: 409, baseType: !652, size: 32, offset: 576)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1104, file: !1105, line: 470, baseType: !723, size: 64, offset: 128)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1104, file: !1105, line: 473, baseType: !1143, size: 64, offset: 192)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1055, line: 39, size: 1152, elements: !1145)
!1145 = !{!1146, !1198, !1211, !1224, !1225, !1237, !1238, !1242, !1243, !1244, !1245, !1246}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1144, file: !1055, line: 41, baseType: !1147, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1148, line: 144, baseType: !1149)
!1148 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1148, line: 100, size: 896, elements: !1151)
!1151 = !{!1152, !1160, !1165, !1170, !1172, !1175, !1176, !1177, !1178, !1179, !1184, !1186, !1187, !1192, !1197}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1150, file: !1148, line: 102, baseType: !1153, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1148, line: 52, baseType: !1154)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!1157, !1158}
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1148, line: 47, baseType: !7)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1150, file: !1148, line: 105, baseType: !1161, size: 64, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1148, line: 59, baseType: !1162)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!652, !1158, !1158}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1150, file: !1148, line: 108, baseType: !1166, size: 64, offset: 128)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1148, line: 63, baseType: !1167)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{null, !656}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1150, file: !1148, line: 111, baseType: !1171, size: 64, offset: 192)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1150, file: !1148, line: 114, baseType: !1173, size: 64, offset: 256)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1174, line: 46, baseType: !807)
!1174 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1150, file: !1148, line: 117, baseType: !1173, size: 64, offset: 320)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1150, file: !1148, line: 120, baseType: !1173, size: 64, offset: 384)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1150, file: !1148, line: 124, baseType: !7, size: 32, offset: 448)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1150, file: !1148, line: 128, baseType: !7, size: 32, offset: 480)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1150, file: !1148, line: 131, baseType: !1180, size: 64, offset: 512)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1148, line: 75, baseType: !1181)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!656, !1173, !1173}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1150, file: !1148, line: 132, baseType: !1185, size: 64, offset: 576)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1148, line: 78, baseType: !1167)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1150, file: !1148, line: 135, baseType: !656, size: 64, offset: 640)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1150, file: !1148, line: 136, baseType: !1188, size: 64, offset: 704)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1148, line: 82, baseType: !1189)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DISubroutineType(types: !1191)
!1191 = !{!656, !656, !1173, !1173}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1150, file: !1148, line: 137, baseType: !1193, size: 64, offset: 768)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1148, line: 83, baseType: !1194)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = !DISubroutineType(types: !1196)
!1196 = !{null, !656, !656}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1150, file: !1148, line: 141, baseType: !7, size: 32, offset: 832)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1144, file: !1055, line: 48, baseType: !1199, size: 64, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !581, line: 35, baseType: !1201)
!1201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !581, line: 35, size: 128, elements: !1202)
!1202 = !{!1203}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1201, file: !581, line: 35, baseType: !1204, size: 128)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !581, line: 33, baseType: !1205)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !581, line: 33, size: 128, elements: !1206)
!1206 = !{!1207, !1208, !1209}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1205, file: !581, line: 33, baseType: !7, size: 32)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1205, file: !581, line: 33, baseType: !7, size: 32, offset: 32)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1205, file: !581, line: 33, baseType: !1210, size: 64, offset: 64)
!1210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !671, size: 64, elements: !772)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1144, file: !1055, line: 51, baseType: !1212, size: 64, offset: 128)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !164, line: 183, baseType: !1214)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !164, line: 183, size: 128, elements: !1215)
!1215 = !{!1216}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1214, file: !164, line: 183, baseType: !1217, size: 128)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !164, line: 182, baseType: !1218)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !164, line: 182, size: 128, elements: !1219)
!1219 = !{!1220, !1221, !1222}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1218, file: !164, line: 182, baseType: !7, size: 32)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1218, file: !164, line: 182, baseType: !7, size: 32, offset: 32)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1218, file: !164, line: 182, baseType: !1223, size: 64, offset: 64)
!1223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !853, size: 64, elements: !772)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1144, file: !1055, line: 54, baseType: !853, size: 64, offset: 192)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1144, file: !1055, line: 57, baseType: !1226, size: 128, offset: 256)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1227, line: 31, size: 128, elements: !1228)
!1227 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1228 = !{!1229, !1230, !1231, !1232, !1233, !1234, !1235}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1226, file: !1227, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1226, file: !1227, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1226, file: !1227, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1226, file: !1227, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1226, file: !1227, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1226, file: !1227, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1226, file: !1227, line: 56, baseType: !1236, size: 64, offset: 64)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !672, line: 47, baseType: !791)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1144, file: !1055, line: 60, baseType: !1226, size: 128, offset: 384)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1144, file: !1055, line: 64, baseType: !1239, size: 64, offset: 512)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1240 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1241, line: 33, flags: DIFlagFwdDecl)
!1241 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1144, file: !1055, line: 67, baseType: !853, size: 64, offset: 576)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1144, file: !1055, line: 73, baseType: !1147, size: 64, offset: 640)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1144, file: !1055, line: 77, baseType: !1236, size: 64, offset: 704)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1144, file: !1055, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1144, file: !1055, line: 82, baseType: !1247, size: 320, offset: 832)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !574, line: 62, size: 320, elements: !1248)
!1248 = !{!1249, !1255, !1256, !1257, !1258, !1265}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1247, file: !574, line: 63, baseType: !1250, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !574, line: 56, size: 128, elements: !1252)
!1252 = !{!1253, !1254}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1251, file: !574, line: 57, baseType: !1250, size: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1251, file: !574, line: 58, baseType: !948, size: 8, offset: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1247, file: !574, line: 64, baseType: !7, size: 32, offset: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1247, file: !574, line: 66, baseType: !7, size: 32, offset: 96)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1247, file: !574, line: 68, baseType: !651, size: 8, offset: 128)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1247, file: !574, line: 70, baseType: !1259, size: 64, offset: 192)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !574, line: 37, size: 128, elements: !1261)
!1261 = !{!1262, !1263}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1260, file: !574, line: 39, baseType: !1259, size: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1260, file: !574, line: 40, baseType: !1264, size: 64, offset: 64)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1247, file: !574, line: 71, baseType: !1266, size: 64, offset: 256)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !574, line: 45, size: 320, elements: !1268)
!1268 = !{!1269, !1270}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1267, file: !574, line: 47, baseType: !1266, size: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1267, file: !574, line: 48, baseType: !662, size: 256, offset: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1104, file: !1105, line: 476, baseType: !1272, size: 64, offset: 256)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !146, line: 187, size: 256, elements: !1274)
!1274 = !{!1275, !1276, !1332, !1333}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1273, file: !146, line: 189, baseType: !652, size: 32)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1273, file: !146, line: 192, baseType: !1277, size: 64, offset: 64)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !146, line: 87, baseType: !1279)
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !146, line: 87, size: 128, elements: !1280)
!1280 = !{!1281}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1279, file: !146, line: 87, baseType: !1282, size: 128)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !146, line: 85, baseType: !1283)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !146, line: 85, size: 128, elements: !1284)
!1284 = !{!1285, !1286, !1287}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1283, file: !146, line: 85, baseType: !7, size: 32)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1283, file: !146, line: 85, baseType: !7, size: 32, offset: 32)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1283, file: !146, line: 85, baseType: !1288, size: 64, offset: 64)
!1288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1289, size: 64, elements: !772)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !146, line: 84, baseType: !1290)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64)
!1291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !146, line: 100, size: 1216, elements: !1292)
!1292 = !{!1293, !1294, !1295, !1296, !1297, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1322, !1330, !1331}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1291, file: !146, line: 102, baseType: !652, size: 32)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1291, file: !146, line: 105, baseType: !7, size: 32, offset: 32)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1291, file: !146, line: 108, baseType: !696, size: 64, offset: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1291, file: !146, line: 111, baseType: !696, size: 64, offset: 128)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1291, file: !146, line: 114, baseType: !1298, size: 64, offset: 192)
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !146, line: 41, size: 64, elements: !1299)
!1299 = !{!1300, !1301}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1298, file: !146, line: 42, baseType: !145, size: 32)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1298, file: !146, line: 43, baseType: !7, size: 32, offset: 32)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1291, file: !146, line: 117, baseType: !7, size: 32, offset: 256)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1291, file: !146, line: 120, baseType: !7, size: 32, offset: 288)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1291, file: !146, line: 123, baseType: !1277, size: 64, offset: 320)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1291, file: !146, line: 126, baseType: !1290, size: 64, offset: 384)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1291, file: !146, line: 129, baseType: !1290, size: 64, offset: 448)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1291, file: !146, line: 132, baseType: !656, size: 64, offset: 512)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1291, file: !146, line: 139, baseType: !853, size: 64, offset: 576)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1291, file: !146, line: 143, baseType: !901, size: 128, offset: 640)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1291, file: !146, line: 146, baseType: !901, size: 128, offset: 768)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1291, file: !146, line: 148, baseType: !651, size: 8, offset: 896)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1291, file: !146, line: 149, baseType: !651, size: 8, offset: 904)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1291, file: !146, line: 153, baseType: !154, size: 32, offset: 928)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1291, file: !146, line: 156, baseType: !1315, size: 64, offset: 960)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !146, line: 48, size: 320, elements: !1317)
!1317 = !{!1318, !1319, !1320, !1321}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1316, file: !146, line: 50, baseType: !671, size: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1316, file: !146, line: 59, baseType: !901, size: 128, offset: 64)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1316, file: !146, line: 64, baseType: !651, size: 8, offset: 192)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1316, file: !146, line: 67, baseType: !1315, size: 64, offset: 256)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1291, file: !146, line: 159, baseType: !1323, size: 64, offset: 1024)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64)
!1324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !146, line: 72, size: 256, elements: !1325)
!1325 = !{!1326, !1327, !1328, !1329}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1324, file: !146, line: 74, baseType: !713, size: 64)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1324, file: !146, line: 77, baseType: !1323, size: 64, offset: 64)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1324, file: !146, line: 78, baseType: !1323, size: 64, offset: 128)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1324, file: !146, line: 81, baseType: !1323, size: 64, offset: 192)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1291, file: !146, line: 162, baseType: !651, size: 8, offset: 1088)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1291, file: !146, line: 166, baseType: !853, size: 64, offset: 1152)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1273, file: !146, line: 197, baseType: !1147, size: 64, offset: 128)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1273, file: !146, line: 200, baseType: !1290, size: 64, offset: 192)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1104, file: !1105, line: 479, baseType: !1147, size: 64, offset: 320)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1104, file: !1105, line: 484, baseType: !853, size: 64, offset: 384)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1104, file: !1105, line: 488, baseType: !853, size: 64, offset: 448)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1104, file: !1105, line: 493, baseType: !853, size: 64, offset: 512)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1104, file: !1105, line: 496, baseType: !853, size: 64, offset: 576)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1104, file: !1105, line: 501, baseType: !1340, size: 64, offset: 640)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64)
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !159, line: 2355, size: 576, elements: !1342)
!1342 = !{!1343, !1346, !1347, !1348, !1349, !1351, !1352, !1357, !1358, !1359, !1360, !1361, !1362}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1341, file: !159, line: 2356, baseType: !1344, size: 64)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64)
!1345 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !159, line: 2356, flags: DIFlagFwdDecl)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1341, file: !159, line: 2357, baseType: !657, size: 64, offset: 64)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1341, file: !159, line: 2358, baseType: !652, size: 32, offset: 128)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1341, file: !159, line: 2359, baseType: !652, size: 32, offset: 160)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1341, file: !159, line: 2360, baseType: !1350, size: 128, offset: 192)
!1350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 128, elements: !833)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1341, file: !159, line: 2364, baseType: !652, size: 32, offset: 320)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1341, file: !159, line: 2367, baseType: !1353, size: 128, offset: 384)
!1353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !159, line: 2349, size: 128, elements: !1354)
!1354 = !{!1355, !1356}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1353, file: !159, line: 2351, baseType: !737, size: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1353, file: !159, line: 2352, baseType: !824, size: 64, offset: 64)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1341, file: !159, line: 2371, baseType: !158, size: 32, offset: 512)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1341, file: !159, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1341, file: !159, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1341, file: !159, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1341, file: !159, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1341, file: !159, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1104, file: !1105, line: 504, baseType: !1364, size: 64, offset: 704)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64)
!1365 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1105, line: 504, flags: DIFlagFwdDecl)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1104, file: !1105, line: 507, baseType: !1147, size: 64, offset: 768)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1104, file: !1105, line: 510, baseType: !652, size: 32, offset: 832)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1104, file: !1105, line: 513, baseType: !652, size: 32, offset: 864)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1104, file: !1105, line: 516, baseType: !690, size: 32, offset: 896)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1104, file: !1105, line: 519, baseType: !690, size: 32, offset: 928)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1104, file: !1105, line: 522, baseType: !7, size: 32, offset: 960)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1104, file: !1105, line: 523, baseType: !7, size: 32, offset: 992)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1104, file: !1105, line: 528, baseType: !657, size: 64, offset: 1024)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1104, file: !1105, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1104, file: !1105, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1104, file: !1105, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1104, file: !1105, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1104, file: !1105, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1104, file: !1105, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1104, file: !1105, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1104, file: !1105, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1104, file: !1105, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1104, file: !1105, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1104, file: !1105, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1104, file: !1105, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1104, file: !1105, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1104, file: !1105, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1104, file: !1105, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1104, file: !1105, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1099, file: !164, line: 3254, baseType: !853, size: 64, offset: 1536)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1099, file: !164, line: 3257, baseType: !853, size: 64, offset: 1600)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1099, file: !164, line: 3258, baseType: !853, size: 64, offset: 1664)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1099, file: !164, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1099, file: !164, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1099, file: !164, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1099, file: !164, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1099, file: !164, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1099, file: !164, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1099, file: !164, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1099, file: !164, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1099, file: !164, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1099, file: !164, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1099, file: !164, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1099, file: !164, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1099, file: !164, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1099, file: !164, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
