; ModuleID = 'tree-ssa-dse.bc'
source_filename = "tree-ssa-dse.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }

!588 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!589 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!590 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!591 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!592 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!593 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!594 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!595 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!596 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!597 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!598 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!599 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !561, line: 727, baseType: !7, size: 32, elements: !600)
!600 = !{!601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624}
!601 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!602 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!603 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!604 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!605 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!606 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!607 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!608 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!609 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!610 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!611 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!612 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!613 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!614 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!615 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!616 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!617 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!618 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!619 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!620 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!621 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!622 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!623 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!624 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!625 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ssa_op_iter_type", file: !626, line: 119, baseType: !7, size: 32, elements: !627)
!626 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!627 = !{!628, !629, !630, !631}
!628 = !DIEnumerator(name: "ssa_op_iter_none", value: 0, isUnsigned: true)
!629 = !DIEnumerator(name: "ssa_op_iter_tree", value: 1, isUnsigned: true)
!630 = !DIEnumerator(name: "ssa_op_iter_use", value: 2, isUnsigned: true)
!631 = !DIEnumerator(name: "ssa_op_iter_def", value: 3, isUnsigned: true)
!632 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !561, line: 80, baseType: !7, size: 32, elements: !633)
!633 = !{!634, !635, !636, !637}
!634 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!635 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!636 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!637 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!638 = !{!639, !640, !641, !642, !645, !646, !648, !711, !715, !719, !366, !982, !1950, !1015, !643, !1952, !632}
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!641 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !644)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !649, line: 47, baseType: !650)
!649 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !652, line: 75, size: 256, elements: !653)
!652 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!653 = !{!654, !669, !670, !671}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !651, file: !652, line: 76, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !652, line: 68, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !652, line: 63, size: 320, elements: !658)
!658 = !{!659, !661, !662, !663}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !657, file: !652, line: 64, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !657, file: !652, line: 65, baseType: !660, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !657, file: !652, line: 66, baseType: !7, size: 32, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !657, file: !652, line: 67, baseType: !664, size: 128, offset: 192)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 128, elements: !667)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !652, line: 29, baseType: !666)
!666 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!667 = !{!668}
!668 = !DISubrange(count: 2)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !651, file: !652, line: 77, baseType: !655, size: 64, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !651, file: !652, line: 78, baseType: !7, size: 32, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !651, file: !652, line: 79, baseType: !672, size: 64, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !652, line: 49, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !652, line: 45, size: 832, elements: !675)
!675 = !{!676, !677, !678}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !674, file: !652, line: 46, baseType: !660, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !674, file: !652, line: 47, baseType: !650, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !674, file: !652, line: 48, baseType: !679, size: 704, offset: 128)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !680, line: 164, size: 704, elements: !681)
!680 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!681 = !{!682, !684, !694, !695, !696, !697, !698, !699, !703, !707, !708, !709, !710}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !679, file: !680, line: 166, baseType: !683, size: 64)
!683 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !679, file: !680, line: 167, baseType: !685, size: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !680, line: 157, size: 192, elements: !687)
!687 = !{!688, !689, !690}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !686, file: !680, line: 159, baseType: !643, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !686, file: !680, line: 160, baseType: !685, size: 64, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !686, file: !680, line: 161, baseType: !691, size: 32, offset: 128)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !644, size: 32, elements: !692)
!692 = !{!693}
!693 = !DISubrange(count: 4)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !679, file: !680, line: 168, baseType: !643, size: 64, offset: 128)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !679, file: !680, line: 169, baseType: !643, size: 64, offset: 192)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !679, file: !680, line: 170, baseType: !643, size: 64, offset: 256)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !679, file: !680, line: 171, baseType: !683, size: 64, offset: 320)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !679, file: !680, line: 172, baseType: !641, size: 32, offset: 384)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !679, file: !680, line: 176, baseType: !700, size: 64, offset: 448)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!685, !645, !683}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !679, file: !680, line: 177, baseType: !704, size: 64, offset: 512)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{null, !645, !685}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !679, file: !680, line: 178, baseType: !645, size: 64, offset: 576)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !679, file: !680, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !679, file: !680, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !679, file: !680, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dse_block_local_data", file: !3, line: 82, size: 64, elements: !713)
!713 = !{!714}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "stores", scope: !712, file: !3, line: 84, baseType: !648, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dse_global_data", file: !3, line: 69, size: 64, elements: !717)
!717 = !{!718}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "stores", scope: !716, file: !3, line: 76, baseType: !648, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !649, line: 56, baseType: !720)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !334, line: 3371, size: 1792, elements: !722)
!722 = !{!723, !756, !762, !773, !792, !803, !808, !817, !823, !836, !848, !886, !1284, !1312, !1329, !1330, !1335, !1344, !1350, !1355, !1359, !1363, !1601, !1648, !1654, !1660, !1667, !1680, !1694, !1711, !1723, !1745, !1760, !1932}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !721, file: !334, line: 3372, baseType: !724, size: 64)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !334, line: 360, size: 64, elements: !725)
!725 = !{!726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !724, file: !334, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !724, file: !334, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !724, file: !334, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !724, file: !334, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !724, file: !334, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !724, file: !334, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !724, file: !334, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !724, file: !334, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !724, file: !334, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !724, file: !334, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !724, file: !334, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !724, file: !334, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !724, file: !334, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !724, file: !334, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !724, file: !334, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !724, file: !334, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !724, file: !334, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !724, file: !334, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !724, file: !334, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !724, file: !334, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !724, file: !334, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !724, file: !334, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !724, file: !334, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !724, file: !334, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !724, file: !334, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !724, file: !334, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !724, file: !334, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !724, file: !334, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !724, file: !334, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !724, file: !334, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !721, file: !334, line: 3373, baseType: !757, size: 192)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !334, line: 402, size: 192, elements: !758)
!758 = !{!759, !760, !761}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !757, file: !334, line: 403, baseType: !724, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !757, file: !334, line: 404, baseType: !719, size: 64, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !757, file: !334, line: 405, baseType: !719, size: 64, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !721, file: !334, line: 3374, baseType: !763, size: 320)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !334, line: 1384, size: 320, elements: !764)
!764 = !{!765, !766}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !763, file: !334, line: 1385, baseType: !757, size: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !763, file: !334, line: 1386, baseType: !767, size: 128, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !768, line: 58, baseType: !769)
!768 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !768, line: 54, size: 128, elements: !770)
!770 = !{!771, !772}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !769, file: !768, line: 56, baseType: !666, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !769, file: !768, line: 57, baseType: !683, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !721, file: !334, line: 3375, baseType: !774, size: 256)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !334, line: 1397, size: 256, elements: !775)
!775 = !{!776, !777}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !774, file: !334, line: 1398, baseType: !757, size: 192)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !774, file: !334, line: 1399, baseType: !778, size: 64, offset: 192)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !780, line: 52, size: 256, elements: !781)
!780 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!781 = !{!782, !783, !784, !785, !786, !787, !788}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !779, file: !780, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !779, file: !780, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !779, file: !780, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !779, file: !780, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !779, file: !780, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !779, file: !780, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !779, file: !780, line: 62, baseType: !789, size: 192, offset: 64)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 192, elements: !790)
!790 = !{!791}
!791 = !DISubrange(count: 3)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !721, file: !334, line: 3376, baseType: !793, size: 256)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !334, line: 1408, size: 256, elements: !794)
!794 = !{!795, !796}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !793, file: !334, line: 1409, baseType: !757, size: 192)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !793, file: !334, line: 1410, baseType: !797, size: 64, offset: 192)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !799, line: 27, size: 192, elements: !800)
!799 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!800 = !{!801, !802}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !798, file: !799, line: 29, baseType: !767, size: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !798, file: !799, line: 30, baseType: !189, size: 32, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !721, file: !334, line: 3377, baseType: !804, size: 256)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !334, line: 1437, size: 256, elements: !805)
!805 = !{!806, !807}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !804, file: !334, line: 1438, baseType: !757, size: 192)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !804, file: !334, line: 1439, baseType: !719, size: 64, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !721, file: !334, line: 3378, baseType: !809, size: 256)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !334, line: 1418, size: 256, elements: !810)
!810 = !{!811, !812, !813}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !809, file: !334, line: 1419, baseType: !757, size: 192)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !809, file: !334, line: 1420, baseType: !641, size: 32, offset: 192)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !809, file: !334, line: 1421, baseType: !814, size: 8, offset: 224)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !644, size: 8, elements: !815)
!815 = !{!816}
!816 = !DISubrange(count: 1)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !721, file: !334, line: 3379, baseType: !818, size: 320)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !334, line: 1428, size: 320, elements: !819)
!819 = !{!820, !821, !822}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !818, file: !334, line: 1429, baseType: !757, size: 192)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !818, file: !334, line: 1430, baseType: !719, size: 64, offset: 192)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !818, file: !334, line: 1431, baseType: !719, size: 64, offset: 256)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !721, file: !334, line: 3380, baseType: !824, size: 320)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !334, line: 1460, size: 320, elements: !825)
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !824, file: !334, line: 1461, baseType: !757, size: 192)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !824, file: !334, line: 1462, baseType: !828, size: 128, offset: 192)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !829, line: 31, size: 128, elements: !830)
!829 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!830 = !{!831, !834, !835}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !828, file: !829, line: 32, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !640)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !828, file: !829, line: 33, baseType: !7, size: 32, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !828, file: !829, line: 34, baseType: !7, size: 32, offset: 96)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !721, file: !334, line: 3381, baseType: !837, size: 384)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !334, line: 2507, size: 384, elements: !838)
!838 = !{!839, !840, !845, !846, !847}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !837, file: !334, line: 2508, baseType: !757, size: 192)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !837, file: !334, line: 2509, baseType: !841, size: 32, offset: 192)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !842, line: 58, baseType: !843)
!842 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !844, line: 44, baseType: !7)
!844 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!845 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !837, file: !334, line: 2510, baseType: !7, size: 32, offset: 224)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !837, file: !334, line: 2511, baseType: !719, size: 64, offset: 256)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !837, file: !334, line: 2512, baseType: !719, size: 64, offset: 320)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !721, file: !334, line: 3382, baseType: !849, size: 896)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !334, line: 2652, size: 896, elements: !850)
!850 = !{!851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !849, file: !334, line: 2653, baseType: !837, size: 384)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !849, file: !334, line: 2654, baseType: !719, size: 64, offset: 384)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !849, file: !334, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !849, file: !334, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !849, file: !334, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !849, file: !334, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !849, file: !334, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !849, file: !334, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !849, file: !334, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !849, file: !334, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !849, file: !334, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !849, file: !334, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !849, file: !334, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !849, file: !334, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !849, file: !334, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !849, file: !334, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !849, file: !334, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !849, file: !334, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !849, file: !334, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !849, file: !334, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !849, file: !334, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !849, file: !334, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !849, file: !334, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !849, file: !334, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !849, file: !334, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !849, file: !334, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !849, file: !334, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !849, file: !334, line: 2703, baseType: !7, size: 32, offset: 512)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !849, file: !334, line: 2705, baseType: !719, size: 64, offset: 576)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !849, file: !334, line: 2706, baseType: !719, size: 64, offset: 640)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !849, file: !334, line: 2707, baseType: !719, size: 64, offset: 704)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !849, file: !334, line: 2708, baseType: !719, size: 64, offset: 768)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !849, file: !334, line: 2711, baseType: !884, size: 64, offset: 832)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !334, line: 2711, flags: DIFlagFwdDecl)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !721, file: !334, line: 3383, baseType: !887, size: 960)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !334, line: 2756, size: 960, elements: !888)
!888 = !{!889, !890}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !887, file: !334, line: 2757, baseType: !849, size: 896)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !887, file: !334, line: 2758, baseType: !891, size: 64, offset: 896)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !649, line: 50, baseType: !892)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !894, line: 240, size: 384, elements: !895)
!894 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!895 = !{!896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !893, file: !894, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !893, file: !894, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !893, file: !894, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !893, file: !894, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !893, file: !894, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !893, file: !894, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !893, file: !894, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !893, file: !894, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !893, file: !894, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !893, file: !894, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !893, file: !894, line: 321, baseType: !907, size: 320, offset: 64)
!907 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !894, line: 315, size: 320, elements: !908)
!908 = !{!909, !1251, !1253, !1282, !1283}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !907, file: !894, line: 316, baseType: !910, size: 64)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !911, size: 64, elements: !815)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !894, line: 183, baseType: !912)
!912 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !894, line: 166, size: 64, elements: !913)
!913 = !{!914, !915, !916, !917, !918, !926, !927, !939, !942, !943, !944, !1228, !1241, !1248}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !912, file: !894, line: 168, baseType: !641, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !912, file: !894, line: 169, baseType: !7, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !912, file: !894, line: 170, baseType: !646, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !912, file: !894, line: 171, baseType: !891, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !912, file: !894, line: 172, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !649, line: 53, baseType: !920)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !894, line: 359, size: 128, elements: !922)
!922 = !{!923, !924}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !921, file: !894, line: 360, baseType: !641, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !921, file: !894, line: 361, baseType: !925, size: 64, offset: 64)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !891, size: 64, elements: !815)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !912, file: !894, line: 173, baseType: !189, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !912, file: !894, line: 174, baseType: !928, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !894, line: 133, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !894, line: 115, size: 32, elements: !930)
!930 = !{!931, !932, !933, !934, !935, !936, !937, !938}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !929, file: !894, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !929, file: !894, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !929, file: !894, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !929, file: !894, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !929, file: !894, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !929, file: !894, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !929, file: !894, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !929, file: !894, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !912, file: !894, line: 175, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !894, line: 175, flags: DIFlagFwdDecl)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !912, file: !894, line: 176, baseType: !650, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !912, file: !894, line: 177, baseType: !719, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !912, file: !894, line: 178, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !318, line: 217, size: 832, elements: !947)
!947 = !{!948, !1193, !1194, !1195, !1198, !1202, !1203, !1204, !1222, !1223, !1224, !1225, !1226, !1227}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !946, file: !318, line: 219, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !318, line: 151, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !318, line: 151, size: 128, elements: !952)
!952 = !{!953}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !951, file: !318, line: 151, baseType: !954, size: 128)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !318, line: 150, baseType: !955)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !318, line: 150, size: 128, elements: !956)
!956 = !{!957, !958, !959}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !955, file: !318, line: 150, baseType: !7, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !955, file: !318, line: 150, baseType: !7, size: 32, offset: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !955, file: !318, line: 150, baseType: !960, size: 64, offset: 64)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 64, elements: !815)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !649, line: 108, baseType: !962)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !318, line: 122, size: 512, elements: !964)
!964 = !{!965, !966, !967, !1185, !1186, !1187, !1188, !1189, !1190, !1191}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !963, file: !318, line: 124, baseType: !945, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !963, file: !318, line: 125, baseType: !945, size: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !963, file: !318, line: 131, baseType: !968, size: 64, offset: 128)
!968 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !318, line: 128, size: 64, elements: !969)
!969 = !{!970, !1184}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !968, file: !318, line: 129, baseType: !971, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !649, line: 66, baseType: !972)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !561, line: 143, size: 192, elements: !974)
!974 = !{!975, !1182, !1183}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !973, file: !561, line: 145, baseType: !976, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !649, line: 69, baseType: !977)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !561, line: 136, size: 192, elements: !979)
!979 = !{!980, !1180, !1181}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !978, file: !561, line: 137, baseType: !981, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !649, line: 58, baseType: !982)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !561, line: 737, size: 768, elements: !984)
!984 = !{!985, !1002, !1035, !1041, !1046, !1051, !1058, !1064, !1070, !1075, !1089, !1094, !1100, !1105, !1115, !1120, !1138, !1145, !1152, !1158, !1163, !1169, !1175}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !983, file: !561, line: 738, baseType: !986, size: 256)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !561, line: 271, size: 256, elements: !987)
!987 = !{!988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !986, file: !561, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !986, file: !561, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !986, file: !561, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !986, file: !561, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !986, file: !561, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !986, file: !561, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !986, file: !561, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !986, file: !561, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !986, file: !561, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !986, file: !561, line: 312, baseType: !7, size: 32, offset: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !986, file: !561, line: 316, baseType: !841, size: 32, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !986, file: !561, line: 319, baseType: !7, size: 32, offset: 96)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !986, file: !561, line: 323, baseType: !945, size: 64, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !986, file: !561, line: 327, baseType: !719, size: 64, offset: 192)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !983, file: !561, line: 739, baseType: !1003, size: 448)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !561, line: 350, size: 448, elements: !1004)
!1004 = !{!1005, !1033}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1003, file: !561, line: 353, baseType: !1006, size: 384)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !561, line: 333, size: 384, elements: !1007)
!1007 = !{!1008, !1009, !1016}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1006, file: !561, line: 336, baseType: !986, size: 256)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1006, file: !561, line: 343, baseType: !1010, size: 64, offset: 256)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !626, line: 37, size: 128, elements: !1012)
!1012 = !{!1013, !1014}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1011, file: !626, line: 39, baseType: !1010, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1011, file: !626, line: 40, baseType: !1015, size: 64, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1006, file: !561, line: 344, baseType: !1017, size: 64, offset: 320)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !626, line: 45, size: 320, elements: !1019)
!1019 = !{!1020, !1021}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1018, file: !626, line: 47, baseType: !1017, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1018, file: !626, line: 48, baseType: !1022, size: 256, offset: 64)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !334, line: 1883, size: 256, elements: !1023)
!1023 = !{!1024, !1026, !1027, !1032}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1022, file: !334, line: 1884, baseType: !1025, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1022, file: !334, line: 1885, baseType: !1025, size: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1022, file: !334, line: 1891, baseType: !1028, size: 64, offset: 128)
!1028 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1022, file: !334, line: 1891, size: 64, elements: !1029)
!1029 = !{!1030, !1031}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1028, file: !334, line: 1891, baseType: !981, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1028, file: !334, line: 1891, baseType: !719, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1022, file: !334, line: 1892, baseType: !1015, size: 64, offset: 192)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1003, file: !561, line: 359, baseType: !1034, size: 64, offset: 384)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !719, size: 64, elements: !815)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !983, file: !561, line: 740, baseType: !1036, size: 512)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !561, line: 365, size: 512, elements: !1037)
!1037 = !{!1038, !1039, !1040}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1036, file: !561, line: 368, baseType: !1006, size: 384)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1036, file: !561, line: 373, baseType: !719, size: 64, offset: 384)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1036, file: !561, line: 374, baseType: !719, size: 64, offset: 448)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !983, file: !561, line: 741, baseType: !1042, size: 576)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !561, line: 380, size: 576, elements: !1043)
!1043 = !{!1044, !1045}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1042, file: !561, line: 383, baseType: !1036, size: 512)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1042, file: !561, line: 389, baseType: !1034, size: 64, offset: 512)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !983, file: !561, line: 742, baseType: !1047, size: 320)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !561, line: 395, size: 320, elements: !1048)
!1048 = !{!1049, !1050}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1047, file: !561, line: 397, baseType: !986, size: 256)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1047, file: !561, line: 400, baseType: !971, size: 64, offset: 256)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !983, file: !561, line: 743, baseType: !1052, size: 448)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !561, line: 406, size: 448, elements: !1053)
!1053 = !{!1054, !1055, !1056, !1057}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1052, file: !561, line: 408, baseType: !986, size: 256)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1052, file: !561, line: 412, baseType: !719, size: 64, offset: 256)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1052, file: !561, line: 420, baseType: !719, size: 64, offset: 320)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1052, file: !561, line: 423, baseType: !971, size: 64, offset: 384)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !983, file: !561, line: 744, baseType: !1059, size: 384)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !561, line: 429, size: 384, elements: !1060)
!1060 = !{!1061, !1062, !1063}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1059, file: !561, line: 431, baseType: !986, size: 256)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1059, file: !561, line: 434, baseType: !719, size: 64, offset: 256)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1059, file: !561, line: 437, baseType: !971, size: 64, offset: 320)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !983, file: !561, line: 745, baseType: !1065, size: 384)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !561, line: 443, size: 384, elements: !1066)
!1066 = !{!1067, !1068, !1069}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1065, file: !561, line: 445, baseType: !986, size: 256)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1065, file: !561, line: 449, baseType: !719, size: 64, offset: 256)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1065, file: !561, line: 453, baseType: !971, size: 64, offset: 320)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !983, file: !561, line: 746, baseType: !1071, size: 320)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !561, line: 459, size: 320, elements: !1072)
!1072 = !{!1073, !1074}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1071, file: !561, line: 461, baseType: !986, size: 256)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1071, file: !561, line: 464, baseType: !719, size: 64, offset: 256)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !983, file: !561, line: 747, baseType: !1076, size: 768)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !561, line: 469, size: 768, elements: !1077)
!1077 = !{!1078, !1079, !1080, !1081, !1082}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1076, file: !561, line: 471, baseType: !986, size: 256)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1076, file: !561, line: 474, baseType: !7, size: 32, offset: 256)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1076, file: !561, line: 475, baseType: !7, size: 32, offset: 288)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1076, file: !561, line: 478, baseType: !719, size: 64, offset: 320)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1076, file: !561, line: 481, baseType: !1083, size: 384, offset: 384)
!1083 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1084, size: 384, elements: !815)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !334, line: 1917, size: 384, elements: !1085)
!1085 = !{!1086, !1087, !1088}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1084, file: !334, line: 1920, baseType: !1022, size: 256)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1084, file: !334, line: 1921, baseType: !719, size: 64, offset: 256)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1084, file: !334, line: 1922, baseType: !841, size: 32, offset: 320)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !983, file: !561, line: 748, baseType: !1090, size: 320)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !561, line: 487, size: 320, elements: !1091)
!1091 = !{!1092, !1093}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1090, file: !561, line: 490, baseType: !986, size: 256)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1090, file: !561, line: 494, baseType: !641, size: 32, offset: 256)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !983, file: !561, line: 749, baseType: !1095, size: 384)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !561, line: 500, size: 384, elements: !1096)
!1096 = !{!1097, !1098, !1099}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1095, file: !561, line: 502, baseType: !986, size: 256)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1095, file: !561, line: 506, baseType: !971, size: 64, offset: 256)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1095, file: !561, line: 510, baseType: !971, size: 64, offset: 320)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !983, file: !561, line: 750, baseType: !1101, size: 320)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !561, line: 529, size: 320, elements: !1102)
!1102 = !{!1103, !1104}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1101, file: !561, line: 531, baseType: !986, size: 256)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1101, file: !561, line: 540, baseType: !971, size: 64, offset: 256)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !983, file: !561, line: 751, baseType: !1106, size: 704)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !561, line: 546, size: 704, elements: !1107)
!1107 = !{!1108, !1109, !1110, !1111, !1112, !1113, !1114}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1106, file: !561, line: 549, baseType: !1036, size: 512)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1106, file: !561, line: 553, baseType: !646, size: 64, offset: 512)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1106, file: !561, line: 557, baseType: !640, size: 8, offset: 576)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1106, file: !561, line: 558, baseType: !640, size: 8, offset: 584)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1106, file: !561, line: 559, baseType: !640, size: 8, offset: 592)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1106, file: !561, line: 560, baseType: !640, size: 8, offset: 600)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1106, file: !561, line: 566, baseType: !1034, size: 64, offset: 640)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !983, file: !561, line: 752, baseType: !1116, size: 384)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !561, line: 571, size: 384, elements: !1117)
!1117 = !{!1118, !1119}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1116, file: !561, line: 573, baseType: !1047, size: 320)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1116, file: !561, line: 577, baseType: !719, size: 64, offset: 320)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !983, file: !561, line: 753, baseType: !1121, size: 576)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !561, line: 600, size: 576, elements: !1122)
!1122 = !{!1123, !1124, !1125, !1128, !1137}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1121, file: !561, line: 602, baseType: !1047, size: 320)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1121, file: !561, line: 605, baseType: !719, size: 64, offset: 320)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1121, file: !561, line: 609, baseType: !1126, size: 64, offset: 384)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1127, line: 46, baseType: !666)
!1127 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1121, file: !561, line: 612, baseType: !1129, size: 64, offset: 448)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !561, line: 581, size: 320, elements: !1131)
!1131 = !{!1132, !1133, !1134, !1135, !1136}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1130, file: !561, line: 583, baseType: !366, size: 32)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1130, file: !561, line: 586, baseType: !719, size: 64, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1130, file: !561, line: 589, baseType: !719, size: 64, offset: 128)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1130, file: !561, line: 592, baseType: !719, size: 64, offset: 192)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1130, file: !561, line: 595, baseType: !719, size: 64, offset: 256)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1121, file: !561, line: 616, baseType: !971, size: 64, offset: 512)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !983, file: !561, line: 754, baseType: !1139, size: 512)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !561, line: 622, size: 512, elements: !1140)
!1140 = !{!1141, !1142, !1143, !1144}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1139, file: !561, line: 624, baseType: !1047, size: 320)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1139, file: !561, line: 628, baseType: !719, size: 64, offset: 320)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1139, file: !561, line: 632, baseType: !719, size: 64, offset: 384)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1139, file: !561, line: 636, baseType: !719, size: 64, offset: 448)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !983, file: !561, line: 755, baseType: !1146, size: 704)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !561, line: 642, size: 704, elements: !1147)
!1147 = !{!1148, !1149, !1150, !1151}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1146, file: !561, line: 644, baseType: !1139, size: 512)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1146, file: !561, line: 648, baseType: !719, size: 64, offset: 512)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1146, file: !561, line: 652, baseType: !719, size: 64, offset: 576)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1146, file: !561, line: 653, baseType: !719, size: 64, offset: 640)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !983, file: !561, line: 756, baseType: !1153, size: 448)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !561, line: 663, size: 448, elements: !1154)
!1154 = !{!1155, !1156, !1157}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1153, file: !561, line: 665, baseType: !1047, size: 320)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1153, file: !561, line: 668, baseType: !719, size: 64, offset: 320)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1153, file: !561, line: 673, baseType: !719, size: 64, offset: 384)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !983, file: !561, line: 757, baseType: !1159, size: 384)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !561, line: 694, size: 384, elements: !1160)
!1160 = !{!1161, !1162}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1159, file: !561, line: 696, baseType: !1047, size: 320)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1159, file: !561, line: 699, baseType: !719, size: 64, offset: 320)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !983, file: !561, line: 758, baseType: !1164, size: 384)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !561, line: 681, size: 384, elements: !1165)
!1165 = !{!1166, !1167, !1168}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1164, file: !561, line: 683, baseType: !986, size: 256)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1164, file: !561, line: 686, baseType: !719, size: 64, offset: 256)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1164, file: !561, line: 689, baseType: !719, size: 64, offset: 320)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !983, file: !561, line: 759, baseType: !1170, size: 384)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !561, line: 707, size: 384, elements: !1171)
!1171 = !{!1172, !1173, !1174}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1170, file: !561, line: 709, baseType: !986, size: 256)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1170, file: !561, line: 712, baseType: !719, size: 64, offset: 256)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1170, file: !561, line: 712, baseType: !719, size: 64, offset: 320)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !983, file: !561, line: 760, baseType: !1176, size: 320)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !561, line: 718, size: 320, elements: !1177)
!1177 = !{!1178, !1179}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1176, file: !561, line: 720, baseType: !986, size: 256)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1176, file: !561, line: 723, baseType: !719, size: 64, offset: 256)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !978, file: !561, line: 138, baseType: !977, size: 64, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !978, file: !561, line: 139, baseType: !977, size: 64, offset: 128)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !973, file: !561, line: 146, baseType: !976, size: 64, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !973, file: !561, line: 152, baseType: !971, size: 64, offset: 128)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !968, file: !318, line: 130, baseType: !891, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !963, file: !318, line: 134, baseType: !645, size: 64, offset: 192)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !963, file: !318, line: 137, baseType: !719, size: 64, offset: 256)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !963, file: !318, line: 138, baseType: !841, size: 32, offset: 320)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !963, file: !318, line: 142, baseType: !7, size: 32, offset: 352)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !963, file: !318, line: 144, baseType: !641, size: 32, offset: 384)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !963, file: !318, line: 145, baseType: !641, size: 32, offset: 416)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !963, file: !318, line: 146, baseType: !1192, size: 64, offset: 448)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !318, line: 119, baseType: !683)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !946, file: !318, line: 220, baseType: !949, size: 64, offset: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !946, file: !318, line: 223, baseType: !645, size: 64, offset: 128)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !946, file: !318, line: 226, baseType: !1196, size: 64, offset: 192)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !318, line: 185, flags: DIFlagFwdDecl)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !946, file: !318, line: 229, baseType: !1199, size: 128, offset: 256)
!1199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1200, size: 128, elements: !667)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !318, line: 229, flags: DIFlagFwdDecl)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !946, file: !318, line: 232, baseType: !945, size: 64, offset: 384)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !946, file: !318, line: 233, baseType: !945, size: 64, offset: 448)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !946, file: !318, line: 238, baseType: !1205, size: 64, offset: 512)
!1205 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !318, line: 235, size: 64, elements: !1206)
!1206 = !{!1207, !1213}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1205, file: !318, line: 236, baseType: !1208, size: 64)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !318, line: 273, size: 128, elements: !1210)
!1210 = !{!1211, !1212}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1209, file: !318, line: 275, baseType: !971, size: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1209, file: !318, line: 278, baseType: !971, size: 64, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1205, file: !318, line: 237, baseType: !1214, size: 64)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !318, line: 259, size: 320, elements: !1216)
!1216 = !{!1217, !1218, !1219, !1220, !1221}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1215, file: !318, line: 261, baseType: !891, size: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1215, file: !318, line: 262, baseType: !891, size: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1215, file: !318, line: 266, baseType: !891, size: 64, offset: 128)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1215, file: !318, line: 267, baseType: !891, size: 64, offset: 192)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1215, file: !318, line: 270, baseType: !641, size: 32, offset: 256)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !946, file: !318, line: 241, baseType: !1192, size: 64, offset: 576)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !946, file: !318, line: 244, baseType: !641, size: 32, offset: 640)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !946, file: !318, line: 247, baseType: !641, size: 32, offset: 672)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !946, file: !318, line: 250, baseType: !641, size: 32, offset: 704)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !946, file: !318, line: 253, baseType: !641, size: 32, offset: 736)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !946, file: !318, line: 256, baseType: !641, size: 32, offset: 768)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !912, file: !894, line: 179, baseType: !1229, size: 64)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !894, line: 150, baseType: !1231)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !894, line: 142, size: 320, elements: !1232)
!1232 = !{!1233, !1234, !1235, !1236, !1239, !1240}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1231, file: !894, line: 144, baseType: !719, size: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1231, file: !894, line: 145, baseType: !891, size: 64, offset: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1231, file: !894, line: 146, baseType: !891, size: 64, offset: 128)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1231, file: !894, line: 147, baseType: !1237, size: 32, offset: 192)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1238, line: 31, baseType: !641)
!1238 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1231, file: !894, line: 148, baseType: !7, size: 32, offset: 224)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1231, file: !894, line: 149, baseType: !640, size: 8, offset: 256)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !912, file: !894, line: 180, baseType: !1242, size: 64)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !894, line: 162, baseType: !1244)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !894, line: 159, size: 128, elements: !1245)
!1245 = !{!1246, !1247}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1244, file: !894, line: 160, baseType: !719, size: 64)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1244, file: !894, line: 161, baseType: !683, size: 64, offset: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !912, file: !894, line: 181, baseType: !1249, size: 64)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64)
!1250 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !894, line: 181, flags: DIFlagFwdDecl)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !907, file: !894, line: 317, baseType: !1252, size: 64)
!1252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !683, size: 64, elements: !815)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !907, file: !894, line: 318, baseType: !1254, size: 320)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !894, line: 188, size: 320, elements: !1255)
!1255 = !{!1256, !1258, !1281}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1254, file: !894, line: 190, baseType: !1257, size: 192)
!1257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !911, size: 192, elements: !790)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1254, file: !894, line: 193, baseType: !1259, size: 64, offset: 192)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !894, line: 206, size: 320, elements: !1261)
!1261 = !{!1262, !1266, !1267, !1268, !1280}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1260, file: !894, line: 208, baseType: !1263, size: 64)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !649, line: 62, baseType: !1265)
!1265 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !649, line: 61, flags: DIFlagFwdDecl)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1260, file: !894, line: 211, baseType: !7, size: 32, offset: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1260, file: !894, line: 214, baseType: !683, size: 64, offset: 128)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1260, file: !894, line: 224, baseType: !1269, size: 64, offset: 192)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !894, line: 202, baseType: !1271)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !894, line: 202, size: 128, elements: !1272)
!1272 = !{!1273}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1271, file: !894, line: 202, baseType: !1274, size: 128)
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !894, line: 200, baseType: !1275)
!1275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !894, line: 200, size: 128, elements: !1276)
!1276 = !{!1277, !1278, !1279}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1275, file: !894, line: 200, baseType: !7, size: 32)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1275, file: !894, line: 200, baseType: !7, size: 32, offset: 32)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1275, file: !894, line: 200, baseType: !925, size: 64, offset: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1260, file: !894, line: 234, baseType: !1269, size: 64, offset: 256)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1254, file: !894, line: 197, baseType: !683, size: 64, offset: 256)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !907, file: !894, line: 319, baseType: !779, size: 256)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !907, file: !894, line: 320, baseType: !798, size: 192)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !721, file: !334, line: 3384, baseType: !1285, size: 1472)
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !334, line: 3114, size: 1472, elements: !1286)
!1286 = !{!1287, !1308, !1309, !1310, !1311}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1285, file: !334, line: 3115, baseType: !1288, size: 1216)
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !334, line: 2984, size: 1216, elements: !1289)
!1289 = !{!1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1288, file: !334, line: 2985, baseType: !887, size: 960)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1288, file: !334, line: 2986, baseType: !719, size: 64, offset: 960)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1288, file: !334, line: 2987, baseType: !719, size: 64, offset: 1024)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1288, file: !334, line: 2988, baseType: !719, size: 64, offset: 1088)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1288, file: !334, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1288, file: !334, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1288, file: !334, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1288, file: !334, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1288, file: !334, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1288, file: !334, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1288, file: !334, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1288, file: !334, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1288, file: !334, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1288, file: !334, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1288, file: !334, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1288, file: !334, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1288, file: !334, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1288, file: !334, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1285, file: !334, line: 3117, baseType: !719, size: 64, offset: 1216)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1285, file: !334, line: 3119, baseType: !719, size: 64, offset: 1280)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1285, file: !334, line: 3121, baseType: !719, size: 64, offset: 1344)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1285, file: !334, line: 3123, baseType: !719, size: 64, offset: 1408)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !721, file: !334, line: 3385, baseType: !1313, size: 1088)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !334, line: 2874, size: 1088, elements: !1314)
!1314 = !{!1315, !1316, !1317}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1313, file: !334, line: 2875, baseType: !887, size: 960)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1313, file: !334, line: 2876, baseType: !891, size: 64, offset: 960)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1313, file: !334, line: 2877, baseType: !1318, size: 64, offset: 1024)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64)
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1320, line: 172, size: 128, elements: !1321)
!1320 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1321 = !{!1322, !1323, !1324, !1325, !1326, !1327, !1328}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1319, file: !1320, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1319, file: !1320, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1319, file: !1320, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1319, file: !1320, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1319, file: !1320, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1319, file: !1320, line: 195, baseType: !7, size: 32, offset: 32)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1319, file: !1320, line: 199, baseType: !719, size: 64, offset: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !721, file: !334, line: 3386, baseType: !1288, size: 1216)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !721, file: !334, line: 3387, baseType: !1331, size: 1280)
!1331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !334, line: 3093, size: 1280, elements: !1332)
!1332 = !{!1333, !1334}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1331, file: !334, line: 3094, baseType: !1288, size: 1216)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1331, file: !334, line: 3095, baseType: !1318, size: 64, offset: 1216)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !721, file: !334, line: 3388, baseType: !1336, size: 1216)
!1336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !334, line: 2824, size: 1216, elements: !1337)
!1337 = !{!1338, !1339, !1340, !1341, !1342, !1343}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1336, file: !334, line: 2825, baseType: !849, size: 896)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1336, file: !334, line: 2827, baseType: !719, size: 64, offset: 896)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1336, file: !334, line: 2828, baseType: !719, size: 64, offset: 960)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1336, file: !334, line: 2829, baseType: !719, size: 64, offset: 1024)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1336, file: !334, line: 2830, baseType: !719, size: 64, offset: 1088)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1336, file: !334, line: 2831, baseType: !719, size: 64, offset: 1152)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !721, file: !334, line: 3389, baseType: !1345, size: 1024)
!1345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !334, line: 2850, size: 1024, elements: !1346)
!1346 = !{!1347, !1348, !1349}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1345, file: !334, line: 2851, baseType: !887, size: 960)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1345, file: !334, line: 2852, baseType: !641, size: 32, offset: 960)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1345, file: !334, line: 2853, baseType: !641, size: 32, offset: 992)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !721, file: !334, line: 3390, baseType: !1351, size: 1024)
!1351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !334, line: 2857, size: 1024, elements: !1352)
!1352 = !{!1353, !1354}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1351, file: !334, line: 2858, baseType: !887, size: 960)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1351, file: !334, line: 2859, baseType: !1318, size: 64, offset: 960)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !721, file: !334, line: 3391, baseType: !1356, size: 960)
!1356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !334, line: 2862, size: 960, elements: !1357)
!1357 = !{!1358}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1356, file: !334, line: 2863, baseType: !887, size: 960)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !721, file: !334, line: 3392, baseType: !1360, size: 1472)
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !334, line: 3304, size: 1472, elements: !1361)
!1361 = !{!1362}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1360, file: !334, line: 3305, baseType: !1285, size: 1472)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !721, file: !334, line: 3393, baseType: !1364, size: 1792)
!1364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !334, line: 3248, size: 1792, elements: !1365)
!1365 = !{!1366, !1367, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1364, file: !334, line: 3249, baseType: !1285, size: 1472)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1364, file: !334, line: 3251, baseType: !1368, size: 64, offset: 1472)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64)
!1369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1370, line: 463, size: 1152, elements: !1371)
!1370 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1371 = !{!1372, !1375, !1406, !1407, !1521, !1524, !1525, !1526, !1527, !1528, !1529, !1553, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1369, file: !1370, line: 464, baseType: !1373, size: 64)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64)
!1374 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1370, line: 464, flags: DIFlagFwdDecl)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1369, file: !1370, line: 467, baseType: !1376, size: 64, offset: 64)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !318, line: 374, size: 640, elements: !1378)
!1378 = !{!1379, !1381, !1382, !1395, !1396, !1397, !1398, !1399, !1400, !1402, !1404, !1405}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1377, file: !318, line: 377, baseType: !1380, size: 64)
!1380 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !649, line: 111, baseType: !945)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1377, file: !318, line: 378, baseType: !1380, size: 64, offset: 64)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1377, file: !318, line: 381, baseType: !1383, size: 64, offset: 128)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64)
!1384 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !318, line: 282, baseType: !1385)
!1385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !318, line: 282, size: 128, elements: !1386)
!1386 = !{!1387}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1385, file: !318, line: 282, baseType: !1388, size: 128)
!1388 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !318, line: 281, baseType: !1389)
!1389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !318, line: 281, size: 128, elements: !1390)
!1390 = !{!1391, !1392, !1393}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1389, file: !318, line: 281, baseType: !7, size: 32)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1389, file: !318, line: 281, baseType: !7, size: 32, offset: 32)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1389, file: !318, line: 281, baseType: !1394, size: 64, offset: 64)
!1394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1380, size: 64, elements: !815)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1377, file: !318, line: 384, baseType: !641, size: 32, offset: 192)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1377, file: !318, line: 387, baseType: !641, size: 32, offset: 224)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1377, file: !318, line: 390, baseType: !641, size: 32, offset: 256)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1377, file: !318, line: 394, baseType: !1383, size: 64, offset: 320)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1377, file: !318, line: 396, baseType: !317, size: 32, offset: 384)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1377, file: !318, line: 399, baseType: !1401, size: 64, offset: 416)
!1401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 64, elements: !667)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1377, file: !318, line: 402, baseType: !1403, size: 64, offset: 480)
!1403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !667)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1377, file: !318, line: 406, baseType: !641, size: 32, offset: 544)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1377, file: !318, line: 409, baseType: !641, size: 32, offset: 576)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1369, file: !1370, line: 470, baseType: !972, size: 64, offset: 128)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1369, file: !1370, line: 473, baseType: !1408, size: 64, offset: 192)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64)
!1409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1320, line: 39, size: 1152, elements: !1410)
!1410 = !{!1411, !1461, !1474, !1486, !1487, !1498, !1499, !1503, !1504, !1505, !1506, !1507}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1409, file: !1320, line: 41, baseType: !1412, size: 64)
!1412 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1413, line: 144, baseType: !1414)
!1413 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64)
!1415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1413, line: 100, size: 896, elements: !1416)
!1416 = !{!1417, !1425, !1430, !1435, !1437, !1438, !1439, !1440, !1441, !1442, !1447, !1449, !1450, !1455, !1460}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1415, file: !1413, line: 102, baseType: !1418, size: 64)
!1418 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1413, line: 52, baseType: !1419)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64)
!1420 = !DISubroutineType(types: !1421)
!1421 = !{!1422, !1423}
!1422 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1413, line: 47, baseType: !7)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64)
!1424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1415, file: !1413, line: 105, baseType: !1426, size: 64, offset: 64)
!1426 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1413, line: 59, baseType: !1427)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64)
