; ModuleID = 'tree-eh.bc'
source_filename = "tree-eh.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type { %struct.eh_region_d*, %struct.VEC_eh_region_gc*, %struct.VEC_eh_landing_pad_gc*, %struct.htab*, %struct.VEC_tree_gc*, %union.eh_status_u }
%struct.eh_region_d = type { %struct.eh_region_d*, %struct.eh_region_d*, %struct.eh_region_d*, i32, i32, %union.eh_region_u, %struct.eh_landing_pad_d*, %struct.rtx_def*, %struct.rtx_def*, i8 }
%union.eh_region_u = type { %struct.eh_region_u_allowed }
%struct.eh_region_u_allowed = type { %union.tree_node*, %union.tree_node*, i32 }
%struct.eh_landing_pad_d = type { %struct.eh_landing_pad_d*, %struct.eh_region_d*, %union.tree_node*, %struct.rtx_def*, i32 }

!605 = !DIEnumerator(name: "GIMPLE_RETURN", value: 9, isUnsigned: true)
!606 = !DIEnumerator(name: "GIMPLE_BIND", value: 10, isUnsigned: true)
!607 = !DIEnumerator(name: "GIMPLE_CATCH", value: 11, isUnsigned: true)
!608 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!609 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!610 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!611 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!612 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!613 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!614 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!615 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!616 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!617 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!618 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!619 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!620 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!621 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!622 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!623 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!624 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!625 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!626 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!627 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!628 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!629 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!630 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!631 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!632 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_try_flags", file: !568, line: 514, baseType: !7, size: 32, elements: !633)
!633 = !{!634, !635, !636, !637}
!634 = !DIEnumerator(name: "GIMPLE_TRY_CATCH", value: 1, isUnsigned: true)
!635 = !DIEnumerator(name: "GIMPLE_TRY_FINALLY", value: 2, isUnsigned: true)
!636 = !DIEnumerator(name: "GIMPLE_TRY_KIND", value: 3, isUnsigned: true)
!637 = !DIEnumerator(name: "GIMPLE_TRY_CATCH_IS_CLEANUP", value: 4, isUnsigned: true)
!638 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !568, line: 80, baseType: !7, size: 32, elements: !639)
!639 = !{!640, !641, !642, !643}
!640 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!641 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!642 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!643 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!644 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ssa_op_iter_type", file: !645, line: 119, baseType: !7, size: 32, elements: !646)
!645 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!646 = !{!647, !648, !649, !650}
!647 = !DIEnumerator(name: "ssa_op_iter_none", value: 0, isUnsigned: true)
!648 = !DIEnumerator(name: "ssa_op_iter_tree", value: 1, isUnsigned: true)
!649 = !DIEnumerator(name: "ssa_op_iter_use", value: 2, isUnsigned: true)
!650 = !DIEnumerator(name: "ssa_op_iter_def", value: 3, isUnsigned: true)
!651 = !{!652, !653, !654, !655, !658, !659, !661, !847, !141, !1180, !1106, !2057, !1208, !1328, !667, !2059, !1355, !656, !2061, !632, !2072, !7, !2077, !686, !2085, !2141, !638, !801, !2142}
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!654 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !657)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "throw_stmt_node", file: !6, line: 344, size: 128, elements: !663)
!663 = !{!664, !2056}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !662, file: !6, line: 345, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !666, line: 58, baseType: !667)
!666 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !568, line: 737, size: 768, elements: !669)
!669 = !{!670, !1903, !1913, !1919, !1924, !1929, !1936, !1942, !1948, !1953, !1967, !1972, !1978, !1983, !1993, !1998, !2014, !2021, !2028, !2034, !2039, !2045, !2051}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !668, file: !568, line: 738, baseType: !671, size: 256)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !568, line: 271, size: 256, elements: !672)
!672 = !{!673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !688, !689, !1902}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !671, file: !568, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !671, file: !568, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !671, file: !568, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !671, file: !568, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !671, file: !568, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !671, file: !568, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !671, file: !568, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !671, file: !568, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !671, file: !568, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !671, file: !568, line: 312, baseType: !7, size: 32, offset: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !671, file: !568, line: 316, baseType: !684, size: 32, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !685, line: 58, baseType: !686)
!685 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !687, line: 44, baseType: !7)
!687 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!688 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !671, file: !568, line: 319, baseType: !7, size: 32, offset: 96)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !671, file: !568, line: 323, baseType: !690, size: 64, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !369, line: 217, size: 832, elements: !692)
!692 = !{!693, !1867, !1868, !1869, !1872, !1876, !1877, !1878, !1896, !1897, !1898, !1899, !1900, !1901}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !691, file: !369, line: 219, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !369, line: 151, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !369, line: 151, size: 128, elements: !697)
!697 = !{!698}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !696, file: !369, line: 151, baseType: !699, size: 128)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !369, line: 150, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !369, line: 150, size: 128, elements: !701)
!701 = !{!702, !703, !704}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !700, file: !369, line: 150, baseType: !7, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !700, file: !369, line: 150, baseType: !7, size: 32, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !700, file: !369, line: 150, baseType: !705, size: 64, offset: 64)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !706, size: 64, elements: !766)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !666, line: 108, baseType: !707)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !369, line: 122, size: 512, elements: !709)
!709 = !{!710, !711, !712, !1859, !1860, !1861, !1862, !1863, !1864, !1865}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !708, file: !369, line: 124, baseType: !690, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !708, file: !369, line: 125, baseType: !690, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !708, file: !369, line: 131, baseType: !713, size: 64, offset: 128)
!713 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !369, line: 128, size: 64, elements: !714)
!714 = !{!715, !730}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !713, file: !369, line: 129, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !666, line: 66, baseType: !717)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !568, line: 143, size: 192, elements: !719)
!719 = !{!720, !728, !729}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !718, file: !568, line: 145, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !666, line: 69, baseType: !722)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !568, line: 136, size: 192, elements: !724)
!724 = !{!725, !726, !727}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !723, file: !568, line: 137, baseType: !665, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !723, file: !568, line: 138, baseType: !722, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !723, file: !568, line: 139, baseType: !722, size: 64, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !718, file: !568, line: 146, baseType: !721, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !718, file: !568, line: 152, baseType: !716, size: 64, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !713, file: !369, line: 130, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !666, line: 50, baseType: !732)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !734, line: 240, size: 384, elements: !735)
!734 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!735 = !{!736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !733, file: !734, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !733, file: !734, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !733, file: !734, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !733, file: !734, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !733, file: !734, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !733, file: !734, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !733, file: !734, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !733, file: !734, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !733, file: !734, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !733, file: !734, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !733, file: !734, line: 321, baseType: !747, size: 320, offset: 64)
!747 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !734, line: 315, size: 320, elements: !748)
!748 = !{!749, !1826, !1828, !1857, !1858}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !747, file: !734, line: 316, baseType: !750, size: 64)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !751, size: 64, elements: !766)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !734, line: 183, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !734, line: 166, size: 64, elements: !753)
!753 = !{!754, !755, !756, !757, !758, !768, !769, !781, !784, !846, !1804, !1805, !1816, !1823}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !752, file: !734, line: 168, baseType: !654, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !752, file: !734, line: 169, baseType: !7, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !752, file: !734, line: 170, baseType: !659, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !752, file: !734, line: 171, baseType: !731, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !752, file: !734, line: 172, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !666, line: 53, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !734, line: 359, size: 128, elements: !762)
!762 = !{!763, !764}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !761, file: !734, line: 360, baseType: !654, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !761, file: !734, line: 361, baseType: !765, size: 64, offset: 64)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !731, size: 64, elements: !766)
!766 = !{!767}
!767 = !DISubrange(count: 1)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !752, file: !734, line: 173, baseType: !13, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !752, file: !734, line: 174, baseType: !770, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !734, line: 133, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !734, line: 115, size: 32, elements: !772)
!772 = !{!773, !774, !775, !776, !777, !778, !779, !780}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !771, file: !734, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !771, file: !734, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !771, file: !734, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !771, file: !734, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !771, file: !734, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !771, file: !734, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !771, file: !734, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !771, file: !734, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !752, file: !734, line: 175, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !734, line: 175, flags: DIFlagFwdDecl)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !752, file: !734, line: 176, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !787, line: 75, size: 256, elements: !788)
!787 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!788 = !{!789, !804, !805, !806}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !786, file: !787, line: 76, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !787, line: 68, baseType: !792)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !787, line: 63, size: 320, elements: !793)
!793 = !{!794, !796, !797, !798}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !792, file: !787, line: 64, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !792, file: !787, line: 65, baseType: !795, size: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !792, file: !787, line: 66, baseType: !7, size: 32, offset: 128)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !792, file: !787, line: 67, baseType: !799, size: 128, offset: 192)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 128, elements: !802)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !787, line: 29, baseType: !801)
!801 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!802 = !{!803}
!803 = !DISubrange(count: 2)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !786, file: !787, line: 77, baseType: !790, size: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !786, file: !787, line: 78, baseType: !7, size: 32, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !786, file: !787, line: 79, baseType: !807, size: 64, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !787, line: 49, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !787, line: 45, size: 832, elements: !810)
!810 = !{!811, !812, !813}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !809, file: !787, line: 46, baseType: !795, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !809, file: !787, line: 47, baseType: !785, size: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !809, file: !787, line: 48, baseType: !814, size: 704, offset: 128)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !815, line: 164, size: 704, elements: !816)
!815 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!816 = !{!817, !819, !829, !830, !831, !832, !833, !834, !838, !842, !843, !844, !845}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !814, file: !815, line: 166, baseType: !818, size: 64)
!818 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !814, file: !815, line: 167, baseType: !820, size: 64, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !815, line: 157, size: 192, elements: !822)
!822 = !{!823, !824, !825}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !821, file: !815, line: 159, baseType: !656, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !821, file: !815, line: 160, baseType: !820, size: 64, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !821, file: !815, line: 161, baseType: !826, size: 32, offset: 128)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !657, size: 32, elements: !827)
!827 = !{!828}
!828 = !DISubrange(count: 4)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !814, file: !815, line: 168, baseType: !656, size: 64, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !814, file: !815, line: 169, baseType: !656, size: 64, offset: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !814, file: !815, line: 170, baseType: !656, size: 64, offset: 256)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !814, file: !815, line: 171, baseType: !818, size: 64, offset: 320)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !814, file: !815, line: 172, baseType: !654, size: 32, offset: 384)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !814, file: !815, line: 176, baseType: !835, size: 64, offset: 448)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!820, !658, !818}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !814, file: !815, line: 177, baseType: !839, size: 64, offset: 512)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{null, !658, !820}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !814, file: !815, line: 178, baseType: !658, size: 64, offset: 576)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !814, file: !815, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !814, file: !815, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !814, file: !815, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !752, file: !734, line: 177, baseType: !847, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !666, line: 56, baseType: !848)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !142, line: 3371, size: 1792, elements: !850)
!850 = !{!851, !884, !890, !901, !920, !931, !936, !943, !949, !962, !970, !1008, !1013, !1041, !1058, !1059, !1064, !1073, !1079, !1084, !1088, !1092, !1453, !1502, !1508, !1514, !1521, !1534, !1548, !1565, !1577, !1599, !1614, !1786}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !849, file: !142, line: 3372, baseType: !852, size: 64)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !142, line: 360, size: 64, elements: !853)
!853 = !{!854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !852, file: !142, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !852, file: !142, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !852, file: !142, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !852, file: !142, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !852, file: !142, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !852, file: !142, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !852, file: !142, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !852, file: !142, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !852, file: !142, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !852, file: !142, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !852, file: !142, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !852, file: !142, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !852, file: !142, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !852, file: !142, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !852, file: !142, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !852, file: !142, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !852, file: !142, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !852, file: !142, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !852, file: !142, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !852, file: !142, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !852, file: !142, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !852, file: !142, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !852, file: !142, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !852, file: !142, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !852, file: !142, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !852, file: !142, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !852, file: !142, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !852, file: !142, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !852, file: !142, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !852, file: !142, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !849, file: !142, line: 3373, baseType: !885, size: 192)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !142, line: 402, size: 192, elements: !886)
!886 = !{!887, !888, !889}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !885, file: !142, line: 403, baseType: !852, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !885, file: !142, line: 404, baseType: !847, size: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !885, file: !142, line: 405, baseType: !847, size: 64, offset: 128)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !849, file: !142, line: 3374, baseType: !891, size: 320)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !142, line: 1384, size: 320, elements: !892)
!892 = !{!893, !894}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !891, file: !142, line: 1385, baseType: !885, size: 192)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !891, file: !142, line: 1386, baseType: !895, size: 128, offset: 192)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !896, line: 58, baseType: !897)
!896 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !896, line: 54, size: 128, elements: !898)
!898 = !{!899, !900}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !897, file: !896, line: 56, baseType: !801, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !897, file: !896, line: 57, baseType: !818, size: 64, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !849, file: !142, line: 3375, baseType: !902, size: 256)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !142, line: 1397, size: 256, elements: !903)
!903 = !{!904, !905}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !902, file: !142, line: 1398, baseType: !885, size: 192)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !902, file: !142, line: 1399, baseType: !906, size: 64, offset: 192)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !908, line: 52, size: 256, elements: !909)
!908 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!909 = !{!910, !911, !912, !913, !914, !915, !916}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !907, file: !908, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !907, file: !908, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !907, file: !908, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !907, file: !908, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !907, file: !908, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !907, file: !908, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !907, file: !908, line: 62, baseType: !917, size: 192, offset: 64)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !801, size: 192, elements: !918)
!918 = !{!919}
!919 = !DISubrange(count: 3)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !849, file: !142, line: 3376, baseType: !921, size: 256)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !142, line: 1408, size: 256, elements: !922)
!922 = !{!923, !924}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !921, file: !142, line: 1409, baseType: !885, size: 192)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !921, file: !142, line: 1410, baseType: !925, size: 64, offset: 192)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !927, line: 27, size: 192, elements: !928)
!927 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !926, file: !927, line: 29, baseType: !895, size: 128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !926, file: !927, line: 30, baseType: !13, size: 32, offset: 128)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !849, file: !142, line: 3377, baseType: !932, size: 256)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !142, line: 1437, size: 256, elements: !933)
!933 = !{!934, !935}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !932, file: !142, line: 1438, baseType: !885, size: 192)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !932, file: !142, line: 1439, baseType: !847, size: 64, offset: 192)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !849, file: !142, line: 3378, baseType: !937, size: 256)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !142, line: 1418, size: 256, elements: !938)
!938 = !{!939, !940, !941}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !937, file: !142, line: 1419, baseType: !885, size: 192)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !937, file: !142, line: 1420, baseType: !654, size: 32, offset: 192)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !937, file: !142, line: 1421, baseType: !942, size: 8, offset: 224)
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !657, size: 8, elements: !766)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !849, file: !142, line: 3379, baseType: !944, size: 320)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !142, line: 1428, size: 320, elements: !945)
!945 = !{!946, !947, !948}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !944, file: !142, line: 1429, baseType: !885, size: 192)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !944, file: !142, line: 1430, baseType: !847, size: 64, offset: 192)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !944, file: !142, line: 1431, baseType: !847, size: 64, offset: 256)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !849, file: !142, line: 3380, baseType: !950, size: 320)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !142, line: 1460, size: 320, elements: !951)
!951 = !{!952, !953}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !950, file: !142, line: 1461, baseType: !885, size: 192)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !950, file: !142, line: 1462, baseType: !954, size: 128, offset: 192)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !955, line: 31, size: 128, elements: !956)
!955 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!956 = !{!957, !960, !961}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !954, file: !955, line: 32, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !653)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !954, file: !955, line: 33, baseType: !7, size: 32, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !954, file: !955, line: 34, baseType: !7, size: 32, offset: 96)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !849, file: !142, line: 3381, baseType: !963, size: 384)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !142, line: 2507, size: 384, elements: !964)
!964 = !{!965, !966, !967, !968, !969}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !963, file: !142, line: 2508, baseType: !885, size: 192)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !963, file: !142, line: 2509, baseType: !684, size: 32, offset: 192)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !963, file: !142, line: 2510, baseType: !7, size: 32, offset: 224)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !963, file: !142, line: 2511, baseType: !847, size: 64, offset: 256)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !963, file: !142, line: 2512, baseType: !847, size: 64, offset: 320)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !849, file: !142, line: 3382, baseType: !971, size: 896)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !142, line: 2652, size: 896, elements: !972)
!972 = !{!973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !971, file: !142, line: 2653, baseType: !963, size: 384)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !971, file: !142, line: 2654, baseType: !847, size: 64, offset: 384)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !971, file: !142, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !971, file: !142, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !971, file: !142, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !971, file: !142, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !971, file: !142, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !971, file: !142, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !971, file: !142, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !971, file: !142, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !971, file: !142, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !971, file: !142, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !971, file: !142, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !971, file: !142, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !971, file: !142, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !971, file: !142, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !971, file: !142, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !971, file: !142, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !971, file: !142, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !971, file: !142, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !971, file: !142, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !971, file: !142, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !971, file: !142, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !971, file: !142, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !971, file: !142, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !971, file: !142, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !971, file: !142, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !971, file: !142, line: 2703, baseType: !7, size: 32, offset: 512)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !971, file: !142, line: 2705, baseType: !847, size: 64, offset: 576)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !971, file: !142, line: 2706, baseType: !847, size: 64, offset: 640)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !971, file: !142, line: 2707, baseType: !847, size: 64, offset: 704)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !971, file: !142, line: 2708, baseType: !847, size: 64, offset: 768)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !971, file: !142, line: 2711, baseType: !1006, size: 64, offset: 832)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !142, line: 2711, flags: DIFlagFwdDecl)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !849, file: !142, line: 3383, baseType: !1009, size: 960)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !142, line: 2756, size: 960, elements: !1010)
!1010 = !{!1011, !1012}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1009, file: !142, line: 2757, baseType: !971, size: 896)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1009, file: !142, line: 2758, baseType: !731, size: 64, offset: 896)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !849, file: !142, line: 3384, baseType: !1014, size: 1472)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !142, line: 3114, size: 1472, elements: !1015)
!1015 = !{!1016, !1037, !1038, !1039, !1040}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1014, file: !142, line: 3115, baseType: !1017, size: 1216)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !142, line: 2984, size: 1216, elements: !1018)
!1018 = !{!1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1017, file: !142, line: 2985, baseType: !1009, size: 960)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1017, file: !142, line: 2986, baseType: !847, size: 64, offset: 960)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1017, file: !142, line: 2987, baseType: !847, size: 64, offset: 1024)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1017, file: !142, line: 2988, baseType: !847, size: 64, offset: 1088)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1017, file: !142, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1017, file: !142, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1017, file: !142, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1017, file: !142, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1017, file: !142, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1017, file: !142, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1017, file: !142, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1017, file: !142, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1017, file: !142, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1017, file: !142, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1017, file: !142, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1017, file: !142, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1017, file: !142, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1017, file: !142, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1014, file: !142, line: 3117, baseType: !847, size: 64, offset: 1216)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1014, file: !142, line: 3119, baseType: !847, size: 64, offset: 1280)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1014, file: !142, line: 3121, baseType: !847, size: 64, offset: 1344)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1014, file: !142, line: 3123, baseType: !847, size: 64, offset: 1408)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !849, file: !142, line: 3385, baseType: !1042, size: 1088)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !142, line: 2874, size: 1088, elements: !1043)
!1043 = !{!1044, !1045, !1046}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1042, file: !142, line: 2875, baseType: !1009, size: 960)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1042, file: !142, line: 2876, baseType: !731, size: 64, offset: 960)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1042, file: !142, line: 2877, baseType: !1047, size: 64, offset: 1024)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1049, line: 172, size: 128, elements: !1050)
!1049 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1050 = !{!1051, !1052, !1053, !1054, !1055, !1056, !1057}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1048, file: !1049, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1048, file: !1049, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1048, file: !1049, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1048, file: !1049, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1048, file: !1049, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1048, file: !1049, line: 195, baseType: !7, size: 32, offset: 32)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1048, file: !1049, line: 199, baseType: !847, size: 64, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !849, file: !142, line: 3386, baseType: !1017, size: 1216)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !849, file: !142, line: 3387, baseType: !1060, size: 1280)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !142, line: 3093, size: 1280, elements: !1061)
!1061 = !{!1062, !1063}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1060, file: !142, line: 3094, baseType: !1017, size: 1216)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1060, file: !142, line: 3095, baseType: !1047, size: 64, offset: 1216)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !849, file: !142, line: 3388, baseType: !1065, size: 1216)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !142, line: 2824, size: 1216, elements: !1066)
!1066 = !{!1067, !1068, !1069, !1070, !1071, !1072}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1065, file: !142, line: 2825, baseType: !971, size: 896)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1065, file: !142, line: 2827, baseType: !847, size: 64, offset: 896)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1065, file: !142, line: 2828, baseType: !847, size: 64, offset: 960)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1065, file: !142, line: 2829, baseType: !847, size: 64, offset: 1024)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1065, file: !142, line: 2830, baseType: !847, size: 64, offset: 1088)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1065, file: !142, line: 2831, baseType: !847, size: 64, offset: 1152)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !849, file: !142, line: 3389, baseType: !1074, size: 1024)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !142, line: 2850, size: 1024, elements: !1075)
!1075 = !{!1076, !1077, !1078}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1074, file: !142, line: 2851, baseType: !1009, size: 960)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1074, file: !142, line: 2852, baseType: !654, size: 32, offset: 960)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1074, file: !142, line: 2853, baseType: !654, size: 32, offset: 992)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !849, file: !142, line: 3390, baseType: !1080, size: 1024)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !142, line: 2857, size: 1024, elements: !1081)
!1081 = !{!1082, !1083}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1080, file: !142, line: 2858, baseType: !1009, size: 960)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1080, file: !142, line: 2859, baseType: !1047, size: 64, offset: 960)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !849, file: !142, line: 3391, baseType: !1085, size: 960)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !142, line: 2862, size: 960, elements: !1086)
!1086 = !{!1087}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1085, file: !142, line: 2863, baseType: !1009, size: 960)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !849, file: !142, line: 3392, baseType: !1089, size: 1472)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !142, line: 3304, size: 1472, elements: !1090)
!1090 = !{!1091}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1089, file: !142, line: 3305, baseType: !1014, size: 1472)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !849, file: !142, line: 3393, baseType: !1093, size: 1792)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !142, line: 3248, size: 1792, elements: !1094)
!1094 = !{!1095, !1096, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1093, file: !142, line: 3249, baseType: !1014, size: 1472)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1093, file: !142, line: 3251, baseType: !1097, size: 64, offset: 1472)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1099, line: 463, size: 1152, elements: !1100)
!1099 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1100 = !{!1101, !1265, !1296, !1297, !1373, !1376, !1377, !1378, !1379, !1380, !1381, !1405, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1098, file: !1099, line: 464, baseType: !1102, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !6, line: 194, size: 384, elements: !1104)
!1104 = !{!1105, !1154, !1167, !1181, !1233, !1246}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1103, file: !6, line: 197, baseType: !1106, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !6, line: 182, baseType: !1107)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !6, line: 116, size: 704, elements: !1109)
!1109 = !{!1110, !1111, !1112, !1113, !1114, !1115, !1142, !1151, !1152, !1153}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1108, file: !6, line: 119, baseType: !1107, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1108, file: !6, line: 122, baseType: !1107, size: 64, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1108, file: !6, line: 123, baseType: !1107, size: 64, offset: 128)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1108, file: !6, line: 126, baseType: !654, size: 32, offset: 192)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1108, file: !6, line: 129, baseType: !5, size: 32, offset: 224)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1108, file: !6, line: 165, baseType: !1116, size: 192, offset: 256)
!1116 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !6, line: 132, size: 192, elements: !1117)
!1117 = !{!1118, !1131, !1137}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1116, file: !6, line: 137, baseType: !1119, size: 128)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !6, line: 133, size: 128, elements: !1120)
!1120 = !{!1121, !1130}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1119, file: !6, line: 135, baseType: !1122, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !6, line: 93, size: 320, elements: !1124)
!1124 = !{!1125, !1126, !1127, !1128, !1129}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1123, file: !6, line: 96, baseType: !1122, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1123, file: !6, line: 97, baseType: !1122, size: 64, offset: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1123, file: !6, line: 101, baseType: !847, size: 64, offset: 128)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1123, file: !6, line: 106, baseType: !847, size: 64, offset: 192)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1123, file: !6, line: 111, baseType: !847, size: 64, offset: 256)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1119, file: !6, line: 136, baseType: !1122, size: 64, offset: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1116, file: !6, line: 151, baseType: !1132, size: 192)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !6, line: 139, size: 192, elements: !1133)
!1133 = !{!1134, !1135, !1136}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1132, file: !6, line: 141, baseType: !847, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1132, file: !6, line: 145, baseType: !847, size: 64, offset: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1132, file: !6, line: 150, baseType: !654, size: 32, offset: 128)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1116, file: !6, line: 164, baseType: !1138, size: 128)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !6, line: 153, size: 128, elements: !1139)
!1139 = !{!1140, !1141}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1138, file: !6, line: 161, baseType: !847, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1138, file: !6, line: 163, baseType: !684, size: 32, offset: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1108, file: !6, line: 168, baseType: !1143, size: 64, offset: 448)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !6, line: 67, size: 320, elements: !1145)
!1145 = !{!1146, !1147, !1148, !1149, !1150}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1144, file: !6, line: 70, baseType: !1143, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1144, file: !6, line: 73, baseType: !1107, size: 64, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1144, file: !6, line: 78, baseType: !847, size: 64, offset: 128)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1144, file: !6, line: 85, baseType: !731, size: 64, offset: 192)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1144, file: !6, line: 88, baseType: !654, size: 32, offset: 256)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1108, file: !6, line: 173, baseType: !731, size: 64, offset: 512)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1108, file: !6, line: 173, baseType: !731, size: 64, offset: 576)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1108, file: !6, line: 177, baseType: !653, size: 8, offset: 640)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1103, file: !6, line: 200, baseType: !1155, size: 64, offset: 64)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !6, line: 185, baseType: !1157)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !6, line: 185, size: 128, elements: !1158)
!1158 = !{!1159}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1157, file: !6, line: 185, baseType: !1160, size: 128)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !6, line: 184, baseType: !1161)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !6, line: 184, size: 128, elements: !1162)
!1162 = !{!1163, !1164, !1165}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1161, file: !6, line: 184, baseType: !7, size: 32)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1161, file: !6, line: 184, baseType: !7, size: 32, offset: 32)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1161, file: !6, line: 184, baseType: !1166, size: 64, offset: 64)
!1166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1106, size: 64, elements: !766)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1103, file: !6, line: 203, baseType: !1168, size: 64, offset: 128)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !6, line: 189, baseType: !1170)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !6, line: 189, size: 128, elements: !1171)
!1171 = !{!1172}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1170, file: !6, line: 189, baseType: !1173, size: 128)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !6, line: 188, baseType: !1174)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !6, line: 188, size: 128, elements: !1175)
!1175 = !{!1176, !1177, !1178}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1174, file: !6, line: 188, baseType: !7, size: 32)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1174, file: !6, line: 188, baseType: !7, size: 32, offset: 32)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1174, file: !6, line: 188, baseType: !1179, size: 64, offset: 64)
!1179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1180, size: 64, elements: !766)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !6, line: 180, baseType: !1143)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1103, file: !6, line: 207, baseType: !1182, size: 64, offset: 192)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1183, line: 144, baseType: !1184)
!1183 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1183, line: 100, size: 896, elements: !1186)
!1186 = !{!1187, !1195, !1200, !1205, !1207, !1210, !1211, !1212, !1213, !1214, !1219, !1221, !1222, !1227, !1232}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1185, file: !1183, line: 102, baseType: !1188, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1183, line: 52, baseType: !1189)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DISubroutineType(types: !1191)
!1191 = !{!1192, !1193}
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1183, line: 47, baseType: !7)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1185, file: !1183, line: 105, baseType: !1196, size: 64, offset: 64)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1183, line: 59, baseType: !1197)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{!654, !1193, !1193}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1185, file: !1183, line: 108, baseType: !1201, size: 64, offset: 128)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1183, line: 63, baseType: !1202)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{null, !658}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1185, file: !1183, line: 111, baseType: !1206, size: 64, offset: 192)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1185, file: !1183, line: 114, baseType: !1208, size: 64, offset: 256)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1209, line: 46, baseType: !801)
!1209 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1185, file: !1183, line: 117, baseType: !1208, size: 64, offset: 320)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1185, file: !1183, line: 120, baseType: !1208, size: 64, offset: 384)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1185, file: !1183, line: 124, baseType: !7, size: 32, offset: 448)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1185, file: !1183, line: 128, baseType: !7, size: 32, offset: 480)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1185, file: !1183, line: 131, baseType: !1215, size: 64, offset: 512)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1183, line: 75, baseType: !1216)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DISubroutineType(types: !1218)
!1218 = !{!658, !1208, !1208}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1185, file: !1183, line: 132, baseType: !1220, size: 64, offset: 576)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1183, line: 78, baseType: !1202)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1185, file: !1183, line: 135, baseType: !658, size: 64, offset: 640)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1185, file: !1183, line: 136, baseType: !1223, size: 64, offset: 704)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1183, line: 82, baseType: !1224)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{!658, !658, !1208, !1208}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1185, file: !1183, line: 137, baseType: !1228, size: 64, offset: 768)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1183, line: 83, baseType: !1229)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = !DISubroutineType(types: !1231)
!1231 = !{null, !658, !658}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1185, file: !1183, line: 141, baseType: !7, size: 32, offset: 832)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1103, file: !6, line: 211, baseType: !1234, size: 64, offset: 256)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !142, line: 183, baseType: !1236)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !142, line: 183, size: 128, elements: !1237)
!1237 = !{!1238}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1236, file: !142, line: 183, baseType: !1239, size: 128)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !142, line: 182, baseType: !1240)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !142, line: 182, size: 128, elements: !1241)
!1241 = !{!1242, !1243, !1244}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1240, file: !142, line: 182, baseType: !7, size: 32)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1240, file: !142, line: 182, baseType: !7, size: 32, offset: 32)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1240, file: !142, line: 182, baseType: !1245, size: 64, offset: 64)
!1245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !847, size: 64, elements: !766)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1103, file: !6, line: 220, baseType: !1247, size: 64, offset: 320)
!1247 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !6, line: 217, size: 64, elements: !1248)
!1248 = !{!1249, !1250}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1247, file: !6, line: 218, baseType: !1234, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1247, file: !6, line: 219, baseType: !1251, size: 64)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1253, line: 29, baseType: !1254)
!1253 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1253, line: 29, size: 96, elements: !1255)
!1255 = !{!1256}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1254, file: !1253, line: 29, baseType: !1257, size: 96)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1253, line: 27, baseType: !1258)
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1253, line: 27, size: 96, elements: !1259)
!1259 = !{!1260, !1261, !1262}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1258, file: !1253, line: 27, baseType: !7, size: 32)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1258, file: !1253, line: 27, baseType: !7, size: 32, offset: 32)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1258, file: !1253, line: 27, baseType: !1263, size: 8, offset: 64)
!1263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1264, size: 8, elements: !766)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1253, line: 26, baseType: !653)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1098, file: !1099, line: 467, baseType: !1266, size: 64, offset: 64)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !369, line: 374, size: 640, elements: !1268)
!1268 = !{!1269, !1271, !1272, !1285, !1286, !1287, !1288, !1289, !1290, !1292, !1294, !1295}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1267, file: !369, line: 377, baseType: !1270, size: 64)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !666, line: 111, baseType: !690)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1267, file: !369, line: 378, baseType: !1270, size: 64, offset: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1267, file: !369, line: 381, baseType: !1273, size: 64, offset: 128)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !369, line: 282, baseType: !1275)
!1275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !369, line: 282, size: 128, elements: !1276)
!1276 = !{!1277}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1275, file: !369, line: 282, baseType: !1278, size: 128)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !369, line: 281, baseType: !1279)
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !369, line: 281, size: 128, elements: !1280)
!1280 = !{!1281, !1282, !1283}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1279, file: !369, line: 281, baseType: !7, size: 32)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1279, file: !369, line: 281, baseType: !7, size: 32, offset: 32)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1279, file: !369, line: 281, baseType: !1284, size: 64, offset: 64)
!1284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1270, size: 64, elements: !766)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1267, file: !369, line: 384, baseType: !654, size: 32, offset: 192)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1267, file: !369, line: 387, baseType: !654, size: 32, offset: 224)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1267, file: !369, line: 390, baseType: !654, size: 32, offset: 256)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1267, file: !369, line: 394, baseType: !1273, size: 64, offset: 320)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1267, file: !369, line: 396, baseType: !368, size: 32, offset: 384)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1267, file: !369, line: 399, baseType: !1291, size: 64, offset: 416)
!1291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !374, size: 64, elements: !802)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1267, file: !369, line: 402, baseType: !1293, size: 64, offset: 480)
!1293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !802)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1267, file: !369, line: 406, baseType: !654, size: 32, offset: 544)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1267, file: !369, line: 409, baseType: !654, size: 32, offset: 576)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1098, file: !1099, line: 470, baseType: !717, size: 64, offset: 128)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1098, file: !1099, line: 473, baseType: !1298, size: 64, offset: 192)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64)
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1049, line: 39, size: 1152, elements: !1300)
!1300 = !{!1301, !1302, !1315, !1316, !1317, !1329, !1330, !1333, !1334, !1335, !1336, !1337}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1299, file: !1049, line: 41, baseType: !1182, size: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1299, file: !1049, line: 48, baseType: !1303, size: 64, offset: 64)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !568, line: 35, baseType: !1305)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !568, line: 35, size: 128, elements: !1306)
!1306 = !{!1307}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1305, file: !568, line: 35, baseType: !1308, size: 128)
!1308 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !568, line: 33, baseType: !1309)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !568, line: 33, size: 128, elements: !1310)
!1310 = !{!1311, !1312, !1313}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1309, file: !568, line: 33, baseType: !7, size: 32)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1309, file: !568, line: 33, baseType: !7, size: 32, offset: 32)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1309, file: !568, line: 33, baseType: !1314, size: 64, offset: 64)
!1314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 64, elements: !766)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1299, file: !1049, line: 51, baseType: !1234, size: 64, offset: 128)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1299, file: !1049, line: 54, baseType: !847, size: 64, offset: 192)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1299, file: !1049, line: 57, baseType: !1318, size: 128, offset: 256)
!1318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1319, line: 31, size: 128, elements: !1320)
!1319 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1320 = !{!1321, !1322, !1323, !1324, !1325, !1326, !1327}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1318, file: !1319, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1318, file: !1319, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1318, file: !1319, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1318, file: !1319, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1318, file: !1319, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1318, file: !1319, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1318, file: !1319, line: 56, baseType: !1328, size: 64, offset: 64)
!1328 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !666, line: 47, baseType: !785)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1299, file: !1049, line: 60, baseType: !1318, size: 128, offset: 384)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1299, file: !1049, line: 64, baseType: !1331, size: 64, offset: 512)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64)
!1332 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !6, line: 27, flags: DIFlagFwdDecl)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1299, file: !1049, line: 67, baseType: !847, size: 64, offset: 576)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1299, file: !1049, line: 73, baseType: !1182, size: 64, offset: 640)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1299, file: !1049, line: 77, baseType: !1328, size: 64, offset: 704)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1299, file: !1049, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1299, file: !1049, line: 82, baseType: !1338, size: 320, offset: 832)
!1338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !645, line: 62, size: 320, elements: !1339)
!1339 = !{!1340, !1346, !1347, !1348, !1349, !1356}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1338, file: !645, line: 63, baseType: !1341, size: 64)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64)
!1342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !645, line: 56, size: 128, elements: !1343)
!1343 = !{!1344, !1345}
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1342, file: !645, line: 57, baseType: !1341, size: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1342, file: !645, line: 58, baseType: !942, size: 8, offset: 64)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1338, file: !645, line: 64, baseType: !7, size: 32, offset: 64)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1338, file: !645, line: 66, baseType: !7, size: 32, offset: 96)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1338, file: !645, line: 68, baseType: !653, size: 8, offset: 128)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1338, file: !645, line: 70, baseType: !1350, size: 64, offset: 192)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64)
!1351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !645, line: 37, size: 128, elements: !1352)
!1352 = !{!1353, !1354}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1351, file: !645, line: 39, baseType: !1350, size: 64)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1351, file: !645, line: 40, baseType: !1355, size: 64, offset: 64)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1338, file: !645, line: 71, baseType: !1357, size: 64, offset: 256)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64)
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !645, line: 45, size: 320, elements: !1359)
!1359 = !{!1360, !1361}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1358, file: !645, line: 47, baseType: !1357, size: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1358, file: !645, line: 48, baseType: !1362, size: 256, offset: 64)
!1362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !142, line: 1883, size: 256, elements: !1363)
!1363 = !{!1364, !1366, !1367, !1372}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1362, file: !142, line: 1884, baseType: !1365, size: 64)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1362, file: !142, line: 1885, baseType: !1365, size: 64, offset: 64)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1362, file: !142, line: 1891, baseType: !1368, size: 64, offset: 128)
!1368 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1362, file: !142, line: 1891, size: 64, elements: !1369)
!1369 = !{!1370, !1371}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1368, file: !142, line: 1891, baseType: !665, size: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1368, file: !142, line: 1891, baseType: !847, size: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1362, file: !142, line: 1892, baseType: !1355, size: 64, offset: 192)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1098, file: !1099, line: 476, baseType: !1374, size: 64, offset: 256)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64)
!1375 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1099, line: 476, flags: DIFlagFwdDecl)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1098, file: !1099, line: 479, baseType: !1182, size: 64, offset: 320)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1098, file: !1099, line: 484, baseType: !847, size: 64, offset: 384)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1098, file: !1099, line: 488, baseType: !847, size: 64, offset: 448)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1098, file: !1099, line: 493, baseType: !847, size: 64, offset: 512)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1098, file: !1099, line: 496, baseType: !847, size: 64, offset: 576)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1098, file: !1099, line: 501, baseType: !1382, size: 64, offset: 640)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64)
!1383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !380, line: 2355, size: 576, elements: !1384)
!1384 = !{!1385, !1388, !1389, !1390, !1391, !1393, !1394, !1399, !1400, !1401, !1402, !1403, !1404}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1383, file: !380, line: 2356, baseType: !1386, size: 64)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64)
!1387 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !380, line: 2356, flags: DIFlagFwdDecl)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1383, file: !380, line: 2357, baseType: !659, size: 64, offset: 64)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1383, file: !380, line: 2358, baseType: !654, size: 32, offset: 128)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1383, file: !380, line: 2359, baseType: !654, size: 32, offset: 160)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1383, file: !380, line: 2360, baseType: !1392, size: 128, offset: 192)
!1392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !654, size: 128, elements: !827)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1383, file: !380, line: 2364, baseType: !654, size: 32, offset: 320)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1383, file: !380, line: 2367, baseType: !1395, size: 128, offset: 384)
!1395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !380, line: 2349, size: 128, elements: !1396)
!1396 = !{!1397, !1398}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1395, file: !380, line: 2351, baseType: !731, size: 64)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1395, file: !380, line: 2352, baseType: !818, size: 64, offset: 64)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1383, file: !380, line: 2371, baseType: !379, size: 32, offset: 512)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1383, file: !380, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1383, file: !380, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1383, file: !380, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1383, file: !380, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1383, file: !380, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1098, file: !1099, line: 504, baseType: !1406, size: 64, offset: 704)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64)
!1407 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1099, line: 504, flags: DIFlagFwdDecl)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1098, file: !1099, line: 507, baseType: !1182, size: 64, offset: 768)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1098, file: !1099, line: 510, baseType: !654, size: 32, offset: 832)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1098, file: !1099, line: 513, baseType: !654, size: 32, offset: 864)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1098, file: !1099, line: 516, baseType: !684, size: 32, offset: 896)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1098, file: !1099, line: 519, baseType: !684, size: 32, offset: 928)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1098, file: !1099, line: 522, baseType: !7, size: 32, offset: 960)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1098, file: !1099, line: 523, baseType: !7, size: 32, offset: 992)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1098, file: !1099, line: 528, baseType: !659, size: 64, offset: 1024)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1098, file: !1099, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1098, file: !1099, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1098, file: !1099, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1098, file: !1099, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1098, file: !1099, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1098, file: !1099, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1098, file: !1099, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1098, file: !1099, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1098, file: !1099, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1098, file: !1099, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1098, file: !1099, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1098, file: !1099, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1098, file: !1099, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1098, file: !1099, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1098, file: !1099, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
