; ModuleID = 'tree-ssa-structalias.bc'
source_filename = "tree-ssa-structalias.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!608 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!609 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!610 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!611 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!612 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!613 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!614 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!615 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!616 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!617 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!618 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!619 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!620 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!621 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!622 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!623 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!624 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!625 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!626 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!627 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!628 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!629 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!630 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !566, line: 80, baseType: !6, size: 32, elements: !631)
!631 = !{!632, !633, !634, !635}
!632 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!633 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!634 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!635 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!636 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !637, line: 309, baseType: !6, size: 32, elements: !638)
!637 = !DIFile(filename: "./cgraph.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!638 = !{!639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658}
!639 = !DIEnumerator(name: "CIF_OK", value: 0, isUnsigned: true)
!640 = !DIEnumerator(name: "CIF_UNSPECIFIED", value: 1, isUnsigned: true)
!641 = !DIEnumerator(name: "CIF_FUNCTION_NOT_CONSIDERED", value: 2, isUnsigned: true)
!642 = !DIEnumerator(name: "CIF_BODY_NOT_AVAILABLE", value: 3, isUnsigned: true)
!643 = !DIEnumerator(name: "CIF_REDEFINED_EXTERN_INLINE", value: 4, isUnsigned: true)
!644 = !DIEnumerator(name: "CIF_FUNCTION_NOT_INLINABLE", value: 5, isUnsigned: true)
!645 = !DIEnumerator(name: "CIF_FUNCTION_NOT_INLINE_CANDIDATE", value: 6, isUnsigned: true)
!646 = !DIEnumerator(name: "CIF_LARGE_FUNCTION_GROWTH_LIMIT", value: 7, isUnsigned: true)
!647 = !DIEnumerator(name: "CIF_LARGE_STACK_FRAME_GROWTH_LIMIT", value: 8, isUnsigned: true)
!648 = !DIEnumerator(name: "CIF_MAX_INLINE_INSNS_SINGLE_LIMIT", value: 9, isUnsigned: true)
!649 = !DIEnumerator(name: "CIF_MAX_INLINE_INSNS_AUTO_LIMIT", value: 10, isUnsigned: true)
!650 = !DIEnumerator(name: "CIF_INLINE_UNIT_GROWTH_LIMIT", value: 11, isUnsigned: true)
!651 = !DIEnumerator(name: "CIF_RECURSIVE_INLINING", value: 12, isUnsigned: true)
!652 = !DIEnumerator(name: "CIF_UNLIKELY_CALL", value: 13, isUnsigned: true)
!653 = !DIEnumerator(name: "CIF_NOT_DECLARED_INLINED", value: 14, isUnsigned: true)
!654 = !DIEnumerator(name: "CIF_OPTIMIZING_FOR_SIZE", value: 15, isUnsigned: true)
!655 = !DIEnumerator(name: "CIF_TARGET_OPTION_MISMATCH", value: 16, isUnsigned: true)
!656 = !DIEnumerator(name: "CIF_MISMATCHED_ARGUMENTS", value: 17, isUnsigned: true)
!657 = !DIEnumerator(name: "CIF_ORIGINALLY_INDIRECT_CALL", value: 18, isUnsigned: true)
!658 = !DIEnumerator(name: "CIF_N_REASONS", value: 19, isUnsigned: true)
!659 = !{!660, !661, !662, !663, !666, !667, !669, !670, !139, !682, !685, !699, !2053, !730, !711, !6, !2060, !2074, !2075, !2076, !2096, !732, !2098, !2100, !853, !684, !1051, !2101, !1085, !664, !630, !2103, !2116, !2121, !2125, !2127, !2148, !1598, !2149, !2158, !2171, !2179, !2180, !2181, !2186, !2187}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!662 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !665)
!669 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "constraint_t", file: !3, line: 187, baseType: !671)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "constraint", file: !3, line: 418, size: 256, elements: !673)
!673 = !{!674, !681}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !672, file: !3, line: 420, baseType: !675, size: 128)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "constraint_expr", file: !3, line: 386, size: 128, elements: !676)
!676 = !{!677, !679, !680}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !675, file: !3, line: 389, baseType: !678, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "constraint_expr_type", file: !3, line: 382, baseType: !5)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !675, file: !3, line: 392, baseType: !6, size: 32, offset: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !675, file: !3, line: 399, baseType: !669, size: 64, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !672, file: !3, line: 421, baseType: !675, size: 128, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !683, line: 46, baseType: !684)
!683 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!684 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constraint_t_heap", file: !3, line: 190, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constraint_t_heap", file: !3, line: 190, size: 128, elements: !688)
!688 = !{!689}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !687, file: !3, line: 190, baseType: !690, size: 128)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constraint_t_base", file: !3, line: 189, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constraint_t_base", file: !3, line: 189, size: 128, elements: !692)
!692 = !{!693, !694, !695}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !691, file: !3, line: 189, baseType: !6, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !691, file: !3, line: 189, baseType: !6, size: 32, offset: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !691, file: !3, line: 189, baseType: !696, size: 64, offset: 64)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 64, elements: !697)
!697 = !{!698}
!698 = !DISubrange(count: 1)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_varinfo_t_heap", file: !3, line: 275, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_varinfo_t_heap", file: !3, line: 275, size: 128, elements: !702)
!702 = !{!703}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !701, file: !3, line: 275, baseType: !704, size: 128)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_varinfo_t_base", file: !3, line: 273, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_varinfo_t_base", file: !3, line: 273, size: 128, elements: !706)
!706 = !{!707, !708, !709}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !705, file: !3, line: 273, baseType: !6, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !705, file: !3, line: 273, baseType: !6, size: 32, offset: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !705, file: !3, line: 273, baseType: !710, size: 64, offset: 64)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !711, size: 64, elements: !697)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "varinfo_t", file: !3, line: 263, baseType: !712)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "variable_info", file: !3, line: 208, size: 576, elements: !714)
!714 = !{!715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !2051, !2052}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !713, file: !3, line: 211, baseType: !6, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "is_artificial_var", scope: !713, file: !3, line: 215, baseType: !6, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "is_special_var", scope: !713, file: !3, line: 219, baseType: !6, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "is_unknown_size_var", scope: !713, file: !3, line: 222, baseType: !6, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "is_full_var", scope: !713, file: !3, line: 225, baseType: !6, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "is_heap_var", scope: !713, file: !3, line: 228, baseType: !6, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "is_restrict_var", scope: !713, file: !3, line: 231, baseType: !6, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "may_have_pointers", scope: !713, file: !3, line: 234, baseType: !6, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "is_global_var", scope: !713, file: !3, line: 237, baseType: !6, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !713, file: !3, line: 240, baseType: !712, size: 64, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !713, file: !3, line: 243, baseType: !684, size: 64, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !713, file: !3, line: 246, baseType: !684, size: 64, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "fullsize", scope: !713, file: !3, line: 249, baseType: !684, size: 64, offset: 256)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !713, file: !3, line: 252, baseType: !667, size: 64, offset: 320)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !713, file: !3, line: 255, baseType: !730, size: 64, offset: 384)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !731, line: 56, baseType: !732)
!731 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !140, line: 3371, size: 1792, elements: !734)
!734 = !{!735, !768, !774, !785, !804, !815, !820, !827, !833, !846, !858, !896, !1386, !1414, !1431, !1432, !1437, !1446, !1452, !1457, !1461, !1465, !1702, !1749, !1755, !1761, !1768, !1781, !1795, !1812, !1824, !1846, !1861, !2033}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !733, file: !140, line: 3372, baseType: !736, size: 64)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !140, line: 360, size: 64, elements: !737)
!737 = !{!738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !736, file: !140, line: 361, baseType: !6, size: 16, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !736, file: !140, line: 363, baseType: !6, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !736, file: !140, line: 364, baseType: !6, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !736, file: !140, line: 365, baseType: !6, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !736, file: !140, line: 366, baseType: !6, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !736, file: !140, line: 367, baseType: !6, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !736, file: !140, line: 368, baseType: !6, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !736, file: !140, line: 369, baseType: !6, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !736, file: !140, line: 370, baseType: !6, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !736, file: !140, line: 372, baseType: !6, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !736, file: !140, line: 373, baseType: !6, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !736, file: !140, line: 374, baseType: !6, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !736, file: !140, line: 375, baseType: !6, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !736, file: !140, line: 376, baseType: !6, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !736, file: !140, line: 377, baseType: !6, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !736, file: !140, line: 378, baseType: !6, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !736, file: !140, line: 379, baseType: !6, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !736, file: !140, line: 381, baseType: !6, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !736, file: !140, line: 382, baseType: !6, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !736, file: !140, line: 383, baseType: !6, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !736, file: !140, line: 384, baseType: !6, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !736, file: !140, line: 385, baseType: !6, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !736, file: !140, line: 386, baseType: !6, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !736, file: !140, line: 387, baseType: !6, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !736, file: !140, line: 388, baseType: !6, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !736, file: !140, line: 390, baseType: !6, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !736, file: !140, line: 391, baseType: !6, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !736, file: !140, line: 392, baseType: !6, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !736, file: !140, line: 394, baseType: !6, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !736, file: !140, line: 399, baseType: !6, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !733, file: !140, line: 3373, baseType: !769, size: 192)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !140, line: 402, size: 192, elements: !770)
!770 = !{!771, !772, !773}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !769, file: !140, line: 403, baseType: !736, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !769, file: !140, line: 404, baseType: !730, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !769, file: !140, line: 405, baseType: !730, size: 64, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !733, file: !140, line: 3374, baseType: !775, size: 320)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !140, line: 1384, size: 320, elements: !776)
!776 = !{!777, !778}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !775, file: !140, line: 1385, baseType: !769, size: 192)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !775, file: !140, line: 1386, baseType: !779, size: 128, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !780, line: 58, baseType: !781)
!780 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !780, line: 54, size: 128, elements: !782)
!782 = !{!783, !784}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !781, file: !780, line: 56, baseType: !684, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !781, file: !780, line: 57, baseType: !669, size: 64, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !733, file: !140, line: 3375, baseType: !786, size: 256)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !140, line: 1397, size: 256, elements: !787)
!787 = !{!788, !789}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !786, file: !140, line: 1398, baseType: !769, size: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !786, file: !140, line: 1399, baseType: !790, size: 64, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !792, line: 52, size: 256, elements: !793)
!792 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!793 = !{!794, !795, !796, !797, !798, !799, !800}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !791, file: !792, line: 56, baseType: !6, size: 2, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !791, file: !792, line: 57, baseType: !6, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !791, file: !792, line: 58, baseType: !6, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !791, file: !792, line: 59, baseType: !6, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !791, file: !792, line: 60, baseType: !6, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !791, file: !792, line: 61, baseType: !6, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !791, file: !792, line: 62, baseType: !801, size: 192, offset: 64)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !684, size: 192, elements: !802)
!802 = !{!803}
!803 = !DISubrange(count: 3)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !733, file: !140, line: 3376, baseType: !805, size: 256)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !140, line: 1408, size: 256, elements: !806)
!806 = !{!807, !808}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !805, file: !140, line: 1409, baseType: !769, size: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !805, file: !140, line: 1410, baseType: !809, size: 64, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !811, line: 27, size: 192, elements: !812)
!811 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!812 = !{!813, !814}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !810, file: !811, line: 29, baseType: !779, size: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !810, file: !811, line: 30, baseType: !11, size: 32, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !733, file: !140, line: 3377, baseType: !816, size: 256)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !140, line: 1437, size: 256, elements: !817)
!817 = !{!818, !819}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !816, file: !140, line: 1438, baseType: !769, size: 192)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !816, file: !140, line: 1439, baseType: !730, size: 64, offset: 192)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !733, file: !140, line: 3378, baseType: !821, size: 256)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !140, line: 1418, size: 256, elements: !822)
!822 = !{!823, !824, !825}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !821, file: !140, line: 1419, baseType: !769, size: 192)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !821, file: !140, line: 1420, baseType: !662, size: 32, offset: 192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !821, file: !140, line: 1421, baseType: !826, size: 8, offset: 224)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 8, elements: !697)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !733, file: !140, line: 3379, baseType: !828, size: 320)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !140, line: 1428, size: 320, elements: !829)
!829 = !{!830, !831, !832}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !828, file: !140, line: 1429, baseType: !769, size: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !828, file: !140, line: 1430, baseType: !730, size: 64, offset: 192)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !828, file: !140, line: 1431, baseType: !730, size: 64, offset: 256)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !733, file: !140, line: 3380, baseType: !834, size: 320)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !140, line: 1460, size: 320, elements: !835)
!835 = !{!836, !837}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !834, file: !140, line: 1461, baseType: !769, size: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !834, file: !140, line: 1462, baseType: !838, size: 128, offset: 192)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !839, line: 31, size: 128, elements: !840)
!839 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!840 = !{!841, !844, !845}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !838, file: !839, line: 32, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !661)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !838, file: !839, line: 33, baseType: !6, size: 32, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !838, file: !839, line: 34, baseType: !6, size: 32, offset: 96)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !733, file: !140, line: 3381, baseType: !847, size: 384)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !140, line: 2507, size: 384, elements: !848)
!848 = !{!849, !850, !855, !856, !857}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !847, file: !140, line: 2508, baseType: !769, size: 192)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !847, file: !140, line: 2509, baseType: !851, size: 32, offset: 192)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !852, line: 58, baseType: !853)
!852 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !854, line: 44, baseType: !6)
!854 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!855 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !847, file: !140, line: 2510, baseType: !6, size: 32, offset: 224)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !847, file: !140, line: 2511, baseType: !730, size: 64, offset: 256)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !847, file: !140, line: 2512, baseType: !730, size: 64, offset: 320)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !733, file: !140, line: 3382, baseType: !859, size: 896)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !140, line: 2652, size: 896, elements: !860)
!860 = !{!861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !859, file: !140, line: 2653, baseType: !847, size: 384)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !859, file: !140, line: 2654, baseType: !730, size: 64, offset: 384)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !859, file: !140, line: 2656, baseType: !6, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !859, file: !140, line: 2658, baseType: !6, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !859, file: !140, line: 2659, baseType: !6, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !859, file: !140, line: 2660, baseType: !6, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !859, file: !140, line: 2661, baseType: !6, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !859, file: !140, line: 2662, baseType: !6, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !859, file: !140, line: 2663, baseType: !6, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !859, file: !140, line: 2664, baseType: !6, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !859, file: !140, line: 2666, baseType: !6, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !859, file: !140, line: 2667, baseType: !6, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !859, file: !140, line: 2668, baseType: !6, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !859, file: !140, line: 2669, baseType: !6, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !859, file: !140, line: 2670, baseType: !6, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !859, file: !140, line: 2671, baseType: !6, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !859, file: !140, line: 2672, baseType: !6, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !859, file: !140, line: 2673, baseType: !6, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !859, file: !140, line: 2674, baseType: !6, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !859, file: !140, line: 2678, baseType: !6, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !859, file: !140, line: 2682, baseType: !6, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !859, file: !140, line: 2685, baseType: !6, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !859, file: !140, line: 2688, baseType: !6, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !859, file: !140, line: 2690, baseType: !6, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !859, file: !140, line: 2692, baseType: !6, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !859, file: !140, line: 2695, baseType: !6, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !859, file: !140, line: 2698, baseType: !6, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !859, file: !140, line: 2703, baseType: !6, size: 32, offset: 512)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !859, file: !140, line: 2705, baseType: !730, size: 64, offset: 576)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !859, file: !140, line: 2706, baseType: !730, size: 64, offset: 640)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !859, file: !140, line: 2707, baseType: !730, size: 64, offset: 704)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !859, file: !140, line: 2708, baseType: !730, size: 64, offset: 768)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !859, file: !140, line: 2711, baseType: !894, size: 64, offset: 832)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !140, line: 2711, flags: DIFlagFwdDecl)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !733, file: !140, line: 3383, baseType: !897, size: 960)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !140, line: 2756, size: 960, elements: !898)
!898 = !{!899, !900}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !897, file: !140, line: 2757, baseType: !859, size: 896)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !897, file: !140, line: 2758, baseType: !901, size: 64, offset: 896)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !731, line: 50, baseType: !902)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !904, line: 240, size: 384, elements: !905)
!904 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!905 = !{!906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !903, file: !904, line: 242, baseType: !6, size: 16, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !903, file: !904, line: 245, baseType: !6, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !903, file: !904, line: 252, baseType: !6, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !903, file: !904, line: 257, baseType: !6, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !903, file: !904, line: 265, baseType: !6, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !903, file: !904, line: 277, baseType: !6, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !903, file: !904, line: 291, baseType: !6, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !903, file: !904, line: 298, baseType: !6, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !903, file: !904, line: 305, baseType: !6, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !903, file: !904, line: 310, baseType: !6, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !903, file: !904, line: 321, baseType: !917, size: 320, offset: 64)
!917 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !904, line: 315, size: 320, elements: !918)
!918 = !{!919, !1319, !1321, !1384, !1385}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !917, file: !904, line: 316, baseType: !920, size: 64)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !921, size: 64, elements: !697)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !904, line: 183, baseType: !922)
!922 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !904, line: 166, size: 64, elements: !923)
!923 = !{!924, !925, !926, !927, !928, !936, !937, !949, !952, !1012, !1013, !1296, !1309, !1316}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !922, file: !904, line: 168, baseType: !662, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !922, file: !904, line: 169, baseType: !6, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !922, file: !904, line: 170, baseType: !667, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !922, file: !904, line: 171, baseType: !901, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !922, file: !904, line: 172, baseType: !929, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !731, line: 53, baseType: !930)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !904, line: 359, size: 128, elements: !932)
!932 = !{!933, !934}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !931, file: !904, line: 360, baseType: !662, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !931, file: !904, line: 361, baseType: !935, size: 64, offset: 64)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 64, elements: !697)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !922, file: !904, line: 173, baseType: !11, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !922, file: !904, line: 174, baseType: !938, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !904, line: 133, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !904, line: 115, size: 32, elements: !940)
!940 = !{!941, !942, !943, !944, !945, !946, !947, !948}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !939, file: !904, line: 118, baseType: !6, size: 8, flags: DIFlagBitField, extraData: i64 0)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !939, file: !904, line: 120, baseType: !6, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !939, file: !904, line: 121, baseType: !6, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !939, file: !904, line: 123, baseType: !6, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !939, file: !904, line: 125, baseType: !6, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !939, file: !904, line: 127, baseType: !6, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !939, file: !904, line: 130, baseType: !6, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !939, file: !904, line: 132, baseType: !6, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !922, file: !904, line: 175, baseType: !950, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !904, line: 175, flags: DIFlagFwdDecl)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !922, file: !904, line: 176, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !955, line: 75, size: 256, elements: !956)
!955 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!956 = !{!957, !971, !972, !973}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !954, file: !955, line: 76, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !955, line: 68, baseType: !960)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !955, line: 63, size: 320, elements: !961)
!961 = !{!962, !964, !965, !966}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !960, file: !955, line: 64, baseType: !963, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !960, file: !955, line: 65, baseType: !963, size: 64, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !960, file: !955, line: 66, baseType: !6, size: 32, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !960, file: !955, line: 67, baseType: !967, size: 128, offset: 192)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 128, elements: !969)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !955, line: 29, baseType: !684)
!969 = !{!970}
!970 = !DISubrange(count: 2)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !954, file: !955, line: 77, baseType: !958, size: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !954, file: !955, line: 78, baseType: !6, size: 32, offset: 128)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !954, file: !955, line: 79, baseType: !974, size: 64, offset: 192)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !955, line: 49, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !955, line: 45, size: 832, elements: !977)
!977 = !{!978, !979, !980}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !976, file: !955, line: 46, baseType: !963, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !976, file: !955, line: 47, baseType: !953, size: 64, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !976, file: !955, line: 48, baseType: !981, size: 704, offset: 128)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !982, line: 164, size: 704, elements: !983)
!982 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!983 = !{!984, !985, !995, !996, !997, !998, !999, !1000, !1004, !1008, !1009, !1010, !1011}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !981, file: !982, line: 166, baseType: !669, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !981, file: !982, line: 167, baseType: !986, size: 64, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !982, line: 157, size: 192, elements: !988)
!988 = !{!989, !990, !991}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !987, file: !982, line: 159, baseType: !664, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !987, file: !982, line: 160, baseType: !986, size: 64, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !987, file: !982, line: 161, baseType: !992, size: 32, offset: 128)
!992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 32, elements: !993)
!993 = !{!994}
!994 = !DISubrange(count: 4)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !981, file: !982, line: 168, baseType: !664, size: 64, offset: 128)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !981, file: !982, line: 169, baseType: !664, size: 64, offset: 192)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !981, file: !982, line: 170, baseType: !664, size: 64, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !981, file: !982, line: 171, baseType: !669, size: 64, offset: 320)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !981, file: !982, line: 172, baseType: !662, size: 32, offset: 384)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !981, file: !982, line: 176, baseType: !1001, size: 64, offset: 448)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!986, !666, !669}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !981, file: !982, line: 177, baseType: !1005, size: 64, offset: 512)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{null, !666, !986}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !981, file: !982, line: 178, baseType: !666, size: 64, offset: 576)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !981, file: !982, line: 179, baseType: !6, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !981, file: !982, line: 180, baseType: !6, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !981, file: !982, line: 184, baseType: !6, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !922, file: !904, line: 177, baseType: !730, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !922, file: !904, line: 178, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !335, line: 217, size: 832, elements: !1016)
!1016 = !{!1017, !1261, !1262, !1263, !1266, !1270, !1271, !1272, !1290, !1291, !1292, !1293, !1294, !1295}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1015, file: !335, line: 219, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !335, line: 151, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !335, line: 151, size: 128, elements: !1021)
!1021 = !{!1022}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1020, file: !335, line: 151, baseType: !1023, size: 128)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !335, line: 150, baseType: !1024)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !335, line: 150, size: 128, elements: !1025)
!1025 = !{!1026, !1027, !1028}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1024, file: !335, line: 150, baseType: !6, size: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1024, file: !335, line: 150, baseType: !6, size: 32, offset: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1024, file: !335, line: 150, baseType: !1029, size: 64, offset: 64)
!1029 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1030, size: 64, elements: !697)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !731, line: 108, baseType: !1031)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !335, line: 122, size: 512, elements: !1033)
!1033 = !{!1034, !1035, !1036, !1253, !1254, !1255, !1256, !1257, !1258, !1259}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1032, file: !335, line: 124, baseType: !1014, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1032, file: !335, line: 125, baseType: !1014, size: 64, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1032, file: !335, line: 131, baseType: !1037, size: 64, offset: 128)
!1037 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !335, line: 128, size: 64, elements: !1038)
!1038 = !{!1039, !1252}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1037, file: !335, line: 129, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !731, line: 66, baseType: !1041)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !566, line: 143, size: 192, elements: !1043)
!1043 = !{!1044, !1250, !1251}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1042, file: !566, line: 145, baseType: !1045, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !731, line: 69, baseType: !1046)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !566, line: 136, size: 192, elements: !1048)
!1048 = !{!1049, !1248, !1249}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1047, file: !566, line: 137, baseType: !1050, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !731, line: 58, baseType: !1051)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !566, line: 737, size: 768, elements: !1053)
!1053 = !{!1054, !1071, !1105, !1111, !1116, !1121, !1128, !1134, !1140, !1145, !1159, !1164, !1170, !1175, !1185, !1190, !1206, !1213, !1220, !1226, !1231, !1237, !1243}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1052, file: !566, line: 738, baseType: !1055, size: 256)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !566, line: 271, size: 256, elements: !1056)
!1056 = !{!1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1055, file: !566, line: 274, baseType: !6, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1055, file: !566, line: 277, baseType: !6, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1055, file: !566, line: 281, baseType: !6, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1055, file: !566, line: 284, baseType: !6, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1055, file: !566, line: 291, baseType: !6, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1055, file: !566, line: 295, baseType: !6, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1055, file: !566, line: 298, baseType: !6, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1055, file: !566, line: 301, baseType: !6, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1055, file: !566, line: 307, baseType: !6, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1055, file: !566, line: 312, baseType: !6, size: 32, offset: 32)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1055, file: !566, line: 316, baseType: !851, size: 32, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1055, file: !566, line: 319, baseType: !6, size: 32, offset: 96)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1055, file: !566, line: 323, baseType: !1014, size: 64, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1055, file: !566, line: 327, baseType: !730, size: 64, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1052, file: !566, line: 739, baseType: !1072, size: 448)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !566, line: 350, size: 448, elements: !1073)
!1073 = !{!1074, !1103}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1072, file: !566, line: 353, baseType: !1075, size: 384)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !566, line: 333, size: 384, elements: !1076)
!1076 = !{!1077, !1078, !1086}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1075, file: !566, line: 336, baseType: !1055, size: 256)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1075, file: !566, line: 343, baseType: !1079, size: 64, offset: 256)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1081, line: 37, size: 128, elements: !1082)
!1081 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1082 = !{!1083, !1084}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1080, file: !1081, line: 39, baseType: !1079, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1080, file: !1081, line: 40, baseType: !1085, size: 64, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1075, file: !566, line: 344, baseType: !1087, size: 64, offset: 320)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1081, line: 45, size: 320, elements: !1089)
!1089 = !{!1090, !1091}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1088, file: !1081, line: 47, baseType: !1087, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1088, file: !1081, line: 48, baseType: !1092, size: 256, offset: 64)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !140, line: 1883, size: 256, elements: !1093)
!1093 = !{!1094, !1096, !1097, !1102}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1092, file: !140, line: 1884, baseType: !1095, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1092, file: !140, line: 1885, baseType: !1095, size: 64, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1092, file: !140, line: 1891, baseType: !1098, size: 64, offset: 128)
!1098 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1092, file: !140, line: 1891, size: 64, elements: !1099)
!1099 = !{!1100, !1101}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1098, file: !140, line: 1891, baseType: !1050, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1098, file: !140, line: 1891, baseType: !730, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1092, file: !140, line: 1892, baseType: !1085, size: 64, offset: 192)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1072, file: !566, line: 359, baseType: !1104, size: 64, offset: 384)
!1104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 64, elements: !697)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1052, file: !566, line: 740, baseType: !1106, size: 512)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !566, line: 365, size: 512, elements: !1107)
!1107 = !{!1108, !1109, !1110}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1106, file: !566, line: 368, baseType: !1075, size: 384)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1106, file: !566, line: 373, baseType: !730, size: 64, offset: 384)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1106, file: !566, line: 374, baseType: !730, size: 64, offset: 448)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1052, file: !566, line: 741, baseType: !1112, size: 576)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !566, line: 380, size: 576, elements: !1113)
!1113 = !{!1114, !1115}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1112, file: !566, line: 383, baseType: !1106, size: 512)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1112, file: !566, line: 389, baseType: !1104, size: 64, offset: 512)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1052, file: !566, line: 742, baseType: !1117, size: 320)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !566, line: 395, size: 320, elements: !1118)
!1118 = !{!1119, !1120}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1117, file: !566, line: 397, baseType: !1055, size: 256)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1117, file: !566, line: 400, baseType: !1040, size: 64, offset: 256)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1052, file: !566, line: 743, baseType: !1122, size: 448)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !566, line: 406, size: 448, elements: !1123)
!1123 = !{!1124, !1125, !1126, !1127}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1122, file: !566, line: 408, baseType: !1055, size: 256)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1122, file: !566, line: 412, baseType: !730, size: 64, offset: 256)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1122, file: !566, line: 420, baseType: !730, size: 64, offset: 320)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1122, file: !566, line: 423, baseType: !1040, size: 64, offset: 384)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1052, file: !566, line: 744, baseType: !1129, size: 384)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !566, line: 429, size: 384, elements: !1130)
!1130 = !{!1131, !1132, !1133}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1129, file: !566, line: 431, baseType: !1055, size: 256)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1129, file: !566, line: 434, baseType: !730, size: 64, offset: 256)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1129, file: !566, line: 437, baseType: !1040, size: 64, offset: 320)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1052, file: !566, line: 745, baseType: !1135, size: 384)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !566, line: 443, size: 384, elements: !1136)
!1136 = !{!1137, !1138, !1139}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1135, file: !566, line: 445, baseType: !1055, size: 256)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1135, file: !566, line: 449, baseType: !730, size: 64, offset: 256)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1135, file: !566, line: 453, baseType: !1040, size: 64, offset: 320)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1052, file: !566, line: 746, baseType: !1141, size: 320)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !566, line: 459, size: 320, elements: !1142)
!1142 = !{!1143, !1144}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1141, file: !566, line: 461, baseType: !1055, size: 256)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1141, file: !566, line: 464, baseType: !730, size: 64, offset: 256)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1052, file: !566, line: 747, baseType: !1146, size: 768)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !566, line: 469, size: 768, elements: !1147)
!1147 = !{!1148, !1149, !1150, !1151, !1152}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1146, file: !566, line: 471, baseType: !1055, size: 256)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1146, file: !566, line: 474, baseType: !6, size: 32, offset: 256)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1146, file: !566, line: 475, baseType: !6, size: 32, offset: 288)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1146, file: !566, line: 478, baseType: !730, size: 64, offset: 320)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1146, file: !566, line: 481, baseType: !1153, size: 384, offset: 384)
!1153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1154, size: 384, elements: !697)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !140, line: 1917, size: 384, elements: !1155)
!1155 = !{!1156, !1157, !1158}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1154, file: !140, line: 1920, baseType: !1092, size: 256)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1154, file: !140, line: 1921, baseType: !730, size: 64, offset: 256)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1154, file: !140, line: 1922, baseType: !851, size: 32, offset: 320)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1052, file: !566, line: 748, baseType: !1160, size: 320)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !566, line: 487, size: 320, elements: !1161)
!1161 = !{!1162, !1163}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1160, file: !566, line: 490, baseType: !1055, size: 256)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1160, file: !566, line: 494, baseType: !662, size: 32, offset: 256)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1052, file: !566, line: 749, baseType: !1165, size: 384)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !566, line: 500, size: 384, elements: !1166)
!1166 = !{!1167, !1168, !1169}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1165, file: !566, line: 502, baseType: !1055, size: 256)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1165, file: !566, line: 506, baseType: !1040, size: 64, offset: 256)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1165, file: !566, line: 510, baseType: !1040, size: 64, offset: 320)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1052, file: !566, line: 750, baseType: !1171, size: 320)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !566, line: 529, size: 320, elements: !1172)
!1172 = !{!1173, !1174}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1171, file: !566, line: 531, baseType: !1055, size: 256)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1171, file: !566, line: 540, baseType: !1040, size: 64, offset: 256)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1052, file: !566, line: 751, baseType: !1176, size: 704)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !566, line: 546, size: 704, elements: !1177)
!1177 = !{!1178, !1179, !1180, !1181, !1182, !1183, !1184}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1176, file: !566, line: 549, baseType: !1106, size: 512)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1176, file: !566, line: 553, baseType: !667, size: 64, offset: 512)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1176, file: !566, line: 557, baseType: !661, size: 8, offset: 576)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1176, file: !566, line: 558, baseType: !661, size: 8, offset: 584)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1176, file: !566, line: 559, baseType: !661, size: 8, offset: 592)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1176, file: !566, line: 560, baseType: !661, size: 8, offset: 600)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1176, file: !566, line: 566, baseType: !1104, size: 64, offset: 640)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1052, file: !566, line: 752, baseType: !1186, size: 384)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !566, line: 571, size: 384, elements: !1187)
!1187 = !{!1188, !1189}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1186, file: !566, line: 573, baseType: !1117, size: 320)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1186, file: !566, line: 577, baseType: !730, size: 64, offset: 320)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1052, file: !566, line: 753, baseType: !1191, size: 576)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !566, line: 600, size: 576, elements: !1192)
!1192 = !{!1193, !1194, !1195, !1196, !1205}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1191, file: !566, line: 602, baseType: !1117, size: 320)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1191, file: !566, line: 605, baseType: !730, size: 64, offset: 320)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1191, file: !566, line: 609, baseType: !682, size: 64, offset: 384)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1191, file: !566, line: 612, baseType: !1197, size: 64, offset: 448)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !566, line: 581, size: 320, elements: !1199)
!1199 = !{!1200, !1201, !1202, !1203, !1204}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1198, file: !566, line: 583, baseType: !139, size: 32)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1198, file: !566, line: 586, baseType: !730, size: 64, offset: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1198, file: !566, line: 589, baseType: !730, size: 64, offset: 128)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1198, file: !566, line: 592, baseType: !730, size: 64, offset: 192)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1198, file: !566, line: 595, baseType: !730, size: 64, offset: 256)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1191, file: !566, line: 616, baseType: !1040, size: 64, offset: 512)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1052, file: !566, line: 754, baseType: !1207, size: 512)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !566, line: 622, size: 512, elements: !1208)
!1208 = !{!1209, !1210, !1211, !1212}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1207, file: !566, line: 624, baseType: !1117, size: 320)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1207, file: !566, line: 628, baseType: !730, size: 64, offset: 320)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1207, file: !566, line: 632, baseType: !730, size: 64, offset: 384)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1207, file: !566, line: 636, baseType: !730, size: 64, offset: 448)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1052, file: !566, line: 755, baseType: !1214, size: 704)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !566, line: 642, size: 704, elements: !1215)
!1215 = !{!1216, !1217, !1218, !1219}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1214, file: !566, line: 644, baseType: !1207, size: 512)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1214, file: !566, line: 648, baseType: !730, size: 64, offset: 512)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1214, file: !566, line: 652, baseType: !730, size: 64, offset: 576)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1214, file: !566, line: 653, baseType: !730, size: 64, offset: 640)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1052, file: !566, line: 756, baseType: !1221, size: 448)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !566, line: 663, size: 448, elements: !1222)
!1222 = !{!1223, !1224, !1225}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1221, file: !566, line: 665, baseType: !1117, size: 320)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1221, file: !566, line: 668, baseType: !730, size: 64, offset: 320)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1221, file: !566, line: 673, baseType: !730, size: 64, offset: 384)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1052, file: !566, line: 757, baseType: !1227, size: 384)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !566, line: 694, size: 384, elements: !1228)
!1228 = !{!1229, !1230}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1227, file: !566, line: 696, baseType: !1117, size: 320)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1227, file: !566, line: 699, baseType: !730, size: 64, offset: 320)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1052, file: !566, line: 758, baseType: !1232, size: 384)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !566, line: 681, size: 384, elements: !1233)
!1233 = !{!1234, !1235, !1236}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1232, file: !566, line: 683, baseType: !1055, size: 256)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1232, file: !566, line: 686, baseType: !730, size: 64, offset: 256)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1232, file: !566, line: 689, baseType: !730, size: 64, offset: 320)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1052, file: !566, line: 759, baseType: !1238, size: 384)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !566, line: 707, size: 384, elements: !1239)
!1239 = !{!1240, !1241, !1242}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1238, file: !566, line: 709, baseType: !1055, size: 256)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1238, file: !566, line: 712, baseType: !730, size: 64, offset: 256)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1238, file: !566, line: 712, baseType: !730, size: 64, offset: 320)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1052, file: !566, line: 760, baseType: !1244, size: 320)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !566, line: 718, size: 320, elements: !1245)
!1245 = !{!1246, !1247}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1244, file: !566, line: 720, baseType: !1055, size: 256)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1244, file: !566, line: 723, baseType: !730, size: 64, offset: 256)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1047, file: !566, line: 138, baseType: !1046, size: 64, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1047, file: !566, line: 139, baseType: !1046, size: 64, offset: 128)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1042, file: !566, line: 146, baseType: !1045, size: 64, offset: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1042, file: !566, line: 152, baseType: !1040, size: 64, offset: 128)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1037, file: !335, line: 130, baseType: !901, size: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1032, file: !335, line: 134, baseType: !666, size: 64, offset: 192)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1032, file: !335, line: 137, baseType: !730, size: 64, offset: 256)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1032, file: !335, line: 138, baseType: !851, size: 32, offset: 320)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1032, file: !335, line: 142, baseType: !6, size: 32, offset: 352)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1032, file: !335, line: 144, baseType: !662, size: 32, offset: 384)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1032, file: !335, line: 145, baseType: !662, size: 32, offset: 416)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1032, file: !335, line: 146, baseType: !1260, size: 64, offset: 448)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !335, line: 119, baseType: !669)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1015, file: !335, line: 220, baseType: !1018, size: 64, offset: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1015, file: !335, line: 223, baseType: !666, size: 64, offset: 128)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1015, file: !335, line: 226, baseType: !1264, size: 64, offset: 192)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64)
!1265 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !335, line: 185, flags: DIFlagFwdDecl)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1015, file: !335, line: 229, baseType: !1267, size: 128, offset: 256)
!1267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1268, size: 128, elements: !969)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64)
!1269 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !335, line: 229, flags: DIFlagFwdDecl)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1015, file: !335, line: 232, baseType: !1014, size: 64, offset: 384)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1015, file: !335, line: 233, baseType: !1014, size: 64, offset: 448)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1015, file: !335, line: 238, baseType: !1273, size: 64, offset: 512)
!1273 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !335, line: 235, size: 64, elements: !1274)
!1274 = !{!1275, !1281}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1273, file: !335, line: 236, baseType: !1276, size: 64)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !335, line: 273, size: 128, elements: !1278)
!1278 = !{!1279, !1280}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1277, file: !335, line: 275, baseType: !1040, size: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1277, file: !335, line: 278, baseType: !1040, size: 64, offset: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1273, file: !335, line: 237, baseType: !1282, size: 64)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !335, line: 259, size: 320, elements: !1284)
!1284 = !{!1285, !1286, !1287, !1288, !1289}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1283, file: !335, line: 261, baseType: !901, size: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1283, file: !335, line: 262, baseType: !901, size: 64, offset: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1283, file: !335, line: 266, baseType: !901, size: 64, offset: 128)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1283, file: !335, line: 267, baseType: !901, size: 64, offset: 192)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1283, file: !335, line: 270, baseType: !662, size: 32, offset: 256)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1015, file: !335, line: 241, baseType: !1260, size: 64, offset: 576)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1015, file: !335, line: 244, baseType: !662, size: 32, offset: 640)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1015, file: !335, line: 247, baseType: !662, size: 32, offset: 672)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1015, file: !335, line: 250, baseType: !662, size: 32, offset: 704)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1015, file: !335, line: 253, baseType: !662, size: 32, offset: 736)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1015, file: !335, line: 256, baseType: !662, size: 32, offset: 768)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !922, file: !904, line: 179, baseType: !1297, size: 64)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !904, line: 150, baseType: !1299)
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !904, line: 142, size: 320, elements: !1300)
!1300 = !{!1301, !1302, !1303, !1304, !1307, !1308}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1299, file: !904, line: 144, baseType: !730, size: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1299, file: !904, line: 145, baseType: !901, size: 64, offset: 64)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1299, file: !904, line: 146, baseType: !901, size: 64, offset: 128)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1299, file: !904, line: 147, baseType: !1305, size: 32, offset: 192)
!1305 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1306, line: 31, baseType: !662)
!1306 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1299, file: !904, line: 148, baseType: !6, size: 32, offset: 224)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1299, file: !904, line: 149, baseType: !661, size: 8, offset: 256)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !922, file: !904, line: 180, baseType: !1310, size: 64)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64)
!1311 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !904, line: 162, baseType: !1312)
!1312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !904, line: 159, size: 128, elements: !1313)
!1313 = !{!1314, !1315}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1312, file: !904, line: 160, baseType: !730, size: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1312, file: !904, line: 161, baseType: !669, size: 64, offset: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !922, file: !904, line: 181, baseType: !1317, size: 64)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64)
!1318 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !904, line: 181, flags: DIFlagFwdDecl)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !917, file: !904, line: 317, baseType: !1320, size: 64)
!1320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !669, size: 64, elements: !697)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !917, file: !904, line: 318, baseType: !1322, size: 320)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !904, line: 188, size: 320, elements: !1323)
!1323 = !{!1324, !1326, !1383}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1322, file: !904, line: 190, baseType: !1325, size: 192)
!1325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !921, size: 192, elements: !802)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1322, file: !904, line: 193, baseType: !1327, size: 64, offset: 192)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64)
!1328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !904, line: 206, size: 320, elements: !1329)
!1329 = !{!1330, !1368, !1369, !1370, !1382}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1328, file: !904, line: 208, baseType: !1331, size: 64)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64)
!1332 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !731, line: 62, baseType: !1333)
!1333 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1334, line: 538, size: 256, elements: !1335)
!1334 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1335 = !{!1336, !1340, !1346, !1359}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1333, file: !1334, line: 539, baseType: !1337, size: 32)
!1337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1334, line: 482, size: 32, elements: !1338)
!1338 = !{!1339}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1337, file: !1334, line: 484, baseType: !6, size: 32)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1333, file: !1334, line: 540, baseType: !1341, size: 192)
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1334, line: 488, size: 192, elements: !1342)
!1342 = !{!1343, !1344, !1345}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1341, file: !1334, line: 489, baseType: !1337, size: 32)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1341, file: !1334, line: 492, baseType: !667, size: 64, offset: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1341, file: !1334, line: 496, baseType: !730, size: 64, offset: 128)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1333, file: !1334, line: 541, baseType: !1347, size: 256)
!1347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1334, line: 504, size: 256, elements: !1348)
!1348 = !{!1349, !1350, !1357, !1358}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1347, file: !1334, line: 505, baseType: !1337, size: 32)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1347, file: !1334, line: 509, baseType: !1351, size: 64, offset: 64)
!1351 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1334, line: 501, baseType: !1352)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64)
!1353 = !DISubroutineType(types: !1354)
!1354 = !{null, !1355}
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64)
!1356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1347, file: !1334, line: 510, baseType: !1355, size: 64, offset: 128)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1347, file: !1334, line: 513, baseType: !1331, size: 64, offset: 192)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1333, file: !1334, line: 542, baseType: !1360, size: 128)
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1334, line: 530, size: 128, elements: !1361)
!1361 = !{!1362, !1363}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1360, file: !1334, line: 531, baseType: !1337, size: 32)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1360, file: !1334, line: 534, baseType: !1364, size: 64, offset: 64)
!1364 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1334, line: 525, baseType: !1365)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64)
!1366 = !DISubroutineType(types: !1367)
!1367 = !{!661, !730, !667, !684, !684}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1328, file: !904, line: 211, baseType: !6, size: 32, offset: 64)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1328, file: !904, line: 214, baseType: !669, size: 64, offset: 128)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1328, file: !904, line: 224, baseType: !1371, size: 64, offset: 192)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64)
!1372 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !904, line: 202, baseType: !1373)
!1373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !904, line: 202, size: 128, elements: !1374)
!1374 = !{!1375}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1373, file: !904, line: 202, baseType: !1376, size: 128)
!1376 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !904, line: 200, baseType: !1377)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !904, line: 200, size: 128, elements: !1378)
!1378 = !{!1379, !1380, !1381}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1377, file: !904, line: 200, baseType: !6, size: 32)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1377, file: !904, line: 200, baseType: !6, size: 32, offset: 32)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1377, file: !904, line: 200, baseType: !935, size: 64, offset: 64)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1328, file: !904, line: 234, baseType: !1371, size: 64, offset: 256)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1322, file: !904, line: 197, baseType: !669, size: 64, offset: 256)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !917, file: !904, line: 319, baseType: !791, size: 256)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !917, file: !904, line: 320, baseType: !810, size: 192)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !733, file: !140, line: 3384, baseType: !1387, size: 1472)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !140, line: 3114, size: 1472, elements: !1388)
!1388 = !{!1389, !1410, !1411, !1412, !1413}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1387, file: !140, line: 3115, baseType: !1390, size: 1216)
!1390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !140, line: 2984, size: 1216, elements: !1391)
!1391 = !{!1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1390, file: !140, line: 2985, baseType: !897, size: 960)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1390, file: !140, line: 2986, baseType: !730, size: 64, offset: 960)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1390, file: !140, line: 2987, baseType: !730, size: 64, offset: 1024)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1390, file: !140, line: 2988, baseType: !730, size: 64, offset: 1088)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1390, file: !140, line: 2991, baseType: !6, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1390, file: !140, line: 2992, baseType: !6, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1390, file: !140, line: 2993, baseType: !6, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1390, file: !140, line: 2994, baseType: !6, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1390, file: !140, line: 2995, baseType: !6, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1390, file: !140, line: 2996, baseType: !6, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1390, file: !140, line: 2998, baseType: !6, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1390, file: !140, line: 3000, baseType: !6, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1390, file: !140, line: 3002, baseType: !6, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1390, file: !140, line: 3003, baseType: !6, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1390, file: !140, line: 3004, baseType: !6, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1390, file: !140, line: 3005, baseType: !6, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1390, file: !140, line: 3007, baseType: !6, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1390, file: !140, line: 3010, baseType: !6, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1387, file: !140, line: 3117, baseType: !730, size: 64, offset: 1216)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1387, file: !140, line: 3119, baseType: !730, size: 64, offset: 1280)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1387, file: !140, line: 3121, baseType: !730, size: 64, offset: 1344)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1387, file: !140, line: 3123, baseType: !730, size: 64, offset: 1408)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !733, file: !140, line: 3385, baseType: !1415, size: 1088)
!1415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !140, line: 2874, size: 1088, elements: !1416)
!1416 = !{!1417, !1418, !1419}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1415, file: !140, line: 2875, baseType: !897, size: 960)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1415, file: !140, line: 2876, baseType: !901, size: 64, offset: 960)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1415, file: !140, line: 2877, baseType: !1420, size: 64, offset: 1024)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64)
!1421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1422, line: 172, size: 128, elements: !1423)
!1422 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1423 = !{!1424, !1425, !1426, !1427, !1428, !1429, !1430}
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1421, file: !1422, line: 174, baseType: !6, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1421, file: !1422, line: 178, baseType: !6, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1421, file: !1422, line: 183, baseType: !6, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1421, file: !1422, line: 187, baseType: !6, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1421, file: !1422, line: 192, baseType: !6, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1421, file: !1422, line: 195, baseType: !6, size: 32, offset: 32)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1421, file: !1422, line: 199, baseType: !730, size: 64, offset: 64)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !733, file: !140, line: 3386, baseType: !1390, size: 1216)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !733, file: !140, line: 3387, baseType: !1433, size: 1280)
!1433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !140, line: 3093, size: 1280, elements: !1434)
!1434 = !{!1435, !1436}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1433, file: !140, line: 3094, baseType: !1390, size: 1216)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1433, file: !140, line: 3095, baseType: !1420, size: 64, offset: 1216)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !733, file: !140, line: 3388, baseType: !1438, size: 1216)
!1438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !140, line: 2824, size: 1216, elements: !1439)
!1439 = !{!1440, !1441, !1442, !1443, !1444, !1445}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1438, file: !140, line: 2825, baseType: !859, size: 896)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1438, file: !140, line: 2827, baseType: !730, size: 64, offset: 896)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1438, file: !140, line: 2828, baseType: !730, size: 64, offset: 960)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1438, file: !140, line: 2829, baseType: !730, size: 64, offset: 1024)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1438, file: !140, line: 2830, baseType: !730, size: 64, offset: 1088)
