; ModuleID = 'tree-iterator.bc'
source_filename = "tree-iterator.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }

!199 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!200 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!201 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "profile_status_d", file: !202, line: 363, baseType: !7, size: 32, elements: !203)
!202 = !DIFile(filename: "./basic-block.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!203 = !{!204, !205, !206}
!204 = !DIEnumerator(name: "PROFILE_ABSENT", value: 0, isUnsigned: true)
!205 = !DIEnumerator(name: "PROFILE_GUESSED", value: 1, isUnsigned: true)
!206 = !DIEnumerator(name: "PROFILE_READ", value: 2, isUnsigned: true)
!207 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dom_state", file: !202, line: 355, baseType: !7, size: 32, elements: !208)
!208 = !{!209, !210, !211}
!209 = !DIEnumerator(name: "DOM_NONE", value: 0, isUnsigned: true)
!210 = !DIEnumerator(name: "DOM_NO_FAST_QUERY", value: 1, isUnsigned: true)
!211 = !DIEnumerator(name: "DOM_OK", value: 2, isUnsigned: true)
!212 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "calling_abi", file: !213, line: 474, baseType: !7, size: 32, elements: !214)
!213 = !DIFile(filename: "./config/i386/i386.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!214 = !{!215, !216}
!215 = !DIEnumerator(name: "SYSV_ABI", value: 0, isUnsigned: true)
!216 = !DIEnumerator(name: "MS_ABI", value: 1, isUnsigned: true)
!217 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_code", file: !6, line: 280, baseType: !7, size: 32, elements: !218)
!218 = !{!219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234}
!219 = !DIEnumerator(name: "OMP_CLAUSE_ERROR", value: 0, isUnsigned: true)
!220 = !DIEnumerator(name: "OMP_CLAUSE_PRIVATE", value: 1, isUnsigned: true)
!221 = !DIEnumerator(name: "OMP_CLAUSE_SHARED", value: 2, isUnsigned: true)
!222 = !DIEnumerator(name: "OMP_CLAUSE_FIRSTPRIVATE", value: 3, isUnsigned: true)
!223 = !DIEnumerator(name: "OMP_CLAUSE_LASTPRIVATE", value: 4, isUnsigned: true)
!224 = !DIEnumerator(name: "OMP_CLAUSE_REDUCTION", value: 5, isUnsigned: true)
!225 = !DIEnumerator(name: "OMP_CLAUSE_COPYIN", value: 6, isUnsigned: true)
!226 = !DIEnumerator(name: "OMP_CLAUSE_COPYPRIVATE", value: 7, isUnsigned: true)
!227 = !DIEnumerator(name: "OMP_CLAUSE_IF", value: 8, isUnsigned: true)
!228 = !DIEnumerator(name: "OMP_CLAUSE_NUM_THREADS", value: 9, isUnsigned: true)
!229 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE", value: 10, isUnsigned: true)
!230 = !DIEnumerator(name: "OMP_CLAUSE_NOWAIT", value: 11, isUnsigned: true)
!231 = !DIEnumerator(name: "OMP_CLAUSE_ORDERED", value: 12, isUnsigned: true)
!232 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT", value: 13, isUnsigned: true)
!233 = !DIEnumerator(name: "OMP_CLAUSE_COLLAPSE", value: 14, isUnsigned: true)
!234 = !DIEnumerator(name: "OMP_CLAUSE_UNTIED", value: 15, isUnsigned: true)
!235 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_default_kind", file: !6, line: 1817, baseType: !7, size: 32, elements: !236)
!236 = !{!237, !238, !239, !240, !241}
!237 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_UNSPECIFIED", value: 0, isUnsigned: true)
!238 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_SHARED", value: 1, isUnsigned: true)
!239 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_NONE", value: 2, isUnsigned: true)
!240 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_PRIVATE", value: 3, isUnsigned: true)
!241 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_FIRSTPRIVATE", value: 4, isUnsigned: true)
!242 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_schedule_kind", file: !6, line: 1805, baseType: !7, size: 32, elements: !243)
!243 = !{!244, !245, !246, !247, !248}
!244 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_STATIC", value: 0, isUnsigned: true)
!245 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_DYNAMIC", value: 1, isUnsigned: true)
!246 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_GUIDED", value: 2, isUnsigned: true)
!247 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_AUTO", value: 3, isUnsigned: true)
!248 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_RUNTIME", value: 4, isUnsigned: true)
!249 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tsi_iterator_update", file: !250, line: 95, baseType: !7, size: 32, elements: !251)
!250 = !DIFile(filename: "./tree-iterator.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!251 = !{!252, !253, !254, !255, !256}
!252 = !DIEnumerator(name: "TSI_NEW_STMT", value: 0, isUnsigned: true)
!253 = !DIEnumerator(name: "TSI_SAME_STMT", value: 1, isUnsigned: true)
!254 = !DIEnumerator(name: "TSI_CHAIN_START", value: 2, isUnsigned: true)
!255 = !DIEnumerator(name: "TSI_CHAIN_END", value: 3, isUnsigned: true)
!256 = !DIEnumerator(name: "TSI_CONTINUE_LINKING", value: 4, isUnsigned: true)
!257 = !{!258, !259, !260, !261, !264, !265, !5, !267, !273}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!260 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !263)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !6, line: 3320, size: 192, elements: !269)
!269 = !{!270, !271, !272}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !268, file: !6, line: 3322, baseType: !267, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !6, line: 3323, baseType: !267, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !268, file: !6, line: 3324, baseType: !273, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !274, line: 56, baseType: !275)
!274 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !6, line: 3371, size: 1792, elements: !277)
!277 = !{!278, !311, !317, !330, !337, !344, !349, !358, !364, !377, !389, !427, !435, !463, !471, !472, !477, !486, !492, !497, !501, !505, !970, !1019, !1025, !1031, !1038, !1049, !1074, !1091, !1097, !1119, !1134, !1306}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !276, file: !6, line: 3372, baseType: !279, size: 64)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !6, line: 360, size: 64, elements: !280)
!280 = !{!281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !279, file: !6, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !279, file: !6, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !279, file: !6, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !279, file: !6, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !279, file: !6, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !279, file: !6, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !279, file: !6, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !279, file: !6, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !279, file: !6, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !279, file: !6, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !279, file: !6, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !279, file: !6, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !279, file: !6, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !279, file: !6, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !279, file: !6, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !279, file: !6, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !279, file: !6, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !279, file: !6, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !279, file: !6, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !279, file: !6, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !279, file: !6, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !279, file: !6, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !279, file: !6, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !279, file: !6, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !279, file: !6, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !279, file: !6, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !279, file: !6, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !279, file: !6, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !279, file: !6, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !279, file: !6, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !276, file: !6, line: 3373, baseType: !312, size: 192)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !6, line: 402, size: 192, elements: !313)
!313 = !{!314, !315, !316}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !312, file: !6, line: 403, baseType: !279, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !312, file: !6, line: 404, baseType: !273, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !312, file: !6, line: 405, baseType: !273, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !276, file: !6, line: 3374, baseType: !318, size: 320)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !6, line: 1384, size: 320, elements: !319)
!319 = !{!320, !321}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !318, file: !6, line: 1385, baseType: !312, size: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !318, file: !6, line: 1386, baseType: !322, size: 128, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !323, line: 58, baseType: !324)
!323 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 54, size: 128, elements: !325)
!325 = !{!326, !328}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !324, file: !323, line: 56, baseType: !327, size: 64)
!327 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !324, file: !323, line: 57, baseType: !329, size: 64, offset: 64)
!329 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !276, file: !6, line: 3375, baseType: !331, size: 256)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !6, line: 1397, size: 256, elements: !332)
!332 = !{!333, !334}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !331, file: !6, line: 1398, baseType: !312, size: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !331, file: !6, line: 1399, baseType: !335, size: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !6, line: 1392, flags: DIFlagFwdDecl)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !276, file: !6, line: 3376, baseType: !338, size: 256)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !6, line: 1408, size: 256, elements: !339)
!339 = !{!340, !341}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !338, file: !6, line: 1409, baseType: !312, size: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !338, file: !6, line: 1410, baseType: !342, size: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !6, line: 1403, flags: DIFlagFwdDecl)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !276, file: !6, line: 3377, baseType: !345, size: 256)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !6, line: 1437, size: 256, elements: !346)
!346 = !{!347, !348}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !345, file: !6, line: 1438, baseType: !312, size: 192)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !345, file: !6, line: 1439, baseType: !273, size: 64, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !276, file: !6, line: 3378, baseType: !350, size: 256)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !6, line: 1418, size: 256, elements: !351)
!351 = !{!352, !353, !354}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !350, file: !6, line: 1419, baseType: !312, size: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !350, file: !6, line: 1420, baseType: !260, size: 32, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !350, file: !6, line: 1421, baseType: !355, size: 8, offset: 224)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 8, elements: !356)
!356 = !{!357}
!357 = !DISubrange(count: 1)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !276, file: !6, line: 3379, baseType: !359, size: 320)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !6, line: 1428, size: 320, elements: !360)
!360 = !{!361, !362, !363}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !359, file: !6, line: 1429, baseType: !312, size: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !359, file: !6, line: 1430, baseType: !273, size: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !359, file: !6, line: 1431, baseType: !273, size: 64, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !276, file: !6, line: 3380, baseType: !365, size: 320)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !6, line: 1460, size: 320, elements: !366)
!366 = !{!367, !368}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !365, file: !6, line: 1461, baseType: !312, size: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !365, file: !6, line: 1462, baseType: !369, size: 128, offset: 192)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !370, line: 31, size: 128, elements: !371)
!370 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!371 = !{!372, !375, !376}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !369, file: !370, line: 32, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !259)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !369, file: !370, line: 33, baseType: !7, size: 32, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !369, file: !370, line: 34, baseType: !7, size: 32, offset: 96)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !276, file: !6, line: 3381, baseType: !378, size: 384)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !6, line: 2507, size: 384, elements: !379)
!379 = !{!380, !381, !386, !387, !388}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !378, file: !6, line: 2508, baseType: !312, size: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !378, file: !6, line: 2509, baseType: !382, size: 32, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !383, line: 58, baseType: !384)
!383 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !385, line: 44, baseType: !7)
!385 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!386 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !378, file: !6, line: 2510, baseType: !7, size: 32, offset: 224)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !378, file: !6, line: 2511, baseType: !273, size: 64, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !378, file: !6, line: 2512, baseType: !273, size: 64, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !276, file: !6, line: 3382, baseType: !390, size: 896)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !6, line: 2652, size: 896, elements: !391)
!391 = !{!392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !390, file: !6, line: 2653, baseType: !378, size: 384)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !390, file: !6, line: 2654, baseType: !273, size: 64, offset: 384)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !390, file: !6, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !390, file: !6, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !390, file: !6, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !390, file: !6, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !390, file: !6, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !390, file: !6, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !390, file: !6, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !390, file: !6, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !390, file: !6, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !390, file: !6, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !390, file: !6, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !390, file: !6, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !390, file: !6, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !390, file: !6, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !390, file: !6, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !390, file: !6, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !390, file: !6, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !390, file: !6, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !390, file: !6, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !390, file: !6, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !390, file: !6, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !390, file: !6, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !390, file: !6, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !390, file: !6, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !390, file: !6, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !390, file: !6, line: 2703, baseType: !7, size: 32, offset: 512)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !390, file: !6, line: 2705, baseType: !273, size: 64, offset: 576)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !390, file: !6, line: 2706, baseType: !273, size: 64, offset: 640)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !390, file: !6, line: 2707, baseType: !273, size: 64, offset: 704)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !390, file: !6, line: 2708, baseType: !273, size: 64, offset: 768)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !390, file: !6, line: 2711, baseType: !425, size: 64, offset: 832)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !6, line: 2711, flags: DIFlagFwdDecl)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !276, file: !6, line: 3383, baseType: !428, size: 960)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !6, line: 2756, size: 960, elements: !429)
!429 = !{!430, !431}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !428, file: !6, line: 2757, baseType: !390, size: 896)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !428, file: !6, line: 2758, baseType: !432, size: 64, offset: 896)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !274, line: 50, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !274, line: 49, flags: DIFlagFwdDecl)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !276, file: !6, line: 3384, baseType: !436, size: 1472)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !6, line: 3114, size: 1472, elements: !437)
!437 = !{!438, !459, !460, !461, !462}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !436, file: !6, line: 3115, baseType: !439, size: 1216)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !6, line: 2984, size: 1216, elements: !440)
!440 = !{!441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !439, file: !6, line: 2985, baseType: !428, size: 960)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !439, file: !6, line: 2986, baseType: !273, size: 64, offset: 960)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !439, file: !6, line: 2987, baseType: !273, size: 64, offset: 1024)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !439, file: !6, line: 2988, baseType: !273, size: 64, offset: 1088)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !439, file: !6, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !439, file: !6, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !439, file: !6, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !439, file: !6, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !439, file: !6, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !439, file: !6, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !439, file: !6, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !439, file: !6, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !439, file: !6, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !439, file: !6, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !439, file: !6, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !439, file: !6, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !439, file: !6, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !439, file: !6, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !436, file: !6, line: 3117, baseType: !273, size: 64, offset: 1216)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !436, file: !6, line: 3119, baseType: !273, size: 64, offset: 1280)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !436, file: !6, line: 3121, baseType: !273, size: 64, offset: 1344)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !436, file: !6, line: 3123, baseType: !273, size: 64, offset: 1408)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !276, file: !6, line: 3385, baseType: !464, size: 1088)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !6, line: 2874, size: 1088, elements: !465)
!465 = !{!466, !467, !468}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !464, file: !6, line: 2875, baseType: !428, size: 960)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !464, file: !6, line: 2876, baseType: !432, size: 64, offset: 960)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !464, file: !6, line: 2877, baseType: !469, size: 64, offset: 1024)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !6, line: 2856, flags: DIFlagFwdDecl)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !276, file: !6, line: 3386, baseType: !439, size: 1216)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !276, file: !6, line: 3387, baseType: !473, size: 1280)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !6, line: 3093, size: 1280, elements: !474)
!474 = !{!475, !476}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !473, file: !6, line: 3094, baseType: !439, size: 1216)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !473, file: !6, line: 3095, baseType: !469, size: 64, offset: 1216)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !276, file: !6, line: 3388, baseType: !478, size: 1216)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !6, line: 2824, size: 1216, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !485}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !478, file: !6, line: 2825, baseType: !390, size: 896)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !478, file: !6, line: 2827, baseType: !273, size: 64, offset: 896)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !478, file: !6, line: 2828, baseType: !273, size: 64, offset: 960)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !478, file: !6, line: 2829, baseType: !273, size: 64, offset: 1024)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !478, file: !6, line: 2830, baseType: !273, size: 64, offset: 1088)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !478, file: !6, line: 2831, baseType: !273, size: 64, offset: 1152)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !276, file: !6, line: 3389, baseType: !487, size: 1024)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !6, line: 2850, size: 1024, elements: !488)
!488 = !{!489, !490, !491}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !487, file: !6, line: 2851, baseType: !428, size: 960)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !487, file: !6, line: 2852, baseType: !260, size: 32, offset: 960)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !487, file: !6, line: 2853, baseType: !260, size: 32, offset: 992)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !276, file: !6, line: 3390, baseType: !493, size: 1024)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !6, line: 2857, size: 1024, elements: !494)
!494 = !{!495, !496}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !493, file: !6, line: 2858, baseType: !428, size: 960)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !493, file: !6, line: 2859, baseType: !469, size: 64, offset: 960)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !276, file: !6, line: 3391, baseType: !498, size: 960)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !6, line: 2862, size: 960, elements: !499)
!499 = !{!500}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !498, file: !6, line: 2863, baseType: !428, size: 960)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !276, file: !6, line: 3392, baseType: !502, size: 1472)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !6, line: 3304, size: 1472, elements: !503)
!503 = !{!504}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !502, file: !6, line: 3305, baseType: !436, size: 1472)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !276, file: !6, line: 3393, baseType: !506, size: 1792)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !6, line: 3248, size: 1792, elements: !507)
!507 = !{!508, !509, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !506, file: !6, line: 3249, baseType: !436, size: 1472)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !506, file: !6, line: 3251, baseType: !510, size: 64, offset: 1472)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !512, line: 463, size: 1152, elements: !513)
!512 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!513 = !{!514, !517, !835, !836, !839, !842, !892, !893, !894, !895, !896, !922, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !511, file: !512, line: 464, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !512, line: 464, flags: DIFlagFwdDecl)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !511, file: !512, line: 467, baseType: !518, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !202, line: 374, size: 640, elements: !520)
!520 = !{!521, !810, !811, !824, !825, !826, !827, !828, !829, !831, !833, !834}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !519, file: !202, line: 377, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !274, line: 111, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !202, line: 217, size: 832, elements: !525)
!525 = !{!526, !773, !774, !775, !778, !784, !785, !786, !804, !805, !806, !807, !808, !809}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !524, file: !202, line: 219, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !202, line: 151, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !202, line: 151, size: 128, elements: !530)
!530 = !{!531}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !529, file: !202, line: 151, baseType: !532, size: 128)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !202, line: 150, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !202, line: 150, size: 128, elements: !534)
!534 = !{!535, !536, !537}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !533, file: !202, line: 150, baseType: !7, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !533, file: !202, line: 150, baseType: !7, size: 32, offset: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !533, file: !202, line: 150, baseType: !538, size: 64, offset: 64)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 64, elements: !356)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !274, line: 108, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !202, line: 122, size: 512, elements: !542)
!542 = !{!543, !544, !545, !765, !766, !767, !768, !769, !770, !771}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !541, file: !202, line: 124, baseType: !523, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !541, file: !202, line: 125, baseType: !523, size: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !541, file: !202, line: 131, baseType: !546, size: 64, offset: 128)
!546 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !202, line: 128, size: 64, elements: !547)
!547 = !{!548, !764}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !546, file: !202, line: 129, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !274, line: 66, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !552, line: 143, size: 192, elements: !553)
!552 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!553 = !{!554, !762, !763}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !551, file: !552, line: 145, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !274, line: 69, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !552, line: 136, size: 192, elements: !558)
!558 = !{!559, !760, !761}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !557, file: !552, line: 137, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !274, line: 58, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !552, line: 737, size: 768, elements: !563)
!563 = !{!564, !581, !615, !621, !626, !631, !638, !644, !650, !655, !669, !674, !680, !685, !695, !700, !718, !725, !732, !738, !743, !749, !755}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !562, file: !552, line: 738, baseType: !565, size: 256)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !552, line: 271, size: 256, elements: !566)
!566 = !{!567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !565, file: !552, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !565, file: !552, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !565, file: !552, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !565, file: !552, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !565, file: !552, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !565, file: !552, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !565, file: !552, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !565, file: !552, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !565, file: !552, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !565, file: !552, line: 312, baseType: !7, size: 32, offset: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !565, file: !552, line: 316, baseType: !382, size: 32, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !565, file: !552, line: 319, baseType: !7, size: 32, offset: 96)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !565, file: !552, line: 323, baseType: !523, size: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !565, file: !552, line: 327, baseType: !273, size: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !562, file: !552, line: 739, baseType: !582, size: 448)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !552, line: 350, size: 448, elements: !583)
!583 = !{!584, !613}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !582, file: !552, line: 353, baseType: !585, size: 384)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !552, line: 333, size: 384, elements: !586)
!586 = !{!587, !588, !596}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !585, file: !552, line: 336, baseType: !565, size: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !585, file: !552, line: 343, baseType: !589, size: 64, offset: 256)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !591, line: 37, size: 128, elements: !592)
!591 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!592 = !{!593, !594}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !590, file: !591, line: 39, baseType: !589, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !590, file: !591, line: 40, baseType: !595, size: 64, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !585, file: !552, line: 344, baseType: !597, size: 64, offset: 320)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !591, line: 45, size: 320, elements: !599)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !598, file: !591, line: 47, baseType: !597, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !598, file: !591, line: 48, baseType: !602, size: 256, offset: 64)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !6, line: 1883, size: 256, elements: !603)
!603 = !{!604, !606, !607, !612}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !602, file: !6, line: 1884, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !602, file: !6, line: 1885, baseType: !605, size: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !602, file: !6, line: 1891, baseType: !608, size: 64, offset: 128)
!608 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !602, file: !6, line: 1891, size: 64, elements: !609)
!609 = !{!610, !611}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !608, file: !6, line: 1891, baseType: !560, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !608, file: !6, line: 1891, baseType: !273, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !602, file: !6, line: 1892, baseType: !595, size: 64, offset: 192)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !582, file: !552, line: 359, baseType: !614, size: 64, offset: 384)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 64, elements: !356)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !562, file: !552, line: 740, baseType: !616, size: 512)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !552, line: 365, size: 512, elements: !617)
!617 = !{!618, !619, !620}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !616, file: !552, line: 368, baseType: !585, size: 384)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !616, file: !552, line: 373, baseType: !273, size: 64, offset: 384)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !616, file: !552, line: 374, baseType: !273, size: 64, offset: 448)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !562, file: !552, line: 741, baseType: !622, size: 576)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !552, line: 380, size: 576, elements: !623)
!623 = !{!624, !625}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !622, file: !552, line: 383, baseType: !616, size: 512)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !622, file: !552, line: 389, baseType: !614, size: 64, offset: 512)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !562, file: !552, line: 742, baseType: !627, size: 320)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !552, line: 395, size: 320, elements: !628)
!628 = !{!629, !630}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !627, file: !552, line: 397, baseType: !565, size: 256)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !627, file: !552, line: 400, baseType: !549, size: 64, offset: 256)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !562, file: !552, line: 743, baseType: !632, size: 448)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !552, line: 406, size: 448, elements: !633)
!633 = !{!634, !635, !636, !637}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !632, file: !552, line: 408, baseType: !565, size: 256)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !632, file: !552, line: 412, baseType: !273, size: 64, offset: 256)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !632, file: !552, line: 420, baseType: !273, size: 64, offset: 320)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !632, file: !552, line: 423, baseType: !549, size: 64, offset: 384)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !562, file: !552, line: 744, baseType: !639, size: 384)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !552, line: 429, size: 384, elements: !640)
!640 = !{!641, !642, !643}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !639, file: !552, line: 431, baseType: !565, size: 256)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !639, file: !552, line: 434, baseType: !273, size: 64, offset: 256)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !639, file: !552, line: 437, baseType: !549, size: 64, offset: 320)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !562, file: !552, line: 745, baseType: !645, size: 384)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !552, line: 443, size: 384, elements: !646)
!646 = !{!647, !648, !649}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !645, file: !552, line: 445, baseType: !565, size: 256)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !645, file: !552, line: 449, baseType: !273, size: 64, offset: 256)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !645, file: !552, line: 453, baseType: !549, size: 64, offset: 320)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !562, file: !552, line: 746, baseType: !651, size: 320)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !552, line: 459, size: 320, elements: !652)
!652 = !{!653, !654}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !651, file: !552, line: 461, baseType: !565, size: 256)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !651, file: !552, line: 464, baseType: !273, size: 64, offset: 256)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !562, file: !552, line: 747, baseType: !656, size: 768)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !552, line: 469, size: 768, elements: !657)
!657 = !{!658, !659, !660, !661, !662}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !656, file: !552, line: 471, baseType: !565, size: 256)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !656, file: !552, line: 474, baseType: !7, size: 32, offset: 256)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !656, file: !552, line: 475, baseType: !7, size: 32, offset: 288)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !656, file: !552, line: 478, baseType: !273, size: 64, offset: 320)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !656, file: !552, line: 481, baseType: !663, size: 384, offset: 384)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !664, size: 384, elements: !356)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !6, line: 1917, size: 384, elements: !665)
!665 = !{!666, !667, !668}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !664, file: !6, line: 1920, baseType: !602, size: 256)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !664, file: !6, line: 1921, baseType: !273, size: 64, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !664, file: !6, line: 1922, baseType: !382, size: 32, offset: 320)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !562, file: !552, line: 748, baseType: !670, size: 320)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !552, line: 487, size: 320, elements: !671)
!671 = !{!672, !673}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !670, file: !552, line: 490, baseType: !565, size: 256)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !670, file: !552, line: 494, baseType: !260, size: 32, offset: 256)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !562, file: !552, line: 749, baseType: !675, size: 384)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !552, line: 500, size: 384, elements: !676)
!676 = !{!677, !678, !679}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !675, file: !552, line: 502, baseType: !565, size: 256)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !675, file: !552, line: 506, baseType: !549, size: 64, offset: 256)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !675, file: !552, line: 510, baseType: !549, size: 64, offset: 320)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !562, file: !552, line: 750, baseType: !681, size: 320)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !552, line: 529, size: 320, elements: !682)
!682 = !{!683, !684}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !681, file: !552, line: 531, baseType: !565, size: 256)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !681, file: !552, line: 540, baseType: !549, size: 64, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !562, file: !552, line: 751, baseType: !686, size: 704)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !552, line: 546, size: 704, elements: !687)
!687 = !{!688, !689, !690, !691, !692, !693, !694}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !686, file: !552, line: 549, baseType: !616, size: 512)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !686, file: !552, line: 553, baseType: !265, size: 64, offset: 512)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !686, file: !552, line: 557, baseType: !259, size: 8, offset: 576)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !686, file: !552, line: 558, baseType: !259, size: 8, offset: 584)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !686, file: !552, line: 559, baseType: !259, size: 8, offset: 592)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !686, file: !552, line: 560, baseType: !259, size: 8, offset: 600)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !686, file: !552, line: 566, baseType: !614, size: 64, offset: 640)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !562, file: !552, line: 752, baseType: !696, size: 384)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !552, line: 571, size: 384, elements: !697)
!697 = !{!698, !699}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !696, file: !552, line: 573, baseType: !627, size: 320)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !696, file: !552, line: 577, baseType: !273, size: 64, offset: 320)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !562, file: !552, line: 753, baseType: !701, size: 576)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !552, line: 600, size: 576, elements: !702)
!702 = !{!703, !704, !705, !708, !717}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !701, file: !552, line: 602, baseType: !627, size: 320)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !701, file: !552, line: 605, baseType: !273, size: 64, offset: 320)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !701, file: !552, line: 609, baseType: !706, size: 64, offset: 384)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !707, line: 46, baseType: !327)
!707 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!708 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !701, file: !552, line: 612, baseType: !709, size: 64, offset: 448)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !552, line: 581, size: 320, elements: !711)
!711 = !{!712, !713, !714, !715, !716}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !710, file: !552, line: 583, baseType: !5, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !710, file: !552, line: 586, baseType: !273, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !710, file: !552, line: 589, baseType: !273, size: 64, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !710, file: !552, line: 592, baseType: !273, size: 64, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !710, file: !552, line: 595, baseType: !273, size: 64, offset: 256)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !701, file: !552, line: 616, baseType: !549, size: 64, offset: 512)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !562, file: !552, line: 754, baseType: !719, size: 512)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !552, line: 622, size: 512, elements: !720)
!720 = !{!721, !722, !723, !724}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !719, file: !552, line: 624, baseType: !627, size: 320)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !719, file: !552, line: 628, baseType: !273, size: 64, offset: 320)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !719, file: !552, line: 632, baseType: !273, size: 64, offset: 384)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !719, file: !552, line: 636, baseType: !273, size: 64, offset: 448)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !562, file: !552, line: 755, baseType: !726, size: 704)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !552, line: 642, size: 704, elements: !727)
!727 = !{!728, !729, !730, !731}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !726, file: !552, line: 644, baseType: !719, size: 512)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !726, file: !552, line: 648, baseType: !273, size: 64, offset: 512)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !726, file: !552, line: 652, baseType: !273, size: 64, offset: 576)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !726, file: !552, line: 653, baseType: !273, size: 64, offset: 640)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !562, file: !552, line: 756, baseType: !733, size: 448)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !552, line: 663, size: 448, elements: !734)
!734 = !{!735, !736, !737}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !733, file: !552, line: 665, baseType: !627, size: 320)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !733, file: !552, line: 668, baseType: !273, size: 64, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !733, file: !552, line: 673, baseType: !273, size: 64, offset: 384)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !562, file: !552, line: 757, baseType: !739, size: 384)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !552, line: 694, size: 384, elements: !740)
!740 = !{!741, !742}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !739, file: !552, line: 696, baseType: !627, size: 320)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !739, file: !552, line: 699, baseType: !273, size: 64, offset: 320)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !562, file: !552, line: 758, baseType: !744, size: 384)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !552, line: 681, size: 384, elements: !745)
!745 = !{!746, !747, !748}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !744, file: !552, line: 683, baseType: !565, size: 256)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !744, file: !552, line: 686, baseType: !273, size: 64, offset: 256)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !744, file: !552, line: 689, baseType: !273, size: 64, offset: 320)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !562, file: !552, line: 759, baseType: !750, size: 384)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !552, line: 707, size: 384, elements: !751)
!751 = !{!752, !753, !754}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !750, file: !552, line: 709, baseType: !565, size: 256)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !750, file: !552, line: 712, baseType: !273, size: 64, offset: 256)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !750, file: !552, line: 712, baseType: !273, size: 64, offset: 320)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !562, file: !552, line: 760, baseType: !756, size: 320)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !552, line: 718, size: 320, elements: !757)
!757 = !{!758, !759}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !756, file: !552, line: 720, baseType: !565, size: 256)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !756, file: !552, line: 723, baseType: !273, size: 64, offset: 256)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !557, file: !552, line: 138, baseType: !556, size: 64, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !557, file: !552, line: 139, baseType: !556, size: 64, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !551, file: !552, line: 146, baseType: !555, size: 64, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !551, file: !552, line: 152, baseType: !549, size: 64, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !546, file: !202, line: 130, baseType: !432, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !541, file: !202, line: 134, baseType: !264, size: 64, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !541, file: !202, line: 137, baseType: !273, size: 64, offset: 256)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !541, file: !202, line: 138, baseType: !382, size: 32, offset: 320)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !541, file: !202, line: 142, baseType: !7, size: 32, offset: 352)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !541, file: !202, line: 144, baseType: !260, size: 32, offset: 384)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !541, file: !202, line: 145, baseType: !260, size: 32, offset: 416)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !541, file: !202, line: 146, baseType: !772, size: 64, offset: 448)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !202, line: 119, baseType: !329)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !524, file: !202, line: 220, baseType: !527, size: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !524, file: !202, line: 223, baseType: !264, size: 64, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !524, file: !202, line: 226, baseType: !776, size: 64, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !202, line: 185, flags: DIFlagFwdDecl)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !524, file: !202, line: 229, baseType: !779, size: 128, offset: 256)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !780, size: 128, elements: !782)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !202, line: 229, flags: DIFlagFwdDecl)
!782 = !{!783}
!783 = !DISubrange(count: 2)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !524, file: !202, line: 232, baseType: !523, size: 64, offset: 384)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !524, file: !202, line: 233, baseType: !523, size: 64, offset: 448)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !524, file: !202, line: 238, baseType: !787, size: 64, offset: 512)
!787 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !202, line: 235, size: 64, elements: !788)
!788 = !{!789, !795}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !787, file: !202, line: 236, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !202, line: 273, size: 128, elements: !792)
!792 = !{!793, !794}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !791, file: !202, line: 275, baseType: !549, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !791, file: !202, line: 278, baseType: !549, size: 64, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !787, file: !202, line: 237, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !202, line: 259, size: 320, elements: !798)
!798 = !{!799, !800, !801, !802, !803}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !797, file: !202, line: 261, baseType: !432, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !797, file: !202, line: 262, baseType: !432, size: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !797, file: !202, line: 266, baseType: !432, size: 64, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !797, file: !202, line: 267, baseType: !432, size: 64, offset: 192)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !797, file: !202, line: 270, baseType: !260, size: 32, offset: 256)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !524, file: !202, line: 241, baseType: !772, size: 64, offset: 576)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !524, file: !202, line: 244, baseType: !260, size: 32, offset: 640)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !524, file: !202, line: 247, baseType: !260, size: 32, offset: 672)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !524, file: !202, line: 250, baseType: !260, size: 32, offset: 704)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !524, file: !202, line: 253, baseType: !260, size: 32, offset: 736)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !524, file: !202, line: 256, baseType: !260, size: 32, offset: 768)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !519, file: !202, line: 378, baseType: !522, size: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !519, file: !202, line: 381, baseType: !812, size: 64, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !202, line: 282, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !202, line: 282, size: 128, elements: !815)
!815 = !{!816}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !814, file: !202, line: 282, baseType: !817, size: 128)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !202, line: 281, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !202, line: 281, size: 128, elements: !819)
!819 = !{!820, !821, !822}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !818, file: !202, line: 281, baseType: !7, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !818, file: !202, line: 281, baseType: !7, size: 32, offset: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !818, file: !202, line: 281, baseType: !823, size: 64, offset: 64)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !522, size: 64, elements: !356)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !519, file: !202, line: 384, baseType: !260, size: 32, offset: 192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !519, file: !202, line: 387, baseType: !260, size: 32, offset: 224)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !519, file: !202, line: 390, baseType: !260, size: 32, offset: 256)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !519, file: !202, line: 394, baseType: !812, size: 64, offset: 320)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !519, file: !202, line: 396, baseType: !201, size: 32, offset: 384)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !519, file: !202, line: 399, baseType: !830, size: 64, offset: 416)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 64, elements: !782)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !519, file: !202, line: 402, baseType: !832, size: 64, offset: 480)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !782)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !519, file: !202, line: 406, baseType: !260, size: 32, offset: 544)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !519, file: !202, line: 409, baseType: !260, size: 32, offset: 576)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !511, file: !512, line: 470, baseType: !550, size: 64, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !511, file: !512, line: 473, baseType: !837, size: 64, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !512, line: 166, flags: DIFlagFwdDecl)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !511, file: !512, line: 476, baseType: !840, size: 64, offset: 256)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !512, line: 476, flags: DIFlagFwdDecl)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !511, file: !512, line: 479, baseType: !843, size: 64, offset: 320)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !844, line: 144, baseType: !845)
!844 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !844, line: 100, size: 896, elements: !847)
!847 = !{!848, !856, !861, !866, !868, !869, !870, !871, !872, !873, !878, !880, !881, !886, !891}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !846, file: !844, line: 102, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !844, line: 52, baseType: !850)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!853, !854}
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !844, line: 47, baseType: !7)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !846, file: !844, line: 105, baseType: !857, size: 64, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !844, line: 59, baseType: !858)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!260, !854, !854}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !846, file: !844, line: 108, baseType: !862, size: 64, offset: 128)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !844, line: 63, baseType: !863)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{null, !264}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !846, file: !844, line: 111, baseType: !867, size: 64, offset: 192)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !846, file: !844, line: 114, baseType: !706, size: 64, offset: 256)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !846, file: !844, line: 117, baseType: !706, size: 64, offset: 320)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !846, file: !844, line: 120, baseType: !706, size: 64, offset: 384)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !846, file: !844, line: 124, baseType: !7, size: 32, offset: 448)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !846, file: !844, line: 128, baseType: !7, size: 32, offset: 480)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !846, file: !844, line: 131, baseType: !874, size: 64, offset: 512)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !844, line: 75, baseType: !875)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!264, !706, !706}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !846, file: !844, line: 132, baseType: !879, size: 64, offset: 576)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !844, line: 78, baseType: !863)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !846, file: !844, line: 135, baseType: !264, size: 64, offset: 640)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !846, file: !844, line: 136, baseType: !882, size: 64, offset: 704)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !844, line: 82, baseType: !883)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DISubroutineType(types: !885)
!885 = !{!264, !264, !706, !706}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !846, file: !844, line: 137, baseType: !887, size: 64, offset: 768)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !844, line: 83, baseType: !888)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{null, !264, !264}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !846, file: !844, line: 141, baseType: !7, size: 32, offset: 832)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !511, file: !512, line: 484, baseType: !273, size: 64, offset: 384)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !511, file: !512, line: 488, baseType: !273, size: 64, offset: 448)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !511, file: !512, line: 493, baseType: !273, size: 64, offset: 512)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !511, file: !512, line: 496, baseType: !273, size: 64, offset: 576)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !511, file: !512, line: 501, baseType: !897, size: 64, offset: 640)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !213, line: 2355, size: 576, elements: !899)
!899 = !{!900, !903, !904, !905, !906, !910, !911, !916, !917, !918, !919, !920, !921}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !898, file: !213, line: 2356, baseType: !901, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !213, line: 2356, flags: DIFlagFwdDecl)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !898, file: !213, line: 2357, baseType: !265, size: 64, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !898, file: !213, line: 2358, baseType: !260, size: 32, offset: 128)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !898, file: !213, line: 2359, baseType: !260, size: 32, offset: 160)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !898, file: !213, line: 2360, baseType: !907, size: 128, offset: 192)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 128, elements: !908)
!908 = !{!909}
!909 = !DISubrange(count: 4)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !898, file: !213, line: 2364, baseType: !260, size: 32, offset: 320)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !898, file: !213, line: 2367, baseType: !912, size: 128, offset: 384)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !213, line: 2349, size: 128, elements: !913)
!913 = !{!914, !915}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !912, file: !213, line: 2351, baseType: !432, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !912, file: !213, line: 2352, baseType: !329, size: 64, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !898, file: !213, line: 2371, baseType: !212, size: 32, offset: 512)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !898, file: !213, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !898, file: !213, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !898, file: !213, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !898, file: !213, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !898, file: !213, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !511, file: !512, line: 504, baseType: !923, size: 64, offset: 704)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !512, line: 504, flags: DIFlagFwdDecl)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !511, file: !512, line: 507, baseType: !843, size: 64, offset: 768)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !511, file: !512, line: 510, baseType: !260, size: 32, offset: 832)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !511, file: !512, line: 513, baseType: !260, size: 32, offset: 864)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !511, file: !512, line: 516, baseType: !382, size: 32, offset: 896)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !511, file: !512, line: 519, baseType: !382, size: 32, offset: 928)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !511, file: !512, line: 522, baseType: !7, size: 32, offset: 960)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !511, file: !512, line: 523, baseType: !7, size: 32, offset: 992)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !511, file: !512, line: 528, baseType: !265, size: 64, offset: 1024)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !511, file: !512, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !511, file: !512, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !511, file: !512, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !511, file: !512, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !511, file: !512, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !511, file: !512, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !511, file: !512, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !511, file: !512, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !511, file: !512, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !511, file: !512, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !511, file: !512, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !511, file: !512, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !511, file: !512, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !511, file: !512, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !511, file: !512, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !511, file: !512, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !506, file: !6, line: 3254, baseType: !273, size: 64, offset: 1536)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !506, file: !6, line: 3257, baseType: !273, size: 64, offset: 1600)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !506, file: !6, line: 3258, baseType: !273, size: 64, offset: 1664)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !506, file: !6, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !506, file: !6, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !506, file: !6, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !506, file: !6, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !506, file: !6, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !506, file: !6, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !506, file: !6, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !506, file: !6, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !506, file: !6, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !506, file: !6, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !506, file: !6, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !506, file: !6, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !506, file: !6, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !506, file: !6, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !506, file: !6, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !506, file: !6, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !506, file: !6, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !506, file: !6, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !276, file: !6, line: 3394, baseType: !971, size: 1344)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !6, line: 2279, size: 1344, elements: !972)
!972 = !{!973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !998, !999, !1000, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !971, file: !6, line: 2280, baseType: !312, size: 192)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !971, file: !6, line: 2281, baseType: !273, size: 64, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !971, file: !6, line: 2282, baseType: !273, size: 64, offset: 256)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !971, file: !6, line: 2283, baseType: !273, size: 64, offset: 320)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !971, file: !6, line: 2284, baseType: !273, size: 64, offset: 384)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !971, file: !6, line: 2285, baseType: !7, size: 32, offset: 448)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !971, file: !6, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !971, file: !6, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !971, file: !6, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !971, file: !6, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !971, file: !6, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !971, file: !6, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !971, file: !6, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !971, file: !6, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !971, file: !6, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !971, file: !6, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !971, file: !6, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !971, file: !6, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !971, file: !6, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !971, file: !6, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !971, file: !6, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !971, file: !6, line: 2305, baseType: !7, size: 32, offset: 512)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !971, file: !6, line: 2306, baseType: !996, size: 32, offset: 544)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !997, line: 31, baseType: !260)
!997 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!998 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !971, file: !6, line: 2307, baseType: !273, size: 64, offset: 576)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !971, file: !6, line: 2308, baseType: !273, size: 64, offset: 640)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !971, file: !6, line: 2314, baseType: !1001, size: 64, offset: 704)
!1001 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !6, line: 2309, size: 64, elements: !1002)
!1002 = !{!1003, !1004, !1005}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1001, file: !6, line: 2310, baseType: !260, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1001, file: !6, line: 2311, baseType: !265, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1001, file: !6, line: 2312, baseType: !1006, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !6, line: 2277, flags: DIFlagFwdDecl)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !971, file: !6, line: 2315, baseType: !273, size: 64, offset: 768)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !971, file: !6, line: 2316, baseType: !273, size: 64, offset: 832)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !971, file: !6, line: 2317, baseType: !273, size: 64, offset: 896)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !971, file: !6, line: 2318, baseType: !273, size: 64, offset: 960)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !971, file: !6, line: 2319, baseType: !273, size: 64, offset: 1024)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !971, file: !6, line: 2320, baseType: !273, size: 64, offset: 1088)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !971, file: !6, line: 2321, baseType: !273, size: 64, offset: 1152)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !971, file: !6, line: 2322, baseType: !273, size: 64, offset: 1216)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !971, file: !6, line: 2324, baseType: !1017, size: 64, offset: 1280)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
