; ModuleID = 'tree-ssa-copy.bc'
source_filename = "tree-ssa-copy.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }

!607 = !DIEnumerator(name: "GIMPLE_SWITCH", value: 5, isUnsigned: true)
!608 = !DIEnumerator(name: "GIMPLE_ASSIGN", value: 6, isUnsigned: true)
!609 = !DIEnumerator(name: "GIMPLE_ASM", value: 7, isUnsigned: true)
!610 = !DIEnumerator(name: "GIMPLE_CALL", value: 8, isUnsigned: true)
!611 = !DIEnumerator(name: "GIMPLE_RETURN", value: 9, isUnsigned: true)
!612 = !DIEnumerator(name: "GIMPLE_BIND", value: 10, isUnsigned: true)
!613 = !DIEnumerator(name: "GIMPLE_CATCH", value: 11, isUnsigned: true)
!614 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!615 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!616 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!617 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!618 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!619 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!620 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!621 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!622 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!623 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!624 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!625 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!626 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!627 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!628 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!629 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!630 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!631 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!632 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!633 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!634 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!635 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!636 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!637 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!638 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ssa_op_iter_type", file: !639, line: 119, baseType: !7, size: 32, elements: !640)
!639 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!640 = !{!641, !642, !643, !644}
!641 = !DIEnumerator(name: "ssa_op_iter_none", value: 0, isUnsigned: true)
!642 = !DIEnumerator(name: "ssa_op_iter_tree", value: 1, isUnsigned: true)
!643 = !DIEnumerator(name: "ssa_op_iter_use", value: 2, isUnsigned: true)
!644 = !DIEnumerator(name: "ssa_op_iter_def", value: 3, isUnsigned: true)
!645 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !574, line: 80, baseType: !7, size: 32, elements: !646)
!646 = !{!647, !648, !649, !650}
!647 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!648 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!649 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!650 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!651 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ssa_prop_result", file: !652, line: 44, baseType: !7, size: 32, elements: !653)
!652 = !DIFile(filename: "./tree-ssa-propagate.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!653 = !{!654, !655, !656}
!654 = !DIEnumerator(name: "SSA_PROP_NOT_INTERESTING", value: 0, isUnsigned: true)
!655 = !DIEnumerator(name: "SSA_PROP_INTERESTING", value: 1, isUnsigned: true)
!656 = !DIEnumerator(name: "SSA_PROP_VARYING", value: 2, isUnsigned: true)
!657 = !{!658, !659, !660, !661, !664, !665, !134, !667, !794, !992, !2051, !1025, !662, !2053, !7, !645, !721}
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!660 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !663)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !668, line: 56, baseType: !669)
!668 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !671)
!671 = !{!672, !705, !711, !724, !743, !754, !759, !768, !774, !787, !799, !837, !1381, !1409, !1426, !1427, !1432, !1441, !1447, !1452, !1456, !1460, !1702, !1749, !1755, !1761, !1768, !1781, !1795, !1812, !1824, !1846, !1861, !2033}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !670, file: !135, line: 3372, baseType: !673, size: 64)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !674)
!674 = !{!675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !673, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !673, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !673, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !673, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !673, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !673, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !673, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !673, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !673, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !673, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !673, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !673, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !673, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !673, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !673, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !673, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !673, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !673, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !673, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !673, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !673, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !673, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !673, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !673, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !673, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !673, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !673, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !673, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !673, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !673, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !670, file: !135, line: 3373, baseType: !706, size: 192)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !707)
!707 = !{!708, !709, !710}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !706, file: !135, line: 403, baseType: !673, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !706, file: !135, line: 404, baseType: !667, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !706, file: !135, line: 405, baseType: !667, size: 64, offset: 128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !670, file: !135, line: 3374, baseType: !712, size: 320)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !713)
!713 = !{!714, !715}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !712, file: !135, line: 1385, baseType: !706, size: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !712, file: !135, line: 1386, baseType: !716, size: 128, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !717, line: 58, baseType: !718)
!717 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !717, line: 54, size: 128, elements: !719)
!719 = !{!720, !722}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !718, file: !717, line: 56, baseType: !721, size: 64)
!721 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !718, file: !717, line: 57, baseType: !723, size: 64, offset: 64)
!723 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !670, file: !135, line: 3375, baseType: !725, size: 256)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !726)
!726 = !{!727, !728}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !725, file: !135, line: 1398, baseType: !706, size: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !725, file: !135, line: 1399, baseType: !729, size: 64, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !731, line: 52, size: 256, elements: !732)
!731 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!732 = !{!733, !734, !735, !736, !737, !738, !739}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !730, file: !731, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !730, file: !731, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !730, file: !731, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !730, file: !731, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !730, file: !731, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !730, file: !731, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !730, file: !731, line: 62, baseType: !740, size: 192, offset: 64)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !721, size: 192, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 3)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !670, file: !135, line: 3376, baseType: !744, size: 256)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !745)
!745 = !{!746, !747}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !744, file: !135, line: 1409, baseType: !706, size: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !744, file: !135, line: 1410, baseType: !748, size: 64, offset: 192)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !750, line: 27, size: 192, elements: !751)
!750 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!751 = !{!752, !753}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !749, file: !750, line: 29, baseType: !716, size: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !749, file: !750, line: 30, baseType: !5, size: 32, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !670, file: !135, line: 3377, baseType: !755, size: 256)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !756)
!756 = !{!757, !758}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !755, file: !135, line: 1438, baseType: !706, size: 192)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !755, file: !135, line: 1439, baseType: !667, size: 64, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !670, file: !135, line: 3378, baseType: !760, size: 256)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !761)
!761 = !{!762, !763, !764}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !760, file: !135, line: 1419, baseType: !706, size: 192)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !760, file: !135, line: 1420, baseType: !660, size: 32, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !760, file: !135, line: 1421, baseType: !765, size: 8, offset: 224)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 8, elements: !766)
!766 = !{!767}
!767 = !DISubrange(count: 1)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !670, file: !135, line: 3379, baseType: !769, size: 320)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !770)
!770 = !{!771, !772, !773}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !769, file: !135, line: 1429, baseType: !706, size: 192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !769, file: !135, line: 1430, baseType: !667, size: 64, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !769, file: !135, line: 1431, baseType: !667, size: 64, offset: 256)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !670, file: !135, line: 3380, baseType: !775, size: 320)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !776)
!776 = !{!777, !778}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !775, file: !135, line: 1461, baseType: !706, size: 192)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !775, file: !135, line: 1462, baseType: !779, size: 128, offset: 192)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !780, line: 31, size: 128, elements: !781)
!780 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!781 = !{!782, !785, !786}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !779, file: !780, line: 32, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !659)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !779, file: !780, line: 33, baseType: !7, size: 32, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !779, file: !780, line: 34, baseType: !7, size: 32, offset: 96)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !670, file: !135, line: 3381, baseType: !788, size: 384)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !789)
!789 = !{!790, !791, !796, !797, !798}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !788, file: !135, line: 2508, baseType: !706, size: 192)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !788, file: !135, line: 2509, baseType: !792, size: 32, offset: 192)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !793, line: 58, baseType: !794)
!793 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !795, line: 44, baseType: !7)
!795 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!796 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !788, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !788, file: !135, line: 2511, baseType: !667, size: 64, offset: 256)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !788, file: !135, line: 2512, baseType: !667, size: 64, offset: 320)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !670, file: !135, line: 3382, baseType: !800, size: 896)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !801)
!801 = !{!802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !800, file: !135, line: 2653, baseType: !788, size: 384)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !800, file: !135, line: 2654, baseType: !667, size: 64, offset: 384)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !800, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !800, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !800, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !800, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !800, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !800, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !800, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !800, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !800, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !800, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !800, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !800, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !800, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !800, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !800, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !800, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !800, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !800, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !800, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !800, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !800, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !800, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !800, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !800, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !800, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !800, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !800, file: !135, line: 2705, baseType: !667, size: 64, offset: 576)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !800, file: !135, line: 2706, baseType: !667, size: 64, offset: 640)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !800, file: !135, line: 2707, baseType: !667, size: 64, offset: 704)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !800, file: !135, line: 2708, baseType: !667, size: 64, offset: 768)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !800, file: !135, line: 2711, baseType: !835, size: 64, offset: 832)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !670, file: !135, line: 3383, baseType: !838, size: 960)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !839)
!839 = !{!840, !841}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !838, file: !135, line: 2757, baseType: !800, size: 896)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !838, file: !135, line: 2758, baseType: !842, size: 64, offset: 896)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !668, line: 50, baseType: !843)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !845, line: 240, size: 384, elements: !846)
!845 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!846 = !{!847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !844, file: !845, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !844, file: !845, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !844, file: !845, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !844, file: !845, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !844, file: !845, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !844, file: !845, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !844, file: !845, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !844, file: !845, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !844, file: !845, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !844, file: !845, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !844, file: !845, line: 321, baseType: !858, size: 320, offset: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !845, line: 315, size: 320, elements: !859)
!859 = !{!860, !1314, !1316, !1379, !1380}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !858, file: !845, line: 316, baseType: !861, size: 64)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !862, size: 64, elements: !766)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !845, line: 183, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !845, line: 166, size: 64, elements: !864)
!864 = !{!865, !866, !867, !868, !869, !877, !878, !890, !893, !953, !954, !1291, !1304, !1311}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !863, file: !845, line: 168, baseType: !660, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !863, file: !845, line: 169, baseType: !7, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !863, file: !845, line: 170, baseType: !665, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !863, file: !845, line: 171, baseType: !842, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !863, file: !845, line: 172, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !668, line: 53, baseType: !871)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !845, line: 359, size: 128, elements: !873)
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !872, file: !845, line: 360, baseType: !660, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !872, file: !845, line: 361, baseType: !876, size: 64, offset: 64)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !842, size: 64, elements: !766)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !863, file: !845, line: 173, baseType: !5, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !863, file: !845, line: 174, baseType: !879, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !845, line: 133, baseType: !880)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !845, line: 115, size: 32, elements: !881)
!881 = !{!882, !883, !884, !885, !886, !887, !888, !889}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !880, file: !845, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !880, file: !845, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !880, file: !845, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !880, file: !845, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !880, file: !845, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !880, file: !845, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !880, file: !845, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !880, file: !845, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !863, file: !845, line: 175, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !845, line: 175, flags: DIFlagFwdDecl)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !863, file: !845, line: 176, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !896, line: 75, size: 256, elements: !897)
!896 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!897 = !{!898, !912, !913, !914}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !895, file: !896, line: 76, baseType: !899, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !896, line: 68, baseType: !901)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !896, line: 63, size: 320, elements: !902)
!902 = !{!903, !905, !906, !907}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !901, file: !896, line: 64, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !901, file: !896, line: 65, baseType: !904, size: 64, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !901, file: !896, line: 66, baseType: !7, size: 32, offset: 128)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !901, file: !896, line: 67, baseType: !908, size: 128, offset: 192)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !909, size: 128, elements: !910)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !896, line: 29, baseType: !721)
!910 = !{!911}
!911 = !DISubrange(count: 2)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !895, file: !896, line: 77, baseType: !899, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !895, file: !896, line: 78, baseType: !7, size: 32, offset: 128)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !895, file: !896, line: 79, baseType: !915, size: 64, offset: 192)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !896, line: 49, baseType: !917)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !896, line: 45, size: 832, elements: !918)
!918 = !{!919, !920, !921}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !917, file: !896, line: 46, baseType: !904, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !917, file: !896, line: 47, baseType: !894, size: 64, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !917, file: !896, line: 48, baseType: !922, size: 704, offset: 128)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !923, line: 164, size: 704, elements: !924)
!923 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!924 = !{!925, !926, !936, !937, !938, !939, !940, !941, !945, !949, !950, !951, !952}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !922, file: !923, line: 166, baseType: !723, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !922, file: !923, line: 167, baseType: !927, size: 64, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !923, line: 157, size: 192, elements: !929)
!929 = !{!930, !931, !932}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !928, file: !923, line: 159, baseType: !662, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !928, file: !923, line: 160, baseType: !927, size: 64, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !928, file: !923, line: 161, baseType: !933, size: 32, offset: 128)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 32, elements: !934)
!934 = !{!935}
!935 = !DISubrange(count: 4)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !922, file: !923, line: 168, baseType: !662, size: 64, offset: 128)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !922, file: !923, line: 169, baseType: !662, size: 64, offset: 192)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !922, file: !923, line: 170, baseType: !662, size: 64, offset: 256)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !922, file: !923, line: 171, baseType: !723, size: 64, offset: 320)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !922, file: !923, line: 172, baseType: !660, size: 32, offset: 384)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !922, file: !923, line: 176, baseType: !942, size: 64, offset: 448)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{!927, !664, !723}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !922, file: !923, line: 177, baseType: !946, size: 64, offset: 512)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{null, !664, !927}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !922, file: !923, line: 178, baseType: !664, size: 64, offset: 576)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !922, file: !923, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !922, file: !923, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !922, file: !923, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !863, file: !845, line: 177, baseType: !667, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !863, file: !845, line: 178, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !343, line: 217, size: 832, elements: !957)
!957 = !{!958, !1203, !1204, !1205, !1261, !1265, !1266, !1267, !1285, !1286, !1287, !1288, !1289, !1290}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !956, file: !343, line: 219, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !343, line: 151, baseType: !961)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !343, line: 151, size: 128, elements: !962)
!962 = !{!963}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !961, file: !343, line: 151, baseType: !964, size: 128)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !343, line: 150, baseType: !965)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !343, line: 150, size: 128, elements: !966)
!966 = !{!967, !968, !969}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !965, file: !343, line: 150, baseType: !7, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !965, file: !343, line: 150, baseType: !7, size: 32, offset: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !965, file: !343, line: 150, baseType: !970, size: 64, offset: 64)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 64, elements: !766)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !668, line: 108, baseType: !972)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !343, line: 122, size: 512, elements: !974)
!974 = !{!975, !976, !977, !1195, !1196, !1197, !1198, !1199, !1200, !1201}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !973, file: !343, line: 124, baseType: !955, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !973, file: !343, line: 125, baseType: !955, size: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !973, file: !343, line: 131, baseType: !978, size: 64, offset: 128)
!978 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !343, line: 128, size: 64, elements: !979)
!979 = !{!980, !1194}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !978, file: !343, line: 129, baseType: !981, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !668, line: 66, baseType: !982)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !574, line: 143, size: 192, elements: !984)
!984 = !{!985, !1192, !1193}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !983, file: !574, line: 145, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !668, line: 69, baseType: !987)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !574, line: 136, size: 192, elements: !989)
!989 = !{!990, !1190, !1191}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !988, file: !574, line: 137, baseType: !991, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !668, line: 58, baseType: !992)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !574, line: 737, size: 768, elements: !994)
!994 = !{!995, !1012, !1045, !1051, !1056, !1061, !1068, !1074, !1080, !1085, !1099, !1104, !1110, !1115, !1125, !1130, !1148, !1155, !1162, !1168, !1173, !1179, !1185}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !993, file: !574, line: 738, baseType: !996, size: 256)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !574, line: 271, size: 256, elements: !997)
!997 = !{!998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !996, file: !574, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !996, file: !574, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !996, file: !574, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !996, file: !574, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !996, file: !574, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !996, file: !574, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !996, file: !574, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !996, file: !574, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !996, file: !574, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !996, file: !574, line: 312, baseType: !7, size: 32, offset: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !996, file: !574, line: 316, baseType: !792, size: 32, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !996, file: !574, line: 319, baseType: !7, size: 32, offset: 96)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !996, file: !574, line: 323, baseType: !955, size: 64, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !996, file: !574, line: 327, baseType: !667, size: 64, offset: 192)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !993, file: !574, line: 739, baseType: !1013, size: 448)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !574, line: 350, size: 448, elements: !1014)
!1014 = !{!1015, !1043}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1013, file: !574, line: 353, baseType: !1016, size: 384)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !574, line: 333, size: 384, elements: !1017)
!1017 = !{!1018, !1019, !1026}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1016, file: !574, line: 336, baseType: !996, size: 256)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1016, file: !574, line: 343, baseType: !1020, size: 64, offset: 256)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !639, line: 37, size: 128, elements: !1022)
!1022 = !{!1023, !1024}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1021, file: !639, line: 39, baseType: !1020, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1021, file: !639, line: 40, baseType: !1025, size: 64, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1016, file: !574, line: 344, baseType: !1027, size: 64, offset: 320)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !639, line: 45, size: 320, elements: !1029)
!1029 = !{!1030, !1031}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1028, file: !639, line: 47, baseType: !1027, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1028, file: !639, line: 48, baseType: !1032, size: 256, offset: 64)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !1033)
!1033 = !{!1034, !1036, !1037, !1042}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1032, file: !135, line: 1884, baseType: !1035, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1032, file: !135, line: 1885, baseType: !1035, size: 64, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1032, file: !135, line: 1891, baseType: !1038, size: 64, offset: 128)
!1038 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1032, file: !135, line: 1891, size: 64, elements: !1039)
!1039 = !{!1040, !1041}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1038, file: !135, line: 1891, baseType: !991, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1038, file: !135, line: 1891, baseType: !667, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1032, file: !135, line: 1892, baseType: !1025, size: 64, offset: 192)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1013, file: !574, line: 359, baseType: !1044, size: 64, offset: 384)
!1044 = !DICompositeType(tag: DW_TAG_array_type, baseType: !667, size: 64, elements: !766)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !993, file: !574, line: 740, baseType: !1046, size: 512)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !574, line: 365, size: 512, elements: !1047)
!1047 = !{!1048, !1049, !1050}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1046, file: !574, line: 368, baseType: !1016, size: 384)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1046, file: !574, line: 373, baseType: !667, size: 64, offset: 384)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1046, file: !574, line: 374, baseType: !667, size: 64, offset: 448)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !993, file: !574, line: 741, baseType: !1052, size: 576)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !574, line: 380, size: 576, elements: !1053)
!1053 = !{!1054, !1055}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1052, file: !574, line: 383, baseType: !1046, size: 512)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1052, file: !574, line: 389, baseType: !1044, size: 64, offset: 512)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !993, file: !574, line: 742, baseType: !1057, size: 320)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !574, line: 395, size: 320, elements: !1058)
!1058 = !{!1059, !1060}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1057, file: !574, line: 397, baseType: !996, size: 256)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1057, file: !574, line: 400, baseType: !981, size: 64, offset: 256)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !993, file: !574, line: 743, baseType: !1062, size: 448)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !574, line: 406, size: 448, elements: !1063)
!1063 = !{!1064, !1065, !1066, !1067}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1062, file: !574, line: 408, baseType: !996, size: 256)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1062, file: !574, line: 412, baseType: !667, size: 64, offset: 256)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1062, file: !574, line: 420, baseType: !667, size: 64, offset: 320)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1062, file: !574, line: 423, baseType: !981, size: 64, offset: 384)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !993, file: !574, line: 744, baseType: !1069, size: 384)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !574, line: 429, size: 384, elements: !1070)
!1070 = !{!1071, !1072, !1073}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1069, file: !574, line: 431, baseType: !996, size: 256)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1069, file: !574, line: 434, baseType: !667, size: 64, offset: 256)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1069, file: !574, line: 437, baseType: !981, size: 64, offset: 320)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !993, file: !574, line: 745, baseType: !1075, size: 384)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !574, line: 443, size: 384, elements: !1076)
!1076 = !{!1077, !1078, !1079}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1075, file: !574, line: 445, baseType: !996, size: 256)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1075, file: !574, line: 449, baseType: !667, size: 64, offset: 256)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1075, file: !574, line: 453, baseType: !981, size: 64, offset: 320)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !993, file: !574, line: 746, baseType: !1081, size: 320)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !574, line: 459, size: 320, elements: !1082)
!1082 = !{!1083, !1084}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1081, file: !574, line: 461, baseType: !996, size: 256)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1081, file: !574, line: 464, baseType: !667, size: 64, offset: 256)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !993, file: !574, line: 747, baseType: !1086, size: 768)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !574, line: 469, size: 768, elements: !1087)
!1087 = !{!1088, !1089, !1090, !1091, !1092}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1086, file: !574, line: 471, baseType: !996, size: 256)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1086, file: !574, line: 474, baseType: !7, size: 32, offset: 256)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1086, file: !574, line: 475, baseType: !7, size: 32, offset: 288)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1086, file: !574, line: 478, baseType: !667, size: 64, offset: 320)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1086, file: !574, line: 481, baseType: !1093, size: 384, offset: 384)
!1093 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1094, size: 384, elements: !766)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !1095)
!1095 = !{!1096, !1097, !1098}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1094, file: !135, line: 1920, baseType: !1032, size: 256)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1094, file: !135, line: 1921, baseType: !667, size: 64, offset: 256)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1094, file: !135, line: 1922, baseType: !792, size: 32, offset: 320)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !993, file: !574, line: 748, baseType: !1100, size: 320)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !574, line: 487, size: 320, elements: !1101)
!1101 = !{!1102, !1103}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1100, file: !574, line: 490, baseType: !996, size: 256)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1100, file: !574, line: 494, baseType: !660, size: 32, offset: 256)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !993, file: !574, line: 749, baseType: !1105, size: 384)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !574, line: 500, size: 384, elements: !1106)
!1106 = !{!1107, !1108, !1109}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1105, file: !574, line: 502, baseType: !996, size: 256)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1105, file: !574, line: 506, baseType: !981, size: 64, offset: 256)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1105, file: !574, line: 510, baseType: !981, size: 64, offset: 320)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !993, file: !574, line: 750, baseType: !1111, size: 320)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !574, line: 529, size: 320, elements: !1112)
!1112 = !{!1113, !1114}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1111, file: !574, line: 531, baseType: !996, size: 256)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1111, file: !574, line: 540, baseType: !981, size: 64, offset: 256)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !993, file: !574, line: 751, baseType: !1116, size: 704)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !574, line: 546, size: 704, elements: !1117)
!1117 = !{!1118, !1119, !1120, !1121, !1122, !1123, !1124}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1116, file: !574, line: 549, baseType: !1046, size: 512)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1116, file: !574, line: 553, baseType: !665, size: 64, offset: 512)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1116, file: !574, line: 557, baseType: !659, size: 8, offset: 576)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1116, file: !574, line: 558, baseType: !659, size: 8, offset: 584)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1116, file: !574, line: 559, baseType: !659, size: 8, offset: 592)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1116, file: !574, line: 560, baseType: !659, size: 8, offset: 600)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1116, file: !574, line: 566, baseType: !1044, size: 64, offset: 640)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !993, file: !574, line: 752, baseType: !1126, size: 384)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !574, line: 571, size: 384, elements: !1127)
!1127 = !{!1128, !1129}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1126, file: !574, line: 573, baseType: !1057, size: 320)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1126, file: !574, line: 577, baseType: !667, size: 64, offset: 320)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !993, file: !574, line: 753, baseType: !1131, size: 576)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !574, line: 600, size: 576, elements: !1132)
!1132 = !{!1133, !1134, !1135, !1138, !1147}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1131, file: !574, line: 602, baseType: !1057, size: 320)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1131, file: !574, line: 605, baseType: !667, size: 64, offset: 320)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1131, file: !574, line: 609, baseType: !1136, size: 64, offset: 384)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1137, line: 46, baseType: !721)
!1137 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1131, file: !574, line: 612, baseType: !1139, size: 64, offset: 448)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !574, line: 581, size: 320, elements: !1141)
!1141 = !{!1142, !1143, !1144, !1145, !1146}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1140, file: !574, line: 583, baseType: !134, size: 32)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1140, file: !574, line: 586, baseType: !667, size: 64, offset: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1140, file: !574, line: 589, baseType: !667, size: 64, offset: 128)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1140, file: !574, line: 592, baseType: !667, size: 64, offset: 192)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1140, file: !574, line: 595, baseType: !667, size: 64, offset: 256)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1131, file: !574, line: 616, baseType: !981, size: 64, offset: 512)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !993, file: !574, line: 754, baseType: !1149, size: 512)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !574, line: 622, size: 512, elements: !1150)
!1150 = !{!1151, !1152, !1153, !1154}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1149, file: !574, line: 624, baseType: !1057, size: 320)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1149, file: !574, line: 628, baseType: !667, size: 64, offset: 320)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1149, file: !574, line: 632, baseType: !667, size: 64, offset: 384)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1149, file: !574, line: 636, baseType: !667, size: 64, offset: 448)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !993, file: !574, line: 755, baseType: !1156, size: 704)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !574, line: 642, size: 704, elements: !1157)
!1157 = !{!1158, !1159, !1160, !1161}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1156, file: !574, line: 644, baseType: !1149, size: 512)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1156, file: !574, line: 648, baseType: !667, size: 64, offset: 512)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1156, file: !574, line: 652, baseType: !667, size: 64, offset: 576)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1156, file: !574, line: 653, baseType: !667, size: 64, offset: 640)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !993, file: !574, line: 756, baseType: !1163, size: 448)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !574, line: 663, size: 448, elements: !1164)
!1164 = !{!1165, !1166, !1167}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1163, file: !574, line: 665, baseType: !1057, size: 320)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1163, file: !574, line: 668, baseType: !667, size: 64, offset: 320)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1163, file: !574, line: 673, baseType: !667, size: 64, offset: 384)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !993, file: !574, line: 757, baseType: !1169, size: 384)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !574, line: 694, size: 384, elements: !1170)
!1170 = !{!1171, !1172}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1169, file: !574, line: 696, baseType: !1057, size: 320)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1169, file: !574, line: 699, baseType: !667, size: 64, offset: 320)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !993, file: !574, line: 758, baseType: !1174, size: 384)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !574, line: 681, size: 384, elements: !1175)
!1175 = !{!1176, !1177, !1178}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1174, file: !574, line: 683, baseType: !996, size: 256)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1174, file: !574, line: 686, baseType: !667, size: 64, offset: 256)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1174, file: !574, line: 689, baseType: !667, size: 64, offset: 320)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !993, file: !574, line: 759, baseType: !1180, size: 384)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !574, line: 707, size: 384, elements: !1181)
!1181 = !{!1182, !1183, !1184}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1180, file: !574, line: 709, baseType: !996, size: 256)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1180, file: !574, line: 712, baseType: !667, size: 64, offset: 256)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1180, file: !574, line: 712, baseType: !667, size: 64, offset: 320)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !993, file: !574, line: 760, baseType: !1186, size: 320)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !574, line: 718, size: 320, elements: !1187)
!1187 = !{!1188, !1189}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1186, file: !574, line: 720, baseType: !996, size: 256)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1186, file: !574, line: 723, baseType: !667, size: 64, offset: 256)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !988, file: !574, line: 138, baseType: !987, size: 64, offset: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !988, file: !574, line: 139, baseType: !987, size: 64, offset: 128)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !983, file: !574, line: 146, baseType: !986, size: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !983, file: !574, line: 152, baseType: !981, size: 64, offset: 128)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !978, file: !343, line: 130, baseType: !842, size: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !973, file: !343, line: 134, baseType: !664, size: 64, offset: 192)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !973, file: !343, line: 137, baseType: !667, size: 64, offset: 256)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !973, file: !343, line: 138, baseType: !792, size: 32, offset: 320)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !973, file: !343, line: 142, baseType: !7, size: 32, offset: 352)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !973, file: !343, line: 144, baseType: !660, size: 32, offset: 384)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !973, file: !343, line: 145, baseType: !660, size: 32, offset: 416)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !973, file: !343, line: 146, baseType: !1202, size: 64, offset: 448)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !343, line: 119, baseType: !723)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !956, file: !343, line: 220, baseType: !959, size: 64, offset: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !956, file: !343, line: 223, baseType: !664, size: 64, offset: 128)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !956, file: !343, line: 226, baseType: !1206, size: 64, offset: 192)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 100, size: 1216, elements: !1208)
!1208 = !{!1209, !1210, !1211, !1212, !1213, !1218, !1219, !1220, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1251, !1259, !1260}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1207, file: !330, line: 102, baseType: !660, size: 32)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1207, file: !330, line: 105, baseType: !7, size: 32, offset: 32)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1207, file: !330, line: 108, baseType: !955, size: 64, offset: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1207, file: !330, line: 111, baseType: !955, size: 64, offset: 128)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1207, file: !330, line: 114, baseType: !1214, size: 64, offset: 192)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !330, line: 41, size: 64, elements: !1215)
!1215 = !{!1216, !1217}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1214, file: !330, line: 42, baseType: !329, size: 32)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1214, file: !330, line: 43, baseType: !7, size: 32, offset: 32)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1207, file: !330, line: 117, baseType: !7, size: 32, offset: 256)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1207, file: !330, line: 120, baseType: !7, size: 32, offset: 288)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1207, file: !330, line: 123, baseType: !1221, size: 64, offset: 320)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !330, line: 87, baseType: !1223)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !330, line: 87, size: 128, elements: !1224)
!1224 = !{!1225}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1223, file: !330, line: 87, baseType: !1226, size: 128)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !330, line: 85, baseType: !1227)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !330, line: 85, size: 128, elements: !1228)
!1228 = !{!1229, !1230, !1231}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1227, file: !330, line: 85, baseType: !7, size: 32)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1227, file: !330, line: 85, baseType: !7, size: 32, offset: 32)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1227, file: !330, line: 85, baseType: !1232, size: 64, offset: 64)
!1232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1233, size: 64, elements: !766)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !330, line: 84, baseType: !1206)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1207, file: !330, line: 126, baseType: !1206, size: 64, offset: 384)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1207, file: !330, line: 129, baseType: !1206, size: 64, offset: 448)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1207, file: !330, line: 132, baseType: !664, size: 64, offset: 512)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1207, file: !330, line: 139, baseType: !667, size: 64, offset: 576)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1207, file: !330, line: 143, baseType: !716, size: 128, offset: 640)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1207, file: !330, line: 146, baseType: !716, size: 128, offset: 768)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1207, file: !330, line: 148, baseType: !659, size: 8, offset: 896)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1207, file: !330, line: 149, baseType: !659, size: 8, offset: 904)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1207, file: !330, line: 153, baseType: !338, size: 32, offset: 928)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1207, file: !330, line: 156, baseType: !1244, size: 64, offset: 960)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !330, line: 48, size: 320, elements: !1246)
!1246 = !{!1247, !1248, !1249, !1250}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1245, file: !330, line: 50, baseType: !991, size: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1245, file: !330, line: 59, baseType: !716, size: 128, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1245, file: !330, line: 64, baseType: !659, size: 8, offset: 192)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1245, file: !330, line: 67, baseType: !1244, size: 64, offset: 256)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1207, file: !330, line: 159, baseType: !1252, size: 64, offset: 1024)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !330, line: 72, size: 256, elements: !1254)
!1254 = !{!1255, !1256, !1257, !1258}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1253, file: !330, line: 74, baseType: !972, size: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1253, file: !330, line: 77, baseType: !1252, size: 64, offset: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1253, file: !330, line: 78, baseType: !1252, size: 64, offset: 128)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1253, file: !330, line: 81, baseType: !1252, size: 64, offset: 192)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1207, file: !330, line: 162, baseType: !659, size: 8, offset: 1088)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1207, file: !330, line: 166, baseType: !667, size: 64, offset: 1152)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !956, file: !343, line: 229, baseType: !1262, size: 128, offset: 256)
!1262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1263, size: 128, elements: !910)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !343, line: 229, flags: DIFlagFwdDecl)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !956, file: !343, line: 232, baseType: !955, size: 64, offset: 384)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !956, file: !343, line: 233, baseType: !955, size: 64, offset: 448)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !956, file: !343, line: 238, baseType: !1268, size: 64, offset: 512)
!1268 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !343, line: 235, size: 64, elements: !1269)
!1269 = !{!1270, !1276}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1268, file: !343, line: 236, baseType: !1271, size: 64)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !343, line: 273, size: 128, elements: !1273)
!1273 = !{!1274, !1275}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1272, file: !343, line: 275, baseType: !981, size: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1272, file: !343, line: 278, baseType: !981, size: 64, offset: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1268, file: !343, line: 237, baseType: !1277, size: 64)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !343, line: 259, size: 320, elements: !1279)
!1279 = !{!1280, !1281, !1282, !1283, !1284}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1278, file: !343, line: 261, baseType: !842, size: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1278, file: !343, line: 262, baseType: !842, size: 64, offset: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1278, file: !343, line: 266, baseType: !842, size: 64, offset: 128)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1278, file: !343, line: 267, baseType: !842, size: 64, offset: 192)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1278, file: !343, line: 270, baseType: !660, size: 32, offset: 256)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !956, file: !343, line: 241, baseType: !1202, size: 64, offset: 576)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !956, file: !343, line: 244, baseType: !660, size: 32, offset: 640)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !956, file: !343, line: 247, baseType: !660, size: 32, offset: 672)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !956, file: !343, line: 250, baseType: !660, size: 32, offset: 704)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !956, file: !343, line: 253, baseType: !660, size: 32, offset: 736)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !956, file: !343, line: 256, baseType: !660, size: 32, offset: 768)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !863, file: !845, line: 179, baseType: !1292, size: 64)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64)
!1293 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !845, line: 150, baseType: !1294)
!1294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !845, line: 142, size: 320, elements: !1295)
!1295 = !{!1296, !1297, !1298, !1299, !1302, !1303}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1294, file: !845, line: 144, baseType: !667, size: 64)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1294, file: !845, line: 145, baseType: !842, size: 64, offset: 64)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1294, file: !845, line: 146, baseType: !842, size: 64, offset: 128)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1294, file: !845, line: 147, baseType: !1300, size: 32, offset: 192)
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1301, line: 31, baseType: !660)
!1301 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1294, file: !845, line: 148, baseType: !7, size: 32, offset: 224)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1294, file: !845, line: 149, baseType: !659, size: 8, offset: 256)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !863, file: !845, line: 180, baseType: !1305, size: 64)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64)
!1306 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !845, line: 162, baseType: !1307)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !845, line: 159, size: 128, elements: !1308)
!1308 = !{!1309, !1310}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1307, file: !845, line: 160, baseType: !667, size: 64)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1307, file: !845, line: 161, baseType: !723, size: 64, offset: 64)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !863, file: !845, line: 181, baseType: !1312, size: 64)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64)
!1313 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !845, line: 181, flags: DIFlagFwdDecl)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !858, file: !845, line: 317, baseType: !1315, size: 64)
!1315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !723, size: 64, elements: !766)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !858, file: !845, line: 318, baseType: !1317, size: 320)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !845, line: 188, size: 320, elements: !1318)
!1318 = !{!1319, !1321, !1378}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1317, file: !845, line: 190, baseType: !1320, size: 192)
!1320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !862, size: 192, elements: !741)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1317, file: !845, line: 193, baseType: !1322, size: 64, offset: 192)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64)
!1323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !845, line: 206, size: 320, elements: !1324)
!1324 = !{!1325, !1363, !1364, !1365, !1377}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1323, file: !845, line: 208, baseType: !1326, size: 64)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64)
!1327 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !668, line: 62, baseType: !1328)
!1328 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1329, line: 538, size: 256, elements: !1330)
!1329 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1330 = !{!1331, !1335, !1341, !1354}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1328, file: !1329, line: 539, baseType: !1332, size: 32)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1329, line: 482, size: 32, elements: !1333)
!1333 = !{!1334}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1332, file: !1329, line: 484, baseType: !7, size: 32)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1328, file: !1329, line: 540, baseType: !1336, size: 192)
!1336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1329, line: 488, size: 192, elements: !1337)
!1337 = !{!1338, !1339, !1340}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1336, file: !1329, line: 489, baseType: !1332, size: 32)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1336, file: !1329, line: 492, baseType: !665, size: 64, offset: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1336, file: !1329, line: 496, baseType: !667, size: 64, offset: 128)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1328, file: !1329, line: 541, baseType: !1342, size: 256)
!1342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1329, line: 504, size: 256, elements: !1343)
!1343 = !{!1344, !1345, !1352, !1353}
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1342, file: !1329, line: 505, baseType: !1332, size: 32)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1342, file: !1329, line: 509, baseType: !1346, size: 64, offset: 64)
!1346 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1329, line: 501, baseType: !1347)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64)
!1348 = !DISubroutineType(types: !1349)
!1349 = !{null, !1350}
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64)
!1351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1342, file: !1329, line: 510, baseType: !1350, size: 64, offset: 128)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1342, file: !1329, line: 513, baseType: !1326, size: 64, offset: 192)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1328, file: !1329, line: 542, baseType: !1355, size: 128)
!1355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1329, line: 530, size: 128, elements: !1356)
!1356 = !{!1357, !1358}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1355, file: !1329, line: 531, baseType: !1332, size: 32)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1355, file: !1329, line: 534, baseType: !1359, size: 64, offset: 64)
!1359 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1329, line: 525, baseType: !1360)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64)
!1361 = !DISubroutineType(types: !1362)
!1362 = !{!659, !667, !665, !721, !721}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1323, file: !845, line: 211, baseType: !7, size: 32, offset: 64)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1323, file: !845, line: 214, baseType: !723, size: 64, offset: 128)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1323, file: !845, line: 224, baseType: !1366, size: 64, offset: 192)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64)
!1367 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !845, line: 202, baseType: !1368)
!1368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !845, line: 202, size: 128, elements: !1369)
!1369 = !{!1370}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1368, file: !845, line: 202, baseType: !1371, size: 128)
!1371 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !845, line: 200, baseType: !1372)
!1372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !845, line: 200, size: 128, elements: !1373)
!1373 = !{!1374, !1375, !1376}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1372, file: !845, line: 200, baseType: !7, size: 32)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1372, file: !845, line: 200, baseType: !7, size: 32, offset: 32)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1372, file: !845, line: 200, baseType: !876, size: 64, offset: 64)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1323, file: !845, line: 234, baseType: !1366, size: 64, offset: 256)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1317, file: !845, line: 197, baseType: !723, size: 64, offset: 256)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !858, file: !845, line: 319, baseType: !730, size: 256)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !858, file: !845, line: 320, baseType: !749, size: 192)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !670, file: !135, line: 3384, baseType: !1382, size: 1472)
!1382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1383)
!1383 = !{!1384, !1405, !1406, !1407, !1408}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1382, file: !135, line: 3115, baseType: !1385, size: 1216)
!1385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1386)
!1386 = !{!1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1385, file: !135, line: 2985, baseType: !838, size: 960)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1385, file: !135, line: 2986, baseType: !667, size: 64, offset: 960)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1385, file: !135, line: 2987, baseType: !667, size: 64, offset: 1024)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1385, file: !135, line: 2988, baseType: !667, size: 64, offset: 1088)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1385, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1385, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1385, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1385, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1385, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1385, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1385, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1385, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1385, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1385, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1385, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1385, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1385, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1385, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1382, file: !135, line: 3117, baseType: !667, size: 64, offset: 1216)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1382, file: !135, line: 3119, baseType: !667, size: 64, offset: 1280)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1382, file: !135, line: 3121, baseType: !667, size: 64, offset: 1344)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1382, file: !135, line: 3123, baseType: !667, size: 64, offset: 1408)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !670, file: !135, line: 3385, baseType: !1410, size: 1088)
!1410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1411)
!1411 = !{!1412, !1413, !1414}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1410, file: !135, line: 2875, baseType: !838, size: 960)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1410, file: !135, line: 2876, baseType: !842, size: 64, offset: 960)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1410, file: !135, line: 2877, baseType: !1415, size: 64, offset: 1024)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64)
!1416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1417, line: 172, size: 128, elements: !1418)
!1417 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1418 = !{!1419, !1420, !1421, !1422, !1423, !1424, !1425}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1416, file: !1417, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1416, file: !1417, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1416, file: !1417, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1416, file: !1417, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1416, file: !1417, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1416, file: !1417, line: 195, baseType: !7, size: 32, offset: 32)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1416, file: !1417, line: 199, baseType: !667, size: 64, offset: 64)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !670, file: !135, line: 3386, baseType: !1385, size: 1216)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !670, file: !135, line: 3387, baseType: !1428, size: 1280)
!1428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1429)
!1429 = !{!1430, !1431}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1428, file: !135, line: 3094, baseType: !1385, size: 1216)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1428, file: !135, line: 3095, baseType: !1415, size: 64, offset: 1216)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !670, file: !135, line: 3388, baseType: !1433, size: 1216)
!1433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1434)
!1434 = !{!1435, !1436, !1437, !1438, !1439, !1440}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1433, file: !135, line: 2825, baseType: !800, size: 896)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1433, file: !135, line: 2827, baseType: !667, size: 64, offset: 896)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1433, file: !135, line: 2828, baseType: !667, size: 64, offset: 960)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1433, file: !135, line: 2829, baseType: !667, size: 64, offset: 1024)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1433, file: !135, line: 2830, baseType: !667, size: 64, offset: 1088)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1433, file: !135, line: 2831, baseType: !667, size: 64, offset: 1152)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !670, file: !135, line: 3389, baseType: !1442, size: 1024)
!1442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1443)
!1443 = !{!1444, !1445, !1446}
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1442, file: !135, line: 2851, baseType: !838, size: 960)
