; ModuleID = 'value-prof.bc'
source_filename = "value-prof.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!1343 = !DIEnumerator(name: "TV_HOIST", value: 132, isUnsigned: true)
!1344 = !DIEnumerator(name: "TV_LSM", value: 133, isUnsigned: true)
!1345 = !DIEnumerator(name: "TV_TRACER", value: 134, isUnsigned: true)
!1346 = !DIEnumerator(name: "TV_WEB", value: 135, isUnsigned: true)
!1347 = !DIEnumerator(name: "TV_AUTO_INC_DEC", value: 136, isUnsigned: true)
!1348 = !DIEnumerator(name: "TV_CSE2", value: 137, isUnsigned: true)
!1349 = !DIEnumerator(name: "TV_BRANCH_PROB", value: 138, isUnsigned: true)
!1350 = !DIEnumerator(name: "TV_VPT", value: 139, isUnsigned: true)
!1351 = !DIEnumerator(name: "TV_COMBINE", value: 140, isUnsigned: true)
!1352 = !DIEnumerator(name: "TV_IFCVT", value: 141, isUnsigned: true)
!1353 = !DIEnumerator(name: "TV_REGMOVE", value: 142, isUnsigned: true)
!1354 = !DIEnumerator(name: "TV_MODE_SWITCH", value: 143, isUnsigned: true)
!1355 = !DIEnumerator(name: "TV_SMS", value: 144, isUnsigned: true)
!1356 = !DIEnumerator(name: "TV_SCHED", value: 145, isUnsigned: true)
!1357 = !DIEnumerator(name: "TV_LOCAL_ALLOC", value: 146, isUnsigned: true)
!1358 = !DIEnumerator(name: "TV_GLOBAL_ALLOC", value: 147, isUnsigned: true)
!1359 = !DIEnumerator(name: "TV_IRA", value: 148, isUnsigned: true)
!1360 = !DIEnumerator(name: "TV_RELOAD", value: 149, isUnsigned: true)
!1361 = !DIEnumerator(name: "TV_RELOAD_CSE_REGS", value: 150, isUnsigned: true)
!1362 = !DIEnumerator(name: "TV_SEQABSTR", value: 151, isUnsigned: true)
!1363 = !DIEnumerator(name: "TV_GCSE_AFTER_RELOAD", value: 152, isUnsigned: true)
!1364 = !DIEnumerator(name: "TV_THREAD_PROLOGUE_AND_EPILOGUE", value: 153, isUnsigned: true)
!1365 = !DIEnumerator(name: "TV_IFCVT2", value: 154, isUnsigned: true)
!1366 = !DIEnumerator(name: "TV_COMBINE_STACK_ADJUST", value: 155, isUnsigned: true)
!1367 = !DIEnumerator(name: "TV_PEEPHOLE2", value: 156, isUnsigned: true)
!1368 = !DIEnumerator(name: "TV_RENAME_REGISTERS", value: 157, isUnsigned: true)
!1369 = !DIEnumerator(name: "TV_CPROP_REGISTERS", value: 158, isUnsigned: true)
!1370 = !DIEnumerator(name: "TV_SCHED2", value: 159, isUnsigned: true)
!1371 = !DIEnumerator(name: "TV_MACH_DEP", value: 160, isUnsigned: true)
!1372 = !DIEnumerator(name: "TV_DBR_SCHED", value: 161, isUnsigned: true)
!1373 = !DIEnumerator(name: "TV_REORDER_BLOCKS", value: 162, isUnsigned: true)
!1374 = !DIEnumerator(name: "TV_SHORTEN_BRANCH", value: 163, isUnsigned: true)
!1375 = !DIEnumerator(name: "TV_REG_STACK", value: 164, isUnsigned: true)
!1376 = !DIEnumerator(name: "TV_FINAL", value: 165, isUnsigned: true)
!1377 = !DIEnumerator(name: "TV_SYMOUT", value: 166, isUnsigned: true)
!1378 = !DIEnumerator(name: "TV_VAR_TRACKING", value: 167, isUnsigned: true)
!1379 = !DIEnumerator(name: "TV_TREE_IFCOMBINE", value: 168, isUnsigned: true)
!1380 = !DIEnumerator(name: "TV_PLUGIN_INIT", value: 169, isUnsigned: true)
!1381 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!1382 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!1383 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!1384 = !{!1385, !1386, !1387, !1388, !1391, !1392, !1394, !2731, !2743, !2746, !1458, !2749, !2751, !134, !1727, !2747, !1402, !1761, !1389, !452, !2752, !7, !1456, !1529, !2764}
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64)
!1386 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1387 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64)
!1390 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64)
!1393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1390)
!1394 = !DIDerivedType(tag: DW_TAG_typedef, name: "histogram_value", file: !378, line: 65, baseType: !1395)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64)
!1396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "histogram_value_t", file: !378, line: 44, size: 384, elements: !1397)
!1397 = !{!1398, !2733, !2734, !2735}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "hvalue", scope: !1396, file: !378, line: 52, baseType: !1399, size: 256)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1396, file: !378, line: 46, size: 256, elements: !1400)
!1400 = !{!1401, !2729, !2730, !2732}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1399, file: !378, line: 48, baseType: !1402, size: 64)
!1402 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !1403, line: 56, baseType: !1404)
!1403 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64)
!1405 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !1406)
!1406 = !{!1407, !1440, !1446, !1459, !1478, !1489, !1494, !1503, !1509, !1522, !1534, !1572, !2064, !2092, !2109, !2110, !2115, !2124, !2130, !2135, !2139, !2143, !2380, !2427, !2433, !2439, !2446, !2459, !2473, !2490, !2502, !2524, !2539, !2711}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1405, file: !135, line: 3372, baseType: !1408, size: 64)
!1408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !1409)
!1409 = !{!1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439}
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1408, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !1408, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !1408, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !1408, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !1408, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !1408, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !1408, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !1408, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !1408, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !1408, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !1408, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !1408, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !1408, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !1408, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !1408, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !1408, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !1408, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !1408, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1408, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1408, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1408, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1408, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1408, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1408, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1408, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1408, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !1408, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !1408, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !1408, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !1408, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1405, file: !135, line: 3373, baseType: !1441, size: 192)
!1441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !1442)
!1442 = !{!1443, !1444, !1445}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1441, file: !135, line: 403, baseType: !1408, size: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1441, file: !135, line: 404, baseType: !1402, size: 64, offset: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1441, file: !135, line: 405, baseType: !1402, size: 64, offset: 128)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1405, file: !135, line: 3374, baseType: !1447, size: 320)
!1447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !1448)
!1448 = !{!1449, !1450}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1447, file: !135, line: 1385, baseType: !1441, size: 192)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1447, file: !135, line: 1386, baseType: !1451, size: 128, offset: 192)
!1451 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1452, line: 58, baseType: !1453)
!1452 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1453 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1452, line: 54, size: 128, elements: !1454)
!1454 = !{!1455, !1457}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1453, file: !1452, line: 56, baseType: !1456, size: 64)
!1456 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1453, file: !1452, line: 57, baseType: !1458, size: 64, offset: 64)
!1458 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !1405, file: !135, line: 3375, baseType: !1460, size: 256)
!1460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !1461)
!1461 = !{!1462, !1463}
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1460, file: !135, line: 1398, baseType: !1441, size: 192)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1460, file: !135, line: 1399, baseType: !1464, size: 64, offset: 192)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64)
!1465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1466, line: 52, size: 256, elements: !1467)
!1466 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1467 = !{!1468, !1469, !1470, !1471, !1472, !1473, !1474}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1465, file: !1466, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1465, file: !1466, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1465, file: !1466, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1465, file: !1466, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1465, file: !1466, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1465, file: !1466, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1465, file: !1466, line: 62, baseType: !1475, size: 192, offset: 64)
!1475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1456, size: 192, elements: !1476)
!1476 = !{!1477}
!1477 = !DISubrange(count: 3)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !1405, file: !135, line: 3376, baseType: !1479, size: 256)
!1479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !1480)
!1480 = !{!1481, !1482}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1479, file: !135, line: 1409, baseType: !1441, size: 192)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1479, file: !135, line: 1410, baseType: !1483, size: 64, offset: 192)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64)
!1484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1485, line: 27, size: 192, elements: !1486)
!1485 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1486 = !{!1487, !1488}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1484, file: !1485, line: 29, baseType: !1451, size: 128)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1484, file: !1485, line: 30, baseType: !5, size: 32, offset: 128)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1405, file: !135, line: 3377, baseType: !1490, size: 256)
!1490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !1491)
!1491 = !{!1492, !1493}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1490, file: !135, line: 1438, baseType: !1441, size: 192)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1490, file: !135, line: 1439, baseType: !1402, size: 64, offset: 192)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1405, file: !135, line: 3378, baseType: !1495, size: 256)
!1495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !1496)
!1496 = !{!1497, !1498, !1499}
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1495, file: !135, line: 1419, baseType: !1441, size: 192)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1495, file: !135, line: 1420, baseType: !1387, size: 32, offset: 192)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1495, file: !135, line: 1421, baseType: !1500, size: 8, offset: 224)
!1500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1390, size: 8, elements: !1501)
!1501 = !{!1502}
!1502 = !DISubrange(count: 1)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !1405, file: !135, line: 3379, baseType: !1504, size: 320)
!1504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !1505)
!1505 = !{!1506, !1507, !1508}
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1504, file: !135, line: 1429, baseType: !1441, size: 192)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1504, file: !135, line: 1430, baseType: !1402, size: 64, offset: 192)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1504, file: !135, line: 1431, baseType: !1402, size: 64, offset: 256)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1405, file: !135, line: 3380, baseType: !1510, size: 320)
!1510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !1511)
!1511 = !{!1512, !1513}
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1510, file: !135, line: 1461, baseType: !1441, size: 192)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1510, file: !135, line: 1462, baseType: !1514, size: 128, offset: 192)
!1514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1515, line: 31, size: 128, elements: !1516)
!1515 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1516 = !{!1517, !1520, !1521}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1514, file: !1515, line: 32, baseType: !1518, size: 64)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64)
!1519 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1386)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1514, file: !1515, line: 33, baseType: !7, size: 32, offset: 64)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1514, file: !1515, line: 34, baseType: !7, size: 32, offset: 96)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !1405, file: !135, line: 3381, baseType: !1523, size: 384)
!1523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !1524)
!1524 = !{!1525, !1526, !1531, !1532, !1533}
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1523, file: !135, line: 2508, baseType: !1441, size: 192)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1523, file: !135, line: 2509, baseType: !1527, size: 32, offset: 192)
!1527 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1528, line: 58, baseType: !1529)
!1528 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1529 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1530, line: 44, baseType: !7)
!1530 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1523, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1523, file: !135, line: 2511, baseType: !1402, size: 64, offset: 256)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1523, file: !135, line: 2512, baseType: !1402, size: 64, offset: 320)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !1405, file: !135, line: 3382, baseType: !1535, size: 896)
!1535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !1536)
!1536 = !{!1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569}
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1535, file: !135, line: 2653, baseType: !1523, size: 384)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1535, file: !135, line: 2654, baseType: !1402, size: 64, offset: 384)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1535, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1535, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1535, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1535, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1535, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1535, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1535, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1535, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1535, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1535, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1535, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1535, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1535, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1535, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1535, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1535, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1535, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1535, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1535, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1535, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1535, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1535, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1535, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1535, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1535, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1535, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1535, file: !135, line: 2705, baseType: !1402, size: 64, offset: 576)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1535, file: !135, line: 2706, baseType: !1402, size: 64, offset: 640)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1535, file: !135, line: 2707, baseType: !1402, size: 64, offset: 704)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1535, file: !135, line: 2708, baseType: !1402, size: 64, offset: 768)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1535, file: !135, line: 2711, baseType: !1570, size: 64, offset: 832)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64)
!1571 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !1405, file: !135, line: 3383, baseType: !1573, size: 960)
!1573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !1574)
!1574 = !{!1575, !1576}
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1573, file: !135, line: 2757, baseType: !1535, size: 896)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1573, file: !135, line: 2758, baseType: !1577, size: 64, offset: 896)
!1577 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !1403, line: 50, baseType: !1578)
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1579, size: 64)
!1579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !1580, line: 240, size: 384, elements: !1581)
!1580 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1581 = !{!1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592}
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1579, file: !1580, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1579, file: !1580, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !1579, file: !1580, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1579, file: !1580, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !1579, file: !1580, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !1579, file: !1580, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !1579, file: !1580, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1579, file: !1580, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !1579, file: !1580, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !1579, file: !1580, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1579, file: !1580, line: 321, baseType: !1593, size: 320, offset: 64)
!1593 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !1580, line: 315, size: 320, elements: !1594)
!1594 = !{!1595, !1997, !1999, !2062, !2063}
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1593, file: !1580, line: 316, baseType: !1596, size: 64)
!1596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1597, size: 64, elements: !1501)
!1597 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !1580, line: 183, baseType: !1598)
!1598 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !1580, line: 166, size: 64, elements: !1599)
!1599 = !{!1600, !1601, !1602, !1603, !1604, !1612, !1613, !1625, !1628, !1688, !1689, !1974, !1987, !1994}
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !1598, file: !1580, line: 168, baseType: !1387, size: 32)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !1598, file: !1580, line: 169, baseType: !7, size: 32)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !1598, file: !1580, line: 170, baseType: !1392, size: 64)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !1598, file: !1580, line: 171, baseType: !1577, size: 64)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !1598, file: !1580, line: 172, baseType: !1605, size: 64)
!1605 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !1403, line: 53, baseType: !1606)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64)
!1607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !1580, line: 359, size: 128, elements: !1608)
!1608 = !{!1609, !1610}
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !1607, file: !1580, line: 360, baseType: !1387, size: 32)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1607, file: !1580, line: 361, baseType: !1611, size: 64, offset: 64)
!1611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1577, size: 64, elements: !1501)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !1598, file: !1580, line: 173, baseType: !5, size: 32)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !1598, file: !1580, line: 174, baseType: !1614, size: 32)
!1614 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !1580, line: 133, baseType: !1615)
!1615 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1580, line: 115, size: 32, elements: !1616)
!1616 = !{!1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624}
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !1615, file: !1580, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !1615, file: !1580, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !1615, file: !1580, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !1615, file: !1580, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !1615, file: !1580, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !1615, file: !1580, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !1615, file: !1580, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1615, file: !1580, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !1598, file: !1580, line: 175, baseType: !1626, size: 64)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64)
!1627 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !1580, line: 175, flags: DIFlagFwdDecl)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !1598, file: !1580, line: 176, baseType: !1629, size: 64)
!1629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1630, size: 64)
!1630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1631, line: 75, size: 256, elements: !1632)
!1631 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1632 = !{!1633, !1647, !1648, !1649}
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1630, file: !1631, line: 76, baseType: !1634, size: 64)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64)
!1635 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1631, line: 68, baseType: !1636)
!1636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1631, line: 63, size: 320, elements: !1637)
!1637 = !{!1638, !1640, !1641, !1642}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1636, file: !1631, line: 64, baseType: !1639, size: 64)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1636, file: !1631, line: 65, baseType: !1639, size: 64, offset: 64)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1636, file: !1631, line: 66, baseType: !7, size: 32, offset: 128)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1636, file: !1631, line: 67, baseType: !1643, size: 128, offset: 192)
!1643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1644, size: 128, elements: !1645)
!1644 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1631, line: 29, baseType: !1456)
!1645 = !{!1646}
!1646 = !DISubrange(count: 2)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1630, file: !1631, line: 77, baseType: !1634, size: 64, offset: 64)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1630, file: !1631, line: 78, baseType: !7, size: 32, offset: 128)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1630, file: !1631, line: 79, baseType: !1650, size: 64, offset: 192)
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1651, size: 64)
!1651 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1631, line: 49, baseType: !1652)
!1652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1631, line: 45, size: 832, elements: !1653)
!1653 = !{!1654, !1655, !1656}
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1652, file: !1631, line: 46, baseType: !1639, size: 64)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1652, file: !1631, line: 47, baseType: !1629, size: 64, offset: 64)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1652, file: !1631, line: 48, baseType: !1657, size: 704, offset: 128)
!1657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1658, line: 164, size: 704, elements: !1659)
!1658 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1659 = !{!1660, !1661, !1671, !1672, !1673, !1674, !1675, !1676, !1680, !1684, !1685, !1686, !1687}
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1657, file: !1658, line: 166, baseType: !1458, size: 64)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1657, file: !1658, line: 167, baseType: !1662, size: 64, offset: 64)
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1663, size: 64)
!1663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1658, line: 157, size: 192, elements: !1664)
!1664 = !{!1665, !1666, !1667}
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1663, file: !1658, line: 159, baseType: !1389, size: 64)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1663, file: !1658, line: 160, baseType: !1662, size: 64, offset: 64)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1663, file: !1658, line: 161, baseType: !1668, size: 32, offset: 128)
!1668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1390, size: 32, elements: !1669)
!1669 = !{!1670}
!1670 = !DISubrange(count: 4)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1657, file: !1658, line: 168, baseType: !1389, size: 64, offset: 128)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1657, file: !1658, line: 169, baseType: !1389, size: 64, offset: 192)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1657, file: !1658, line: 170, baseType: !1389, size: 64, offset: 256)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1657, file: !1658, line: 171, baseType: !1458, size: 64, offset: 320)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1657, file: !1658, line: 172, baseType: !1387, size: 32, offset: 384)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1657, file: !1658, line: 176, baseType: !1677, size: 64, offset: 448)
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1678, size: 64)
!1678 = !DISubroutineType(types: !1679)
!1679 = !{!1662, !1391, !1458}
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1657, file: !1658, line: 177, baseType: !1681, size: 64, offset: 512)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64)
!1682 = !DISubroutineType(types: !1683)
!1683 = !{null, !1391, !1662}
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1657, file: !1658, line: 178, baseType: !1391, size: 64, offset: 576)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1657, file: !1658, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1657, file: !1658, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1657, file: !1658, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !1598, file: !1580, line: 177, baseType: !1402, size: 64)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !1598, file: !1580, line: 178, baseType: !1690, size: 64)
!1690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1691, size: 64)
!1691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !330, line: 217, size: 832, elements: !1692)
!1692 = !{!1693, !1939, !1940, !1941, !1944, !1948, !1949, !1950, !1968, !1969, !1970, !1971, !1972, !1973}
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1691, file: !330, line: 219, baseType: !1694, size: 64)
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64)
!1695 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !330, line: 151, baseType: !1696)
!1696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !330, line: 151, size: 128, elements: !1697)
!1697 = !{!1698}
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1696, file: !330, line: 151, baseType: !1699, size: 128)
!1699 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !330, line: 150, baseType: !1700)
!1700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !330, line: 150, size: 128, elements: !1701)
!1701 = !{!1702, !1703, !1704}
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1700, file: !330, line: 150, baseType: !7, size: 32)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1700, file: !330, line: 150, baseType: !7, size: 32, offset: 32)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1700, file: !330, line: 150, baseType: !1705, size: 64, offset: 64)
!1705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1706, size: 64, elements: !1501)
!1706 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !1403, line: 108, baseType: !1707)
!1707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1708, size: 64)
!1708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !330, line: 122, size: 512, elements: !1709)
!1709 = !{!1710, !1711, !1712, !1931, !1932, !1933, !1934, !1935, !1936, !1937}
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1708, file: !330, line: 124, baseType: !1690, size: 64)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1708, file: !330, line: 125, baseType: !1690, size: 64, offset: 64)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1708, file: !330, line: 131, baseType: !1713, size: 64, offset: 128)
!1713 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !330, line: 128, size: 64, elements: !1714)
!1714 = !{!1715, !1930}
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1713, file: !330, line: 129, baseType: !1716, size: 64)
!1716 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !1403, line: 66, baseType: !1717)
!1717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1718, size: 64)
!1718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !388, line: 143, size: 192, elements: !1719)
!1719 = !{!1720, !1928, !1929}
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1718, file: !388, line: 145, baseType: !1721, size: 64)
!1721 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !1403, line: 69, baseType: !1722)
!1722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1723, size: 64)
!1723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !388, line: 136, size: 192, elements: !1724)
!1724 = !{!1725, !1926, !1927}
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1723, file: !388, line: 137, baseType: !1726, size: 64)
!1726 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !1403, line: 58, baseType: !1727)
!1727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1728, size: 64)
!1728 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !388, line: 737, size: 768, elements: !1729)
!1729 = !{!1730, !1747, !1781, !1787, !1792, !1797, !1804, !1810, !1816, !1821, !1835, !1840, !1846, !1851, !1861, !1866, !1884, !1891, !1898, !1904, !1909, !1915, !1921}
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1728, file: !388, line: 738, baseType: !1731, size: 256)
!1731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !388, line: 271, size: 256, elements: !1732)
!1732 = !{!1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746}
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1731, file: !388, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1731, file: !388, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1731, file: !388, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1731, file: !388, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1731, file: !388, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1731, file: !388, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1731, file: !388, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1731, file: !388, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1731, file: !388, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1731, file: !388, line: 312, baseType: !7, size: 32, offset: 32)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1731, file: !388, line: 316, baseType: !1527, size: 32, offset: 64)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1731, file: !388, line: 319, baseType: !7, size: 32, offset: 96)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1731, file: !388, line: 323, baseType: !1690, size: 64, offset: 128)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1731, file: !388, line: 327, baseType: !1402, size: 64, offset: 192)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1728, file: !388, line: 739, baseType: !1748, size: 448)
!1748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !388, line: 350, size: 448, elements: !1749)
!1749 = !{!1750, !1779}
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1748, file: !388, line: 353, baseType: !1751, size: 384)
!1751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !388, line: 333, size: 384, elements: !1752)
!1752 = !{!1753, !1754, !1762}
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1751, file: !388, line: 336, baseType: !1731, size: 256)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1751, file: !388, line: 343, baseType: !1755, size: 64, offset: 256)
!1755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1756, size: 64)
!1756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1757, line: 37, size: 128, elements: !1758)
!1757 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1758 = !{!1759, !1760}
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1756, file: !1757, line: 39, baseType: !1755, size: 64)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1756, file: !1757, line: 40, baseType: !1761, size: 64, offset: 64)
!1761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1751, file: !388, line: 344, baseType: !1763, size: 64, offset: 320)
!1763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1764, size: 64)
!1764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1757, line: 45, size: 320, elements: !1765)
!1765 = !{!1766, !1767}
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1764, file: !1757, line: 47, baseType: !1763, size: 64)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1764, file: !1757, line: 48, baseType: !1768, size: 256, offset: 64)
!1768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !1769)
!1769 = !{!1770, !1772, !1773, !1778}
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1768, file: !135, line: 1884, baseType: !1771, size: 64)
!1771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1768, size: 64)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1768, file: !135, line: 1885, baseType: !1771, size: 64, offset: 64)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1768, file: !135, line: 1891, baseType: !1774, size: 64, offset: 128)
!1774 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1768, file: !135, line: 1891, size: 64, elements: !1775)
!1775 = !{!1776, !1777}
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1774, file: !135, line: 1891, baseType: !1726, size: 64)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1774, file: !135, line: 1891, baseType: !1402, size: 64)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1768, file: !135, line: 1892, baseType: !1761, size: 64, offset: 192)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1748, file: !388, line: 359, baseType: !1780, size: 64, offset: 384)
!1780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1402, size: 64, elements: !1501)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1728, file: !388, line: 740, baseType: !1782, size: 512)
!1782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !388, line: 365, size: 512, elements: !1783)
!1783 = !{!1784, !1785, !1786}
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1782, file: !388, line: 368, baseType: !1751, size: 384)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1782, file: !388, line: 373, baseType: !1402, size: 64, offset: 384)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1782, file: !388, line: 374, baseType: !1402, size: 64, offset: 448)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1728, file: !388, line: 741, baseType: !1788, size: 576)
!1788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !388, line: 380, size: 576, elements: !1789)
!1789 = !{!1790, !1791}
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1788, file: !388, line: 383, baseType: !1782, size: 512)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1788, file: !388, line: 389, baseType: !1780, size: 64, offset: 512)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1728, file: !388, line: 742, baseType: !1793, size: 320)
!1793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !388, line: 395, size: 320, elements: !1794)
!1794 = !{!1795, !1796}
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1793, file: !388, line: 397, baseType: !1731, size: 256)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1793, file: !388, line: 400, baseType: !1716, size: 64, offset: 256)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1728, file: !388, line: 743, baseType: !1798, size: 448)
!1798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !388, line: 406, size: 448, elements: !1799)
!1799 = !{!1800, !1801, !1802, !1803}
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1798, file: !388, line: 408, baseType: !1731, size: 256)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1798, file: !388, line: 412, baseType: !1402, size: 64, offset: 256)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1798, file: !388, line: 420, baseType: !1402, size: 64, offset: 320)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1798, file: !388, line: 423, baseType: !1716, size: 64, offset: 384)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1728, file: !388, line: 744, baseType: !1805, size: 384)
!1805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !388, line: 429, size: 384, elements: !1806)
!1806 = !{!1807, !1808, !1809}
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1805, file: !388, line: 431, baseType: !1731, size: 256)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1805, file: !388, line: 434, baseType: !1402, size: 64, offset: 256)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1805, file: !388, line: 437, baseType: !1716, size: 64, offset: 320)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1728, file: !388, line: 745, baseType: !1811, size: 384)
!1811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !388, line: 443, size: 384, elements: !1812)
!1812 = !{!1813, !1814, !1815}
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1811, file: !388, line: 445, baseType: !1731, size: 256)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1811, file: !388, line: 449, baseType: !1402, size: 64, offset: 256)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1811, file: !388, line: 453, baseType: !1716, size: 64, offset: 320)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1728, file: !388, line: 746, baseType: !1817, size: 320)
!1817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !388, line: 459, size: 320, elements: !1818)
!1818 = !{!1819, !1820}
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1817, file: !388, line: 461, baseType: !1731, size: 256)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1817, file: !388, line: 464, baseType: !1402, size: 64, offset: 256)
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1728, file: !388, line: 747, baseType: !1822, size: 768)
!1822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !388, line: 469, size: 768, elements: !1823)
!1823 = !{!1824, !1825, !1826, !1827, !1828}
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1822, file: !388, line: 471, baseType: !1731, size: 256)
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1822, file: !388, line: 474, baseType: !7, size: 32, offset: 256)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1822, file: !388, line: 475, baseType: !7, size: 32, offset: 288)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1822, file: !388, line: 478, baseType: !1402, size: 64, offset: 320)
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1822, file: !388, line: 481, baseType: !1829, size: 384, offset: 384)
!1829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1830, size: 384, elements: !1501)
!1830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !1831)
!1831 = !{!1832, !1833, !1834}
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1830, file: !135, line: 1920, baseType: !1768, size: 256)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1830, file: !135, line: 1921, baseType: !1402, size: 64, offset: 256)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1830, file: !135, line: 1922, baseType: !1527, size: 32, offset: 320)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1728, file: !388, line: 748, baseType: !1836, size: 320)
!1836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !388, line: 487, size: 320, elements: !1837)
!1837 = !{!1838, !1839}
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1836, file: !388, line: 490, baseType: !1731, size: 256)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1836, file: !388, line: 494, baseType: !1387, size: 32, offset: 256)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1728, file: !388, line: 749, baseType: !1841, size: 384)
!1841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !388, line: 500, size: 384, elements: !1842)
!1842 = !{!1843, !1844, !1845}
!1843 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1841, file: !388, line: 502, baseType: !1731, size: 256)
!1844 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1841, file: !388, line: 506, baseType: !1716, size: 64, offset: 256)
!1845 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1841, file: !388, line: 510, baseType: !1716, size: 64, offset: 320)
!1846 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1728, file: !388, line: 750, baseType: !1847, size: 320)
!1847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !388, line: 529, size: 320, elements: !1848)
!1848 = !{!1849, !1850}
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1847, file: !388, line: 531, baseType: !1731, size: 256)
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1847, file: !388, line: 540, baseType: !1716, size: 64, offset: 256)
!1851 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1728, file: !388, line: 751, baseType: !1852, size: 704)
!1852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !388, line: 546, size: 704, elements: !1853)
!1853 = !{!1854, !1855, !1856, !1857, !1858, !1859, !1860}
!1854 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1852, file: !388, line: 549, baseType: !1782, size: 512)
!1855 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1852, file: !388, line: 553, baseType: !1392, size: 64, offset: 512)
!1856 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1852, file: !388, line: 557, baseType: !1386, size: 8, offset: 576)
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1852, file: !388, line: 558, baseType: !1386, size: 8, offset: 584)
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1852, file: !388, line: 559, baseType: !1386, size: 8, offset: 592)
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1852, file: !388, line: 560, baseType: !1386, size: 8, offset: 600)
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1852, file: !388, line: 566, baseType: !1780, size: 64, offset: 640)
!1861 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1728, file: !388, line: 752, baseType: !1862, size: 384)
!1862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !388, line: 571, size: 384, elements: !1863)
!1863 = !{!1864, !1865}
!1864 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1862, file: !388, line: 573, baseType: !1793, size: 320)
!1865 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1862, file: !388, line: 577, baseType: !1402, size: 64, offset: 320)
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1728, file: !388, line: 753, baseType: !1867, size: 576)
!1867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !388, line: 600, size: 576, elements: !1868)
!1868 = !{!1869, !1870, !1871, !1874, !1883}
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1867, file: !388, line: 602, baseType: !1793, size: 320)
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1867, file: !388, line: 605, baseType: !1402, size: 64, offset: 320)
!1871 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1867, file: !388, line: 609, baseType: !1872, size: 64, offset: 384)
!1872 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1873, line: 46, baseType: !1456)
!1873 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1874 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1867, file: !388, line: 612, baseType: !1875, size: 64, offset: 448)
!1875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1876, size: 64)
!1876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !388, line: 581, size: 320, elements: !1877)
!1877 = !{!1878, !1879, !1880, !1881, !1882}
!1878 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1876, file: !388, line: 583, baseType: !134, size: 32)
!1879 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1876, file: !388, line: 586, baseType: !1402, size: 64, offset: 64)
!1880 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1876, file: !388, line: 589, baseType: !1402, size: 64, offset: 128)
!1881 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1876, file: !388, line: 592, baseType: !1402, size: 64, offset: 192)
!1882 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1876, file: !388, line: 595, baseType: !1402, size: 64, offset: 256)
!1883 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1867, file: !388, line: 616, baseType: !1716, size: 64, offset: 512)
!1884 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1728, file: !388, line: 754, baseType: !1885, size: 512)
!1885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !388, line: 622, size: 512, elements: !1886)
!1886 = !{!1887, !1888, !1889, !1890}
!1887 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1885, file: !388, line: 624, baseType: !1793, size: 320)
!1888 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1885, file: !388, line: 628, baseType: !1402, size: 64, offset: 320)
!1889 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1885, file: !388, line: 632, baseType: !1402, size: 64, offset: 384)
!1890 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1885, file: !388, line: 636, baseType: !1402, size: 64, offset: 448)
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1728, file: !388, line: 755, baseType: !1892, size: 704)
!1892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !388, line: 642, size: 704, elements: !1893)
!1893 = !{!1894, !1895, !1896, !1897}
!1894 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1892, file: !388, line: 644, baseType: !1885, size: 512)
!1895 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1892, file: !388, line: 648, baseType: !1402, size: 64, offset: 512)
!1896 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1892, file: !388, line: 652, baseType: !1402, size: 64, offset: 576)
!1897 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1892, file: !388, line: 653, baseType: !1402, size: 64, offset: 640)
!1898 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1728, file: !388, line: 756, baseType: !1899, size: 448)
!1899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !388, line: 663, size: 448, elements: !1900)
!1900 = !{!1901, !1902, !1903}
!1901 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1899, file: !388, line: 665, baseType: !1793, size: 320)
!1902 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1899, file: !388, line: 668, baseType: !1402, size: 64, offset: 320)
!1903 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1899, file: !388, line: 673, baseType: !1402, size: 64, offset: 384)
!1904 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1728, file: !388, line: 757, baseType: !1905, size: 384)
!1905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !388, line: 694, size: 384, elements: !1906)
!1906 = !{!1907, !1908}
!1907 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1905, file: !388, line: 696, baseType: !1793, size: 320)
!1908 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1905, file: !388, line: 699, baseType: !1402, size: 64, offset: 320)
!1909 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1728, file: !388, line: 758, baseType: !1910, size: 384)
!1910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !388, line: 681, size: 384, elements: !1911)
!1911 = !{!1912, !1913, !1914}
!1912 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1910, file: !388, line: 683, baseType: !1731, size: 256)
!1913 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1910, file: !388, line: 686, baseType: !1402, size: 64, offset: 256)
!1914 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1910, file: !388, line: 689, baseType: !1402, size: 64, offset: 320)
!1915 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1728, file: !388, line: 759, baseType: !1916, size: 384)
!1916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !388, line: 707, size: 384, elements: !1917)
!1917 = !{!1918, !1919, !1920}
!1918 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1916, file: !388, line: 709, baseType: !1731, size: 256)
!1919 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1916, file: !388, line: 712, baseType: !1402, size: 64, offset: 256)
!1920 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1916, file: !388, line: 712, baseType: !1402, size: 64, offset: 320)
!1921 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1728, file: !388, line: 760, baseType: !1922, size: 320)
!1922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !388, line: 718, size: 320, elements: !1923)
!1923 = !{!1924, !1925}
!1924 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1922, file: !388, line: 720, baseType: !1731, size: 256)
!1925 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1922, file: !388, line: 723, baseType: !1402, size: 64, offset: 256)
!1926 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1723, file: !388, line: 138, baseType: !1722, size: 64, offset: 64)
!1927 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1723, file: !388, line: 139, baseType: !1722, size: 64, offset: 128)
!1928 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1718, file: !388, line: 146, baseType: !1721, size: 64, offset: 64)
!1929 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1718, file: !388, line: 152, baseType: !1716, size: 64, offset: 128)
!1930 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1713, file: !330, line: 130, baseType: !1577, size: 64)
!1931 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1708, file: !330, line: 134, baseType: !1391, size: 64, offset: 192)
!1932 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1708, file: !330, line: 137, baseType: !1402, size: 64, offset: 256)
!1933 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1708, file: !330, line: 138, baseType: !1527, size: 32, offset: 320)
!1934 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1708, file: !330, line: 142, baseType: !7, size: 32, offset: 352)
!1935 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1708, file: !330, line: 144, baseType: !1387, size: 32, offset: 384)
!1936 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1708, file: !330, line: 145, baseType: !1387, size: 32, offset: 416)
!1937 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1708, file: !330, line: 146, baseType: !1938, size: 64, offset: 448)
!1938 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !330, line: 119, baseType: !1458)
!1939 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1691, file: !330, line: 220, baseType: !1694, size: 64, offset: 64)
!1940 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1691, file: !330, line: 223, baseType: !1391, size: 64, offset: 128)
!1941 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1691, file: !330, line: 226, baseType: !1942, size: 64, offset: 192)
!1942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1943, size: 64)
!1943 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 185, flags: DIFlagFwdDecl)
!1944 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1691, file: !330, line: 229, baseType: !1945, size: 128, offset: 256)
!1945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1946, size: 128, elements: !1645)
!1946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1947, size: 64)
!1947 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !330, line: 229, flags: DIFlagFwdDecl)
!1948 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1691, file: !330, line: 232, baseType: !1690, size: 64, offset: 384)
!1949 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1691, file: !330, line: 233, baseType: !1690, size: 64, offset: 448)
!1950 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1691, file: !330, line: 238, baseType: !1951, size: 64, offset: 512)
!1951 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !330, line: 235, size: 64, elements: !1952)
!1952 = !{!1953, !1959}
!1953 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1951, file: !330, line: 236, baseType: !1954, size: 64)
!1954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1955, size: 64)
!1955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !330, line: 273, size: 128, elements: !1956)
!1956 = !{!1957, !1958}
!1957 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1955, file: !330, line: 275, baseType: !1716, size: 64)
!1958 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1955, file: !330, line: 278, baseType: !1716, size: 64, offset: 64)
!1959 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1951, file: !330, line: 237, baseType: !1960, size: 64)
!1960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1961, size: 64)
!1961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !330, line: 259, size: 320, elements: !1962)
!1962 = !{!1963, !1964, !1965, !1966, !1967}
!1963 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1961, file: !330, line: 261, baseType: !1577, size: 64)
!1964 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1961, file: !330, line: 262, baseType: !1577, size: 64, offset: 64)
!1965 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1961, file: !330, line: 266, baseType: !1577, size: 64, offset: 128)
!1966 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1961, file: !330, line: 267, baseType: !1577, size: 64, offset: 192)
!1967 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1961, file: !330, line: 270, baseType: !1387, size: 32, offset: 256)
!1968 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1691, file: !330, line: 241, baseType: !1938, size: 64, offset: 576)
!1969 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1691, file: !330, line: 244, baseType: !1387, size: 32, offset: 640)
!1970 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1691, file: !330, line: 247, baseType: !1387, size: 32, offset: 672)
!1971 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1691, file: !330, line: 250, baseType: !1387, size: 32, offset: 704)
!1972 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1691, file: !330, line: 253, baseType: !1387, size: 32, offset: 736)
!1973 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1691, file: !330, line: 256, baseType: !1387, size: 32, offset: 768)
!1974 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !1598, file: !1580, line: 179, baseType: !1975, size: 64)
!1975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1976, size: 64)
!1976 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !1580, line: 150, baseType: !1977)
!1977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !1580, line: 142, size: 320, elements: !1978)
!1978 = !{!1979, !1980, !1981, !1982, !1985, !1986}
!1979 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1977, file: !1580, line: 144, baseType: !1402, size: 64)
!1980 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1977, file: !1580, line: 145, baseType: !1577, size: 64, offset: 64)
!1981 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1977, file: !1580, line: 146, baseType: !1577, size: 64, offset: 128)
!1982 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1977, file: !1580, line: 147, baseType: !1983, size: 32, offset: 192)
!1983 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1984, line: 31, baseType: !1387)
!1984 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1985 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1977, file: !1580, line: 148, baseType: !7, size: 32, offset: 224)
!1986 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1977, file: !1580, line: 149, baseType: !1386, size: 8, offset: 256)
!1987 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !1598, file: !1580, line: 180, baseType: !1988, size: 64)
!1988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1989, size: 64)
!1989 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !1580, line: 162, baseType: !1990)
!1990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !1580, line: 159, size: 128, elements: !1991)
!1991 = !{!1992, !1993}
!1992 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1990, file: !1580, line: 160, baseType: !1402, size: 64)
!1993 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1990, file: !1580, line: 161, baseType: !1458, size: 64, offset: 64)
!1994 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !1598, file: !1580, line: 181, baseType: !1995, size: 64)
!1995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1996, size: 64)
!1996 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !1580, line: 181, flags: DIFlagFwdDecl)
!1997 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !1593, file: !1580, line: 317, baseType: !1998, size: 64)
!1998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1458, size: 64, elements: !1501)
!1999 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !1593, file: !1580, line: 318, baseType: !2000, size: 320)
!2000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !1580, line: 188, size: 320, elements: !2001)
!2001 = !{!2002, !2004, !2061}
!2002 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !2000, file: !1580, line: 190, baseType: !2003, size: 192)
!2003 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1597, size: 192, elements: !1476)
!2004 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !2000, file: !1580, line: 193, baseType: !2005, size: 64, offset: 192)
!2005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2006, size: 64)
!2006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !1580, line: 206, size: 320, elements: !2007)
!2007 = !{!2008, !2046, !2047, !2048, !2060}
!2008 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !2006, file: !1580, line: 208, baseType: !2009, size: 64)
!2009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2010, size: 64)
!2010 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !1403, line: 62, baseType: !2011)
!2011 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !2012, line: 538, size: 256, elements: !2013)
!2012 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2013 = !{!2014, !2018, !2024, !2037}
!2014 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2011, file: !2012, line: 539, baseType: !2015, size: 32)
!2015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !2012, line: 482, size: 32, elements: !2016)
!2016 = !{!2017}
!2017 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2015, file: !2012, line: 484, baseType: !7, size: 32)
!2018 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !2011, file: !2012, line: 540, baseType: !2019, size: 192)
!2019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !2012, line: 488, size: 192, elements: !2020)
!2020 = !{!2021, !2022, !2023}
!2021 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2019, file: !2012, line: 489, baseType: !2015, size: 32)
!2022 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2019, file: !2012, line: 492, baseType: !1392, size: 64, offset: 64)
!2023 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !2019, file: !2012, line: 496, baseType: !1402, size: 64, offset: 128)
!2024 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !2011, file: !2012, line: 541, baseType: !2025, size: 256)
!2025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !2012, line: 504, size: 256, elements: !2026)
!2026 = !{!2027, !2028, !2035, !2036}
!2027 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2025, file: !2012, line: 505, baseType: !2015, size: 32)
!2028 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !2025, file: !2012, line: 509, baseType: !2029, size: 64, offset: 64)
!2029 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !2012, line: 501, baseType: !2030)
!2030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2031, size: 64)
!2031 = !DISubroutineType(types: !2032)
!2032 = !{null, !2033}
!2033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2034, size: 64)
!2034 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!2035 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !2025, file: !2012, line: 510, baseType: !2033, size: 64, offset: 128)
!2036 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2025, file: !2012, line: 513, baseType: !2009, size: 64, offset: 192)
!2037 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !2011, file: !2012, line: 542, baseType: !2038, size: 128)
!2038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !2012, line: 530, size: 128, elements: !2039)
!2039 = !{!2040, !2041}
!2040 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2038, file: !2012, line: 531, baseType: !2015, size: 32)
!2041 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !2038, file: !2012, line: 534, baseType: !2042, size: 64, offset: 64)
!2042 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !2012, line: 525, baseType: !2043)
!2043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2044, size: 64)
!2044 = !DISubroutineType(types: !2045)
!2045 = !{!1386, !1402, !1392, !1456, !1456}
!2046 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !2006, file: !1580, line: 211, baseType: !7, size: 32, offset: 64)
!2047 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2006, file: !1580, line: 214, baseType: !1458, size: 64, offset: 128)
!2048 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !2006, file: !1580, line: 224, baseType: !2049, size: 64, offset: 192)
!2049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2050, size: 64)
!2050 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !1580, line: 202, baseType: !2051)
!2051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !1580, line: 202, size: 128, elements: !2052)
!2052 = !{!2053}
!2053 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2051, file: !1580, line: 202, baseType: !2054, size: 128)
!2054 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !1580, line: 200, baseType: !2055)
!2055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !1580, line: 200, size: 128, elements: !2056)
!2056 = !{!2057, !2058, !2059}
!2057 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2055, file: !1580, line: 200, baseType: !7, size: 32)
!2058 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2055, file: !1580, line: 200, baseType: !7, size: 32, offset: 32)
!2059 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2055, file: !1580, line: 200, baseType: !1611, size: 64, offset: 64)
!2060 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !2006, file: !1580, line: 234, baseType: !2049, size: 64, offset: 256)
!2061 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2000, file: !1580, line: 197, baseType: !1458, size: 64, offset: 256)
!2062 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !1593, file: !1580, line: 319, baseType: !1465, size: 256)
!2063 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !1593, file: !1580, line: 320, baseType: !1484, size: 192)
!2064 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !1405, file: !135, line: 3384, baseType: !2065, size: 1472)
!2065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !2066)
!2066 = !{!2067, !2088, !2089, !2090, !2091}
!2067 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2065, file: !135, line: 3115, baseType: !2068, size: 1216)
!2068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !2069)
!2069 = !{!2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087}
!2070 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2068, file: !135, line: 2985, baseType: !1573, size: 960)
!2071 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !2068, file: !135, line: 2986, baseType: !1402, size: 64, offset: 960)
!2072 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !2068, file: !135, line: 2987, baseType: !1402, size: 64, offset: 1024)
!2073 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !2068, file: !135, line: 2988, baseType: !1402, size: 64, offset: 1088)
!2074 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !2068, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!2075 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !2068, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!2076 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !2068, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!2077 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !2068, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!2078 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !2068, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!2079 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !2068, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!2080 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !2068, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!2081 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !2068, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!2082 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !2068, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!2083 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !2068, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!2084 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !2068, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!2085 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !2068, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!2086 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !2068, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!2087 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !2068, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!2088 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !2065, file: !135, line: 3117, baseType: !1402, size: 64, offset: 1216)
!2089 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !2065, file: !135, line: 3119, baseType: !1402, size: 64, offset: 1280)
!2090 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !2065, file: !135, line: 3121, baseType: !1402, size: 64, offset: 1344)
!2091 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !2065, file: !135, line: 3123, baseType: !1402, size: 64, offset: 1408)
!2092 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !1405, file: !135, line: 3385, baseType: !2093, size: 1088)
!2093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !2094)
!2094 = !{!2095, !2096, !2097}
!2095 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2093, file: !135, line: 2875, baseType: !1573, size: 960)
!2096 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !2093, file: !135, line: 2876, baseType: !1577, size: 64, offset: 960)
!2097 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2093, file: !135, line: 2877, baseType: !2098, size: 64, offset: 1024)
!2098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2099, size: 64)
!2099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !2100, line: 172, size: 128, elements: !2101)
!2100 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2101 = !{!2102, !2103, !2104, !2105, !2106, !2107, !2108}
!2102 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !2099, file: !2100, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!2103 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !2099, file: !2100, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!2104 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !2099, file: !2100, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!2105 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !2099, file: !2100, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!2106 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !2099, file: !2100, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!2107 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !2099, file: !2100, line: 195, baseType: !7, size: 32, offset: 32)
!2108 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !2099, file: !2100, line: 199, baseType: !1402, size: 64, offset: 64)
!2109 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !1405, file: !135, line: 3386, baseType: !2068, size: 1216)
!2110 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !1405, file: !135, line: 3387, baseType: !2111, size: 1280)
!2111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !2112)
!2112 = !{!2113, !2114}
!2113 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2111, file: !135, line: 3094, baseType: !2068, size: 1216)
!2114 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2111, file: !135, line: 3095, baseType: !2098, size: 64, offset: 1216)
!2115 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !1405, file: !135, line: 3388, baseType: !2116, size: 1216)
!2116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !2117)
!2117 = !{!2118, !2119, !2120, !2121, !2122, !2123}
!2118 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2116, file: !135, line: 2825, baseType: !1535, size: 896)
!2119 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2116, file: !135, line: 2827, baseType: !1402, size: 64, offset: 896)
!2120 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !2116, file: !135, line: 2828, baseType: !1402, size: 64, offset: 960)
!2121 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !2116, file: !135, line: 2829, baseType: !1402, size: 64, offset: 1024)
!2122 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !2116, file: !135, line: 2830, baseType: !1402, size: 64, offset: 1088)
!2123 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !2116, file: !135, line: 2831, baseType: !1402, size: 64, offset: 1152)
!2124 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !1405, file: !135, line: 3389, baseType: !2125, size: 1024)
!2125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !2126)
!2126 = !{!2127, !2128, !2129}
!2127 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2125, file: !135, line: 2851, baseType: !1573, size: 960)
!2128 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !2125, file: !135, line: 2852, baseType: !1387, size: 32, offset: 960)
!2129 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !2125, file: !135, line: 2853, baseType: !1387, size: 32, offset: 992)
!2130 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !1405, file: !135, line: 3390, baseType: !2131, size: 1024)
!2131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !2132)
!2132 = !{!2133, !2134}
!2133 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2131, file: !135, line: 2858, baseType: !1573, size: 960)
!2134 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2131, file: !135, line: 2859, baseType: !2098, size: 64, offset: 960)
!2135 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !1405, file: !135, line: 3391, baseType: !2136, size: 960)
!2136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !2137)
!2137 = !{!2138}
!2138 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2136, file: !135, line: 2863, baseType: !1573, size: 960)
!2139 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !1405, file: !135, line: 3392, baseType: !2140, size: 1472)
!2140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !2141)
!2141 = !{!2142}
!2142 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2140, file: !135, line: 3305, baseType: !2065, size: 1472)
!2143 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !1405, file: !135, line: 3393, baseType: !2144, size: 1792)
!2144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !2145)
!2145 = !{!2146, !2147, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379}
!2146 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2144, file: !135, line: 3249, baseType: !2065, size: 1472)
!2147 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !2144, file: !135, line: 3251, baseType: !2148, size: 64, offset: 1472)
!2148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2149, size: 64)
!2149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !2150, line: 463, size: 1152, elements: !2151)
!2150 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2151 = !{!2152, !2155, !2186, !2187, !2300, !2303, !2304, !2305, !2306, !2307, !2308, !2332, !2335, !2336, !2337, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2356, !2357, !2358}
!2152 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !2149, file: !2150, line: 464, baseType: !2153, size: 64)
!2153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2154, size: 64)
!2154 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !2150, line: 464, flags: DIFlagFwdDecl)
!2155 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !2149, file: !2150, line: 467, baseType: !2156, size: 64, offset: 64)
!2156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2157, size: 64)
!2157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !330, line: 374, size: 640, elements: !2158)
!2158 = !{!2159, !2161, !2162, !2175, !2176, !2177, !2178, !2179, !2180, !2182, !2184, !2185}
!2159 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !2157, file: !330, line: 377, baseType: !2160, size: 64)
!2160 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !1403, line: 111, baseType: !1690)
!2161 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !2157, file: !330, line: 378, baseType: !2160, size: 64, offset: 64)
!2162 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !2157, file: !330, line: 381, baseType: !2163, size: 64, offset: 128)
!2163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2164, size: 64)
!2164 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !330, line: 282, baseType: !2165)
!2165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !330, line: 282, size: 128, elements: !2166)
!2166 = !{!2167}
!2167 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2165, file: !330, line: 282, baseType: !2168, size: 128)
!2168 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !330, line: 281, baseType: !2169)
!2169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !330, line: 281, size: 128, elements: !2170)
!2170 = !{!2171, !2172, !2173}
!2171 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2169, file: !330, line: 281, baseType: !7, size: 32)
