; ModuleID = 'var-tracking.bc'
source_filename = "var-tracking.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtl_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }

!704 = !{!705, !706, !707, !708, !709, !710, !711, !712, !713, !714}
!705 = !DIEnumerator(name: "MO_USE", value: 0, isUnsigned: true)
!706 = !DIEnumerator(name: "MO_USE_NO_VAR", value: 1, isUnsigned: true)
!707 = !DIEnumerator(name: "MO_VAL_USE", value: 2, isUnsigned: true)
!708 = !DIEnumerator(name: "MO_VAL_LOC", value: 3, isUnsigned: true)
!709 = !DIEnumerator(name: "MO_VAL_SET", value: 4, isUnsigned: true)
!710 = !DIEnumerator(name: "MO_SET", value: 5, isUnsigned: true)
!711 = !DIEnumerator(name: "MO_COPY", value: 6, isUnsigned: true)
!712 = !DIEnumerator(name: "MO_CLOBBER", value: 7, isUnsigned: true)
!713 = !DIEnumerator(name: "MO_CALL", value: 8, isUnsigned: true)
!714 = !DIEnumerator(name: "MO_ADJUST", value: 9, isUnsigned: true)
!715 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "var_init_status", file: !561, line: 940, baseType: !7, size: 32, elements: !716)
!716 = !{!717, !718, !719}
!717 = !DIEnumerator(name: "VAR_INIT_STATUS_UNKNOWN", value: 0, isUnsigned: true)
!718 = !DIEnumerator(name: "VAR_INIT_STATUS_UNINITIALIZED", value: 1, isUnsigned: true)
!719 = !DIEnumerator(name: "VAR_INIT_STATUS_INITIALIZED", value: 2, isUnsigned: true)
!720 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "insert_option", file: !721, line: 147, baseType: !7, size: 32, elements: !722)
!721 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!722 = !{!723, !724}
!723 = !DIEnumerator(name: "NO_INSERT", value: 0, isUnsigned: true)
!724 = !DIEnumerator(name: "INSERT", value: 1, isUnsigned: true)
!725 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_class", file: !726, line: 36, baseType: !7, size: 32, elements: !727)
!726 = !DIFile(filename: "./machmode.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!727 = !{!728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746}
!728 = !DIEnumerator(name: "MODE_RANDOM", value: 0, isUnsigned: true)
!729 = !DIEnumerator(name: "MODE_CC", value: 1, isUnsigned: true)
!730 = !DIEnumerator(name: "MODE_INT", value: 2, isUnsigned: true)
!731 = !DIEnumerator(name: "MODE_PARTIAL_INT", value: 3, isUnsigned: true)
!732 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!733 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!734 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!735 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!736 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!737 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!738 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!739 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!740 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!741 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!742 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!743 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!744 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!745 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!746 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!747 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "emit_note_where", file: !3, line: 160, baseType: !7, size: 32, elements: !748)
!748 = !{!749, !750, !751}
!749 = !DIEnumerator(name: "EMIT_NOTE_BEFORE_INSN", value: 0, isUnsigned: true)
!750 = !DIEnumerator(name: "EMIT_NOTE_AFTER_INSN", value: 1, isUnsigned: true)
!751 = !DIEnumerator(name: "EMIT_NOTE_AFTER_CALL_INSN", value: 2, isUnsigned: true)
!752 = !{!753, !754, !755, !756, !759, !760, !189, !762, !937, !560, !2109, !2115, !2167, !2156, !1414, !2193, !2195, !2204, !2209, !384, !7, !2149, !1573, !2183, !2216, !2217, !2232, !725, !2120, !938, !2233, !2235, !1656, !2242, !1541, !816, !2243, !2164, !2250, !2256, !2258, !2264, !818, !2266, !2278, !2284}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!755 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !758)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !763, line: 56, baseType: !764)
!763 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !190, line: 3371, size: 1792, elements: !766)
!766 = !{!767, !800, !806, !819, !838, !849, !854, !863, !869, !882, !894, !932, !1445, !1473, !1490, !1491, !1496, !1505, !1511, !1516, !1520, !1524, !1760, !1807, !1813, !1819, !1826, !1839, !1853, !1870, !1882, !1904, !1919, !2091}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !765, file: !190, line: 3372, baseType: !768, size: 64)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !190, line: 360, size: 64, elements: !769)
!769 = !{!770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !768, file: !190, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !768, file: !190, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !768, file: !190, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !768, file: !190, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !768, file: !190, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !768, file: !190, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !768, file: !190, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !768, file: !190, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !768, file: !190, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !768, file: !190, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !768, file: !190, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !768, file: !190, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !768, file: !190, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !768, file: !190, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !768, file: !190, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !768, file: !190, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !768, file: !190, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !768, file: !190, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !768, file: !190, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !768, file: !190, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !768, file: !190, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !768, file: !190, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !768, file: !190, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !768, file: !190, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !768, file: !190, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !768, file: !190, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !768, file: !190, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !768, file: !190, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !768, file: !190, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !768, file: !190, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !765, file: !190, line: 3373, baseType: !801, size: 192)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !190, line: 402, size: 192, elements: !802)
!802 = !{!803, !804, !805}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !801, file: !190, line: 403, baseType: !768, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !801, file: !190, line: 404, baseType: !762, size: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !801, file: !190, line: 405, baseType: !762, size: 64, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !765, file: !190, line: 3374, baseType: !807, size: 320)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !190, line: 1384, size: 320, elements: !808)
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !807, file: !190, line: 1385, baseType: !801, size: 192)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !807, file: !190, line: 1386, baseType: !811, size: 128, offset: 192)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !812, line: 58, baseType: !813)
!812 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !812, line: 54, size: 128, elements: !814)
!814 = !{!815, !817}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !813, file: !812, line: 56, baseType: !816, size: 64)
!816 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !813, file: !812, line: 57, baseType: !818, size: 64, offset: 64)
!818 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !765, file: !190, line: 3375, baseType: !820, size: 256)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !190, line: 1397, size: 256, elements: !821)
!821 = !{!822, !823}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !820, file: !190, line: 1398, baseType: !801, size: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !820, file: !190, line: 1399, baseType: !824, size: 64, offset: 192)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !826, line: 52, size: 256, elements: !827)
!826 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!827 = !{!828, !829, !830, !831, !832, !833, !834}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !825, file: !826, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !825, file: !826, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !825, file: !826, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !825, file: !826, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !825, file: !826, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !825, file: !826, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !825, file: !826, line: 62, baseType: !835, size: 192, offset: 64)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !816, size: 192, elements: !836)
!836 = !{!837}
!837 = !DISubrange(count: 3)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !765, file: !190, line: 3376, baseType: !839, size: 256)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !190, line: 1408, size: 256, elements: !840)
!840 = !{!841, !842}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !839, file: !190, line: 1409, baseType: !801, size: 192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !839, file: !190, line: 1410, baseType: !843, size: 64, offset: 192)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !845, line: 27, size: 192, elements: !846)
!845 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!846 = !{!847, !848}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !844, file: !845, line: 29, baseType: !811, size: 128)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !844, file: !845, line: 30, baseType: !384, size: 32, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !765, file: !190, line: 3377, baseType: !850, size: 256)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !190, line: 1437, size: 256, elements: !851)
!851 = !{!852, !853}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !850, file: !190, line: 1438, baseType: !801, size: 192)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !850, file: !190, line: 1439, baseType: !762, size: 64, offset: 192)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !765, file: !190, line: 3378, baseType: !855, size: 256)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !190, line: 1418, size: 256, elements: !856)
!856 = !{!857, !858, !859}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !855, file: !190, line: 1419, baseType: !801, size: 192)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !855, file: !190, line: 1420, baseType: !755, size: 32, offset: 192)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !855, file: !190, line: 1421, baseType: !860, size: 8, offset: 224)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !758, size: 8, elements: !861)
!861 = !{!862}
!862 = !DISubrange(count: 1)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !765, file: !190, line: 3379, baseType: !864, size: 320)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !190, line: 1428, size: 320, elements: !865)
!865 = !{!866, !867, !868}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !864, file: !190, line: 1429, baseType: !801, size: 192)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !864, file: !190, line: 1430, baseType: !762, size: 64, offset: 192)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !864, file: !190, line: 1431, baseType: !762, size: 64, offset: 256)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !765, file: !190, line: 3380, baseType: !870, size: 320)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !190, line: 1460, size: 320, elements: !871)
!871 = !{!872, !873}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !870, file: !190, line: 1461, baseType: !801, size: 192)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !870, file: !190, line: 1462, baseType: !874, size: 128, offset: 192)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !875, line: 31, size: 128, elements: !876)
!875 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!876 = !{!877, !880, !881}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !874, file: !875, line: 32, baseType: !878, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !754)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !874, file: !875, line: 33, baseType: !7, size: 32, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !874, file: !875, line: 34, baseType: !7, size: 32, offset: 96)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !765, file: !190, line: 3381, baseType: !883, size: 384)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !190, line: 2507, size: 384, elements: !884)
!884 = !{!885, !886, !891, !892, !893}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !883, file: !190, line: 2508, baseType: !801, size: 192)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !883, file: !190, line: 2509, baseType: !887, size: 32, offset: 192)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !888, line: 58, baseType: !889)
!888 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !890, line: 44, baseType: !7)
!890 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!891 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !883, file: !190, line: 2510, baseType: !7, size: 32, offset: 224)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !883, file: !190, line: 2511, baseType: !762, size: 64, offset: 256)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !883, file: !190, line: 2512, baseType: !762, size: 64, offset: 320)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !765, file: !190, line: 3382, baseType: !895, size: 896)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !190, line: 2652, size: 896, elements: !896)
!896 = !{!897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !895, file: !190, line: 2653, baseType: !883, size: 384)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !895, file: !190, line: 2654, baseType: !762, size: 64, offset: 384)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !895, file: !190, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !895, file: !190, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !895, file: !190, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !895, file: !190, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !895, file: !190, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !895, file: !190, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !895, file: !190, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !895, file: !190, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !895, file: !190, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !895, file: !190, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !895, file: !190, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !895, file: !190, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !895, file: !190, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !895, file: !190, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !895, file: !190, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !895, file: !190, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !895, file: !190, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !895, file: !190, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !895, file: !190, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !895, file: !190, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !895, file: !190, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !895, file: !190, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !895, file: !190, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !895, file: !190, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !895, file: !190, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !895, file: !190, line: 2703, baseType: !7, size: 32, offset: 512)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !895, file: !190, line: 2705, baseType: !762, size: 64, offset: 576)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !895, file: !190, line: 2706, baseType: !762, size: 64, offset: 640)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !895, file: !190, line: 2707, baseType: !762, size: 64, offset: 704)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !895, file: !190, line: 2708, baseType: !762, size: 64, offset: 768)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !895, file: !190, line: 2711, baseType: !930, size: 64, offset: 832)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !190, line: 2711, flags: DIFlagFwdDecl)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !765, file: !190, line: 3383, baseType: !933, size: 960)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !190, line: 2756, size: 960, elements: !934)
!934 = !{!935, !936}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !933, file: !190, line: 2757, baseType: !895, size: 896)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !933, file: !190, line: 2758, baseType: !937, size: 64, offset: 896)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !763, line: 50, baseType: !938)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !561, line: 240, size: 384, elements: !940)
!940 = !{!941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !939, file: !561, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !939, file: !561, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !939, file: !561, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !939, file: !561, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !939, file: !561, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !939, file: !561, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !939, file: !561, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !939, file: !561, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !939, file: !561, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !939, file: !561, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !939, file: !561, line: 321, baseType: !952, size: 320, offset: 64)
!952 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !561, line: 315, size: 320, elements: !953)
!953 = !{!954, !1378, !1380, !1443, !1444}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !952, file: !561, line: 316, baseType: !955, size: 64)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 64, elements: !861)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !561, line: 183, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !561, line: 166, size: 64, elements: !958)
!958 = !{!959, !960, !961, !962, !963, !971, !972, !984, !1008, !1068, !1069, !1355, !1368, !1375}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !957, file: !561, line: 168, baseType: !755, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !957, file: !561, line: 169, baseType: !7, size: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !957, file: !561, line: 170, baseType: !760, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !957, file: !561, line: 171, baseType: !937, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !957, file: !561, line: 172, baseType: !964, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !763, line: 53, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !561, line: 359, size: 128, elements: !967)
!967 = !{!968, !969}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !966, file: !561, line: 360, baseType: !755, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !966, file: !561, line: 361, baseType: !970, size: 64, offset: 64)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 64, elements: !861)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !957, file: !561, line: 173, baseType: !384, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !957, file: !561, line: 174, baseType: !973, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !561, line: 133, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !561, line: 115, size: 32, elements: !975)
!975 = !{!976, !977, !978, !979, !980, !981, !982, !983}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !974, file: !561, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !974, file: !561, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !974, file: !561, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !974, file: !561, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !974, file: !561, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !974, file: !561, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !974, file: !561, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !974, file: !561, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !957, file: !561, line: 175, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !987, line: 23, size: 320, elements: !988)
!987 = !DIFile(filename: "./cselib.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!988 = !{!989, !990, !991, !992, !999, !1007}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !986, file: !987, line: 25, baseType: !7, size: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !986, file: !987, line: 28, baseType: !755, size: 32, offset: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "val_rtx", scope: !986, file: !987, line: 31, baseType: !937, size: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "locs", scope: !986, file: !987, line: 35, baseType: !993, size: 64, offset: 128)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "elt_loc_list", file: !987, line: 45, size: 192, elements: !995)
!995 = !{!996, !997, !998}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !994, file: !987, line: 47, baseType: !993, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !994, file: !987, line: 49, baseType: !937, size: 64, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "setting_insn", scope: !994, file: !987, line: 51, baseType: !937, size: 64, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "addr_list", scope: !986, file: !987, line: 39, baseType: !1000, size: 64, offset: 192)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "elt_list", file: !987, line: 55, size: 128, elements: !1002)
!1002 = !{!1003, !1004}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1001, file: !987, line: 56, baseType: !1000, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "elt", scope: !1001, file: !987, line: 57, baseType: !1005, size: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "cselib_val", file: !987, line: 42, baseType: !986)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "next_containing_mem", scope: !986, file: !987, line: 41, baseType: !985, size: 64, offset: 256)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !957, file: !561, line: 176, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1011, line: 75, size: 256, elements: !1012)
!1011 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1012 = !{!1013, !1027, !1028, !1029}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1010, file: !1011, line: 76, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1011, line: 68, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1011, line: 63, size: 320, elements: !1017)
!1017 = !{!1018, !1020, !1021, !1022}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1016, file: !1011, line: 64, baseType: !1019, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1016, file: !1011, line: 65, baseType: !1019, size: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1016, file: !1011, line: 66, baseType: !7, size: 32, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1016, file: !1011, line: 67, baseType: !1023, size: 128, offset: 192)
!1023 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1024, size: 128, elements: !1025)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1011, line: 29, baseType: !816)
!1025 = !{!1026}
!1026 = !DISubrange(count: 2)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1010, file: !1011, line: 77, baseType: !1014, size: 64, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1010, file: !1011, line: 78, baseType: !7, size: 32, offset: 128)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1010, file: !1011, line: 79, baseType: !1030, size: 64, offset: 192)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1011, line: 49, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1011, line: 45, size: 832, elements: !1033)
!1033 = !{!1034, !1035, !1036}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1032, file: !1011, line: 46, baseType: !1019, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1032, file: !1011, line: 47, baseType: !1009, size: 64, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1032, file: !1011, line: 48, baseType: !1037, size: 704, offset: 128)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1038, line: 164, size: 704, elements: !1039)
!1038 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1039 = !{!1040, !1041, !1051, !1052, !1053, !1054, !1055, !1056, !1060, !1064, !1065, !1066, !1067}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1037, file: !1038, line: 166, baseType: !818, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1037, file: !1038, line: 167, baseType: !1042, size: 64, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1038, line: 157, size: 192, elements: !1044)
!1044 = !{!1045, !1046, !1047}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1043, file: !1038, line: 159, baseType: !757, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1043, file: !1038, line: 160, baseType: !1042, size: 64, offset: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1043, file: !1038, line: 161, baseType: !1048, size: 32, offset: 128)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !758, size: 32, elements: !1049)
!1049 = !{!1050}
!1050 = !DISubrange(count: 4)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1037, file: !1038, line: 168, baseType: !757, size: 64, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1037, file: !1038, line: 169, baseType: !757, size: 64, offset: 192)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1037, file: !1038, line: 170, baseType: !757, size: 64, offset: 256)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1037, file: !1038, line: 171, baseType: !818, size: 64, offset: 320)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1037, file: !1038, line: 172, baseType: !755, size: 32, offset: 384)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1037, file: !1038, line: 176, baseType: !1057, size: 64, offset: 448)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!1042, !759, !818}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1037, file: !1038, line: 177, baseType: !1061, size: 64, offset: 512)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{null, !759, !1042}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1037, file: !1038, line: 178, baseType: !759, size: 64, offset: 576)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1037, file: !1038, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1037, file: !1038, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1037, file: !1038, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !957, file: !561, line: 177, baseType: !762, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !957, file: !561, line: 178, baseType: !1070, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !513, line: 217, size: 832, elements: !1072)
!1072 = !{!1073, !1320, !1321, !1322, !1325, !1329, !1330, !1331, !1349, !1350, !1351, !1352, !1353, !1354}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1071, file: !513, line: 219, baseType: !1074, size: 64)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !513, line: 151, baseType: !1076)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !513, line: 151, size: 128, elements: !1077)
!1077 = !{!1078}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1076, file: !513, line: 151, baseType: !1079, size: 128)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !513, line: 150, baseType: !1080)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !513, line: 150, size: 128, elements: !1081)
!1081 = !{!1082, !1083, !1084}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1080, file: !513, line: 150, baseType: !7, size: 32)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1080, file: !513, line: 150, baseType: !7, size: 32, offset: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1080, file: !513, line: 150, baseType: !1085, size: 64, offset: 64)
!1085 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1086, size: 64, elements: !861)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !763, line: 108, baseType: !1087)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !513, line: 122, size: 512, elements: !1089)
!1089 = !{!1090, !1091, !1092, !1312, !1313, !1314, !1315, !1316, !1317, !1318}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1088, file: !513, line: 124, baseType: !1070, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1088, file: !513, line: 125, baseType: !1070, size: 64, offset: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1088, file: !513, line: 131, baseType: !1093, size: 64, offset: 128)
!1093 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !513, line: 128, size: 64, elements: !1094)
!1094 = !{!1095, !1311}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1093, file: !513, line: 129, baseType: !1096, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !763, line: 66, baseType: !1097)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !1099, line: 143, size: 192, elements: !1100)
!1099 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1100 = !{!1101, !1309, !1310}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1098, file: !1099, line: 145, baseType: !1102, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !763, line: 69, baseType: !1103)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !1099, line: 136, size: 192, elements: !1105)
!1105 = !{!1106, !1307, !1308}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1104, file: !1099, line: 137, baseType: !1107, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !763, line: 58, baseType: !1108)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !1099, line: 737, size: 768, elements: !1110)
!1110 = !{!1111, !1128, !1162, !1168, !1173, !1178, !1185, !1191, !1197, !1202, !1216, !1221, !1227, !1232, !1242, !1247, !1265, !1272, !1279, !1285, !1290, !1296, !1302}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1109, file: !1099, line: 738, baseType: !1112, size: 256)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !1099, line: 271, size: 256, elements: !1113)
!1113 = !{!1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1112, file: !1099, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1112, file: !1099, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1112, file: !1099, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1112, file: !1099, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1112, file: !1099, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1112, file: !1099, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1112, file: !1099, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1112, file: !1099, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1112, file: !1099, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1112, file: !1099, line: 312, baseType: !7, size: 32, offset: 32)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1112, file: !1099, line: 316, baseType: !887, size: 32, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1112, file: !1099, line: 319, baseType: !7, size: 32, offset: 96)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1112, file: !1099, line: 323, baseType: !1070, size: 64, offset: 128)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1112, file: !1099, line: 327, baseType: !762, size: 64, offset: 192)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1109, file: !1099, line: 739, baseType: !1129, size: 448)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !1099, line: 350, size: 448, elements: !1130)
!1130 = !{!1131, !1160}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1129, file: !1099, line: 353, baseType: !1132, size: 384)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !1099, line: 333, size: 384, elements: !1133)
!1133 = !{!1134, !1135, !1143}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1132, file: !1099, line: 336, baseType: !1112, size: 256)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1132, file: !1099, line: 343, baseType: !1136, size: 64, offset: 256)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1138, line: 37, size: 128, elements: !1139)
!1138 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1139 = !{!1140, !1141}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1137, file: !1138, line: 39, baseType: !1136, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1137, file: !1138, line: 40, baseType: !1142, size: 64, offset: 64)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1132, file: !1099, line: 344, baseType: !1144, size: 64, offset: 320)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1138, line: 45, size: 320, elements: !1146)
!1146 = !{!1147, !1148}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1145, file: !1138, line: 47, baseType: !1144, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1145, file: !1138, line: 48, baseType: !1149, size: 256, offset: 64)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !190, line: 1883, size: 256, elements: !1150)
!1150 = !{!1151, !1153, !1154, !1159}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1149, file: !190, line: 1884, baseType: !1152, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1149, file: !190, line: 1885, baseType: !1152, size: 64, offset: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1149, file: !190, line: 1891, baseType: !1155, size: 64, offset: 128)
!1155 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1149, file: !190, line: 1891, size: 64, elements: !1156)
!1156 = !{!1157, !1158}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1155, file: !190, line: 1891, baseType: !1107, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1155, file: !190, line: 1891, baseType: !762, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1149, file: !190, line: 1892, baseType: !1142, size: 64, offset: 192)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1129, file: !1099, line: 359, baseType: !1161, size: 64, offset: 384)
!1161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 64, elements: !861)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1109, file: !1099, line: 740, baseType: !1163, size: 512)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !1099, line: 365, size: 512, elements: !1164)
!1164 = !{!1165, !1166, !1167}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1163, file: !1099, line: 368, baseType: !1132, size: 384)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1163, file: !1099, line: 373, baseType: !762, size: 64, offset: 384)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1163, file: !1099, line: 374, baseType: !762, size: 64, offset: 448)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1109, file: !1099, line: 741, baseType: !1169, size: 576)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !1099, line: 380, size: 576, elements: !1170)
!1170 = !{!1171, !1172}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1169, file: !1099, line: 383, baseType: !1163, size: 512)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1169, file: !1099, line: 389, baseType: !1161, size: 64, offset: 512)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1109, file: !1099, line: 742, baseType: !1174, size: 320)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !1099, line: 395, size: 320, elements: !1175)
!1175 = !{!1176, !1177}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1174, file: !1099, line: 397, baseType: !1112, size: 256)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1174, file: !1099, line: 400, baseType: !1096, size: 64, offset: 256)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1109, file: !1099, line: 743, baseType: !1179, size: 448)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !1099, line: 406, size: 448, elements: !1180)
!1180 = !{!1181, !1182, !1183, !1184}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1179, file: !1099, line: 408, baseType: !1112, size: 256)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1179, file: !1099, line: 412, baseType: !762, size: 64, offset: 256)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1179, file: !1099, line: 420, baseType: !762, size: 64, offset: 320)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1179, file: !1099, line: 423, baseType: !1096, size: 64, offset: 384)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1109, file: !1099, line: 744, baseType: !1186, size: 384)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !1099, line: 429, size: 384, elements: !1187)
!1187 = !{!1188, !1189, !1190}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1186, file: !1099, line: 431, baseType: !1112, size: 256)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1186, file: !1099, line: 434, baseType: !762, size: 64, offset: 256)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1186, file: !1099, line: 437, baseType: !1096, size: 64, offset: 320)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1109, file: !1099, line: 745, baseType: !1192, size: 384)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !1099, line: 443, size: 384, elements: !1193)
!1193 = !{!1194, !1195, !1196}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1192, file: !1099, line: 445, baseType: !1112, size: 256)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1192, file: !1099, line: 449, baseType: !762, size: 64, offset: 256)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1192, file: !1099, line: 453, baseType: !1096, size: 64, offset: 320)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1109, file: !1099, line: 746, baseType: !1198, size: 320)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !1099, line: 459, size: 320, elements: !1199)
!1199 = !{!1200, !1201}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1198, file: !1099, line: 461, baseType: !1112, size: 256)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1198, file: !1099, line: 464, baseType: !762, size: 64, offset: 256)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1109, file: !1099, line: 747, baseType: !1203, size: 768)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !1099, line: 469, size: 768, elements: !1204)
!1204 = !{!1205, !1206, !1207, !1208, !1209}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1203, file: !1099, line: 471, baseType: !1112, size: 256)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1203, file: !1099, line: 474, baseType: !7, size: 32, offset: 256)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1203, file: !1099, line: 475, baseType: !7, size: 32, offset: 288)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1203, file: !1099, line: 478, baseType: !762, size: 64, offset: 320)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1203, file: !1099, line: 481, baseType: !1210, size: 384, offset: 384)
!1210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1211, size: 384, elements: !861)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !190, line: 1917, size: 384, elements: !1212)
!1212 = !{!1213, !1214, !1215}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1211, file: !190, line: 1920, baseType: !1149, size: 256)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1211, file: !190, line: 1921, baseType: !762, size: 64, offset: 256)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1211, file: !190, line: 1922, baseType: !887, size: 32, offset: 320)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1109, file: !1099, line: 748, baseType: !1217, size: 320)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !1099, line: 487, size: 320, elements: !1218)
!1218 = !{!1219, !1220}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1217, file: !1099, line: 490, baseType: !1112, size: 256)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1217, file: !1099, line: 494, baseType: !755, size: 32, offset: 256)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1109, file: !1099, line: 749, baseType: !1222, size: 384)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !1099, line: 500, size: 384, elements: !1223)
!1223 = !{!1224, !1225, !1226}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1222, file: !1099, line: 502, baseType: !1112, size: 256)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1222, file: !1099, line: 506, baseType: !1096, size: 64, offset: 256)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1222, file: !1099, line: 510, baseType: !1096, size: 64, offset: 320)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1109, file: !1099, line: 750, baseType: !1228, size: 320)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !1099, line: 529, size: 320, elements: !1229)
!1229 = !{!1230, !1231}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1228, file: !1099, line: 531, baseType: !1112, size: 256)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1228, file: !1099, line: 540, baseType: !1096, size: 64, offset: 256)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1109, file: !1099, line: 751, baseType: !1233, size: 704)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !1099, line: 546, size: 704, elements: !1234)
!1234 = !{!1235, !1236, !1237, !1238, !1239, !1240, !1241}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1233, file: !1099, line: 549, baseType: !1163, size: 512)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1233, file: !1099, line: 553, baseType: !760, size: 64, offset: 512)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1233, file: !1099, line: 557, baseType: !754, size: 8, offset: 576)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1233, file: !1099, line: 558, baseType: !754, size: 8, offset: 584)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1233, file: !1099, line: 559, baseType: !754, size: 8, offset: 592)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1233, file: !1099, line: 560, baseType: !754, size: 8, offset: 600)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1233, file: !1099, line: 566, baseType: !1161, size: 64, offset: 640)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1109, file: !1099, line: 752, baseType: !1243, size: 384)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !1099, line: 571, size: 384, elements: !1244)
!1244 = !{!1245, !1246}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1243, file: !1099, line: 573, baseType: !1174, size: 320)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1243, file: !1099, line: 577, baseType: !762, size: 64, offset: 320)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1109, file: !1099, line: 753, baseType: !1248, size: 576)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !1099, line: 600, size: 576, elements: !1249)
!1249 = !{!1250, !1251, !1252, !1255, !1264}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1248, file: !1099, line: 602, baseType: !1174, size: 320)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1248, file: !1099, line: 605, baseType: !762, size: 64, offset: 320)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1248, file: !1099, line: 609, baseType: !1253, size: 64, offset: 384)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1254, line: 46, baseType: !816)
!1254 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1248, file: !1099, line: 612, baseType: !1256, size: 64, offset: 448)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !1099, line: 581, size: 320, elements: !1258)
!1258 = !{!1259, !1260, !1261, !1262, !1263}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1257, file: !1099, line: 583, baseType: !189, size: 32)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1257, file: !1099, line: 586, baseType: !762, size: 64, offset: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1257, file: !1099, line: 589, baseType: !762, size: 64, offset: 128)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1257, file: !1099, line: 592, baseType: !762, size: 64, offset: 192)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1257, file: !1099, line: 595, baseType: !762, size: 64, offset: 256)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1248, file: !1099, line: 616, baseType: !1096, size: 64, offset: 512)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1109, file: !1099, line: 754, baseType: !1266, size: 512)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !1099, line: 622, size: 512, elements: !1267)
!1267 = !{!1268, !1269, !1270, !1271}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1266, file: !1099, line: 624, baseType: !1174, size: 320)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1266, file: !1099, line: 628, baseType: !762, size: 64, offset: 320)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1266, file: !1099, line: 632, baseType: !762, size: 64, offset: 384)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1266, file: !1099, line: 636, baseType: !762, size: 64, offset: 448)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1109, file: !1099, line: 755, baseType: !1273, size: 704)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !1099, line: 642, size: 704, elements: !1274)
!1274 = !{!1275, !1276, !1277, !1278}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1273, file: !1099, line: 644, baseType: !1266, size: 512)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1273, file: !1099, line: 648, baseType: !762, size: 64, offset: 512)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1273, file: !1099, line: 652, baseType: !762, size: 64, offset: 576)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1273, file: !1099, line: 653, baseType: !762, size: 64, offset: 640)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1109, file: !1099, line: 756, baseType: !1280, size: 448)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !1099, line: 663, size: 448, elements: !1281)
!1281 = !{!1282, !1283, !1284}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1280, file: !1099, line: 665, baseType: !1174, size: 320)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1280, file: !1099, line: 668, baseType: !762, size: 64, offset: 320)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1280, file: !1099, line: 673, baseType: !762, size: 64, offset: 384)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1109, file: !1099, line: 757, baseType: !1286, size: 384)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !1099, line: 694, size: 384, elements: !1287)
!1287 = !{!1288, !1289}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1286, file: !1099, line: 696, baseType: !1174, size: 320)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1286, file: !1099, line: 699, baseType: !762, size: 64, offset: 320)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1109, file: !1099, line: 758, baseType: !1291, size: 384)
!1291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !1099, line: 681, size: 384, elements: !1292)
!1292 = !{!1293, !1294, !1295}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1291, file: !1099, line: 683, baseType: !1112, size: 256)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1291, file: !1099, line: 686, baseType: !762, size: 64, offset: 256)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1291, file: !1099, line: 689, baseType: !762, size: 64, offset: 320)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1109, file: !1099, line: 759, baseType: !1297, size: 384)
!1297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !1099, line: 707, size: 384, elements: !1298)
!1298 = !{!1299, !1300, !1301}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1297, file: !1099, line: 709, baseType: !1112, size: 256)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1297, file: !1099, line: 712, baseType: !762, size: 64, offset: 256)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1297, file: !1099, line: 712, baseType: !762, size: 64, offset: 320)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1109, file: !1099, line: 760, baseType: !1303, size: 320)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !1099, line: 718, size: 320, elements: !1304)
!1304 = !{!1305, !1306}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1303, file: !1099, line: 720, baseType: !1112, size: 256)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1303, file: !1099, line: 723, baseType: !762, size: 64, offset: 256)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1104, file: !1099, line: 138, baseType: !1103, size: 64, offset: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1104, file: !1099, line: 139, baseType: !1103, size: 64, offset: 128)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1098, file: !1099, line: 146, baseType: !1102, size: 64, offset: 64)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1098, file: !1099, line: 152, baseType: !1096, size: 64, offset: 128)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1093, file: !513, line: 130, baseType: !937, size: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1088, file: !513, line: 134, baseType: !759, size: 64, offset: 192)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1088, file: !513, line: 137, baseType: !762, size: 64, offset: 256)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1088, file: !513, line: 138, baseType: !887, size: 32, offset: 320)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1088, file: !513, line: 142, baseType: !7, size: 32, offset: 352)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1088, file: !513, line: 144, baseType: !755, size: 32, offset: 384)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1088, file: !513, line: 145, baseType: !755, size: 32, offset: 416)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1088, file: !513, line: 146, baseType: !1319, size: 64, offset: 448)
!1319 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !513, line: 119, baseType: !818)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1071, file: !513, line: 220, baseType: !1074, size: 64, offset: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1071, file: !513, line: 223, baseType: !759, size: 64, offset: 128)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1071, file: !513, line: 226, baseType: !1323, size: 64, offset: 192)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64)
!1324 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !513, line: 185, flags: DIFlagFwdDecl)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1071, file: !513, line: 229, baseType: !1326, size: 128, offset: 256)
!1326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1327, size: 128, elements: !1025)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64)
!1328 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !513, line: 229, flags: DIFlagFwdDecl)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1071, file: !513, line: 232, baseType: !1070, size: 64, offset: 384)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1071, file: !513, line: 233, baseType: !1070, size: 64, offset: 448)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1071, file: !513, line: 238, baseType: !1332, size: 64, offset: 512)
!1332 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !513, line: 235, size: 64, elements: !1333)
!1333 = !{!1334, !1340}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1332, file: !513, line: 236, baseType: !1335, size: 64)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64)
!1336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !513, line: 273, size: 128, elements: !1337)
!1337 = !{!1338, !1339}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1336, file: !513, line: 275, baseType: !1096, size: 64)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1336, file: !513, line: 278, baseType: !1096, size: 64, offset: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1332, file: !513, line: 237, baseType: !1341, size: 64)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64)
!1342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !513, line: 259, size: 320, elements: !1343)
!1343 = !{!1344, !1345, !1346, !1347, !1348}
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1342, file: !513, line: 261, baseType: !937, size: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1342, file: !513, line: 262, baseType: !937, size: 64, offset: 64)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1342, file: !513, line: 266, baseType: !937, size: 64, offset: 128)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1342, file: !513, line: 267, baseType: !937, size: 64, offset: 192)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1342, file: !513, line: 270, baseType: !755, size: 32, offset: 256)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1071, file: !513, line: 241, baseType: !1319, size: 64, offset: 576)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1071, file: !513, line: 244, baseType: !755, size: 32, offset: 640)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1071, file: !513, line: 247, baseType: !755, size: 32, offset: 672)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1071, file: !513, line: 250, baseType: !755, size: 32, offset: 704)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1071, file: !513, line: 253, baseType: !755, size: 32, offset: 736)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1071, file: !513, line: 256, baseType: !755, size: 32, offset: 768)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !957, file: !561, line: 179, baseType: !1356, size: 64)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64)
!1357 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !561, line: 150, baseType: !1358)
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !561, line: 142, size: 320, elements: !1359)
!1359 = !{!1360, !1361, !1362, !1363, !1366, !1367}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1358, file: !561, line: 144, baseType: !762, size: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1358, file: !561, line: 145, baseType: !937, size: 64, offset: 64)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1358, file: !561, line: 146, baseType: !937, size: 64, offset: 128)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1358, file: !561, line: 147, baseType: !1364, size: 32, offset: 192)
!1364 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1365, line: 31, baseType: !755)
!1365 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1358, file: !561, line: 148, baseType: !7, size: 32, offset: 224)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1358, file: !561, line: 149, baseType: !754, size: 8, offset: 256)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !957, file: !561, line: 180, baseType: !1369, size: 64)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64)
!1370 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !561, line: 162, baseType: !1371)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !561, line: 159, size: 128, elements: !1372)
!1372 = !{!1373, !1374}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1371, file: !561, line: 160, baseType: !762, size: 64)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1371, file: !561, line: 161, baseType: !818, size: 64, offset: 64)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !957, file: !561, line: 181, baseType: !1376, size: 64)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64)
!1377 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !561, line: 181, flags: DIFlagFwdDecl)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !952, file: !561, line: 317, baseType: !1379, size: 64)
!1379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !818, size: 64, elements: !861)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !952, file: !561, line: 318, baseType: !1381, size: 320)
!1381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !561, line: 188, size: 320, elements: !1382)
!1382 = !{!1383, !1385, !1442}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1381, file: !561, line: 190, baseType: !1384, size: 192)
!1384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 192, elements: !836)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1381, file: !561, line: 193, baseType: !1386, size: 64, offset: 192)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !561, line: 206, size: 320, elements: !1388)
!1388 = !{!1389, !1427, !1428, !1429, !1441}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1387, file: !561, line: 208, baseType: !1390, size: 64)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64)
!1391 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !763, line: 62, baseType: !1392)
!1392 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1393, line: 538, size: 256, elements: !1394)
!1393 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1394 = !{!1395, !1399, !1405, !1418}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1392, file: !1393, line: 539, baseType: !1396, size: 32)
!1396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1393, line: 482, size: 32, elements: !1397)
!1397 = !{!1398}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1396, file: !1393, line: 484, baseType: !7, size: 32)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1392, file: !1393, line: 540, baseType: !1400, size: 192)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1393, line: 488, size: 192, elements: !1401)
!1401 = !{!1402, !1403, !1404}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1400, file: !1393, line: 489, baseType: !1396, size: 32)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1400, file: !1393, line: 492, baseType: !760, size: 64, offset: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1400, file: !1393, line: 496, baseType: !762, size: 64, offset: 128)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1392, file: !1393, line: 541, baseType: !1406, size: 256)
!1406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1393, line: 504, size: 256, elements: !1407)
!1407 = !{!1408, !1409, !1416, !1417}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1406, file: !1393, line: 505, baseType: !1396, size: 32)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1406, file: !1393, line: 509, baseType: !1410, size: 64, offset: 64)
!1410 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1393, line: 501, baseType: !1411)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64)
!1412 = !DISubroutineType(types: !1413)
!1413 = !{null, !1414}
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64)
!1415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1406, file: !1393, line: 510, baseType: !1414, size: 64, offset: 128)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1406, file: !1393, line: 513, baseType: !1390, size: 64, offset: 192)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1392, file: !1393, line: 542, baseType: !1419, size: 128)
!1419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1393, line: 530, size: 128, elements: !1420)
!1420 = !{!1421, !1422}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1419, file: !1393, line: 531, baseType: !1396, size: 32)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1419, file: !1393, line: 534, baseType: !1423, size: 64, offset: 64)
!1423 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1393, line: 525, baseType: !1424)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64)
!1425 = !DISubroutineType(types: !1426)
!1426 = !{!754, !762, !760, !816, !816}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1387, file: !561, line: 211, baseType: !7, size: 32, offset: 64)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1387, file: !561, line: 214, baseType: !818, size: 64, offset: 128)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1387, file: !561, line: 224, baseType: !1430, size: 64, offset: 192)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64)
!1431 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !561, line: 202, baseType: !1432)
!1432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !561, line: 202, size: 128, elements: !1433)
!1433 = !{!1434}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1432, file: !561, line: 202, baseType: !1435, size: 128)
!1435 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !561, line: 200, baseType: !1436)
!1436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !561, line: 200, size: 128, elements: !1437)
!1437 = !{!1438, !1439, !1440}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1436, file: !561, line: 200, baseType: !7, size: 32)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1436, file: !561, line: 200, baseType: !7, size: 32, offset: 32)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1436, file: !561, line: 200, baseType: !970, size: 64, offset: 64)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1387, file: !561, line: 234, baseType: !1430, size: 64, offset: 256)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1381, file: !561, line: 197, baseType: !818, size: 64, offset: 256)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !952, file: !561, line: 319, baseType: !825, size: 256)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !952, file: !561, line: 320, baseType: !844, size: 192)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !765, file: !190, line: 3384, baseType: !1446, size: 1472)
!1446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !190, line: 3114, size: 1472, elements: !1447)
!1447 = !{!1448, !1469, !1470, !1471, !1472}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1446, file: !190, line: 3115, baseType: !1449, size: 1216)
!1449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !190, line: 2984, size: 1216, elements: !1450)
!1450 = !{!1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1449, file: !190, line: 2985, baseType: !933, size: 960)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1449, file: !190, line: 2986, baseType: !762, size: 64, offset: 960)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1449, file: !190, line: 2987, baseType: !762, size: 64, offset: 1024)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1449, file: !190, line: 2988, baseType: !762, size: 64, offset: 1088)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1449, file: !190, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1449, file: !190, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1449, file: !190, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1449, file: !190, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1449, file: !190, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1449, file: !190, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1449, file: !190, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1449, file: !190, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1449, file: !190, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1449, file: !190, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1449, file: !190, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1449, file: !190, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1449, file: !190, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1449, file: !190, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1446, file: !190, line: 3117, baseType: !762, size: 64, offset: 1216)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1446, file: !190, line: 3119, baseType: !762, size: 64, offset: 1280)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1446, file: !190, line: 3121, baseType: !762, size: 64, offset: 1344)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1446, file: !190, line: 3123, baseType: !762, size: 64, offset: 1408)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !765, file: !190, line: 3385, baseType: !1474, size: 1088)
!1474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !190, line: 2874, size: 1088, elements: !1475)
!1475 = !{!1476, !1477, !1478}
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1474, file: !190, line: 2875, baseType: !933, size: 960)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1474, file: !190, line: 2876, baseType: !937, size: 64, offset: 960)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1474, file: !190, line: 2877, baseType: !1479, size: 64, offset: 1024)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64)
!1480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1481, line: 172, size: 128, elements: !1482)
!1481 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1482 = !{!1483, !1484, !1485, !1486, !1487, !1488, !1489}
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1480, file: !1481, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1480, file: !1481, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1480, file: !1481, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1480, file: !1481, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1480, file: !1481, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1480, file: !1481, line: 195, baseType: !7, size: 32, offset: 32)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1480, file: !1481, line: 199, baseType: !762, size: 64, offset: 64)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !765, file: !190, line: 3386, baseType: !1449, size: 1216)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !765, file: !190, line: 3387, baseType: !1492, size: 1280)
!1492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !190, line: 3093, size: 1280, elements: !1493)
!1493 = !{!1494, !1495}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1492, file: !190, line: 3094, baseType: !1449, size: 1216)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1492, file: !190, line: 3095, baseType: !1479, size: 64, offset: 1216)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !765, file: !190, line: 3388, baseType: !1497, size: 1216)
!1497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !190, line: 2824, size: 1216, elements: !1498)
!1498 = !{!1499, !1500, !1501, !1502, !1503, !1504}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1497, file: !190, line: 2825, baseType: !895, size: 896)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1497, file: !190, line: 2827, baseType: !762, size: 64, offset: 896)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1497, file: !190, line: 2828, baseType: !762, size: 64, offset: 960)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1497, file: !190, line: 2829, baseType: !762, size: 64, offset: 1024)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1497, file: !190, line: 2830, baseType: !762, size: 64, offset: 1088)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1497, file: !190, line: 2831, baseType: !762, size: 64, offset: 1152)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !765, file: !190, line: 3389, baseType: !1506, size: 1024)
!1506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !190, line: 2850, size: 1024, elements: !1507)
!1507 = !{!1508, !1509, !1510}
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1506, file: !190, line: 2851, baseType: !933, size: 960)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1506, file: !190, line: 2852, baseType: !755, size: 32, offset: 960)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1506, file: !190, line: 2853, baseType: !755, size: 32, offset: 992)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !765, file: !190, line: 3390, baseType: !1512, size: 1024)
!1512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !190, line: 2857, size: 1024, elements: !1513)
!1513 = !{!1514, !1515}
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1512, file: !190, line: 2858, baseType: !933, size: 960)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1512, file: !190, line: 2859, baseType: !1479, size: 64, offset: 960)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !765, file: !190, line: 3391, baseType: !1517, size: 960)
!1517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !190, line: 2862, size: 960, elements: !1518)
!1518 = !{!1519}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1517, file: !190, line: 2863, baseType: !933, size: 960)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !765, file: !190, line: 3392, baseType: !1521, size: 1472)
!1521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !190, line: 3304, size: 1472, elements: !1522)
!1522 = !{!1523}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1521, file: !190, line: 3305, baseType: !1446, size: 1472)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !765, file: !190, line: 3393, baseType: !1525, size: 1792)
!1525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !190, line: 3248, size: 1792, elements: !1526)
!1526 = !{!1527, !1528, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759}
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1525, file: !190, line: 3249, baseType: !1446, size: 1472)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1525, file: !190, line: 3251, baseType: !1529, size: 64, offset: 1472)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64)
!1530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1531, line: 463, size: 1152, elements: !1532)
!1531 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1532 = !{!1533, !1536, !1567, !1568, !1680, !1683, !1684, !1685, !1686, !1687, !1688, !1712, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738}
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1530, file: !1531, line: 464, baseType: !1534, size: 64)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64)
!1535 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1531, line: 464, flags: DIFlagFwdDecl)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1530, file: !1531, line: 467, baseType: !1537, size: 64, offset: 64)
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1538, size: 64)
!1538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !513, line: 374, size: 640, elements: !1539)
