; ModuleID = 'varasm.bc'
source_filename = "varasm.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }

!582 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!583 = !{!584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601}
!584 = !DIEnumerator(name: "SECCAT_TEXT", value: 0, isUnsigned: true)
!585 = !DIEnumerator(name: "SECCAT_RODATA", value: 1, isUnsigned: true)
!586 = !DIEnumerator(name: "SECCAT_RODATA_MERGE_STR", value: 2, isUnsigned: true)
!587 = !DIEnumerator(name: "SECCAT_RODATA_MERGE_STR_INIT", value: 3, isUnsigned: true)
!588 = !DIEnumerator(name: "SECCAT_RODATA_MERGE_CONST", value: 4, isUnsigned: true)
!589 = !DIEnumerator(name: "SECCAT_SRODATA", value: 5, isUnsigned: true)
!590 = !DIEnumerator(name: "SECCAT_DATA", value: 6, isUnsigned: true)
!591 = !DIEnumerator(name: "SECCAT_DATA_REL", value: 7, isUnsigned: true)
!592 = !DIEnumerator(name: "SECCAT_DATA_REL_LOCAL", value: 8, isUnsigned: true)
!593 = !DIEnumerator(name: "SECCAT_DATA_REL_RO", value: 9, isUnsigned: true)
!594 = !DIEnumerator(name: "SECCAT_DATA_REL_RO_LOCAL", value: 10, isUnsigned: true)
!595 = !DIEnumerator(name: "SECCAT_SDATA", value: 11, isUnsigned: true)
!596 = !DIEnumerator(name: "SECCAT_TDATA", value: 12, isUnsigned: true)
!597 = !DIEnumerator(name: "SECCAT_BSS", value: 13, isUnsigned: true)
!598 = !DIEnumerator(name: "SECCAT_SBSS", value: 14, isUnsigned: true)
!599 = !DIEnumerator(name: "SECCAT_TBSS", value: 15, isUnsigned: true)
!600 = !DIEnumerator(name: "SECCAT_EMUTLS_VAR", value: 16, isUnsigned: true)
!601 = !DIEnumerator(name: "SECCAT_EMUTLS_TMPL", value: 17, isUnsigned: true)
!602 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !603, line: 56, baseType: !7, size: 32, elements: !604)
!603 = !DIFile(filename: "./target.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!604 = !{!605, !606, !607, !608, !609}
!605 = !DIEnumerator(name: "SWITCH_TYPE_PASSED", value: 0, isUnsigned: true)
!606 = !DIEnumerator(name: "SWITCH_TYPE_ENABLED", value: 1, isUnsigned: true)
!607 = !DIEnumerator(name: "SWITCH_TYPE_DESCRIPTIVE", value: 2, isUnsigned: true)
!608 = !DIEnumerator(name: "SWITCH_TYPE_LINE_START", value: 3, isUnsigned: true)
!609 = !DIEnumerator(name: "SWITCH_TYPE_LINE_END", value: 4, isUnsigned: true)
!610 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "expand_modifier", file: !611, line: 52, baseType: !7, size: 32, elements: !612)
!611 = !DIFile(filename: "./expr.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!612 = !{!613, !614, !615, !616, !617, !618, !619}
!613 = !DIEnumerator(name: "EXPAND_NORMAL", value: 0, isUnsigned: true)
!614 = !DIEnumerator(name: "EXPAND_STACK_PARM", value: 1, isUnsigned: true)
!615 = !DIEnumerator(name: "EXPAND_SUM", value: 2, isUnsigned: true)
!616 = !DIEnumerator(name: "EXPAND_CONST_ADDRESS", value: 3, isUnsigned: true)
!617 = !DIEnumerator(name: "EXPAND_INITIALIZER", value: 4, isUnsigned: true)
!618 = !DIEnumerator(name: "EXPAND_WRITE", value: 5, isUnsigned: true)
!619 = !DIEnumerator(name: "EXPAND_MEMORY", value: 6, isUnsigned: true)
!620 = !{!621, !622, !623, !624, !627, !628, !630, !183, !632, !1718, !639, !1044, !1719, !625, !1720, !811, !7, !5, !377, !754, !694, !543, !1721, !1017, !692, !571, !1727, !1220, !1241, !1434, !1494, !1734, !1026, !1736, !1738, !1740, !1040, !640, !1741, !1743, !1760, !1762, !1764, !1766, !1083}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!623 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !626)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !631, line: 44, baseType: !7)
!631 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_map", file: !151, line: 5278, size: 192, elements: !634)
!634 = !{!635, !1716, !1717}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !633, file: !151, line: 5279, baseType: !636, size: 64)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_map_base", file: !151, line: 5267, size: 64, elements: !637)
!637 = !{!638}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !636, file: !151, line: 5268, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !572, line: 56, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !151, line: 3371, size: 1792, elements: !642)
!642 = !{!643, !676, !682, !695, !714, !725, !730, !739, !745, !758, !768, !806, !1098, !1126, !1134, !1135, !1140, !1149, !1155, !1160, !1164, !1168, !1342, !1389, !1395, !1402, !1409, !1435, !1460, !1477, !1489, !1511, !1526, !1698}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !641, file: !151, line: 3372, baseType: !644, size: 64)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !151, line: 360, size: 64, elements: !645)
!645 = !{!646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !644, file: !151, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !644, file: !151, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !644, file: !151, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !644, file: !151, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !644, file: !151, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !644, file: !151, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !644, file: !151, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !644, file: !151, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !644, file: !151, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !644, file: !151, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !644, file: !151, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !644, file: !151, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !644, file: !151, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !644, file: !151, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !644, file: !151, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !644, file: !151, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !644, file: !151, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !644, file: !151, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !644, file: !151, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !644, file: !151, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !644, file: !151, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !644, file: !151, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !644, file: !151, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !644, file: !151, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !644, file: !151, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !644, file: !151, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !644, file: !151, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !644, file: !151, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !644, file: !151, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !644, file: !151, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !641, file: !151, line: 3373, baseType: !677, size: 192)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !151, line: 402, size: 192, elements: !678)
!678 = !{!679, !680, !681}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !677, file: !151, line: 403, baseType: !644, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !677, file: !151, line: 404, baseType: !639, size: 64, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !677, file: !151, line: 405, baseType: !639, size: 64, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !641, file: !151, line: 3374, baseType: !683, size: 320)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !151, line: 1384, size: 320, elements: !684)
!684 = !{!685, !686}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !683, file: !151, line: 1385, baseType: !677, size: 192)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !683, file: !151, line: 1386, baseType: !687, size: 128, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !688, line: 58, baseType: !689)
!688 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !688, line: 54, size: 128, elements: !690)
!690 = !{!691, !693}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !689, file: !688, line: 56, baseType: !692, size: 64)
!692 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !689, file: !688, line: 57, baseType: !694, size: 64, offset: 64)
!694 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !641, file: !151, line: 3375, baseType: !696, size: 256)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !151, line: 1397, size: 256, elements: !697)
!697 = !{!698, !699}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !696, file: !151, line: 1398, baseType: !677, size: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !696, file: !151, line: 1399, baseType: !700, size: 64, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !702, line: 52, size: 256, elements: !703)
!702 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!703 = !{!704, !705, !706, !707, !708, !709, !710}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !701, file: !702, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !701, file: !702, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !701, file: !702, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !701, file: !702, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !701, file: !702, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !701, file: !702, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !701, file: !702, line: 62, baseType: !711, size: 192, offset: 64)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !692, size: 192, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 3)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !641, file: !151, line: 3376, baseType: !715, size: 256)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !151, line: 1408, size: 256, elements: !716)
!716 = !{!717, !718}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !715, file: !151, line: 1409, baseType: !677, size: 192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !715, file: !151, line: 1410, baseType: !719, size: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !721, line: 27, size: 192, elements: !722)
!721 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!722 = !{!723, !724}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !720, file: !721, line: 29, baseType: !687, size: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !720, file: !721, line: 30, baseType: !5, size: 32, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !641, file: !151, line: 3377, baseType: !726, size: 256)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !151, line: 1437, size: 256, elements: !727)
!727 = !{!728, !729}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !726, file: !151, line: 1438, baseType: !677, size: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !726, file: !151, line: 1439, baseType: !639, size: 64, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !641, file: !151, line: 3378, baseType: !731, size: 256)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !151, line: 1418, size: 256, elements: !732)
!732 = !{!733, !734, !735}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !731, file: !151, line: 1419, baseType: !677, size: 192)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !731, file: !151, line: 1420, baseType: !623, size: 32, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !731, file: !151, line: 1421, baseType: !736, size: 8, offset: 224)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 8, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 1)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !641, file: !151, line: 3379, baseType: !740, size: 320)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !151, line: 1428, size: 320, elements: !741)
!741 = !{!742, !743, !744}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !740, file: !151, line: 1429, baseType: !677, size: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !740, file: !151, line: 1430, baseType: !639, size: 64, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !740, file: !151, line: 1431, baseType: !639, size: 64, offset: 256)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !641, file: !151, line: 3380, baseType: !746, size: 320)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !151, line: 1460, size: 320, elements: !747)
!747 = !{!748, !749}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !746, file: !151, line: 1461, baseType: !677, size: 192)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !746, file: !151, line: 1462, baseType: !750, size: 128, offset: 192)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !751, line: 31, size: 128, elements: !752)
!751 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!752 = !{!753, !756, !757}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !750, file: !751, line: 32, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !622)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !750, file: !751, line: 33, baseType: !7, size: 32, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !750, file: !751, line: 34, baseType: !7, size: 32, offset: 96)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !641, file: !151, line: 3381, baseType: !759, size: 384)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !151, line: 2507, size: 384, elements: !760)
!760 = !{!761, !762, !765, !766, !767}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !759, file: !151, line: 2508, baseType: !677, size: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !759, file: !151, line: 2509, baseType: !763, size: 32, offset: 192)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !764, line: 58, baseType: !630)
!764 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!765 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !759, file: !151, line: 2510, baseType: !7, size: 32, offset: 224)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !759, file: !151, line: 2511, baseType: !639, size: 64, offset: 256)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !759, file: !151, line: 2512, baseType: !639, size: 64, offset: 320)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !641, file: !151, line: 3382, baseType: !769, size: 896)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !151, line: 2652, size: 896, elements: !770)
!770 = !{!771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !769, file: !151, line: 2653, baseType: !759, size: 384)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !769, file: !151, line: 2654, baseType: !639, size: 64, offset: 384)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !769, file: !151, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !769, file: !151, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !769, file: !151, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !769, file: !151, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !769, file: !151, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !769, file: !151, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !769, file: !151, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !769, file: !151, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !769, file: !151, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !769, file: !151, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !769, file: !151, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !769, file: !151, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !769, file: !151, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !769, file: !151, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !769, file: !151, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !769, file: !151, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !769, file: !151, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !769, file: !151, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !769, file: !151, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !769, file: !151, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !769, file: !151, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !769, file: !151, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !769, file: !151, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !769, file: !151, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !769, file: !151, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !769, file: !151, line: 2703, baseType: !7, size: 32, offset: 512)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !769, file: !151, line: 2705, baseType: !639, size: 64, offset: 576)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !769, file: !151, line: 2706, baseType: !639, size: 64, offset: 640)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !769, file: !151, line: 2707, baseType: !639, size: 64, offset: 704)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !769, file: !151, line: 2708, baseType: !639, size: 64, offset: 768)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !769, file: !151, line: 2711, baseType: !804, size: 64, offset: 832)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !151, line: 2711, flags: DIFlagFwdDecl)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !641, file: !151, line: 3383, baseType: !807, size: 960)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !151, line: 2756, size: 960, elements: !808)
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !807, file: !151, line: 2757, baseType: !769, size: 896)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !807, file: !151, line: 2758, baseType: !811, size: 64, offset: 896)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !572, line: 50, baseType: !812)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !378, line: 240, size: 384, elements: !814)
!814 = !{!815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !813, file: !378, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !813, file: !378, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !813, file: !378, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !813, file: !378, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !813, file: !378, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !813, file: !378, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !813, file: !378, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !813, file: !378, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !813, file: !378, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !813, file: !378, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !813, file: !378, line: 321, baseType: !826, size: 320, offset: 64)
!826 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !378, line: 315, size: 320, elements: !827)
!827 = !{!828, !1032, !1034, !1096, !1097}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !826, file: !378, line: 316, baseType: !829, size: 64)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !830, size: 64, elements: !737)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !378, line: 183, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !378, line: 166, size: 64, elements: !832)
!832 = !{!833, !834, !835, !836, !837, !845, !846, !858, !861, !921, !922, !996, !1009, !1016}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !831, file: !378, line: 168, baseType: !623, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !831, file: !378, line: 169, baseType: !7, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !831, file: !378, line: 170, baseType: !628, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !831, file: !378, line: 171, baseType: !811, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !831, file: !378, line: 172, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !572, line: 53, baseType: !839)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !378, line: 359, size: 128, elements: !841)
!841 = !{!842, !843}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !840, file: !378, line: 360, baseType: !623, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !840, file: !378, line: 361, baseType: !844, size: 64, offset: 64)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !811, size: 64, elements: !737)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !831, file: !378, line: 173, baseType: !5, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !831, file: !378, line: 174, baseType: !847, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !378, line: 133, baseType: !848)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 115, size: 32, elements: !849)
!849 = !{!850, !851, !852, !853, !854, !855, !856, !857}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !848, file: !378, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !848, file: !378, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !848, file: !378, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !848, file: !378, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !848, file: !378, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !848, file: !378, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !848, file: !378, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !848, file: !378, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !831, file: !378, line: 175, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !378, line: 175, flags: DIFlagFwdDecl)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !831, file: !378, line: 176, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !864, line: 75, size: 256, elements: !865)
!864 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!865 = !{!866, !880, !881, !882}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !863, file: !864, line: 76, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !864, line: 68, baseType: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !864, line: 63, size: 320, elements: !870)
!870 = !{!871, !873, !874, !875}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !869, file: !864, line: 64, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !869, file: !864, line: 65, baseType: !872, size: 64, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !869, file: !864, line: 66, baseType: !7, size: 32, offset: 128)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !869, file: !864, line: 67, baseType: !876, size: 128, offset: 192)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !877, size: 128, elements: !878)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !864, line: 29, baseType: !692)
!878 = !{!879}
!879 = !DISubrange(count: 2)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !863, file: !864, line: 77, baseType: !867, size: 64, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !863, file: !864, line: 78, baseType: !7, size: 32, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !863, file: !864, line: 79, baseType: !883, size: 64, offset: 192)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !864, line: 49, baseType: !885)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !864, line: 45, size: 832, elements: !886)
!886 = !{!887, !888, !889}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !885, file: !864, line: 46, baseType: !872, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !885, file: !864, line: 47, baseType: !862, size: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !885, file: !864, line: 48, baseType: !890, size: 704, offset: 128)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !891, line: 164, size: 704, elements: !892)
!891 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!892 = !{!893, !894, !904, !905, !906, !907, !908, !909, !913, !917, !918, !919, !920}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !890, file: !891, line: 166, baseType: !694, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !890, file: !891, line: 167, baseType: !895, size: 64, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !891, line: 157, size: 192, elements: !897)
!897 = !{!898, !899, !900}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !896, file: !891, line: 159, baseType: !625, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !896, file: !891, line: 160, baseType: !895, size: 64, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !896, file: !891, line: 161, baseType: !901, size: 32, offset: 128)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 32, elements: !902)
!902 = !{!903}
!903 = !DISubrange(count: 4)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !890, file: !891, line: 168, baseType: !625, size: 64, offset: 128)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !890, file: !891, line: 169, baseType: !625, size: 64, offset: 192)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !890, file: !891, line: 170, baseType: !625, size: 64, offset: 256)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !890, file: !891, line: 171, baseType: !694, size: 64, offset: 320)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !890, file: !891, line: 172, baseType: !623, size: 32, offset: 384)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !890, file: !891, line: 176, baseType: !910, size: 64, offset: 448)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!895, !627, !694}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !890, file: !891, line: 177, baseType: !914, size: 64, offset: 512)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{null, !627, !895}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !890, file: !891, line: 178, baseType: !627, size: 64, offset: 576)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !890, file: !891, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !890, file: !891, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !890, file: !891, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !831, file: !378, line: 177, baseType: !639, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !831, file: !378, line: 178, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !925)
!925 = !{!926, !961, !962, !963, !966, !970, !971, !972, !990, !991, !992, !993, !994, !995}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !924, file: !135, line: 219, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !930)
!930 = !{!931}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !929, file: !135, line: 151, baseType: !932, size: 128)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !933, file: !135, line: 150, baseType: !7, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !933, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !933, file: !135, line: 150, baseType: !938, size: 64, offset: 64)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 64, elements: !737)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !572, line: 108, baseType: !940)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !942)
!942 = !{!943, !944, !945, !953, !954, !955, !956, !957, !958, !959}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !941, file: !135, line: 124, baseType: !923, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !941, file: !135, line: 125, baseType: !923, size: 64, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !941, file: !135, line: 131, baseType: !946, size: 64, offset: 128)
!946 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !947)
!947 = !{!948, !952}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !946, file: !135, line: 129, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !572, line: 66, baseType: !950)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !572, line: 65, flags: DIFlagFwdDecl)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !946, file: !135, line: 130, baseType: !811, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !941, file: !135, line: 134, baseType: !627, size: 64, offset: 192)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !941, file: !135, line: 137, baseType: !639, size: 64, offset: 256)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !941, file: !135, line: 138, baseType: !763, size: 32, offset: 320)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !941, file: !135, line: 142, baseType: !7, size: 32, offset: 352)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !941, file: !135, line: 144, baseType: !623, size: 32, offset: 384)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !941, file: !135, line: 145, baseType: !623, size: 32, offset: 416)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !941, file: !135, line: 146, baseType: !960, size: 64, offset: 448)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !135, line: 119, baseType: !694)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !924, file: !135, line: 220, baseType: !927, size: 64, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !924, file: !135, line: 223, baseType: !627, size: 64, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !924, file: !135, line: 226, baseType: !964, size: 64, offset: 192)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !135, line: 185, flags: DIFlagFwdDecl)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !924, file: !135, line: 229, baseType: !967, size: 128, offset: 256)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 128, elements: !878)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !135, line: 229, flags: DIFlagFwdDecl)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !924, file: !135, line: 232, baseType: !923, size: 64, offset: 384)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !924, file: !135, line: 233, baseType: !923, size: 64, offset: 448)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !924, file: !135, line: 238, baseType: !973, size: 64, offset: 512)
!973 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !135, line: 235, size: 64, elements: !974)
!974 = !{!975, !981}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !973, file: !135, line: 236, baseType: !976, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !135, line: 273, size: 128, elements: !978)
!978 = !{!979, !980}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !977, file: !135, line: 275, baseType: !949, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !977, file: !135, line: 278, baseType: !949, size: 64, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !973, file: !135, line: 237, baseType: !982, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !135, line: 259, size: 320, elements: !984)
!984 = !{!985, !986, !987, !988, !989}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !983, file: !135, line: 261, baseType: !811, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !983, file: !135, line: 262, baseType: !811, size: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !983, file: !135, line: 266, baseType: !811, size: 64, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !983, file: !135, line: 267, baseType: !811, size: 64, offset: 192)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !983, file: !135, line: 270, baseType: !623, size: 32, offset: 256)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !924, file: !135, line: 241, baseType: !960, size: 64, offset: 576)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !924, file: !135, line: 244, baseType: !623, size: 32, offset: 640)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !924, file: !135, line: 247, baseType: !623, size: 32, offset: 672)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !924, file: !135, line: 250, baseType: !623, size: 32, offset: 704)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !924, file: !135, line: 253, baseType: !623, size: 32, offset: 736)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !924, file: !135, line: 256, baseType: !623, size: 32, offset: 768)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !831, file: !378, line: 179, baseType: !997, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !378, line: 150, baseType: !999)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !378, line: 142, size: 320, elements: !1000)
!1000 = !{!1001, !1002, !1003, !1004, !1007, !1008}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !999, file: !378, line: 144, baseType: !639, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !999, file: !378, line: 145, baseType: !811, size: 64, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !999, file: !378, line: 146, baseType: !811, size: 64, offset: 128)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !999, file: !378, line: 147, baseType: !1005, size: 32, offset: 192)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1006, line: 31, baseType: !623)
!1006 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !999, file: !378, line: 148, baseType: !7, size: 32, offset: 224)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !999, file: !378, line: 149, baseType: !622, size: 8, offset: 256)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !831, file: !378, line: 180, baseType: !1010, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !378, line: 162, baseType: !1012)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !378, line: 159, size: 128, elements: !1013)
!1013 = !{!1014, !1015}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1012, file: !378, line: 160, baseType: !639, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1012, file: !378, line: 161, baseType: !694, size: 64, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !831, file: !378, line: 181, baseType: !1017, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !3, line: 3459, size: 512, elements: !1019)
!1019 = !{!1020, !1021, !1022, !1023, !1024, !1025, !1028, !1029, !1030, !1031}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1018, file: !3, line: 3460, baseType: !1017, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1018, file: !3, line: 3461, baseType: !811, size: 64, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "sym", scope: !1018, file: !3, line: 3462, baseType: !811, size: 64, offset: 128)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "constant", scope: !1018, file: !3, line: 3463, baseType: !811, size: 64, offset: 192)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1018, file: !3, line: 3464, baseType: !694, size: 64, offset: 256)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !1018, file: !3, line: 3465, baseType: !1026, size: 32, offset: 320)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1027, line: 47, baseType: !7)
!1027 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1018, file: !3, line: 3466, baseType: !5, size: 32, offset: 352)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1018, file: !3, line: 3467, baseType: !7, size: 32, offset: 384)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "labelno", scope: !1018, file: !3, line: 3468, baseType: !623, size: 32, offset: 416)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !1018, file: !3, line: 3469, baseType: !623, size: 32, offset: 448)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !826, file: !378, line: 317, baseType: !1033, size: 64)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !694, size: 64, elements: !737)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !826, file: !378, line: 318, baseType: !1035, size: 320)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !378, line: 188, size: 320, elements: !1036)
!1036 = !{!1037, !1039, !1095}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1035, file: !378, line: 190, baseType: !1038, size: 192)
!1038 = !DICompositeType(tag: DW_TAG_array_type, baseType: !830, size: 192, elements: !712)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1035, file: !378, line: 193, baseType: !1040, size: 64, offset: 192)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !378, line: 206, size: 320, elements: !1042)
!1042 = !{!1043, !1080, !1081, !1082, !1094}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1041, file: !378, line: 208, baseType: !1044, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !572, line: 62, baseType: !1046)
!1046 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !582, line: 538, size: 256, elements: !1047)
!1047 = !{!1048, !1052, !1058, !1071}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1046, file: !582, line: 539, baseType: !1049, size: 32)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !582, line: 482, size: 32, elements: !1050)
!1050 = !{!1051}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1049, file: !582, line: 484, baseType: !7, size: 32)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1046, file: !582, line: 540, baseType: !1053, size: 192)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !582, line: 488, size: 192, elements: !1054)
!1054 = !{!1055, !1056, !1057}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1053, file: !582, line: 489, baseType: !1049, size: 32)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1053, file: !582, line: 492, baseType: !628, size: 64, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1053, file: !582, line: 496, baseType: !639, size: 64, offset: 128)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1046, file: !582, line: 541, baseType: !1059, size: 256)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !582, line: 504, size: 256, elements: !1060)
!1060 = !{!1061, !1062, !1069, !1070}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1059, file: !582, line: 505, baseType: !1049, size: 32)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1059, file: !582, line: 509, baseType: !1063, size: 64, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !582, line: 501, baseType: !1064)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{null, !1067}
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1059, file: !582, line: 510, baseType: !1067, size: 64, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1059, file: !582, line: 513, baseType: !1044, size: 64, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1046, file: !582, line: 542, baseType: !1072, size: 128)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !582, line: 530, size: 128, elements: !1073)
!1073 = !{!1074, !1075}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1072, file: !582, line: 531, baseType: !1049, size: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1072, file: !582, line: 534, baseType: !1076, size: 64, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !582, line: 525, baseType: !1077)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!622, !639, !628, !692, !692}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1041, file: !378, line: 211, baseType: !7, size: 32, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1041, file: !378, line: 214, baseType: !694, size: 64, offset: 128)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1041, file: !378, line: 224, baseType: !1083, size: 64, offset: 192)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !378, line: 202, baseType: !1085)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !378, line: 202, size: 128, elements: !1086)
!1086 = !{!1087}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1085, file: !378, line: 202, baseType: !1088, size: 128)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !378, line: 200, baseType: !1089)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !378, line: 200, size: 128, elements: !1090)
!1090 = !{!1091, !1092, !1093}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1089, file: !378, line: 200, baseType: !7, size: 32)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1089, file: !378, line: 200, baseType: !7, size: 32, offset: 32)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1089, file: !378, line: 200, baseType: !844, size: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1041, file: !378, line: 234, baseType: !1083, size: 64, offset: 256)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1035, file: !378, line: 197, baseType: !694, size: 64, offset: 256)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !826, file: !378, line: 319, baseType: !701, size: 256)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !826, file: !378, line: 320, baseType: !720, size: 192)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !641, file: !151, line: 3384, baseType: !1099, size: 1472)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !151, line: 3114, size: 1472, elements: !1100)
!1100 = !{!1101, !1122, !1123, !1124, !1125}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1099, file: !151, line: 3115, baseType: !1102, size: 1216)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !151, line: 2984, size: 1216, elements: !1103)
!1103 = !{!1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1102, file: !151, line: 2985, baseType: !807, size: 960)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1102, file: !151, line: 2986, baseType: !639, size: 64, offset: 960)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1102, file: !151, line: 2987, baseType: !639, size: 64, offset: 1024)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1102, file: !151, line: 2988, baseType: !639, size: 64, offset: 1088)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1102, file: !151, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1102, file: !151, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1102, file: !151, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1102, file: !151, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1102, file: !151, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1102, file: !151, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1102, file: !151, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1102, file: !151, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1102, file: !151, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1102, file: !151, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1102, file: !151, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1102, file: !151, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1102, file: !151, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1102, file: !151, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1099, file: !151, line: 3117, baseType: !639, size: 64, offset: 1216)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1099, file: !151, line: 3119, baseType: !639, size: 64, offset: 1280)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1099, file: !151, line: 3121, baseType: !639, size: 64, offset: 1344)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1099, file: !151, line: 3123, baseType: !639, size: 64, offset: 1408)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !641, file: !151, line: 3385, baseType: !1127, size: 1088)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !151, line: 2874, size: 1088, elements: !1128)
!1128 = !{!1129, !1130, !1131}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1127, file: !151, line: 2875, baseType: !807, size: 960)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1127, file: !151, line: 2876, baseType: !811, size: 64, offset: 960)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1127, file: !151, line: 2877, baseType: !1132, size: 64, offset: 1024)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !151, line: 2856, flags: DIFlagFwdDecl)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !641, file: !151, line: 3386, baseType: !1102, size: 1216)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !641, file: !151, line: 3387, baseType: !1136, size: 1280)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !151, line: 3093, size: 1280, elements: !1137)
!1137 = !{!1138, !1139}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1136, file: !151, line: 3094, baseType: !1102, size: 1216)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1136, file: !151, line: 3095, baseType: !1132, size: 64, offset: 1216)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !641, file: !151, line: 3388, baseType: !1141, size: 1216)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !151, line: 2824, size: 1216, elements: !1142)
!1142 = !{!1143, !1144, !1145, !1146, !1147, !1148}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1141, file: !151, line: 2825, baseType: !769, size: 896)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1141, file: !151, line: 2827, baseType: !639, size: 64, offset: 896)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1141, file: !151, line: 2828, baseType: !639, size: 64, offset: 960)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1141, file: !151, line: 2829, baseType: !639, size: 64, offset: 1024)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1141, file: !151, line: 2830, baseType: !639, size: 64, offset: 1088)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1141, file: !151, line: 2831, baseType: !639, size: 64, offset: 1152)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !641, file: !151, line: 3389, baseType: !1150, size: 1024)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !151, line: 2850, size: 1024, elements: !1151)
!1151 = !{!1152, !1153, !1154}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1150, file: !151, line: 2851, baseType: !807, size: 960)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1150, file: !151, line: 2852, baseType: !623, size: 32, offset: 960)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1150, file: !151, line: 2853, baseType: !623, size: 32, offset: 992)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !641, file: !151, line: 3390, baseType: !1156, size: 1024)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !151, line: 2857, size: 1024, elements: !1157)
!1157 = !{!1158, !1159}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1156, file: !151, line: 2858, baseType: !807, size: 960)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1156, file: !151, line: 2859, baseType: !1132, size: 64, offset: 960)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !641, file: !151, line: 3391, baseType: !1161, size: 960)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !151, line: 2862, size: 960, elements: !1162)
!1162 = !{!1163}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1161, file: !151, line: 2863, baseType: !807, size: 960)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !641, file: !151, line: 3392, baseType: !1165, size: 1472)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !151, line: 3304, size: 1472, elements: !1166)
!1166 = !{!1167}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1165, file: !151, line: 3305, baseType: !1099, size: 1472)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !641, file: !151, line: 3393, baseType: !1169, size: 1792)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !151, line: 3248, size: 1792, elements: !1170)
!1170 = !{!1171, !1172, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1169, file: !151, line: 3249, baseType: !1099, size: 1472)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1169, file: !151, line: 3251, baseType: !1173, size: 64, offset: 1472)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1175, line: 463, size: 1152, elements: !1176)
!1175 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1176 = !{!1177, !1180, !1211, !1212, !1215, !1218, !1266, !1267, !1268, !1269, !1270, !1294, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1174, file: !1175, line: 464, baseType: !1178, size: 64)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1175, line: 464, flags: DIFlagFwdDecl)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1174, file: !1175, line: 467, baseType: !1181, size: 64, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !1183)
!1183 = !{!1184, !1186, !1187, !1200, !1201, !1202, !1203, !1204, !1205, !1207, !1209, !1210}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1182, file: !135, line: 377, baseType: !1185, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !572, line: 111, baseType: !923)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1182, file: !135, line: 378, baseType: !1185, size: 64, offset: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1182, file: !135, line: 381, baseType: !1188, size: 64, offset: 128)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !1190)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !1191)
!1191 = !{!1192}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1190, file: !135, line: 282, baseType: !1193, size: 128)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !1194)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !1195)
!1195 = !{!1196, !1197, !1198}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1194, file: !135, line: 281, baseType: !7, size: 32)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1194, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1194, file: !135, line: 281, baseType: !1199, size: 64, offset: 64)
!1199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1185, size: 64, elements: !737)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1182, file: !135, line: 384, baseType: !623, size: 32, offset: 192)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1182, file: !135, line: 387, baseType: !623, size: 32, offset: 224)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1182, file: !135, line: 390, baseType: !623, size: 32, offset: 256)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1182, file: !135, line: 394, baseType: !1188, size: 64, offset: 320)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1182, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1182, file: !135, line: 399, baseType: !1206, size: 64, offset: 416)
!1206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !878)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1182, file: !135, line: 402, baseType: !1208, size: 64, offset: 480)
!1208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !878)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1182, file: !135, line: 406, baseType: !623, size: 32, offset: 544)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1182, file: !135, line: 409, baseType: !623, size: 32, offset: 576)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1174, file: !1175, line: 470, baseType: !950, size: 64, offset: 128)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1174, file: !1175, line: 473, baseType: !1213, size: 64, offset: 192)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1175, line: 166, flags: DIFlagFwdDecl)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1174, file: !1175, line: 476, baseType: !1216, size: 64, offset: 256)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1175, line: 476, flags: DIFlagFwdDecl)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1174, file: !1175, line: 479, baseType: !1219, size: 64, offset: 320)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1027, line: 144, baseType: !1220)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1027, line: 100, size: 896, elements: !1222)
!1222 = !{!1223, !1228, !1233, !1238, !1240, !1243, !1244, !1245, !1246, !1247, !1252, !1254, !1255, !1260, !1265}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1221, file: !1027, line: 102, baseType: !1224, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1027, line: 52, baseType: !1225)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{!1026, !1067}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1221, file: !1027, line: 105, baseType: !1229, size: 64, offset: 64)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1027, line: 59, baseType: !1230)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = !DISubroutineType(types: !1232)
!1232 = !{!623, !1067, !1067}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1221, file: !1027, line: 108, baseType: !1234, size: 64, offset: 128)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1027, line: 63, baseType: !1235)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{null, !627}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1221, file: !1027, line: 111, baseType: !1239, size: 64, offset: 192)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1221, file: !1027, line: 114, baseType: !1241, size: 64, offset: 256)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1242, line: 46, baseType: !692)
!1242 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1221, file: !1027, line: 117, baseType: !1241, size: 64, offset: 320)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1221, file: !1027, line: 120, baseType: !1241, size: 64, offset: 384)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1221, file: !1027, line: 124, baseType: !7, size: 32, offset: 448)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1221, file: !1027, line: 128, baseType: !7, size: 32, offset: 480)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1221, file: !1027, line: 131, baseType: !1248, size: 64, offset: 512)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1027, line: 75, baseType: !1249)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64)
!1250 = !DISubroutineType(types: !1251)
!1251 = !{!627, !1241, !1241}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1221, file: !1027, line: 132, baseType: !1253, size: 64, offset: 576)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1027, line: 78, baseType: !1235)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1221, file: !1027, line: 135, baseType: !627, size: 64, offset: 640)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1221, file: !1027, line: 136, baseType: !1256, size: 64, offset: 704)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1027, line: 82, baseType: !1257)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64)
!1258 = !DISubroutineType(types: !1259)
!1259 = !{!627, !627, !1241, !1241}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1221, file: !1027, line: 137, baseType: !1261, size: 64, offset: 768)
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1027, line: 83, baseType: !1262)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{null, !627, !627}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1221, file: !1027, line: 141, baseType: !7, size: 32, offset: 832)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1174, file: !1175, line: 484, baseType: !639, size: 64, offset: 384)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1174, file: !1175, line: 488, baseType: !639, size: 64, offset: 448)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1174, file: !1175, line: 493, baseType: !639, size: 64, offset: 512)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1174, file: !1175, line: 496, baseType: !639, size: 64, offset: 576)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1174, file: !1175, line: 501, baseType: !1271, size: 64, offset: 640)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !146, line: 2355, size: 576, elements: !1273)
!1273 = !{!1274, !1277, !1278, !1279, !1280, !1282, !1283, !1288, !1289, !1290, !1291, !1292, !1293}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1272, file: !146, line: 2356, baseType: !1275, size: 64)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !146, line: 2356, flags: DIFlagFwdDecl)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1272, file: !146, line: 2357, baseType: !628, size: 64, offset: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1272, file: !146, line: 2358, baseType: !623, size: 32, offset: 128)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1272, file: !146, line: 2359, baseType: !623, size: 32, offset: 160)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1272, file: !146, line: 2360, baseType: !1281, size: 128, offset: 192)
!1281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, size: 128, elements: !902)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1272, file: !146, line: 2364, baseType: !623, size: 32, offset: 320)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1272, file: !146, line: 2367, baseType: !1284, size: 128, offset: 384)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !146, line: 2349, size: 128, elements: !1285)
!1285 = !{!1286, !1287}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1284, file: !146, line: 2351, baseType: !811, size: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1284, file: !146, line: 2352, baseType: !694, size: 64, offset: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1272, file: !146, line: 2371, baseType: !145, size: 32, offset: 512)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1272, file: !146, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1272, file: !146, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1272, file: !146, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1272, file: !146, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1272, file: !146, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1174, file: !1175, line: 504, baseType: !1295, size: 64, offset: 704)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1175, line: 504, flags: DIFlagFwdDecl)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1174, file: !1175, line: 507, baseType: !1219, size: 64, offset: 768)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1174, file: !1175, line: 510, baseType: !623, size: 32, offset: 832)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1174, file: !1175, line: 513, baseType: !623, size: 32, offset: 864)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1174, file: !1175, line: 516, baseType: !763, size: 32, offset: 896)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1174, file: !1175, line: 519, baseType: !763, size: 32, offset: 928)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1174, file: !1175, line: 522, baseType: !7, size: 32, offset: 960)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1174, file: !1175, line: 523, baseType: !7, size: 32, offset: 992)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1174, file: !1175, line: 528, baseType: !628, size: 64, offset: 1024)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1174, file: !1175, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1174, file: !1175, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1174, file: !1175, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1174, file: !1175, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1174, file: !1175, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1174, file: !1175, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1174, file: !1175, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1174, file: !1175, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1174, file: !1175, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1174, file: !1175, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1174, file: !1175, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1174, file: !1175, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1174, file: !1175, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1174, file: !1175, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1174, file: !1175, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1174, file: !1175, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1169, file: !151, line: 3254, baseType: !639, size: 64, offset: 1536)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1169, file: !151, line: 3257, baseType: !639, size: 64, offset: 1600)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1169, file: !151, line: 3258, baseType: !639, size: 64, offset: 1664)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1169, file: !151, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1169, file: !151, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1169, file: !151, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1169, file: !151, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1169, file: !151, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1169, file: !151, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1169, file: !151, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1169, file: !151, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1169, file: !151, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1169, file: !151, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1169, file: !151, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1169, file: !151, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1169, file: !151, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1169, file: !151, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1169, file: !151, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1169, file: !151, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1169, file: !151, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1169, file: !151, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !641, file: !151, line: 3394, baseType: !1343, size: 1344)
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !151, line: 2279, size: 1344, elements: !1344)
!1344 = !{!1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1343, file: !151, line: 2280, baseType: !677, size: 192)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1343, file: !151, line: 2281, baseType: !639, size: 64, offset: 192)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1343, file: !151, line: 2282, baseType: !639, size: 64, offset: 256)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1343, file: !151, line: 2283, baseType: !639, size: 64, offset: 320)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1343, file: !151, line: 2284, baseType: !639, size: 64, offset: 384)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1343, file: !151, line: 2285, baseType: !7, size: 32, offset: 448)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1343, file: !151, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1343, file: !151, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1343, file: !151, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1343, file: !151, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1343, file: !151, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1343, file: !151, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1343, file: !151, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1343, file: !151, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1343, file: !151, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1343, file: !151, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1343, file: !151, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1343, file: !151, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1343, file: !151, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1343, file: !151, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1343, file: !151, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1343, file: !151, line: 2305, baseType: !7, size: 32, offset: 512)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1343, file: !151, line: 2306, baseType: !1005, size: 32, offset: 544)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1343, file: !151, line: 2307, baseType: !639, size: 64, offset: 576)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1343, file: !151, line: 2308, baseType: !639, size: 64, offset: 640)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1343, file: !151, line: 2314, baseType: !1371, size: 64, offset: 704)
!1371 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !151, line: 2309, size: 64, elements: !1372)
!1372 = !{!1373, !1374, !1375}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1371, file: !151, line: 2310, baseType: !623, size: 32)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1371, file: !151, line: 2311, baseType: !628, size: 64)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1371, file: !151, line: 2312, baseType: !1376, size: 64)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64)
!1377 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !151, line: 2277, flags: DIFlagFwdDecl)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1343, file: !151, line: 2315, baseType: !639, size: 64, offset: 768)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1343, file: !151, line: 2316, baseType: !639, size: 64, offset: 832)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1343, file: !151, line: 2317, baseType: !639, size: 64, offset: 896)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1343, file: !151, line: 2318, baseType: !639, size: 64, offset: 960)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1343, file: !151, line: 2319, baseType: !639, size: 64, offset: 1024)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1343, file: !151, line: 2320, baseType: !639, size: 64, offset: 1088)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1343, file: !151, line: 2321, baseType: !639, size: 64, offset: 1152)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1343, file: !151, line: 2322, baseType: !639, size: 64, offset: 1216)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1343, file: !151, line: 2324, baseType: !1387, size: 64, offset: 1280)
