; ModuleID = 'varpool.bc'
source_filename = "varpool.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

!215 = !DIEnumerator(name: "SYSV_ABI", value: 0, isUnsigned: true)
!216 = !DIEnumerator(name: "MS_ABI", value: 1, isUnsigned: true)
!217 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_code", file: !6, line: 280, baseType: !7, size: 32, elements: !218)
!218 = !{!219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234}
!219 = !DIEnumerator(name: "OMP_CLAUSE_ERROR", value: 0, isUnsigned: true)
!220 = !DIEnumerator(name: "OMP_CLAUSE_PRIVATE", value: 1, isUnsigned: true)
!221 = !DIEnumerator(name: "OMP_CLAUSE_SHARED", value: 2, isUnsigned: true)
!222 = !DIEnumerator(name: "OMP_CLAUSE_FIRSTPRIVATE", value: 3, isUnsigned: true)
!223 = !DIEnumerator(name: "OMP_CLAUSE_LASTPRIVATE", value: 4, isUnsigned: true)
!224 = !DIEnumerator(name: "OMP_CLAUSE_REDUCTION", value: 5, isUnsigned: true)
!225 = !DIEnumerator(name: "OMP_CLAUSE_COPYIN", value: 6, isUnsigned: true)
!226 = !DIEnumerator(name: "OMP_CLAUSE_COPYPRIVATE", value: 7, isUnsigned: true)
!227 = !DIEnumerator(name: "OMP_CLAUSE_IF", value: 8, isUnsigned: true)
!228 = !DIEnumerator(name: "OMP_CLAUSE_NUM_THREADS", value: 9, isUnsigned: true)
!229 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE", value: 10, isUnsigned: true)
!230 = !DIEnumerator(name: "OMP_CLAUSE_NOWAIT", value: 11, isUnsigned: true)
!231 = !DIEnumerator(name: "OMP_CLAUSE_ORDERED", value: 12, isUnsigned: true)
!232 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT", value: 13, isUnsigned: true)
!233 = !DIEnumerator(name: "OMP_CLAUSE_COLLAPSE", value: 14, isUnsigned: true)
!234 = !DIEnumerator(name: "OMP_CLAUSE_UNTIED", value: 15, isUnsigned: true)
!235 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_default_kind", file: !6, line: 1817, baseType: !7, size: 32, elements: !236)
!236 = !{!237, !238, !239, !240, !241}
!237 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_UNSPECIFIED", value: 0, isUnsigned: true)
!238 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_SHARED", value: 1, isUnsigned: true)
!239 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_NONE", value: 2, isUnsigned: true)
!240 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_PRIVATE", value: 3, isUnsigned: true)
!241 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_FIRSTPRIVATE", value: 4, isUnsigned: true)
!242 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_schedule_kind", file: !6, line: 1805, baseType: !7, size: 32, elements: !243)
!243 = !{!244, !245, !246, !247, !248}
!244 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_STATIC", value: 0, isUnsigned: true)
!245 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_DYNAMIC", value: 1, isUnsigned: true)
!246 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_GUIDED", value: 2, isUnsigned: true)
!247 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_AUTO", value: 3, isUnsigned: true)
!248 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_RUNTIME", value: 4, isUnsigned: true)
!249 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "availability", file: !250, line: 27, baseType: !7, size: 32, elements: !251)
!250 = !DIFile(filename: "./cgraph.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!251 = !{!252, !253, !254, !255, !256}
!252 = !DIEnumerator(name: "AVAIL_UNSET", value: 0, isUnsigned: true)
!253 = !DIEnumerator(name: "AVAIL_NOT_AVAILABLE", value: 1, isUnsigned: true)
!254 = !DIEnumerator(name: "AVAIL_OVERWRITABLE", value: 2, isUnsigned: true)
!255 = !DIEnumerator(name: "AVAIL_AVAILABLE", value: 3, isUnsigned: true)
!256 = !DIEnumerator(name: "AVAIL_LOCAL", value: 4, isUnsigned: true)
!257 = !{!258, !259, !260, !261, !264, !265, !5, !267, !268, !272, !1458, !859}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!260 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !263)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "varpool_node", file: !250, line: 358, size: 320, elements: !270)
!270 = !{!271, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !269, file: !250, line: 359, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !273, line: 56, baseType: !274)
!273 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !6, line: 3371, size: 1792, elements: !276)
!276 = !{!277, !310, !316, !329, !336, !343, !348, !357, !363, !376, !388, !426, !434, !462, !479, !480, !485, !494, !500, !505, !509, !513, !1096, !1145, !1151, !1157, !1164, !1177, !1191, !1208, !1220, !1242, !1257, !1429}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !275, file: !6, line: 3372, baseType: !278, size: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !6, line: 360, size: 64, elements: !279)
!279 = !{!280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !278, file: !6, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !278, file: !6, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !278, file: !6, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !278, file: !6, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !278, file: !6, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !278, file: !6, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !278, file: !6, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !278, file: !6, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !278, file: !6, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !278, file: !6, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !278, file: !6, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !278, file: !6, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !278, file: !6, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !278, file: !6, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !278, file: !6, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !278, file: !6, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !278, file: !6, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !278, file: !6, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !278, file: !6, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !278, file: !6, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !278, file: !6, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !278, file: !6, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !278, file: !6, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !278, file: !6, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !278, file: !6, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !278, file: !6, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !278, file: !6, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !278, file: !6, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !278, file: !6, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !278, file: !6, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !275, file: !6, line: 3373, baseType: !311, size: 192)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !6, line: 402, size: 192, elements: !312)
!312 = !{!313, !314, !315}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !311, file: !6, line: 403, baseType: !278, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !311, file: !6, line: 404, baseType: !272, size: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !311, file: !6, line: 405, baseType: !272, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !275, file: !6, line: 3374, baseType: !317, size: 320)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !6, line: 1384, size: 320, elements: !318)
!318 = !{!319, !320}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !317, file: !6, line: 1385, baseType: !311, size: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !317, file: !6, line: 1386, baseType: !321, size: 128, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !322, line: 58, baseType: !323)
!322 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !322, line: 54, size: 128, elements: !324)
!324 = !{!325, !327}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !323, file: !322, line: 56, baseType: !326, size: 64)
!326 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !323, file: !322, line: 57, baseType: !328, size: 64, offset: 64)
!328 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !275, file: !6, line: 3375, baseType: !330, size: 256)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !6, line: 1397, size: 256, elements: !331)
!331 = !{!332, !333}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !330, file: !6, line: 1398, baseType: !311, size: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !330, file: !6, line: 1399, baseType: !334, size: 64, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !6, line: 1392, flags: DIFlagFwdDecl)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !275, file: !6, line: 3376, baseType: !337, size: 256)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !6, line: 1408, size: 256, elements: !338)
!338 = !{!339, !340}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !337, file: !6, line: 1409, baseType: !311, size: 192)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !337, file: !6, line: 1410, baseType: !341, size: 64, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !6, line: 1403, flags: DIFlagFwdDecl)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !275, file: !6, line: 3377, baseType: !344, size: 256)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !6, line: 1437, size: 256, elements: !345)
!345 = !{!346, !347}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !344, file: !6, line: 1438, baseType: !311, size: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !344, file: !6, line: 1439, baseType: !272, size: 64, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !275, file: !6, line: 3378, baseType: !349, size: 256)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !6, line: 1418, size: 256, elements: !350)
!350 = !{!351, !352, !353}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !349, file: !6, line: 1419, baseType: !311, size: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !349, file: !6, line: 1420, baseType: !260, size: 32, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !349, file: !6, line: 1421, baseType: !354, size: 8, offset: 224)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 8, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 1)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !275, file: !6, line: 3379, baseType: !358, size: 320)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !6, line: 1428, size: 320, elements: !359)
!359 = !{!360, !361, !362}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !358, file: !6, line: 1429, baseType: !311, size: 192)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !358, file: !6, line: 1430, baseType: !272, size: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !358, file: !6, line: 1431, baseType: !272, size: 64, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !275, file: !6, line: 3380, baseType: !364, size: 320)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !6, line: 1460, size: 320, elements: !365)
!365 = !{!366, !367}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !364, file: !6, line: 1461, baseType: !311, size: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !364, file: !6, line: 1462, baseType: !368, size: 128, offset: 192)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !369, line: 31, size: 128, elements: !370)
!369 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!370 = !{!371, !374, !375}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !368, file: !369, line: 32, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !259)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !368, file: !369, line: 33, baseType: !7, size: 32, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !368, file: !369, line: 34, baseType: !7, size: 32, offset: 96)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !275, file: !6, line: 3381, baseType: !377, size: 384)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !6, line: 2507, size: 384, elements: !378)
!378 = !{!379, !380, !385, !386, !387}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !377, file: !6, line: 2508, baseType: !311, size: 192)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !377, file: !6, line: 2509, baseType: !381, size: 32, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !382, line: 58, baseType: !383)
!382 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !384, line: 44, baseType: !7)
!384 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!385 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !377, file: !6, line: 2510, baseType: !7, size: 32, offset: 224)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !377, file: !6, line: 2511, baseType: !272, size: 64, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !377, file: !6, line: 2512, baseType: !272, size: 64, offset: 320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !275, file: !6, line: 3382, baseType: !389, size: 896)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !6, line: 2652, size: 896, elements: !390)
!390 = !{!391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !389, file: !6, line: 2653, baseType: !377, size: 384)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !389, file: !6, line: 2654, baseType: !272, size: 64, offset: 384)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !389, file: !6, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !389, file: !6, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !389, file: !6, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !389, file: !6, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !389, file: !6, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !389, file: !6, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !389, file: !6, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !389, file: !6, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !389, file: !6, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !389, file: !6, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !389, file: !6, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !389, file: !6, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !389, file: !6, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !389, file: !6, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !389, file: !6, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !389, file: !6, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !389, file: !6, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !389, file: !6, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !389, file: !6, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !389, file: !6, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !389, file: !6, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !389, file: !6, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !389, file: !6, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !389, file: !6, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !389, file: !6, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !389, file: !6, line: 2703, baseType: !7, size: 32, offset: 512)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !389, file: !6, line: 2705, baseType: !272, size: 64, offset: 576)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !389, file: !6, line: 2706, baseType: !272, size: 64, offset: 640)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !389, file: !6, line: 2707, baseType: !272, size: 64, offset: 704)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !389, file: !6, line: 2708, baseType: !272, size: 64, offset: 768)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !389, file: !6, line: 2711, baseType: !424, size: 64, offset: 832)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !6, line: 2711, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !275, file: !6, line: 3383, baseType: !427, size: 960)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !6, line: 2756, size: 960, elements: !428)
!428 = !{!429, !430}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !427, file: !6, line: 2757, baseType: !389, size: 896)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !427, file: !6, line: 2758, baseType: !431, size: 64, offset: 896)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !273, line: 50, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !273, line: 49, flags: DIFlagFwdDecl)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !275, file: !6, line: 3384, baseType: !435, size: 1472)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !6, line: 3114, size: 1472, elements: !436)
!436 = !{!437, !458, !459, !460, !461}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !435, file: !6, line: 3115, baseType: !438, size: 1216)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !6, line: 2984, size: 1216, elements: !439)
!439 = !{!440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !438, file: !6, line: 2985, baseType: !427, size: 960)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !438, file: !6, line: 2986, baseType: !272, size: 64, offset: 960)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !438, file: !6, line: 2987, baseType: !272, size: 64, offset: 1024)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !438, file: !6, line: 2988, baseType: !272, size: 64, offset: 1088)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !438, file: !6, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !438, file: !6, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !438, file: !6, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !438, file: !6, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !438, file: !6, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !438, file: !6, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !438, file: !6, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !438, file: !6, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !438, file: !6, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !438, file: !6, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !438, file: !6, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !438, file: !6, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !438, file: !6, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !438, file: !6, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !435, file: !6, line: 3117, baseType: !272, size: 64, offset: 1216)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !435, file: !6, line: 3119, baseType: !272, size: 64, offset: 1280)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !435, file: !6, line: 3121, baseType: !272, size: 64, offset: 1344)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !435, file: !6, line: 3123, baseType: !272, size: 64, offset: 1408)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !275, file: !6, line: 3385, baseType: !463, size: 1088)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !6, line: 2874, size: 1088, elements: !464)
!464 = !{!465, !466, !467}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !463, file: !6, line: 2875, baseType: !427, size: 960)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !463, file: !6, line: 2876, baseType: !431, size: 64, offset: 960)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !463, file: !6, line: 2877, baseType: !468, size: 64, offset: 1024)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !470, line: 172, size: 128, elements: !471)
!470 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!471 = !{!472, !473, !474, !475, !476, !477, !478}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !469, file: !470, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !469, file: !470, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !469, file: !470, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !469, file: !470, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !469, file: !470, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !469, file: !470, line: 195, baseType: !7, size: 32, offset: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !469, file: !470, line: 199, baseType: !272, size: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !275, file: !6, line: 3386, baseType: !438, size: 1216)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !275, file: !6, line: 3387, baseType: !481, size: 1280)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !6, line: 3093, size: 1280, elements: !482)
!482 = !{!483, !484}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !481, file: !6, line: 3094, baseType: !438, size: 1216)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !481, file: !6, line: 3095, baseType: !468, size: 64, offset: 1216)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !275, file: !6, line: 3388, baseType: !486, size: 1216)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !6, line: 2824, size: 1216, elements: !487)
!487 = !{!488, !489, !490, !491, !492, !493}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !486, file: !6, line: 2825, baseType: !389, size: 896)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !486, file: !6, line: 2827, baseType: !272, size: 64, offset: 896)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !486, file: !6, line: 2828, baseType: !272, size: 64, offset: 960)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !486, file: !6, line: 2829, baseType: !272, size: 64, offset: 1024)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !486, file: !6, line: 2830, baseType: !272, size: 64, offset: 1088)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !486, file: !6, line: 2831, baseType: !272, size: 64, offset: 1152)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !275, file: !6, line: 3389, baseType: !495, size: 1024)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !6, line: 2850, size: 1024, elements: !496)
!496 = !{!497, !498, !499}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !495, file: !6, line: 2851, baseType: !427, size: 960)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !495, file: !6, line: 2852, baseType: !260, size: 32, offset: 960)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !495, file: !6, line: 2853, baseType: !260, size: 32, offset: 992)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !275, file: !6, line: 3390, baseType: !501, size: 1024)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !6, line: 2857, size: 1024, elements: !502)
!502 = !{!503, !504}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !501, file: !6, line: 2858, baseType: !427, size: 960)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !501, file: !6, line: 2859, baseType: !468, size: 64, offset: 960)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !275, file: !6, line: 3391, baseType: !506, size: 960)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !6, line: 2862, size: 960, elements: !507)
!507 = !{!508}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !506, file: !6, line: 2863, baseType: !427, size: 960)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !275, file: !6, line: 3392, baseType: !510, size: 1472)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !6, line: 3304, size: 1472, elements: !511)
!511 = !{!512}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !510, file: !6, line: 3305, baseType: !435, size: 1472)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !275, file: !6, line: 3393, baseType: !514, size: 1792)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !6, line: 3248, size: 1792, elements: !515)
!515 = !{!516, !517, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !514, file: !6, line: 3249, baseType: !435, size: 1472)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !514, file: !6, line: 3251, baseType: !518, size: 64, offset: 1472)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !520, line: 463, size: 1152, elements: !521)
!520 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!521 = !{!522, !525, !843, !844, !1016, !1019, !1020, !1021, !1022, !1023, !1024, !1048, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !519, file: !520, line: 464, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !520, line: 464, flags: DIFlagFwdDecl)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !519, file: !520, line: 467, baseType: !526, size: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !202, line: 374, size: 640, elements: !528)
!528 = !{!529, !818, !819, !832, !833, !834, !835, !836, !837, !839, !841, !842}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !527, file: !202, line: 377, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !273, line: 111, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !202, line: 217, size: 832, elements: !533)
!533 = !{!534, !781, !782, !783, !786, !792, !793, !794, !812, !813, !814, !815, !816, !817}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !532, file: !202, line: 219, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !202, line: 151, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !202, line: 151, size: 128, elements: !538)
!538 = !{!539}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !537, file: !202, line: 151, baseType: !540, size: 128)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !202, line: 150, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !202, line: 150, size: 128, elements: !542)
!542 = !{!543, !544, !545}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !541, file: !202, line: 150, baseType: !7, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !541, file: !202, line: 150, baseType: !7, size: 32, offset: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !541, file: !202, line: 150, baseType: !546, size: 64, offset: 64)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 64, elements: !355)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !273, line: 108, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !202, line: 122, size: 512, elements: !550)
!550 = !{!551, !552, !553, !773, !774, !775, !776, !777, !778, !779}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !549, file: !202, line: 124, baseType: !531, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !549, file: !202, line: 125, baseType: !531, size: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !549, file: !202, line: 131, baseType: !554, size: 64, offset: 128)
!554 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !202, line: 128, size: 64, elements: !555)
!555 = !{!556, !772}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !554, file: !202, line: 129, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !273, line: 66, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !560, line: 143, size: 192, elements: !561)
!560 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!561 = !{!562, !770, !771}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !559, file: !560, line: 145, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !273, line: 69, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !560, line: 136, size: 192, elements: !566)
!566 = !{!567, !768, !769}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !565, file: !560, line: 137, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !273, line: 58, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !560, line: 737, size: 768, elements: !571)
!571 = !{!572, !589, !623, !629, !634, !639, !646, !652, !658, !663, !677, !682, !688, !693, !703, !708, !726, !733, !740, !746, !751, !757, !763}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !570, file: !560, line: 738, baseType: !573, size: 256)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !560, line: 271, size: 256, elements: !574)
!574 = !{!575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !573, file: !560, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !573, file: !560, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !573, file: !560, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !573, file: !560, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !573, file: !560, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !573, file: !560, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !573, file: !560, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !573, file: !560, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !573, file: !560, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !573, file: !560, line: 312, baseType: !7, size: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !573, file: !560, line: 316, baseType: !381, size: 32, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !573, file: !560, line: 319, baseType: !7, size: 32, offset: 96)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !573, file: !560, line: 323, baseType: !531, size: 64, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !573, file: !560, line: 327, baseType: !272, size: 64, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !570, file: !560, line: 739, baseType: !590, size: 448)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !560, line: 350, size: 448, elements: !591)
!591 = !{!592, !621}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !590, file: !560, line: 353, baseType: !593, size: 384)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !560, line: 333, size: 384, elements: !594)
!594 = !{!595, !596, !604}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !593, file: !560, line: 336, baseType: !573, size: 256)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !593, file: !560, line: 343, baseType: !597, size: 64, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !599, line: 37, size: 128, elements: !600)
!599 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!600 = !{!601, !602}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !598, file: !599, line: 39, baseType: !597, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !598, file: !599, line: 40, baseType: !603, size: 64, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !593, file: !560, line: 344, baseType: !605, size: 64, offset: 320)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !599, line: 45, size: 320, elements: !607)
!607 = !{!608, !609}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !606, file: !599, line: 47, baseType: !605, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !606, file: !599, line: 48, baseType: !610, size: 256, offset: 64)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !6, line: 1883, size: 256, elements: !611)
!611 = !{!612, !614, !615, !620}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !610, file: !6, line: 1884, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !610, file: !6, line: 1885, baseType: !613, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !610, file: !6, line: 1891, baseType: !616, size: 64, offset: 128)
!616 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !610, file: !6, line: 1891, size: 64, elements: !617)
!617 = !{!618, !619}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !616, file: !6, line: 1891, baseType: !568, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !616, file: !6, line: 1891, baseType: !272, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !610, file: !6, line: 1892, baseType: !603, size: 64, offset: 192)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !590, file: !560, line: 359, baseType: !622, size: 64, offset: 384)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 64, elements: !355)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !570, file: !560, line: 740, baseType: !624, size: 512)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !560, line: 365, size: 512, elements: !625)
!625 = !{!626, !627, !628}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !624, file: !560, line: 368, baseType: !593, size: 384)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !624, file: !560, line: 373, baseType: !272, size: 64, offset: 384)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !624, file: !560, line: 374, baseType: !272, size: 64, offset: 448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !570, file: !560, line: 741, baseType: !630, size: 576)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !560, line: 380, size: 576, elements: !631)
!631 = !{!632, !633}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !630, file: !560, line: 383, baseType: !624, size: 512)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !630, file: !560, line: 389, baseType: !622, size: 64, offset: 512)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !570, file: !560, line: 742, baseType: !635, size: 320)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !560, line: 395, size: 320, elements: !636)
!636 = !{!637, !638}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !635, file: !560, line: 397, baseType: !573, size: 256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !635, file: !560, line: 400, baseType: !557, size: 64, offset: 256)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !570, file: !560, line: 743, baseType: !640, size: 448)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !560, line: 406, size: 448, elements: !641)
!641 = !{!642, !643, !644, !645}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !640, file: !560, line: 408, baseType: !573, size: 256)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !640, file: !560, line: 412, baseType: !272, size: 64, offset: 256)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !640, file: !560, line: 420, baseType: !272, size: 64, offset: 320)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !640, file: !560, line: 423, baseType: !557, size: 64, offset: 384)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !570, file: !560, line: 744, baseType: !647, size: 384)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !560, line: 429, size: 384, elements: !648)
!648 = !{!649, !650, !651}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !647, file: !560, line: 431, baseType: !573, size: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !647, file: !560, line: 434, baseType: !272, size: 64, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !647, file: !560, line: 437, baseType: !557, size: 64, offset: 320)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !570, file: !560, line: 745, baseType: !653, size: 384)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !560, line: 443, size: 384, elements: !654)
!654 = !{!655, !656, !657}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !653, file: !560, line: 445, baseType: !573, size: 256)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !653, file: !560, line: 449, baseType: !272, size: 64, offset: 256)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !653, file: !560, line: 453, baseType: !557, size: 64, offset: 320)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !570, file: !560, line: 746, baseType: !659, size: 320)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !560, line: 459, size: 320, elements: !660)
!660 = !{!661, !662}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !659, file: !560, line: 461, baseType: !573, size: 256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !659, file: !560, line: 464, baseType: !272, size: 64, offset: 256)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !570, file: !560, line: 747, baseType: !664, size: 768)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !560, line: 469, size: 768, elements: !665)
!665 = !{!666, !667, !668, !669, !670}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !664, file: !560, line: 471, baseType: !573, size: 256)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !664, file: !560, line: 474, baseType: !7, size: 32, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !664, file: !560, line: 475, baseType: !7, size: 32, offset: 288)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !664, file: !560, line: 478, baseType: !272, size: 64, offset: 320)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !664, file: !560, line: 481, baseType: !671, size: 384, offset: 384)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 384, elements: !355)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !6, line: 1917, size: 384, elements: !673)
!673 = !{!674, !675, !676}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !672, file: !6, line: 1920, baseType: !610, size: 256)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !672, file: !6, line: 1921, baseType: !272, size: 64, offset: 256)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !672, file: !6, line: 1922, baseType: !381, size: 32, offset: 320)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !570, file: !560, line: 748, baseType: !678, size: 320)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !560, line: 487, size: 320, elements: !679)
!679 = !{!680, !681}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !678, file: !560, line: 490, baseType: !573, size: 256)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !678, file: !560, line: 494, baseType: !260, size: 32, offset: 256)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !570, file: !560, line: 749, baseType: !683, size: 384)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !560, line: 500, size: 384, elements: !684)
!684 = !{!685, !686, !687}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !683, file: !560, line: 502, baseType: !573, size: 256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !683, file: !560, line: 506, baseType: !557, size: 64, offset: 256)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !683, file: !560, line: 510, baseType: !557, size: 64, offset: 320)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !570, file: !560, line: 750, baseType: !689, size: 320)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !560, line: 529, size: 320, elements: !690)
!690 = !{!691, !692}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !689, file: !560, line: 531, baseType: !573, size: 256)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !689, file: !560, line: 540, baseType: !557, size: 64, offset: 256)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !570, file: !560, line: 751, baseType: !694, size: 704)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !560, line: 546, size: 704, elements: !695)
!695 = !{!696, !697, !698, !699, !700, !701, !702}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !694, file: !560, line: 549, baseType: !624, size: 512)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !694, file: !560, line: 553, baseType: !265, size: 64, offset: 512)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !694, file: !560, line: 557, baseType: !259, size: 8, offset: 576)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !694, file: !560, line: 558, baseType: !259, size: 8, offset: 584)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !694, file: !560, line: 559, baseType: !259, size: 8, offset: 592)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !694, file: !560, line: 560, baseType: !259, size: 8, offset: 600)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !694, file: !560, line: 566, baseType: !622, size: 64, offset: 640)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !570, file: !560, line: 752, baseType: !704, size: 384)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !560, line: 571, size: 384, elements: !705)
!705 = !{!706, !707}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !704, file: !560, line: 573, baseType: !635, size: 320)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !704, file: !560, line: 577, baseType: !272, size: 64, offset: 320)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !570, file: !560, line: 753, baseType: !709, size: 576)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !560, line: 600, size: 576, elements: !710)
!710 = !{!711, !712, !713, !716, !725}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !709, file: !560, line: 602, baseType: !635, size: 320)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !709, file: !560, line: 605, baseType: !272, size: 64, offset: 320)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !709, file: !560, line: 609, baseType: !714, size: 64, offset: 384)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !715, line: 46, baseType: !326)
!715 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!716 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !709, file: !560, line: 612, baseType: !717, size: 64, offset: 448)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !560, line: 581, size: 320, elements: !719)
!719 = !{!720, !721, !722, !723, !724}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !718, file: !560, line: 583, baseType: !5, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !718, file: !560, line: 586, baseType: !272, size: 64, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !718, file: !560, line: 589, baseType: !272, size: 64, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !718, file: !560, line: 592, baseType: !272, size: 64, offset: 192)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !718, file: !560, line: 595, baseType: !272, size: 64, offset: 256)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !709, file: !560, line: 616, baseType: !557, size: 64, offset: 512)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !570, file: !560, line: 754, baseType: !727, size: 512)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !560, line: 622, size: 512, elements: !728)
!728 = !{!729, !730, !731, !732}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !727, file: !560, line: 624, baseType: !635, size: 320)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !727, file: !560, line: 628, baseType: !272, size: 64, offset: 320)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !727, file: !560, line: 632, baseType: !272, size: 64, offset: 384)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !727, file: !560, line: 636, baseType: !272, size: 64, offset: 448)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !570, file: !560, line: 755, baseType: !734, size: 704)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !560, line: 642, size: 704, elements: !735)
!735 = !{!736, !737, !738, !739}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !734, file: !560, line: 644, baseType: !727, size: 512)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !734, file: !560, line: 648, baseType: !272, size: 64, offset: 512)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !734, file: !560, line: 652, baseType: !272, size: 64, offset: 576)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !734, file: !560, line: 653, baseType: !272, size: 64, offset: 640)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !570, file: !560, line: 756, baseType: !741, size: 448)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !560, line: 663, size: 448, elements: !742)
!742 = !{!743, !744, !745}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !741, file: !560, line: 665, baseType: !635, size: 320)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !741, file: !560, line: 668, baseType: !272, size: 64, offset: 320)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !741, file: !560, line: 673, baseType: !272, size: 64, offset: 384)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !570, file: !560, line: 757, baseType: !747, size: 384)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !560, line: 694, size: 384, elements: !748)
!748 = !{!749, !750}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !747, file: !560, line: 696, baseType: !635, size: 320)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !747, file: !560, line: 699, baseType: !272, size: 64, offset: 320)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !570, file: !560, line: 758, baseType: !752, size: 384)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !560, line: 681, size: 384, elements: !753)
!753 = !{!754, !755, !756}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !752, file: !560, line: 683, baseType: !573, size: 256)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !752, file: !560, line: 686, baseType: !272, size: 64, offset: 256)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !752, file: !560, line: 689, baseType: !272, size: 64, offset: 320)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !570, file: !560, line: 759, baseType: !758, size: 384)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !560, line: 707, size: 384, elements: !759)
!759 = !{!760, !761, !762}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !758, file: !560, line: 709, baseType: !573, size: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !758, file: !560, line: 712, baseType: !272, size: 64, offset: 256)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !758, file: !560, line: 712, baseType: !272, size: 64, offset: 320)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !570, file: !560, line: 760, baseType: !764, size: 320)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !560, line: 718, size: 320, elements: !765)
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !764, file: !560, line: 720, baseType: !573, size: 256)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !764, file: !560, line: 723, baseType: !272, size: 64, offset: 256)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !565, file: !560, line: 138, baseType: !564, size: 64, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !565, file: !560, line: 139, baseType: !564, size: 64, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !559, file: !560, line: 146, baseType: !563, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !559, file: !560, line: 152, baseType: !557, size: 64, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !554, file: !202, line: 130, baseType: !431, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !549, file: !202, line: 134, baseType: !264, size: 64, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !549, file: !202, line: 137, baseType: !272, size: 64, offset: 256)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !549, file: !202, line: 138, baseType: !381, size: 32, offset: 320)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !549, file: !202, line: 142, baseType: !7, size: 32, offset: 352)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !549, file: !202, line: 144, baseType: !260, size: 32, offset: 384)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !549, file: !202, line: 145, baseType: !260, size: 32, offset: 416)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !549, file: !202, line: 146, baseType: !780, size: 64, offset: 448)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !202, line: 119, baseType: !328)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !532, file: !202, line: 220, baseType: !535, size: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !532, file: !202, line: 223, baseType: !264, size: 64, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !532, file: !202, line: 226, baseType: !784, size: 64, offset: 192)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !202, line: 185, flags: DIFlagFwdDecl)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !532, file: !202, line: 229, baseType: !787, size: 128, offset: 256)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !788, size: 128, elements: !790)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !202, line: 229, flags: DIFlagFwdDecl)
!790 = !{!791}
!791 = !DISubrange(count: 2)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !532, file: !202, line: 232, baseType: !531, size: 64, offset: 384)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !532, file: !202, line: 233, baseType: !531, size: 64, offset: 448)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !532, file: !202, line: 238, baseType: !795, size: 64, offset: 512)
!795 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !202, line: 235, size: 64, elements: !796)
!796 = !{!797, !803}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !795, file: !202, line: 236, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !202, line: 273, size: 128, elements: !800)
!800 = !{!801, !802}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !799, file: !202, line: 275, baseType: !557, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !799, file: !202, line: 278, baseType: !557, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !795, file: !202, line: 237, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !202, line: 259, size: 320, elements: !806)
!806 = !{!807, !808, !809, !810, !811}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !805, file: !202, line: 261, baseType: !431, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !805, file: !202, line: 262, baseType: !431, size: 64, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !805, file: !202, line: 266, baseType: !431, size: 64, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !805, file: !202, line: 267, baseType: !431, size: 64, offset: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !805, file: !202, line: 270, baseType: !260, size: 32, offset: 256)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !532, file: !202, line: 241, baseType: !780, size: 64, offset: 576)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !532, file: !202, line: 244, baseType: !260, size: 32, offset: 640)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !532, file: !202, line: 247, baseType: !260, size: 32, offset: 672)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !532, file: !202, line: 250, baseType: !260, size: 32, offset: 704)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !532, file: !202, line: 253, baseType: !260, size: 32, offset: 736)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !532, file: !202, line: 256, baseType: !260, size: 32, offset: 768)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !527, file: !202, line: 378, baseType: !530, size: 64, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !527, file: !202, line: 381, baseType: !820, size: 64, offset: 128)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !202, line: 282, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !202, line: 282, size: 128, elements: !823)
!823 = !{!824}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !822, file: !202, line: 282, baseType: !825, size: 128)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !202, line: 281, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !202, line: 281, size: 128, elements: !827)
!827 = !{!828, !829, !830}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !826, file: !202, line: 281, baseType: !7, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !826, file: !202, line: 281, baseType: !7, size: 32, offset: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !826, file: !202, line: 281, baseType: !831, size: 64, offset: 64)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !530, size: 64, elements: !355)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !527, file: !202, line: 384, baseType: !260, size: 32, offset: 192)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !527, file: !202, line: 387, baseType: !260, size: 32, offset: 224)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !527, file: !202, line: 390, baseType: !260, size: 32, offset: 256)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !527, file: !202, line: 394, baseType: !820, size: 64, offset: 320)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !527, file: !202, line: 396, baseType: !201, size: 32, offset: 384)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !527, file: !202, line: 399, baseType: !838, size: 64, offset: 416)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 64, elements: !790)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !527, file: !202, line: 402, baseType: !840, size: 64, offset: 480)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !790)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !527, file: !202, line: 406, baseType: !260, size: 32, offset: 544)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !527, file: !202, line: 409, baseType: !260, size: 32, offset: 576)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !519, file: !520, line: 470, baseType: !558, size: 64, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !519, file: !520, line: 473, baseType: !845, size: 64, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !470, line: 39, size: 1152, elements: !847)
!847 = !{!848, !898, !911, !923, !924, !993, !994, !998, !999, !1000, !1001, !1002}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !846, file: !470, line: 41, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !850, line: 144, baseType: !851)
!850 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !850, line: 100, size: 896, elements: !853)
!853 = !{!854, !862, !867, !872, !874, !875, !876, !877, !878, !879, !884, !886, !887, !892, !897}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !852, file: !850, line: 102, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !850, line: 52, baseType: !856)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DISubroutineType(types: !858)
!858 = !{!859, !860}
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !850, line: 47, baseType: !7)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !852, file: !850, line: 105, baseType: !863, size: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !850, line: 59, baseType: !864)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!260, !860, !860}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !852, file: !850, line: 108, baseType: !868, size: 64, offset: 128)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !850, line: 63, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{null, !264}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !852, file: !850, line: 111, baseType: !873, size: 64, offset: 192)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !852, file: !850, line: 114, baseType: !714, size: 64, offset: 256)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !852, file: !850, line: 117, baseType: !714, size: 64, offset: 320)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !852, file: !850, line: 120, baseType: !714, size: 64, offset: 384)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !852, file: !850, line: 124, baseType: !7, size: 32, offset: 448)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !852, file: !850, line: 128, baseType: !7, size: 32, offset: 480)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !852, file: !850, line: 131, baseType: !880, size: 64, offset: 512)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !850, line: 75, baseType: !881)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!264, !714, !714}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !852, file: !850, line: 132, baseType: !885, size: 64, offset: 576)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !850, line: 78, baseType: !869)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !852, file: !850, line: 135, baseType: !264, size: 64, offset: 640)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !852, file: !850, line: 136, baseType: !888, size: 64, offset: 704)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !850, line: 82, baseType: !889)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DISubroutineType(types: !891)
!891 = !{!264, !264, !714, !714}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !852, file: !850, line: 137, baseType: !893, size: 64, offset: 768)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !850, line: 83, baseType: !894)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{null, !264, !264}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !852, file: !850, line: 141, baseType: !7, size: 32, offset: 832)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !846, file: !470, line: 48, baseType: !899, size: 64, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !560, line: 35, baseType: !901)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !560, line: 35, size: 128, elements: !902)
!902 = !{!903}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !901, file: !560, line: 35, baseType: !904, size: 128)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !560, line: 33, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !560, line: 33, size: 128, elements: !906)
!906 = !{!907, !908, !909}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !905, file: !560, line: 33, baseType: !7, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !905, file: !560, line: 33, baseType: !7, size: 32, offset: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !905, file: !560, line: 33, baseType: !910, size: 64, offset: 64)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 64, elements: !355)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !846, file: !470, line: 51, baseType: !912, size: 64, offset: 128)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !6, line: 183, baseType: !914)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !6, line: 183, size: 128, elements: !915)
!915 = !{!916}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !914, file: !6, line: 183, baseType: !917, size: 128)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !6, line: 182, baseType: !918)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !6, line: 182, size: 128, elements: !919)
!919 = !{!920, !921, !922}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !918, file: !6, line: 182, baseType: !7, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !918, file: !6, line: 182, baseType: !7, size: 32, offset: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !918, file: !6, line: 182, baseType: !622, size: 64, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !846, file: !470, line: 54, baseType: !272, size: 64, offset: 192)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !846, file: !470, line: 57, baseType: !925, size: 128, offset: 256)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !926, line: 31, size: 128, elements: !927)
!926 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!927 = !{!928, !929, !930, !931, !932, !933, !934}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !925, file: !926, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !925, file: !926, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !925, file: !926, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !925, file: !926, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !925, file: !926, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !925, file: !926, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !925, file: !926, line: 56, baseType: !935, size: 64, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !273, line: 47, baseType: !936)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !938, line: 75, size: 256, elements: !939)
!938 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!939 = !{!940, !952, !953, !954}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !937, file: !938, line: 76, baseType: !941, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !938, line: 68, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !938, line: 63, size: 320, elements: !944)
!944 = !{!945, !947, !948, !949}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !943, file: !938, line: 64, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !943, file: !938, line: 65, baseType: !946, size: 64, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !943, file: !938, line: 66, baseType: !7, size: 32, offset: 128)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !943, file: !938, line: 67, baseType: !950, size: 128, offset: 192)
!950 = !DICompositeType(tag: DW_TAG_array_type, baseType: !951, size: 128, elements: !790)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !938, line: 29, baseType: !326)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !937, file: !938, line: 77, baseType: !941, size: 64, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !937, file: !938, line: 78, baseType: !7, size: 32, offset: 128)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !937, file: !938, line: 79, baseType: !955, size: 64, offset: 192)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !938, line: 49, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !938, line: 45, size: 832, elements: !958)
!958 = !{!959, !960, !961}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !957, file: !938, line: 46, baseType: !946, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !957, file: !938, line: 47, baseType: !936, size: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !957, file: !938, line: 48, baseType: !962, size: 704, offset: 128)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !963, line: 164, size: 704, elements: !964)
!963 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!964 = !{!965, !966, !976, !977, !978, !979, !980, !981, !985, !989, !990, !991, !992}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !962, file: !963, line: 166, baseType: !328, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !962, file: !963, line: 167, baseType: !967, size: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !963, line: 157, size: 192, elements: !969)
!969 = !{!970, !971, !972}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !968, file: !963, line: 159, baseType: !262, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !968, file: !963, line: 160, baseType: !967, size: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !968, file: !963, line: 161, baseType: !973, size: 32, offset: 128)
!973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 32, elements: !974)
!974 = !{!975}
!975 = !DISubrange(count: 4)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !962, file: !963, line: 168, baseType: !262, size: 64, offset: 128)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !962, file: !963, line: 169, baseType: !262, size: 64, offset: 192)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !962, file: !963, line: 170, baseType: !262, size: 64, offset: 256)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !962, file: !963, line: 171, baseType: !328, size: 64, offset: 320)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !962, file: !963, line: 172, baseType: !260, size: 32, offset: 384)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !962, file: !963, line: 176, baseType: !982, size: 64, offset: 448)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!967, !264, !328}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !962, file: !963, line: 177, baseType: !986, size: 64, offset: 512)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{null, !264, !967}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !962, file: !963, line: 178, baseType: !264, size: 64, offset: 576)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !962, file: !963, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !962, file: !963, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !962, file: !963, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !846, file: !470, line: 60, baseType: !925, size: 128, offset: 384)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !846, file: !470, line: 64, baseType: !995, size: 64, offset: 512)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !997, line: 33, flags: DIFlagFwdDecl)
!997 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!998 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !846, file: !470, line: 67, baseType: !272, size: 64, offset: 576)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !846, file: !470, line: 73, baseType: !849, size: 64, offset: 640)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !846, file: !470, line: 77, baseType: !935, size: 64, offset: 704)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !846, file: !470, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !846, file: !470, line: 82, baseType: !1003, size: 320, offset: 832)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !599, line: 62, size: 320, elements: !1004)
!1004 = !{!1005, !1011, !1012, !1013, !1014, !1015}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1003, file: !599, line: 63, baseType: !1006, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !599, line: 56, size: 128, elements: !1008)
!1008 = !{!1009, !1010}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1007, file: !599, line: 57, baseType: !1006, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1007, file: !599, line: 58, baseType: !354, size: 8, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1003, file: !599, line: 64, baseType: !7, size: 32, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1003, file: !599, line: 66, baseType: !7, size: 32, offset: 96)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1003, file: !599, line: 68, baseType: !259, size: 8, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1003, file: !599, line: 70, baseType: !597, size: 64, offset: 192)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1003, file: !599, line: 71, baseType: !605, size: 64, offset: 256)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !519, file: !520, line: 476, baseType: !1017, size: 64, offset: 256)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !520, line: 476, flags: DIFlagFwdDecl)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !519, file: !520, line: 479, baseType: !849, size: 64, offset: 320)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !519, file: !520, line: 484, baseType: !272, size: 64, offset: 384)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !519, file: !520, line: 488, baseType: !272, size: 64, offset: 448)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !519, file: !520, line: 493, baseType: !272, size: 64, offset: 512)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !519, file: !520, line: 496, baseType: !272, size: 64, offset: 576)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !519, file: !520, line: 501, baseType: !1025, size: 64, offset: 640)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !213, line: 2355, size: 576, elements: !1027)
!1027 = !{!1028, !1031, !1032, !1033, !1034, !1036, !1037, !1042, !1043, !1044, !1045, !1046, !1047}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1026, file: !213, line: 2356, baseType: !1029, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !213, line: 2356, flags: DIFlagFwdDecl)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1026, file: !213, line: 2357, baseType: !265, size: 64, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1026, file: !213, line: 2358, baseType: !260, size: 32, offset: 128)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1026, file: !213, line: 2359, baseType: !260, size: 32, offset: 160)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1026, file: !213, line: 2360, baseType: !1035, size: 128, offset: 192)
!1035 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 128, elements: !974)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1026, file: !213, line: 2364, baseType: !260, size: 32, offset: 320)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1026, file: !213, line: 2367, baseType: !1038, size: 128, offset: 384)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !213, line: 2349, size: 128, elements: !1039)
!1039 = !{!1040, !1041}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1038, file: !213, line: 2351, baseType: !431, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1038, file: !213, line: 2352, baseType: !328, size: 64, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1026, file: !213, line: 2371, baseType: !212, size: 32, offset: 512)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1026, file: !213, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1026, file: !213, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1026, file: !213, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1026, file: !213, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1026, file: !213, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !519, file: !520, line: 504, baseType: !1049, size: 64, offset: 704)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !520, line: 504, flags: DIFlagFwdDecl)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !519, file: !520, line: 507, baseType: !849, size: 64, offset: 768)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !519, file: !520, line: 510, baseType: !260, size: 32, offset: 832)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !519, file: !520, line: 513, baseType: !260, size: 32, offset: 864)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !519, file: !520, line: 516, baseType: !381, size: 32, offset: 896)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !519, file: !520, line: 519, baseType: !381, size: 32, offset: 928)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !519, file: !520, line: 522, baseType: !7, size: 32, offset: 960)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !519, file: !520, line: 523, baseType: !7, size: 32, offset: 992)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !519, file: !520, line: 528, baseType: !265, size: 64, offset: 1024)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !519, file: !520, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !519, file: !520, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !519, file: !520, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !519, file: !520, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !519, file: !520, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !519, file: !520, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
