; ModuleID = 'web.bc'
source_filename = "web.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtl_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }

!640 = !DIEnumerator(name: "TV_CGRAPH_VERIFY", value: 110, isUnsigned: true)
!641 = !DIEnumerator(name: "TV_DOM_FRONTIERS", value: 111, isUnsigned: true)
!642 = !DIEnumerator(name: "TV_DOMINANCE", value: 112, isUnsigned: true)
!643 = !DIEnumerator(name: "TV_CONTROL_DEPENDENCES", value: 113, isUnsigned: true)
!644 = !DIEnumerator(name: "TV_OVERLOAD", value: 114, isUnsigned: true)
!645 = !DIEnumerator(name: "TV_TEMPLATE_INSTANTIATION", value: 115, isUnsigned: true)
!646 = !DIEnumerator(name: "TV_EXPAND", value: 116, isUnsigned: true)
!647 = !DIEnumerator(name: "TV_VARCONST", value: 117, isUnsigned: true)
!648 = !DIEnumerator(name: "TV_LOWER_SUBREG", value: 118, isUnsigned: true)
!649 = !DIEnumerator(name: "TV_JUMP", value: 119, isUnsigned: true)
!650 = !DIEnumerator(name: "TV_FWPROP", value: 120, isUnsigned: true)
!651 = !DIEnumerator(name: "TV_CSE", value: 121, isUnsigned: true)
!652 = !DIEnumerator(name: "TV_DCE", value: 122, isUnsigned: true)
!653 = !DIEnumerator(name: "TV_DSE1", value: 123, isUnsigned: true)
!654 = !DIEnumerator(name: "TV_DSE2", value: 124, isUnsigned: true)
!655 = !DIEnumerator(name: "TV_LOOP", value: 125, isUnsigned: true)
!656 = !DIEnumerator(name: "TV_LOOP_MOVE_INVARIANTS", value: 126, isUnsigned: true)
!657 = !DIEnumerator(name: "TV_LOOP_UNSWITCH", value: 127, isUnsigned: true)
!658 = !DIEnumerator(name: "TV_LOOP_UNROLL", value: 128, isUnsigned: true)
!659 = !DIEnumerator(name: "TV_LOOP_DOLOOP", value: 129, isUnsigned: true)
!660 = !DIEnumerator(name: "TV_CPROP", value: 130, isUnsigned: true)
!661 = !DIEnumerator(name: "TV_PRE", value: 131, isUnsigned: true)
!662 = !DIEnumerator(name: "TV_HOIST", value: 132, isUnsigned: true)
!663 = !DIEnumerator(name: "TV_LSM", value: 133, isUnsigned: true)
!664 = !DIEnumerator(name: "TV_TRACER", value: 134, isUnsigned: true)
!665 = !DIEnumerator(name: "TV_WEB", value: 135, isUnsigned: true)
!666 = !DIEnumerator(name: "TV_AUTO_INC_DEC", value: 136, isUnsigned: true)
!667 = !DIEnumerator(name: "TV_CSE2", value: 137, isUnsigned: true)
!668 = !DIEnumerator(name: "TV_BRANCH_PROB", value: 138, isUnsigned: true)
!669 = !DIEnumerator(name: "TV_VPT", value: 139, isUnsigned: true)
!670 = !DIEnumerator(name: "TV_COMBINE", value: 140, isUnsigned: true)
!671 = !DIEnumerator(name: "TV_IFCVT", value: 141, isUnsigned: true)
!672 = !DIEnumerator(name: "TV_REGMOVE", value: 142, isUnsigned: true)
!673 = !DIEnumerator(name: "TV_MODE_SWITCH", value: 143, isUnsigned: true)
!674 = !DIEnumerator(name: "TV_SMS", value: 144, isUnsigned: true)
!675 = !DIEnumerator(name: "TV_SCHED", value: 145, isUnsigned: true)
!676 = !DIEnumerator(name: "TV_LOCAL_ALLOC", value: 146, isUnsigned: true)
!677 = !DIEnumerator(name: "TV_GLOBAL_ALLOC", value: 147, isUnsigned: true)
!678 = !DIEnumerator(name: "TV_IRA", value: 148, isUnsigned: true)
!679 = !DIEnumerator(name: "TV_RELOAD", value: 149, isUnsigned: true)
!680 = !DIEnumerator(name: "TV_RELOAD_CSE_REGS", value: 150, isUnsigned: true)
!681 = !DIEnumerator(name: "TV_SEQABSTR", value: 151, isUnsigned: true)
!682 = !DIEnumerator(name: "TV_GCSE_AFTER_RELOAD", value: 152, isUnsigned: true)
!683 = !DIEnumerator(name: "TV_THREAD_PROLOGUE_AND_EPILOGUE", value: 153, isUnsigned: true)
!684 = !DIEnumerator(name: "TV_IFCVT2", value: 154, isUnsigned: true)
!685 = !DIEnumerator(name: "TV_COMBINE_STACK_ADJUST", value: 155, isUnsigned: true)
!686 = !DIEnumerator(name: "TV_PEEPHOLE2", value: 156, isUnsigned: true)
!687 = !DIEnumerator(name: "TV_RENAME_REGISTERS", value: 157, isUnsigned: true)
!688 = !DIEnumerator(name: "TV_CPROP_REGISTERS", value: 158, isUnsigned: true)
!689 = !DIEnumerator(name: "TV_SCHED2", value: 159, isUnsigned: true)
!690 = !DIEnumerator(name: "TV_MACH_DEP", value: 160, isUnsigned: true)
!691 = !DIEnumerator(name: "TV_DBR_SCHED", value: 161, isUnsigned: true)
!692 = !DIEnumerator(name: "TV_REORDER_BLOCKS", value: 162, isUnsigned: true)
!693 = !DIEnumerator(name: "TV_SHORTEN_BRANCH", value: 163, isUnsigned: true)
!694 = !DIEnumerator(name: "TV_REG_STACK", value: 164, isUnsigned: true)
!695 = !DIEnumerator(name: "TV_FINAL", value: 165, isUnsigned: true)
!696 = !DIEnumerator(name: "TV_SYMOUT", value: 166, isUnsigned: true)
!697 = !DIEnumerator(name: "TV_VAR_TRACKING", value: 167, isUnsigned: true)
!698 = !DIEnumerator(name: "TV_TREE_IFCOMBINE", value: 168, isUnsigned: true)
!699 = !DIEnumerator(name: "TV_PLUGIN_INIT", value: 169, isUnsigned: true)
!700 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!701 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!702 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!703 = !{!704, !705, !706, !707, !710, !711, !377, !713, !1783, !1790, !5}
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!706 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !709)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !714, line: 50, baseType: !715)
!714 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !378, line: 240, size: 384, elements: !717)
!717 = !{!718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !716, file: !378, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !716, file: !378, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !716, file: !378, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !716, file: !378, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !716, file: !378, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !716, file: !378, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !716, file: !378, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !716, file: !378, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !716, file: !378, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !716, file: !378, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !716, file: !378, line: 321, baseType: !729, size: 320, offset: 64)
!729 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !378, line: 315, size: 320, elements: !730)
!730 = !{!731, !1718, !1720, !1781, !1782}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !729, file: !378, line: 316, baseType: !732, size: 64)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !733, size: 64, elements: !748)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !378, line: 183, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !378, line: 166, size: 64, elements: !735)
!735 = !{!736, !737, !738, !739, !740, !750, !751, !763, !766, !828, !1696, !1697, !1708, !1715}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !734, file: !378, line: 168, baseType: !706, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !734, file: !378, line: 169, baseType: !7, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !734, file: !378, line: 170, baseType: !711, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !734, file: !378, line: 171, baseType: !713, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !734, file: !378, line: 172, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !714, line: 53, baseType: !742)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !378, line: 359, size: 128, elements: !744)
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !743, file: !378, line: 360, baseType: !706, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !743, file: !378, line: 361, baseType: !747, size: 64, offset: 64)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !713, size: 64, elements: !748)
!748 = !{!749}
!749 = !DISubrange(count: 1)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !734, file: !378, line: 173, baseType: !5, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !734, file: !378, line: 174, baseType: !752, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !378, line: 133, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 115, size: 32, elements: !754)
!754 = !{!755, !756, !757, !758, !759, !760, !761, !762}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !753, file: !378, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !753, file: !378, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !753, file: !378, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !753, file: !378, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !753, file: !378, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !753, file: !378, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !753, file: !378, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !753, file: !378, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !734, file: !378, line: 175, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !378, line: 175, flags: DIFlagFwdDecl)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !734, file: !378, line: 176, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !769, line: 75, size: 256, elements: !770)
!769 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!770 = !{!771, !786, !787, !788}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !768, file: !769, line: 76, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !769, line: 68, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !769, line: 63, size: 320, elements: !775)
!775 = !{!776, !778, !779, !780}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !774, file: !769, line: 64, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !774, file: !769, line: 65, baseType: !777, size: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !774, file: !769, line: 66, baseType: !7, size: 32, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !774, file: !769, line: 67, baseType: !781, size: 128, offset: 192)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !782, size: 128, elements: !784)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !769, line: 29, baseType: !783)
!783 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!784 = !{!785}
!785 = !DISubrange(count: 2)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !768, file: !769, line: 77, baseType: !772, size: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !768, file: !769, line: 78, baseType: !7, size: 32, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !768, file: !769, line: 79, baseType: !789, size: 64, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !769, line: 49, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !769, line: 45, size: 832, elements: !792)
!792 = !{!793, !794, !795}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !791, file: !769, line: 46, baseType: !777, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !791, file: !769, line: 47, baseType: !767, size: 64, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !791, file: !769, line: 48, baseType: !796, size: 704, offset: 128)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !797, line: 164, size: 704, elements: !798)
!797 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!798 = !{!799, !801, !811, !812, !813, !814, !815, !816, !820, !824, !825, !826, !827}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !796, file: !797, line: 166, baseType: !800, size: 64)
!800 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !796, file: !797, line: 167, baseType: !802, size: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !797, line: 157, size: 192, elements: !804)
!804 = !{!805, !806, !807}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !803, file: !797, line: 159, baseType: !708, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !803, file: !797, line: 160, baseType: !802, size: 64, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !803, file: !797, line: 161, baseType: !808, size: 32, offset: 128)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !709, size: 32, elements: !809)
!809 = !{!810}
!810 = !DISubrange(count: 4)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !796, file: !797, line: 168, baseType: !708, size: 64, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !796, file: !797, line: 169, baseType: !708, size: 64, offset: 192)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !796, file: !797, line: 170, baseType: !708, size: 64, offset: 256)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !796, file: !797, line: 171, baseType: !800, size: 64, offset: 320)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !796, file: !797, line: 172, baseType: !706, size: 32, offset: 384)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !796, file: !797, line: 176, baseType: !817, size: 64, offset: 448)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{!802, !710, !800}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !796, file: !797, line: 177, baseType: !821, size: 64, offset: 512)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{null, !710, !802}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !796, file: !797, line: 178, baseType: !710, size: 64, offset: 576)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !796, file: !797, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !796, file: !797, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !796, file: !797, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !734, file: !378, line: 177, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !714, line: 56, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !151, line: 3371, size: 1792, elements: !832)
!832 = !{!833, !866, !872, !883, !902, !913, !918, !925, !931, !944, !956, !994, !999, !1027, !1035, !1036, !1041, !1050, !1056, !1061, !1065, !1069, !1320, !1369, !1375, !1382, !1389, !1415, !1440, !1457, !1469, !1491, !1506, !1678}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !831, file: !151, line: 3372, baseType: !834, size: 64)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !151, line: 360, size: 64, elements: !835)
!835 = !{!836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !834, file: !151, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !834, file: !151, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !834, file: !151, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !834, file: !151, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !834, file: !151, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !834, file: !151, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !834, file: !151, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !834, file: !151, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !834, file: !151, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !834, file: !151, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !834, file: !151, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !834, file: !151, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !834, file: !151, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !834, file: !151, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !834, file: !151, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !834, file: !151, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !834, file: !151, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !834, file: !151, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !834, file: !151, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !834, file: !151, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !834, file: !151, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !834, file: !151, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !834, file: !151, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !834, file: !151, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !834, file: !151, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !834, file: !151, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !834, file: !151, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !834, file: !151, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !834, file: !151, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !834, file: !151, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !831, file: !151, line: 3373, baseType: !867, size: 192)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !151, line: 402, size: 192, elements: !868)
!868 = !{!869, !870, !871}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !867, file: !151, line: 403, baseType: !834, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !867, file: !151, line: 404, baseType: !829, size: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !867, file: !151, line: 405, baseType: !829, size: 64, offset: 128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !831, file: !151, line: 3374, baseType: !873, size: 320)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !151, line: 1384, size: 320, elements: !874)
!874 = !{!875, !876}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !873, file: !151, line: 1385, baseType: !867, size: 192)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !873, file: !151, line: 1386, baseType: !877, size: 128, offset: 192)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !878, line: 58, baseType: !879)
!878 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !878, line: 54, size: 128, elements: !880)
!880 = !{!881, !882}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !879, file: !878, line: 56, baseType: !783, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !879, file: !878, line: 57, baseType: !800, size: 64, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !831, file: !151, line: 3375, baseType: !884, size: 256)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !151, line: 1397, size: 256, elements: !885)
!885 = !{!886, !887}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !884, file: !151, line: 1398, baseType: !867, size: 192)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !884, file: !151, line: 1399, baseType: !888, size: 64, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !890, line: 52, size: 256, elements: !891)
!890 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!891 = !{!892, !893, !894, !895, !896, !897, !898}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !889, file: !890, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !889, file: !890, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !889, file: !890, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !889, file: !890, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !889, file: !890, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !889, file: !890, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !889, file: !890, line: 62, baseType: !899, size: 192, offset: 64)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !783, size: 192, elements: !900)
!900 = !{!901}
!901 = !DISubrange(count: 3)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !831, file: !151, line: 3376, baseType: !903, size: 256)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !151, line: 1408, size: 256, elements: !904)
!904 = !{!905, !906}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !903, file: !151, line: 1409, baseType: !867, size: 192)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !903, file: !151, line: 1410, baseType: !907, size: 64, offset: 192)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !909, line: 27, size: 192, elements: !910)
!909 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!910 = !{!911, !912}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !908, file: !909, line: 29, baseType: !877, size: 128)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !908, file: !909, line: 30, baseType: !5, size: 32, offset: 128)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !831, file: !151, line: 3377, baseType: !914, size: 256)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !151, line: 1437, size: 256, elements: !915)
!915 = !{!916, !917}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !914, file: !151, line: 1438, baseType: !867, size: 192)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !914, file: !151, line: 1439, baseType: !829, size: 64, offset: 192)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !831, file: !151, line: 3378, baseType: !919, size: 256)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !151, line: 1418, size: 256, elements: !920)
!920 = !{!921, !922, !923}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !919, file: !151, line: 1419, baseType: !867, size: 192)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !919, file: !151, line: 1420, baseType: !706, size: 32, offset: 192)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !919, file: !151, line: 1421, baseType: !924, size: 8, offset: 224)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !709, size: 8, elements: !748)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !831, file: !151, line: 3379, baseType: !926, size: 320)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !151, line: 1428, size: 320, elements: !927)
!927 = !{!928, !929, !930}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !926, file: !151, line: 1429, baseType: !867, size: 192)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !926, file: !151, line: 1430, baseType: !829, size: 64, offset: 192)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !926, file: !151, line: 1431, baseType: !829, size: 64, offset: 256)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !831, file: !151, line: 3380, baseType: !932, size: 320)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !151, line: 1460, size: 320, elements: !933)
!933 = !{!934, !935}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !932, file: !151, line: 1461, baseType: !867, size: 192)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !932, file: !151, line: 1462, baseType: !936, size: 128, offset: 192)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !937, line: 31, size: 128, elements: !938)
!937 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!938 = !{!939, !942, !943}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !936, file: !937, line: 32, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !705)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !936, file: !937, line: 33, baseType: !7, size: 32, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !936, file: !937, line: 34, baseType: !7, size: 32, offset: 96)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !831, file: !151, line: 3381, baseType: !945, size: 384)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !151, line: 2507, size: 384, elements: !946)
!946 = !{!947, !948, !953, !954, !955}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !945, file: !151, line: 2508, baseType: !867, size: 192)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !945, file: !151, line: 2509, baseType: !949, size: 32, offset: 192)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !950, line: 58, baseType: !951)
!950 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !952, line: 44, baseType: !7)
!952 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!953 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !945, file: !151, line: 2510, baseType: !7, size: 32, offset: 224)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !945, file: !151, line: 2511, baseType: !829, size: 64, offset: 256)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !945, file: !151, line: 2512, baseType: !829, size: 64, offset: 320)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !831, file: !151, line: 3382, baseType: !957, size: 896)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !151, line: 2652, size: 896, elements: !958)
!958 = !{!959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !957, file: !151, line: 2653, baseType: !945, size: 384)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !957, file: !151, line: 2654, baseType: !829, size: 64, offset: 384)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !957, file: !151, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !957, file: !151, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !957, file: !151, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !957, file: !151, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !957, file: !151, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !957, file: !151, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !957, file: !151, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !957, file: !151, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !957, file: !151, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !957, file: !151, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !957, file: !151, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !957, file: !151, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !957, file: !151, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !957, file: !151, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !957, file: !151, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !957, file: !151, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !957, file: !151, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !957, file: !151, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !957, file: !151, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !957, file: !151, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !957, file: !151, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !957, file: !151, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !957, file: !151, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !957, file: !151, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !957, file: !151, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !957, file: !151, line: 2703, baseType: !7, size: 32, offset: 512)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !957, file: !151, line: 2705, baseType: !829, size: 64, offset: 576)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !957, file: !151, line: 2706, baseType: !829, size: 64, offset: 640)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !957, file: !151, line: 2707, baseType: !829, size: 64, offset: 704)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !957, file: !151, line: 2708, baseType: !829, size: 64, offset: 768)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !957, file: !151, line: 2711, baseType: !992, size: 64, offset: 832)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !151, line: 2711, flags: DIFlagFwdDecl)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !831, file: !151, line: 3383, baseType: !995, size: 960)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !151, line: 2756, size: 960, elements: !996)
!996 = !{!997, !998}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !995, file: !151, line: 2757, baseType: !957, size: 896)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !995, file: !151, line: 2758, baseType: !713, size: 64, offset: 896)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !831, file: !151, line: 3384, baseType: !1000, size: 1472)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !151, line: 3114, size: 1472, elements: !1001)
!1001 = !{!1002, !1023, !1024, !1025, !1026}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1000, file: !151, line: 3115, baseType: !1003, size: 1216)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !151, line: 2984, size: 1216, elements: !1004)
!1004 = !{!1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1003, file: !151, line: 2985, baseType: !995, size: 960)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1003, file: !151, line: 2986, baseType: !829, size: 64, offset: 960)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1003, file: !151, line: 2987, baseType: !829, size: 64, offset: 1024)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1003, file: !151, line: 2988, baseType: !829, size: 64, offset: 1088)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1003, file: !151, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1003, file: !151, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1003, file: !151, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1003, file: !151, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1003, file: !151, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1003, file: !151, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1003, file: !151, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1003, file: !151, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1003, file: !151, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1003, file: !151, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1003, file: !151, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1003, file: !151, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1003, file: !151, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1003, file: !151, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1000, file: !151, line: 3117, baseType: !829, size: 64, offset: 1216)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1000, file: !151, line: 3119, baseType: !829, size: 64, offset: 1280)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1000, file: !151, line: 3121, baseType: !829, size: 64, offset: 1344)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1000, file: !151, line: 3123, baseType: !829, size: 64, offset: 1408)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !831, file: !151, line: 3385, baseType: !1028, size: 1088)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !151, line: 2874, size: 1088, elements: !1029)
!1029 = !{!1030, !1031, !1032}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1028, file: !151, line: 2875, baseType: !995, size: 960)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1028, file: !151, line: 2876, baseType: !713, size: 64, offset: 960)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1028, file: !151, line: 2877, baseType: !1033, size: 64, offset: 1024)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !151, line: 2856, flags: DIFlagFwdDecl)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !831, file: !151, line: 3386, baseType: !1003, size: 1216)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !831, file: !151, line: 3387, baseType: !1037, size: 1280)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !151, line: 3093, size: 1280, elements: !1038)
!1038 = !{!1039, !1040}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1037, file: !151, line: 3094, baseType: !1003, size: 1216)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1037, file: !151, line: 3095, baseType: !1033, size: 64, offset: 1216)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !831, file: !151, line: 3388, baseType: !1042, size: 1216)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !151, line: 2824, size: 1216, elements: !1043)
!1043 = !{!1044, !1045, !1046, !1047, !1048, !1049}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1042, file: !151, line: 2825, baseType: !957, size: 896)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1042, file: !151, line: 2827, baseType: !829, size: 64, offset: 896)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1042, file: !151, line: 2828, baseType: !829, size: 64, offset: 960)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1042, file: !151, line: 2829, baseType: !829, size: 64, offset: 1024)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1042, file: !151, line: 2830, baseType: !829, size: 64, offset: 1088)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1042, file: !151, line: 2831, baseType: !829, size: 64, offset: 1152)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !831, file: !151, line: 3389, baseType: !1051, size: 1024)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !151, line: 2850, size: 1024, elements: !1052)
!1052 = !{!1053, !1054, !1055}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1051, file: !151, line: 2851, baseType: !995, size: 960)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1051, file: !151, line: 2852, baseType: !706, size: 32, offset: 960)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1051, file: !151, line: 2853, baseType: !706, size: 32, offset: 992)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !831, file: !151, line: 3390, baseType: !1057, size: 1024)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !151, line: 2857, size: 1024, elements: !1058)
!1058 = !{!1059, !1060}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1057, file: !151, line: 2858, baseType: !995, size: 960)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1057, file: !151, line: 2859, baseType: !1033, size: 64, offset: 960)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !831, file: !151, line: 3391, baseType: !1062, size: 960)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !151, line: 2862, size: 960, elements: !1063)
!1063 = !{!1064}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1062, file: !151, line: 2863, baseType: !995, size: 960)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !831, file: !151, line: 3392, baseType: !1066, size: 1472)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !151, line: 3304, size: 1472, elements: !1067)
!1067 = !{!1068}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1066, file: !151, line: 3305, baseType: !1000, size: 1472)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !831, file: !151, line: 3393, baseType: !1070, size: 1792)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !151, line: 3248, size: 1792, elements: !1071)
!1071 = !{!1072, !1073, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1070, file: !151, line: 3249, baseType: !1000, size: 1472)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1070, file: !151, line: 3251, baseType: !1074, size: 64, offset: 1472)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1076, line: 463, size: 1152, elements: !1077)
!1076 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1077 = !{!1078, !1081, !1185, !1186, !1189, !1192, !1244, !1245, !1246, !1247, !1248, !1272, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1075, file: !1076, line: 464, baseType: !1079, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1076, line: 464, flags: DIFlagFwdDecl)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1075, file: !1076, line: 467, baseType: !1082, size: 64, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !1084)
!1084 = !{!1085, !1160, !1161, !1174, !1175, !1176, !1177, !1178, !1179, !1181, !1183, !1184}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1083, file: !135, line: 377, baseType: !1086, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !714, line: 111, baseType: !1087)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !1089)
!1089 = !{!1090, !1125, !1126, !1127, !1130, !1134, !1135, !1136, !1154, !1155, !1156, !1157, !1158, !1159}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1088, file: !135, line: 219, baseType: !1091, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !1093)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !1094)
!1094 = !{!1095}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1093, file: !135, line: 151, baseType: !1096, size: 128)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !1097)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !1098)
!1098 = !{!1099, !1100, !1101}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1097, file: !135, line: 150, baseType: !7, size: 32)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1097, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1097, file: !135, line: 150, baseType: !1102, size: 64, offset: 64)
!1102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1103, size: 64, elements: !748)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !714, line: 108, baseType: !1104)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !1106)
!1106 = !{!1107, !1108, !1109, !1117, !1118, !1119, !1120, !1121, !1122, !1123}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1105, file: !135, line: 124, baseType: !1087, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1105, file: !135, line: 125, baseType: !1087, size: 64, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1105, file: !135, line: 131, baseType: !1110, size: 64, offset: 128)
!1110 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !1111)
!1111 = !{!1112, !1116}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1110, file: !135, line: 129, baseType: !1113, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !714, line: 66, baseType: !1114)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !714, line: 65, flags: DIFlagFwdDecl)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1110, file: !135, line: 130, baseType: !713, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1105, file: !135, line: 134, baseType: !710, size: 64, offset: 192)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1105, file: !135, line: 137, baseType: !829, size: 64, offset: 256)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1105, file: !135, line: 138, baseType: !949, size: 32, offset: 320)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1105, file: !135, line: 142, baseType: !7, size: 32, offset: 352)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1105, file: !135, line: 144, baseType: !706, size: 32, offset: 384)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1105, file: !135, line: 145, baseType: !706, size: 32, offset: 416)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1105, file: !135, line: 146, baseType: !1124, size: 64, offset: 448)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !135, line: 119, baseType: !800)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1088, file: !135, line: 220, baseType: !1091, size: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1088, file: !135, line: 223, baseType: !710, size: 64, offset: 128)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1088, file: !135, line: 226, baseType: !1128, size: 64, offset: 192)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !135, line: 185, flags: DIFlagFwdDecl)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1088, file: !135, line: 229, baseType: !1131, size: 128, offset: 256)
!1131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1132, size: 128, elements: !784)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !135, line: 229, flags: DIFlagFwdDecl)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1088, file: !135, line: 232, baseType: !1087, size: 64, offset: 384)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1088, file: !135, line: 233, baseType: !1087, size: 64, offset: 448)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1088, file: !135, line: 238, baseType: !1137, size: 64, offset: 512)
!1137 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !135, line: 235, size: 64, elements: !1138)
!1138 = !{!1139, !1145}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1137, file: !135, line: 236, baseType: !1140, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !135, line: 273, size: 128, elements: !1142)
!1142 = !{!1143, !1144}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1141, file: !135, line: 275, baseType: !1113, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1141, file: !135, line: 278, baseType: !1113, size: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1137, file: !135, line: 237, baseType: !1146, size: 64)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !135, line: 259, size: 320, elements: !1148)
!1148 = !{!1149, !1150, !1151, !1152, !1153}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1147, file: !135, line: 261, baseType: !713, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1147, file: !135, line: 262, baseType: !713, size: 64, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1147, file: !135, line: 266, baseType: !713, size: 64, offset: 128)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1147, file: !135, line: 267, baseType: !713, size: 64, offset: 192)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1147, file: !135, line: 270, baseType: !706, size: 32, offset: 256)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1088, file: !135, line: 241, baseType: !1124, size: 64, offset: 576)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1088, file: !135, line: 244, baseType: !706, size: 32, offset: 640)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1088, file: !135, line: 247, baseType: !706, size: 32, offset: 672)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1088, file: !135, line: 250, baseType: !706, size: 32, offset: 704)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1088, file: !135, line: 253, baseType: !706, size: 32, offset: 736)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1088, file: !135, line: 256, baseType: !706, size: 32, offset: 768)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1083, file: !135, line: 378, baseType: !1086, size: 64, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1083, file: !135, line: 381, baseType: !1162, size: 64, offset: 128)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !1164)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !1165)
!1165 = !{!1166}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1164, file: !135, line: 282, baseType: !1167, size: 128)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !1168)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !1169)
!1169 = !{!1170, !1171, !1172}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1168, file: !135, line: 281, baseType: !7, size: 32)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1168, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1168, file: !135, line: 281, baseType: !1173, size: 64, offset: 64)
!1173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1086, size: 64, elements: !748)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1083, file: !135, line: 384, baseType: !706, size: 32, offset: 192)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1083, file: !135, line: 387, baseType: !706, size: 32, offset: 224)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1083, file: !135, line: 390, baseType: !706, size: 32, offset: 256)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1083, file: !135, line: 394, baseType: !1162, size: 64, offset: 320)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1083, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1083, file: !135, line: 399, baseType: !1180, size: 64, offset: 416)
!1180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !784)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1083, file: !135, line: 402, baseType: !1182, size: 64, offset: 480)
!1182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !784)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1083, file: !135, line: 406, baseType: !706, size: 32, offset: 544)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1083, file: !135, line: 409, baseType: !706, size: 32, offset: 576)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1075, file: !1076, line: 470, baseType: !1114, size: 64, offset: 128)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1075, file: !1076, line: 473, baseType: !1187, size: 64, offset: 192)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1076, line: 166, flags: DIFlagFwdDecl)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1075, file: !1076, line: 476, baseType: !1190, size: 64, offset: 256)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1076, line: 476, flags: DIFlagFwdDecl)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1075, file: !1076, line: 479, baseType: !1193, size: 64, offset: 320)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1194, line: 144, baseType: !1195)
!1194 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1194, line: 100, size: 896, elements: !1197)
!1197 = !{!1198, !1206, !1211, !1216, !1218, !1221, !1222, !1223, !1224, !1225, !1230, !1232, !1233, !1238, !1243}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1196, file: !1194, line: 102, baseType: !1199, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1194, line: 52, baseType: !1200)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!1203, !1204}
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1194, line: 47, baseType: !7)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1196, file: !1194, line: 105, baseType: !1207, size: 64, offset: 64)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1194, line: 59, baseType: !1208)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!706, !1204, !1204}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1196, file: !1194, line: 108, baseType: !1212, size: 64, offset: 128)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1194, line: 63, baseType: !1213)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = !DISubroutineType(types: !1215)
!1215 = !{null, !710}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1196, file: !1194, line: 111, baseType: !1217, size: 64, offset: 192)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1196, file: !1194, line: 114, baseType: !1219, size: 64, offset: 256)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1220, line: 46, baseType: !783)
!1220 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1196, file: !1194, line: 117, baseType: !1219, size: 64, offset: 320)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1196, file: !1194, line: 120, baseType: !1219, size: 64, offset: 384)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1196, file: !1194, line: 124, baseType: !7, size: 32, offset: 448)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1196, file: !1194, line: 128, baseType: !7, size: 32, offset: 480)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1196, file: !1194, line: 131, baseType: !1226, size: 64, offset: 512)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1194, line: 75, baseType: !1227)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!710, !1219, !1219}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1196, file: !1194, line: 132, baseType: !1231, size: 64, offset: 576)
!1231 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1194, line: 78, baseType: !1213)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1196, file: !1194, line: 135, baseType: !710, size: 64, offset: 640)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1196, file: !1194, line: 136, baseType: !1234, size: 64, offset: 704)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1194, line: 82, baseType: !1235)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!710, !710, !1219, !1219}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1196, file: !1194, line: 137, baseType: !1239, size: 64, offset: 768)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1194, line: 83, baseType: !1240)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{null, !710, !710}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1196, file: !1194, line: 141, baseType: !7, size: 32, offset: 832)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1075, file: !1076, line: 484, baseType: !829, size: 64, offset: 384)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1075, file: !1076, line: 488, baseType: !829, size: 64, offset: 448)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1075, file: !1076, line: 493, baseType: !829, size: 64, offset: 512)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1075, file: !1076, line: 496, baseType: !829, size: 64, offset: 576)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1075, file: !1076, line: 501, baseType: !1249, size: 64, offset: 640)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !146, line: 2355, size: 576, elements: !1251)
!1251 = !{!1252, !1255, !1256, !1257, !1258, !1260, !1261, !1266, !1267, !1268, !1269, !1270, !1271}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1250, file: !146, line: 2356, baseType: !1253, size: 64)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64)
!1254 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !146, line: 2356, flags: DIFlagFwdDecl)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1250, file: !146, line: 2357, baseType: !711, size: 64, offset: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1250, file: !146, line: 2358, baseType: !706, size: 32, offset: 128)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1250, file: !146, line: 2359, baseType: !706, size: 32, offset: 160)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1250, file: !146, line: 2360, baseType: !1259, size: 128, offset: 192)
!1259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !706, size: 128, elements: !809)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1250, file: !146, line: 2364, baseType: !706, size: 32, offset: 320)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1250, file: !146, line: 2367, baseType: !1262, size: 128, offset: 384)
!1262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !146, line: 2349, size: 128, elements: !1263)
!1263 = !{!1264, !1265}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1262, file: !146, line: 2351, baseType: !713, size: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1262, file: !146, line: 2352, baseType: !800, size: 64, offset: 64)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1250, file: !146, line: 2371, baseType: !145, size: 32, offset: 512)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1250, file: !146, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1250, file: !146, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1250, file: !146, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1250, file: !146, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1250, file: !146, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1075, file: !1076, line: 504, baseType: !1273, size: 64, offset: 704)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1274 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1076, line: 504, flags: DIFlagFwdDecl)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1075, file: !1076, line: 507, baseType: !1193, size: 64, offset: 768)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1075, file: !1076, line: 510, baseType: !706, size: 32, offset: 832)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1075, file: !1076, line: 513, baseType: !706, size: 32, offset: 864)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1075, file: !1076, line: 516, baseType: !949, size: 32, offset: 896)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1075, file: !1076, line: 519, baseType: !949, size: 32, offset: 928)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1075, file: !1076, line: 522, baseType: !7, size: 32, offset: 960)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1075, file: !1076, line: 523, baseType: !7, size: 32, offset: 992)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1075, file: !1076, line: 528, baseType: !711, size: 64, offset: 1024)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1075, file: !1076, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1075, file: !1076, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1075, file: !1076, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1075, file: !1076, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1075, file: !1076, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1075, file: !1076, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1075, file: !1076, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1075, file: !1076, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1075, file: !1076, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1075, file: !1076, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1075, file: !1076, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1075, file: !1076, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1075, file: !1076, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1075, file: !1076, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1075, file: !1076, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1075, file: !1076, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1070, file: !151, line: 3254, baseType: !829, size: 64, offset: 1536)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1070, file: !151, line: 3257, baseType: !829, size: 64, offset: 1600)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1070, file: !151, line: 3258, baseType: !829, size: 64, offset: 1664)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1070, file: !151, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1070, file: !151, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1070, file: !151, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1070, file: !151, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1070, file: !151, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1070, file: !151, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1070, file: !151, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1070, file: !151, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1070, file: !151, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1070, file: !151, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1070, file: !151, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1070, file: !151, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1070, file: !151, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1070, file: !151, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1070, file: !151, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1070, file: !151, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1070, file: !151, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1070, file: !151, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !831, file: !151, line: 3394, baseType: !1321, size: 1344)
!1321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !151, line: 2279, size: 1344, elements: !1322)
!1322 = !{!1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1348, !1349, !1350, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1321, file: !151, line: 2280, baseType: !867, size: 192)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1321, file: !151, line: 2281, baseType: !829, size: 64, offset: 192)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1321, file: !151, line: 2282, baseType: !829, size: 64, offset: 256)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1321, file: !151, line: 2283, baseType: !829, size: 64, offset: 320)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1321, file: !151, line: 2284, baseType: !829, size: 64, offset: 384)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1321, file: !151, line: 2285, baseType: !7, size: 32, offset: 448)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1321, file: !151, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1321, file: !151, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1321, file: !151, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1321, file: !151, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1321, file: !151, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1321, file: !151, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1321, file: !151, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1321, file: !151, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1321, file: !151, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1321, file: !151, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1321, file: !151, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1321, file: !151, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1321, file: !151, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1321, file: !151, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1321, file: !151, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1321, file: !151, line: 2305, baseType: !7, size: 32, offset: 512)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1321, file: !151, line: 2306, baseType: !1346, size: 32, offset: 544)
!1346 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1347, line: 31, baseType: !706)
!1347 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1321, file: !151, line: 2307, baseType: !829, size: 64, offset: 576)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1321, file: !151, line: 2308, baseType: !829, size: 64, offset: 640)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1321, file: !151, line: 2314, baseType: !1351, size: 64, offset: 704)
!1351 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !151, line: 2309, size: 64, elements: !1352)
!1352 = !{!1353, !1354, !1355}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1351, file: !151, line: 2310, baseType: !706, size: 32)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1351, file: !151, line: 2311, baseType: !711, size: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1351, file: !151, line: 2312, baseType: !1356, size: 64)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64)
!1357 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !151, line: 2277, flags: DIFlagFwdDecl)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1321, file: !151, line: 2315, baseType: !829, size: 64, offset: 768)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1321, file: !151, line: 2316, baseType: !829, size: 64, offset: 832)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1321, file: !151, line: 2317, baseType: !829, size: 64, offset: 896)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1321, file: !151, line: 2318, baseType: !829, size: 64, offset: 960)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1321, file: !151, line: 2319, baseType: !829, size: 64, offset: 1024)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1321, file: !151, line: 2320, baseType: !829, size: 64, offset: 1088)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1321, file: !151, line: 2321, baseType: !829, size: 64, offset: 1152)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1321, file: !151, line: 2322, baseType: !829, size: 64, offset: 1216)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1321, file: !151, line: 2324, baseType: !1367, size: 64, offset: 1280)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64)
!1368 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !151, line: 2324, flags: DIFlagFwdDecl)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !831, file: !151, line: 3395, baseType: !1370, size: 320)
!1370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !151, line: 1469, size: 320, elements: !1371)
!1371 = !{!1372, !1373, !1374}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1370, file: !151, line: 1470, baseType: !867, size: 192)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1370, file: !151, line: 1471, baseType: !829, size: 64, offset: 192)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1370, file: !151, line: 1472, baseType: !829, size: 64, offset: 256)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !831, file: !151, line: 3396, baseType: !1376, size: 320)
!1376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !151, line: 1482, size: 320, elements: !1377)
!1377 = !{!1378, !1379, !1380}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1376, file: !151, line: 1483, baseType: !867, size: 192)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1376, file: !151, line: 1484, baseType: !706, size: 32, offset: 192)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1376, file: !151, line: 1485, baseType: !1381, size: 64, offset: 256)
!1381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !829, size: 64, elements: !748)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !831, file: !151, line: 3397, baseType: !1383, size: 384)
!1383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !151, line: 1829, size: 384, elements: !1384)
!1384 = !{!1385, !1386, !1387, !1388}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1383, file: !151, line: 1830, baseType: !867, size: 192)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1383, file: !151, line: 1831, baseType: !949, size: 32, offset: 192)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1383, file: !151, line: 1832, baseType: !829, size: 64, offset: 256)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1383, file: !151, line: 1835, baseType: !1381, size: 64, offset: 320)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !831, file: !151, line: 3398, baseType: !1390, size: 704)
!1390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !151, line: 1898, size: 704, elements: !1391)
!1391 = !{!1392, !1393, !1394, !1398, !1399, !1402}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1390, file: !151, line: 1899, baseType: !867, size: 192)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1390, file: !151, line: 1902, baseType: !829, size: 64, offset: 192)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1390, file: !151, line: 1905, baseType: !1395, size: 64, offset: 256)
!1395 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !714, line: 58, baseType: !1396)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64)
!1397 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !714, line: 57, flags: DIFlagFwdDecl)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1390, file: !151, line: 1908, baseType: !7, size: 32, offset: 320)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1390, file: !151, line: 1911, baseType: !1400, size: 64, offset: 384)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64)
!1401 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !151, line: 1876, flags: DIFlagFwdDecl)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1390, file: !151, line: 1914, baseType: !1403, size: 256, offset: 448)
!1403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !151, line: 1883, size: 256, elements: !1404)
!1404 = !{!1405, !1407, !1408, !1413}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1403, file: !151, line: 1884, baseType: !1406, size: 64)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1403, file: !151, line: 1885, baseType: !1406, size: 64, offset: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1403, file: !151, line: 1891, baseType: !1409, size: 64, offset: 128)
!1409 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1403, file: !151, line: 1891, size: 64, elements: !1410)
!1410 = !{!1411, !1412}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1409, file: !151, line: 1891, baseType: !1395, size: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1409, file: !151, line: 1891, baseType: !829, size: 64)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1403, file: !151, line: 1892, baseType: !1414, size: 64, offset: 192)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !831, file: !151, line: 3399, baseType: !1416, size: 704)
!1416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !151, line: 2008, size: 704, elements: !1417)
!1417 = !{!1418, !1419, !1420, !1421, !1422, !1423, !1435, !1436, !1437, !1438, !1439}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1416, file: !151, line: 2009, baseType: !867, size: 192)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1416, file: !151, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1416, file: !151, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1416, file: !151, line: 2014, baseType: !949, size: 32, offset: 224)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1416, file: !151, line: 2016, baseType: !829, size: 64, offset: 256)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1416, file: !151, line: 2017, baseType: !1424, size: 64, offset: 320)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64)
!1425 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !151, line: 183, baseType: !1426)
!1426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !151, line: 183, size: 128, elements: !1427)
!1427 = !{!1428}
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1426, file: !151, line: 183, baseType: !1429, size: 128)
!1429 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !151, line: 182, baseType: !1430)
!1430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !151, line: 182, size: 128, elements: !1431)
!1431 = !{!1432, !1433, !1434}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1430, file: !151, line: 182, baseType: !7, size: 32)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1430, file: !151, line: 182, baseType: !7, size: 32, offset: 32)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1430, file: !151, line: 182, baseType: !1381, size: 64, offset: 64)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1416, file: !151, line: 2019, baseType: !829, size: 64, offset: 384)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1416, file: !151, line: 2020, baseType: !829, size: 64, offset: 448)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1416, file: !151, line: 2021, baseType: !829, size: 64, offset: 512)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1416, file: !151, line: 2022, baseType: !829, size: 64, offset: 576)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1416, file: !151, line: 2023, baseType: !829, size: 64, offset: 640)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !831, file: !151, line: 3400, baseType: !1441, size: 832)
!1441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !151, line: 2430, size: 832, elements: !1442)
!1442 = !{!1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1441, file: !151, line: 2431, baseType: !867, size: 192)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1441, file: !151, line: 2433, baseType: !829, size: 64, offset: 192)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1441, file: !151, line: 2434, baseType: !829, size: 64, offset: 256)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1441, file: !151, line: 2435, baseType: !829, size: 64, offset: 320)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1441, file: !151, line: 2436, baseType: !829, size: 64, offset: 384)
