; ModuleID = 'xatexit.bc'
source_filename = "xatexit.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.xatexit = type { %struct.xatexit*, i32, [32 x void ()*] }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@_xexit_cleanup = external dso_local local_unnamed_addr global void ()*, align 8
@xatexit_head = internal unnamed_addr global %struct.xatexit* @xatexit_first, align 8, !dbg !0
@xatexit_first = internal global %struct.xatexit zeroinitializer, align 8, !dbg !23

; Function Attrs: inlinehint nounwind uwtable
define dso_local i32 @vprintf(i8* noalias %__fmt, %struct.__va_list_tag* %__arg) local_unnamed_addr #0 !dbg !29 {
entry:
  call void @llvm.dbg.value(metadata i8* %__fmt, metadata !46, metadata !DIExpression()), !dbg !48
  call void @llvm.dbg.value(metadata %struct.__va_list_tag* %__arg, metadata !47, metadata !DIExpression()), !dbg !48

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "xatexit_head", scope: !2, file: !3, line: 61, type: !8, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !22, nameTableKind: None)
!3 = !DIFile(filename: "xatexit.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!4 = !{}
!5 = !{!6, !7, !8, !21}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xatexit", file: !3, line: 50, size: 2176, elements: !10)
!10 = !{!11, !12, !14}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !9, file: !3, line: 51, baseType: !8, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "ind", scope: !9, file: !3, line: 52, baseType: !13, size: 32, offset: 64)
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "fns", scope: !9, file: !3, line: 53, baseType: !15, size: 2048, offset: 128)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 2048, elements: !19)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DISubroutineType(types: !18)
!18 = !{null}
!19 = !{!20}
!20 = !DISubrange(count: 32)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!22 = !{!0, !23}
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "xatexit_first", scope: !2, file: !3, line: 58, type: !9, isLocal: true, isDefinition: true)
!25 = !{i32 2, !"Dwarf Version", i32 4}
!26 = !{i32 2, !"Debug Info Version", i32 3}
!27 = !{i32 1, !"wchar_size", i32 4}
!28 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!29 = distinct !DISubprogram(name: "vprintf", scope: !30, file: !30, line: 39, type: !31, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !45)
!30 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!31 = !DISubroutineType(types: !32)
!32 = !{!13, !33, !37}
!33 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !34)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!36 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !39)
!39 = !{!40, !42, !43, !44}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !38, file: !3, baseType: !41, size: 32)
!41 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !38, file: !3, baseType: !41, size: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !38, file: !3, baseType: !21, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !38, file: !3, baseType: !21, size: 64, offset: 128)
!45 = !{!46, !47}
!46 = !DILocalVariable(name: "__fmt", arg: 1, scope: !29, file: !30, line: 39, type: !33)
!47 = !DILocalVariable(name: "__arg", arg: 2, scope: !29, file: !30, line: 39, type: !37)
!48 = !DILocation(line: 0, scope: !29)
!49 = !DILocation(line: 41, column: 20, scope: !29)
!50 = !DILocation(line: 41, column: 10, scope: !29)
!51 = !DILocation(line: 41, column: 3, scope: !29)
!52 = distinct !DISubprogram(name: "getchar", scope: !30, file: !30, line: 47, type: !53, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!53 = !DISubroutineType(types: !54)
!54 = !{!13}
!55 = !DILocation(line: 49, column: 16, scope: !52)
!56 = !DILocation(line: 49, column: 10, scope: !52)
!57 = !DILocation(line: 49, column: 3, scope: !52)
!58 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !30, file: !30, line: 56, type: !59, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !121)
!59 = !DISubroutineType(types: !60)
!60 = !{!13, !61}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !63, line: 7, baseType: !64)
!63 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !65, line: 49, size: 1728, elements: !66)
!65 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!66 = !{!67, !68, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !83, !85, !86, !87, !91, !93, !95, !99, !102, !104, !107, !110, !111, !112, !116, !117}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !64, file: !65, line: 51, baseType: !13, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !64, file: !65, line: 54, baseType: !69, size: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !64, file: !65, line: 55, baseType: !69, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !64, file: !65, line: 56, baseType: !69, size: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !64, file: !65, line: 57, baseType: !69, size: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !64, file: !65, line: 58, baseType: !69, size: 64, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !64, file: !65, line: 59, baseType: !69, size: 64, offset: 384)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !64, file: !65, line: 60, baseType: !69, size: 64, offset: 448)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !64, file: !65, line: 61, baseType: !69, size: 64, offset: 512)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !64, file: !65, line: 64, baseType: !69, size: 64, offset: 576)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !64, file: !65, line: 65, baseType: !69, size: 64, offset: 640)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !64, file: !65, line: 66, baseType: !69, size: 64, offset: 704)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !64, file: !65, line: 68, baseType: !81, size: 64, offset: 768)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !65, line: 36, flags: DIFlagFwdDecl)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !64, file: !65, line: 70, baseType: !84, size: 64, offset: 832)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !64, file: !65, line: 72, baseType: !13, size: 32, offset: 896)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !64, file: !65, line: 73, baseType: !13, size: 32, offset: 928)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !64, file: !65, line: 74, baseType: !88, size: 64, offset: 960)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !89, line: 152, baseType: !90)
!89 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!90 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !64, file: !65, line: 77, baseType: !92, size: 16, offset: 1024)
!92 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !64, file: !65, line: 78, baseType: !94, size: 8, offset: 1040)
!94 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !64, file: !65, line: 79, baseType: !96, size: 8, offset: 1048)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 8, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 1)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !64, file: !65, line: 81, baseType: !100, size: 64, offset: 1088)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !65, line: 43, baseType: null)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !64, file: !65, line: 89, baseType: !103, size: 64, offset: 1152)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !89, line: 153, baseType: !90)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !64, file: !65, line: 91, baseType: !105, size: 64, offset: 1216)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !65, line: 37, flags: DIFlagFwdDecl)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !64, file: !65, line: 92, baseType: !108, size: 64, offset: 1280)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !65, line: 38, flags: DIFlagFwdDecl)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !64, file: !65, line: 93, baseType: !84, size: 64, offset: 1344)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !64, file: !65, line: 94, baseType: !21, size: 64, offset: 1408)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !64, file: !65, line: 95, baseType: !113, size: 64, offset: 1472)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !114, line: 46, baseType: !115)
!114 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!115 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !64, file: !65, line: 96, baseType: !13, size: 32, offset: 1536)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !64, file: !65, line: 98, baseType: !118, size: 160, offset: 1568)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 160, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 20)
!121 = !{!122}
!122 = !DILocalVariable(name: "__fp", arg: 1, scope: !58, file: !30, line: 56, type: !61)
!123 = !DILocation(line: 0, scope: !58)
!124 = !DILocation(line: 58, column: 10, scope: !58)
!125 = !DILocation(line: 58, column: 3, scope: !58)
!126 = distinct !DISubprogram(name: "getc_unlocked", scope: !30, file: !30, line: 66, type: !59, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !127)
!127 = !{!128}
!128 = !DILocalVariable(name: "__fp", arg: 1, scope: !126, file: !30, line: 66, type: !61)
!129 = !DILocation(line: 0, scope: !126)
!130 = !DILocation(line: 68, column: 10, scope: !126)
!131 = !DILocation(line: 68, column: 3, scope: !126)
!132 = distinct !DISubprogram(name: "getchar_unlocked", scope: !30, file: !30, line: 73, type: !53, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!133 = !DILocation(line: 75, column: 10, scope: !132)
!134 = !DILocation(line: 75, column: 3, scope: !132)
!135 = distinct !DISubprogram(name: "putchar", scope: !30, file: !30, line: 82, type: !136, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !138)
!136 = !DISubroutineType(types: !137)
!137 = !{!13, !13}
!138 = !{!139}
!139 = !DILocalVariable(name: "__c", arg: 1, scope: !135, file: !30, line: 82, type: !13)
!140 = !DILocation(line: 0, scope: !135)
!141 = !DILocation(line: 84, column: 21, scope: !135)
!142 = !DILocation(line: 84, column: 10, scope: !135)
!143 = !DILocation(line: 84, column: 3, scope: !135)
!144 = distinct !DISubprogram(name: "fputc_unlocked", scope: !30, file: !30, line: 91, type: !145, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !147)
!145 = !DISubroutineType(types: !146)
!146 = !{!13, !13, !61}
!147 = !{!148, !149}
!148 = !DILocalVariable(name: "__c", arg: 1, scope: !144, file: !30, line: 91, type: !13)
!149 = !DILocalVariable(name: "__stream", arg: 2, scope: !144, file: !30, line: 91, type: !61)
!150 = !DILocation(line: 0, scope: !144)
!151 = !DILocation(line: 93, column: 10, scope: !144)
!152 = !DILocation(line: 93, column: 3, scope: !144)
!153 = distinct !DISubprogram(name: "putc_unlocked", scope: !30, file: !30, line: 101, type: !145, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !154)
!154 = !{!155, !156}
!155 = !DILocalVariable(name: "__c", arg: 1, scope: !153, file: !30, line: 101, type: !13)
!156 = !DILocalVariable(name: "__stream", arg: 2, scope: !153, file: !30, line: 101, type: !61)
!157 = !DILocation(line: 0, scope: !153)
!158 = !DILocation(line: 103, column: 10, scope: !153)
!159 = !DILocation(line: 103, column: 3, scope: !153)
!160 = distinct !DISubprogram(name: "putchar_unlocked", scope: !30, file: !30, line: 108, type: !136, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !161)
!161 = !{!162}
!162 = !DILocalVariable(name: "__c", arg: 1, scope: !160, file: !30, line: 108, type: !13)
!163 = !DILocation(line: 0, scope: !160)
!164 = !DILocation(line: 110, column: 10, scope: !160)
!165 = !DILocation(line: 110, column: 3, scope: !160)
!166 = distinct !DISubprogram(name: "getline", scope: !30, file: !30, line: 118, type: !167, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !172)
!167 = !DISubroutineType(types: !168)
!168 = !{!169, !170, !171, !61}
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !89, line: 193, baseType: !90)
